#Если Клиент Тогда
	
Перем ВысотаЗаголовка Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Процедура перегружает значения отбора
// из реквизита обработки "Отбор"
// в отбор построителя запроса
// 
Процедура СкопироватьОтбор(ОтборИсточник, ОтборПриемник, ТолькоИспользуемые = Ложь) Экспорт
	
	// Очистка отбора приемника
	КвоЭлементов = ОтборПриемник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
	
		ОтборПриемник.Удалить(КвоЭлементов - Н);	
	
	КонецЦикла;
	
	// Загрузка элементов отбора
	КвоЭлементов = ОтборИсточник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
		
		ОбратныйИндекс = КвоЭлементов - Н;
		Элемент        = ОтборИсточник[ОбратныйИндекс];
		
		Если (НЕ ТолькоИспользуемые) ИЛИ Элемент.Использование Тогда
			
			Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
				
				ЭлементПриемника = ОтборПриемник.Добавить(Элемент.ПутьКДанным);
				
			Иначе
				
				ЭлементПриемника = Неопределено;
				
			КонецЕсли;
			
			Если ЭлементПриемника <> Неопределено Тогда
				
				Попытка
				
					ЭлементПриемника.ВидСравнения  = Элемент.ВидСравнения;
					ЭлементПриемника.Значение	   = Элемент.Значение;
					ЭлементПриемника.ЗначениеС	   = Элемент.ЗначениеС;
					ЭлементПриемника.ЗначениеПо	   = Элемент.ЗначениеПо;
					ЭлементПриемника.Использование = Элемент.Использование;
					
				
				Исключение
					
					ОбщегоНазначения.СообщитьОбОшибке("Элемент отбора <" + Элемент + ">:" + Символы.ПС + Символы.Таб + ОписаниеОшибки()
					                 + Символы.ПС + Символы.Таб + "Элемент удален.");
					
					ОтборПриемник.Удалить(ОтборПриемник.Индекс(ЭлементПриемника));
					ОтборИсточник.Удалить(ОбратныйИндекс);
					
				КонецПопытки;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Элемент отбора <¤1¤> не входит в число допустимых."
"	Элемент удален.", Элемент));
				ОтборИсточник.Удалить(ОбратныйИндекс);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

Функция СформироватьНадписьОтбора()
	
	ТекстОтбора = "";
	Разделитель = "";
	
	Для каждого ЭлементОтбора Из ПостроительЗапроса.Отбор Цикл
	
		Если ЭлементОтбора.Использование Тогда
			
			ТекстОтбора = ТекстОтбора + Разделитель + ЭлементОтбора;
			Разделитель = "; "
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТекстОтбора) Тогда
		
		ТекстОтбора = "Отбор не установлен";
		
	Иначе
		
		ТекстОтбора = "Отбор: " + ТекстОтбора;
		
	КонецЕсли;
	
	Возврат ТекстОтбора;

КонецФункции // СформироватьЗаголовокФормы()

Процедура СформироватьОтчет(ДокументРезультат, ТолькоЗаголовок = Ложь) Экспорт

	// Перегрузка значений из реквизита формы "Отбор"
	// в отбор построителя запроса
	СкопироватьОтбор(Отбор, ПостроительЗапроса.Отбор, Истина);
	
	ДокументРезультат.Очистить();
	
	Макет     = ПолучитьМакет("Макет");
	НаДату    = ?(НЕ ЗначениеЗаполнено(ДатаСведений), РабочаяДата, ДатаСведений);
	НаДату    = КонецДня(НаДату);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстОтбора  = СформироватьНадписьОтбора();
	ОбластьМакета.Параметры.ДатаСведений = НаДату;
	
	ДокументРезультат.Вывести(ОбластьМакета);
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	Если ТолькоЗаголовок Тогда
		
		Возврат
		
	КонецЕсли;
	
	ПостроительЗапроса.Параметры.Вставить("ДатаСведений", НаДату + 1);
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		ОбластьНетДанных = Макет.ПолучитьОбласть("НетДанных");
		ДокументРезультат.Вывести(ОбластьНетДанных);
		Возврат;
		                                                                              
	КонецЕсли;
	
	Выборка           = ПостроительЗапроса.Результат.Выбрать();
	Разделитель        = Макет.ПолучитьОбласть("Разделитель");
	ВывестиРазделитель = Ложь;
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВывестиРазделитель Тогда
			
			ДокументРезультат.Вывести(Разделитель, 1);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Наименование");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПостоянныеСведения");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 2);
		
        // Управленческий учет
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаУпр");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 1);
			
		ОбластьМакета = Макет.ПолучитьОбласть("УпрУчет");
		ОбластьМакета.Параметры.Заполнить(Выборка);
			
		ДокументРезультат.Вывести(ОбластьМакета, 2);
		
		// Регламентированный учет
		Если Выборка.Организация <> Null Тогда
			
			//ОбластьМакета = Макет.ПолучитьОбласть("ШапкаОсновныеСведения");
			//ОбластьМакета.Параметры.Заполнить(Выборка);
			//ДокументРезультат.Вывести(ОбластьМакета, 1);
			//
			//ОбластьМакета = Макет.ПолучитьОбласть("ОбщиеСведения");
			//ОбластьМакета.Параметры.Заполнить(Выборка);
			//
			//Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеПолное) Тогда
			//	
			//	ОбластьМакета.Параметры.ОрганизацияПредставление = Выборка.ОрганизацияНаименованиеПолное;
			//	
			//КонецЕсли;
			//
			//ДокументРезультат.Вывести(ОбластьМакета, 2);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаБух");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 1);
			
			ОбластьМакета = Макет.ПолучитьОбласть("БухУчет");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеПолное) Тогда
				
				ОбластьМакета.Параметры.ОрганизацияПредставление = Выборка.ОрганизацияНаименованиеПолное;
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьМакета, 2);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаНал");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 1);
			
			ОбластьМакета = Макет.ПолучитьОбласть("НалУчет");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 2);
			
		КонецЕсли;
		
		ВывестиРазделитель = Истина;
	
	КонецЦикла;
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ТолькоПросмотр                = Истина;
	ДокументРезультат.ВерхнийКолонтитул.Выводить    = Истина;
	ДокументРезультат.ВерхнийКолонтитул.ТекстСправа = "Дата сведений: " + НаДату;
	ДокументРезультат.НижнийКолонтитул.Выводить     = Истина;
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы,
	                                                                  ДокументРезультат.ШиринаТаблицы);
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОбОС";
	
КонецПроцедуры // СформироватьОтчет()
                                                                                                    
// Процедура - заполняет начальные настройки заполнения
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительЗапроса                         = Новый ПостроительЗапроса;
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ОсновныеСредства.Наименование КАК Наименование,
	|	ОсновныеСредства.Код КАК Код,
	|	ОсновныеСредства.НаименованиеПолное КАК НаименованиеПолное,
	|	ОсновныеСредства.Изготовитель КАК Изготовитель,
	|	ОсновныеСредства.НомерПаспорта КАК НомерПаспорта,
	|	ОсновныеСредства.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредства.Модель КАК Модель,
	|	ОсновныеСредства.Автотранспорт КАК Автотранспорт,
	|	ОсновныеСредства.Комментарий КАК Комментарий,
	|	ПервоначальныеСведенияОСБУ.Организация КАК Организация,
	|	ПервоначальныеСведенияОСБУ.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.Организация) КАК ОрганизацияПредставление,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.МОЛ) КАК МОЛПредставление,
	|	МестонахождениеОС.Местонахождение КАК ПодразделениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.Местонахождение) КАК ПодразделениеОрганизацииПредставление,
	|	ПервоначальныеСведенияОСБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОСБУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьБУ,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетУчета) КАК СчетУчетаБУ,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизацииБУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.СпособНачисленияАмортизации) КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОСБУ.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	ГрафикиАмортизацииОС.ГрафикАмортизации КАК ГрафикАмортизации,
	|	ПРЕДСТАВЛЕНИЕ(ГрафикиАмортизацииОС.ГрафикАмортизации) КАК ГрафикАмортизацииПредставление,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизацииБУ,
	|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации) КАК СпособОтраженияРасходовПоАмортизацииБУПредставление,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ХозрасчетныйСтоимость.СуммаОстаток КАК СтоимостьОстатокБУ,
	|	ХозрасчетныйАмортизация.СуммаОстатокКт КАК АмортизацияОстатокБУ,
	|	ВыработкаОС.КоличествоОборот КАК Выработка,
	|	ПервоначальныеСведенияОСНУ.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	НачислениеАмортизацииОСБУ.НачислятьАмортизацию КАК НачислятьАмортизациюБУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСНУ.НалоговаяГруппаОС) КАК НалоговаяГруппаОС,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияБУ,
	|	ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьБУ,
	|	ПараметрыАмортизацииОСНУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ПараметрыАмортизацииОСНУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ПРЕДСТАВЛЕНИЕ(НалоговыеНазначенияОС.НалоговоеНазначение) КАК НалоговоеНазначениеПредставление,
	|	ХозрасчетныйСтоимость.СуммаНУОстаток КАК СтоимостьОстатокНУ,
	|	ХозрасчетныйАмортизация.СуммаНУОстатокКт КАК АмортизацияОстатокНУ,
	|	ВводВЭксплуатацию.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор КАК ДокументВводаВЭксплуатацию,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатацию.Регистратор) КАК ДокументВводаВЭксплуатациюПредставление,
	|	Выбытие.ДатаСостояния КАК ДатаВыбытия,
	|	Выбытие.Регистратор КАК ДокументВыбытия,
	|	ПРЕДСТАВЛЕНИЕ(Выбытие.Регистратор) КАК ДокументВыбытияПредставление,
	|	НалоговыеНазначенияОС.Регистратор КАК РегистраторВНД,
	|	ГрафикиАмортизацииОС.Регистратор КАК РегистраторГрафики,
	|	МестонахождениеОС.Регистратор КАК РегистраторМестонахождение,
	|	НачислениеАмортизацииОСБУ.Регистратор КАК РегистраторНачислениеАмортизацииБУ,
	|	ПараметрыАмортизацииОСБУ.Регистратор КАК РегистраторПараметрыАмортизации,
	|	ПараметрыАмортизацииОСНУ.Регистратор КАК РегистраторПараметрыАмортизацииНУ,
	|	ПервоначальныеСведенияОСБУ.Регистратор КАК РегистраторПервоначальныеСведенияБУ,
	|	ПервоначальныеСведенияОСНУ.Регистратор КАК РегистраторПервоначальныеСведенияНУ,
	|	СчетаБухгалтерскогоУчетаОС.Регистратор КАК РегистраторСчетаБУ,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.Регистратор КАК РегистраторСпособов,
	|	МестонахождениеОСУУ.МОЛ КАК МОЛУУ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОСУУ.МОЛ) КАК МОЛУУПредставление,
	|	МестонахождениеОСУУ.Местонахождение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОСУУ.Местонахождение) КАК ПодразделениеПредставление,
	|	ПервоначальныеСведенияОСУУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьУУ,
	|	ПервоначальныеСведенияОСУУ.ПараметрВыработки КАК ПараметрВыработкиУУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСУУ.ПараметрВыработки) КАК ПараметрВыработкиУУПредставление,
	|	ГрафикиАмортизацииОСУУ.ГрафикАмортизации КАК ГрафикАмортизацииУУ,
	|	ПРЕДСТАВЛЕНИЕ(ГрафикиАмортизацииОСУУ.ГрафикАмортизации) КАК ГрафикАмортизацииПредставлениеУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации) КАК СпособыОтраженияРасходовПоАмортизацииУУПредставление,
	|	ПараметрыАмортизацииОСУУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРаботУУ,
	|	ПараметрыАмортизацииОСУУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииУУ,
	|	СтоимостьОСУУ.СтоимостьОстаток КАК СтоимостьОстатокУУ,
	|	СтоимостьОСУУ.АмортизацияОстаток КАК АмортизацияОстатокУУ,
	|	ВыработкаОСУУ.КоличествоОборот КАК ВыработкаУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизацию КАК НачислятьАмортизациюУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяцеУУ,
	|	ПараметрыАмортизацииОСУУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияУУ,
	|	ПараметрыАмортизацииОСУУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьУУ,
	|	ВыбытиеУУ.ДатаСостояния КАК ДатаВыбытияУУ,
	|	ВыбытиеУУ.Регистратор КАК ДокументВыбытияУУ,
	|	ПРЕДСТАВЛЕНИЕ(ВыбытиеУУ.Регистратор) КАК ДокументВыбытияУУПредставление,
	|	ГрафикиАмортизацииОСУУ.Регистратор КАК РегистраторГрафикиУУ,
	|	МестонахождениеОСУУ.Регистратор КАК РегистраторМестонахождениеУУ,
	|	НачислениеАмортизацииОСУУ.Регистратор КАК РегистраторНачислениеАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.Регистратор КАК РегистраторПараметрыАмортизацииУУ,
	|	ПервоначальныеСведенияОСУУ.Регистратор КАК РегистраторПервоначальныеСведенияУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.Регистратор КАК РегистраторСпособовУУ,
	|	ПервоначальныеСведенияОСУУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизацииУУ,
	|	ВводВЭксплуатациюУУ.ДатаСостояния КАК ДатаВводаВЭксплуатациюУУ,
	|	ВводВЭксплуатациюУУ.Регистратор КАК ДокументВводаВЭксплуатациюУУ,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатациюУУ.Регистратор) КАК ДокументВводаВЭксплуатациюУУПредставление
	|{ВЫБРАТЬ
	|	ОсновноеСредство,
	|	Наименование,
	|	Код,
	|	НаименованиеПолное,
	|	Изготовитель,
	|	НомерПаспорта,
	|	ЗаводскойНомер,
	|	ДатаВыпуска,
	|	Модель,
	|	Автотранспорт,
	|	Комментарий,
	|	Организация,
	|	ОрганизацияНаименованиеПолное,
	|	МОЛ,
	|	ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ИнвентарныйНомер,
	|	ПервоначальнаяСтоимостьБУ,
	|	СчетУчетаБУ,
	|	СчетНачисленияАмортизацииБУ,
	|	СпособНачисленияАмортизации,
	|	ПараметрВыработки,
	|	ГрафикАмортизации,
	|	СпособОтраженияРасходовПоАмортизацииБУ,
	|	ОбъемПродукцииРабот,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	СтоимостьДляВычисленияАмортизации,
	|	ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	СтоимостьОстатокБУ,
	|	АмортизацияОстатокБУ,
	|	Выработка,
	|	ПервоначальнаяСтоимостьНУ,
	|	НачислятьАмортизациюБУ,
	|	НалоговаяГруппаОС,
	|	СрокПолезногоИспользованияБУ,
	|	ЛиквидационнаяСтоимостьБУ,
	|	СрокИспользованияДляВычисленияАмортизацииНУ,
	|	СтоимостьДляВычисленияАмортизацииНУ,
	|	НалоговоеНазначение,
	|	СтоимостьОстатокНУ,
	|	АмортизацияОстатокНУ,
	|	ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаВыбытия,
	|	ДокументВыбытия,
	|	РегистраторВНД,
	|	РегистраторГрафики,
	|	РегистраторМестонахождение,
	|	РегистраторНачислениеАмортизацииБУ,
	|	РегистраторПараметрыАмортизации,
	|	РегистраторПараметрыАмортизацииНУ,
	|	РегистраторПервоначальныеСведенияБУ,
	|	РегистраторПервоначальныеСведенияНУ,
	|	РегистраторСчетаБУ,
	|	РегистраторСпособов,
	|	МОЛУУ,
	|	Подразделение,
	|	ПервоначальнаяСтоимостьУУ,
	|	ПараметрВыработкиУУ,
	|	ГрафикАмортизацииУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ОбъемПродукцииРаботУУ,
	|	СрокИспользованияДляВычисленияАмортизацииУУ,
	|	СтоимостьДляВычисленияАмортизацииУУ,
	|	ОбъемПродукцииРаботДляВычисленияАмортизацииУУ,
	|	СтоимостьОстатокУУ,
	|	АмортизацияОстатокУУ,
	|	ВыработкаУУ,
	|	НачислятьАмортизациюУУ,
	|	НачислятьАмортизациюВТекущемМесяцеУУ,
	|	СрокПолезногоИспользованияУУ,
	|	ЛиквидационнаяСтоимостьУУ,
	|	ДатаВыбытияУУ,
	|	ДокументВыбытияУУ,
	|	РегистраторГрафикиУУ,
	|	РегистраторМестонахождениеУУ,
	|	РегистраторНачислениеАмортизацииУУ,
	|	РегистраторПараметрыАмортизацииУУ,
	|	РегистраторПервоначальныеСведенияУУ,
	|	РегистраторСпособовУУ,
	|	СпособНачисленияАмортизацииУУ КАК СпособНачисленияАмортизацииУУ,
	|	ДатаВводаВЭксплуатациюУУ,
	|	ДокументВводаВЭксплуатациюУУ}
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПервоначальныеСведенияОСБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК МестонахождениеОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = МестонахождениеОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК СчетаБухгалтерскогоУчетаОС
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		&ДатаСведений,
	|		Счет В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        СчетаБухгалтерскогоУчетаОС.СчетУчета
	|		    ИЗ
	|		        РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, ) КАК СчетаБухгалтерскогоУчетаОС),
	|		&СубконтоОС,
	|		{ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ХозрасчетныйСтоимость
	|				ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ХозрасчетныйСтоимость.Субконто1
	|					И СчетаБухгалтерскогоУчетаОС.Организация = ХозрасчетныйСтоимость.Организация
	|					И СчетаБухгалтерскогоУчетаОС.СчетУчета = ХозрасчетныйСтоимость.Счет
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		&ДатаСведений,
	|		Счет В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации
	|		    ИЗ
	|		        РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, ) КАК СчетаБухгалтерскогоУчетаОС),
	|		&СубконтоОС,
	|		{ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ХозрасчетныйАмортизация
	|				ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ХозрасчетныйАмортизация.Субконто1
	|					И СчетаБухгалтерскогоУчетаОС.Организация = ХозрасчетныйАмортизация.Организация
	|					И СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации = ХозрасчетныйАмортизация.Счет
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = СчетаБухгалтерскогоУчетаОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ГрафикиАмортизацииОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ГрафикиАмортизацииОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ГрафикиАмортизацииОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК НачислениеАмортизацииОСБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = НачислениеАмортизацииОСБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = НачислениеАмортизацииОСБУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ 
	|				РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПараметрыАмортизацииОСНУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСНУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ПараметрыАмортизацииОСНУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПараметрыАмортизацииОСБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ПараметрыАмортизацииОСБУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК НалоговыеНазначенияОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = НалоговыеНазначенияОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ВводВЭксплуатацию.Организация
	|				И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)
	|				И (ВводВЭксплуатацию.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК Выбытие
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = Выбытие.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = Выбытие.Организация
	|				И (Выбытие.Состояние = &СостояниеВыбытия)
	|				И (Выбытие.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаОС.Обороты(, &ДатаСведений, , {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ВыработкаОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ВыработкаОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.ПараметрВыработки = ВыработкаОС.ПараметрВыработки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК СпособыОтраженияРасходовПоАмортизацииБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = СпособыОтраженияРасходовПоАмортизацииБУ.Организация
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСБУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПервоначальныеСведенияОСНУ
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСНУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПервоначальныеСведенияОСУУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК МестонахождениеОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = МестонахождениеОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ГрафикиАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ГрафикиАмортизацииОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК ВыбытиеУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВыбытиеУУ.ОсновноеСредство
	|				И (ВыбытиеУУ.Состояние = &СостояниеВыбытия)
	|				И (ВыбытиеУУ.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаОС.Обороты(, &ДатаСведений, , {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ВыработкаОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВыработкаОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СпособыОтраженияРасходовПоАмортизацииУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СтоимостьОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = СтоимостьОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК ВводВЭксплуатациюУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВводВЭксплуатациюУУ.ОсновноеСредство
	|				И (ВводВЭксплуатациюУУ.Состояние = &СостояниеВвода)
	|				И (ВводВЭксплуатациюУУ.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НачислениеАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = НачислениеАмортизацииОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПараметрыАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ПараметрыАмортизацииОСУУ.ОсновноеСредство
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСУУ.ОсновноеСредство
	|ГДЕ
	|	(НЕ ОсновныеСредства.ЭтоГруппа)
	|{ГДЕ
	|	ОсновныеСредства.Ссылка.* КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОСБУ.Организация.* КАК Организация,
	|	МестонахождениеОС.МОЛ.* КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.* КАК ПодразделениеОрганизации,
	|	ПервоначальныеСведенияОСБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОСБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизацииБУ,
	|	ПервоначальныеСведенияОСБУ.ПараметрВыработки.* КАК ПараметрВыработки,
	|	ГрафикиАмортизацииОС.ГрафикАмортизации.* КАК ГрафикАмортизации,
	|	НачислениеАмортизацииОСБУ.НачислятьАмортизацию КАК НачислятьАмортизациюБУ,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|	МестонахождениеОСУУ.МОЛ.* КАК МОЛУУ,
	|	МестонахождениеОСУУ.Местонахождение.* КАК Подразделение,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ГрафикиАмортизацииОСУУ.ГрафикАмортизации.* КАК ГрафикАмортизацииУУ,
	|	ПервоначальныеСведенияОСУУ.ПараметрВыработки.*,
	|	ПараметрыАмортизацииОСУУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияУУ,
	|	ПервоначальныеСведенияОСУУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизацииУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизацию КАК НачислятьАмортизациюУУ}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Параметры = ПостроительЗапроса.Параметры;
	
	
	Параметры.Вставить("СубконтоОС"                , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Параметры.Вставить("СостояниеВвода"            , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Параметры.Вставить("СостояниеВыбытия"          , Перечисления.СостоянияОС.СнятоСУчета);

	ДоступныеПоля = ПостроительЗапроса.ДоступныеПоля;
	
	// Заполнение пользовательских представлений для доступных полей
	СтруктураПредставлениеПолей = Новый Структура;
	
	СтруктураПредставлениеПолей.Вставить("Организация"							 , "Организация");
	СтруктураПредставлениеПолей.Вставить("Подразделение"						 , "Подразделение");
	СтруктураПредставлениеПолей.Вставить("МОЛ"							 		 , "МОЛ");
	
	СтруктураПредставлениеПолей.Вставить("ОсновноеСредство"                      , "Основное средство");
	СтруктураПредставлениеПолей.Вставить("ИнвентарныйНомер"                      , "Инвентарный номер");
	СтруктураПредставлениеПолей.Вставить("СпособНачисленияАмортизации"           , "Способ начисления амортизации");
	СтруктураПредставлениеПолей.Вставить("ПараметрВыработки"                     , "Параметр выработки");
	СтруктураПредставлениеПолей.Вставить("ГрафикАмортизации"                     , "График амортизации");
	СтруктураПредставлениеПолей.Вставить("НачислятьАмортизациюБУ"                , "Начислять амортизацию (БУ)");
	СтруктураПредставлениеПолей.Вставить("СрокПолезногоИспользования"            , "Срок полезного использования");
	СтруктураПредставлениеПолей.Вставить("НалоговоеНазначение"                   , "Налоговое назначение");
	СтруктураПредставлениеПолей.Вставить("СпособОтраженияРасходовПоАмортизацииБУ", "Способ отражения расходов по амортизации");
	
	Для каждого КлючЗначение Из СтруктураПредставлениеПолей Цикл
		
		Поле = ДоступныеПоля.Найти(КлючЗначение.Ключ);
		
		Если Поле <> Неопределено  Тогда
			
			Поле.Представление = КлючЗначение.Значение;			
			
		КонецЕсли;		
	
	КонецЦикла;
	
	// заполнение доступных полей для реквизита обработки
	Отбор.УстановитьДоступныеПоля(ДоступныеПоля);
	
	// поля по умолчанию                                                                
	Отбор.Добавить("ОсновноеСредство");
	Отбор.Добавить("Организация");
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

#КонецЕсли
