#Если Клиент Тогда
	
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ТолькоЗаголовок = Ложь) Экспорт
	
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	ЗаголовокОтчета.Параметры.Период = НСтр("ru='Период: ';uk='Період: '") + ПредставлениеПериода(НачалоМесяца(Период), КонецМесяца(Период), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
	Если ПостроительОтчета.Отбор.Организация.Использование Тогда
		ЗаголовокОтчета.Параметры.Организация = НСтр("ru='Организация: ';uk='Організація: '") + ПостроительОтчета.Отбор.Организация.Значение;
	КонецЕсли;
	
	Если ТолькоЗаголовок Тогда
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		Возврат;
	КонецЕсли;
	
	ПостроительОтчета.МакетЗаголовкаОтчета = ЗаголовокОтчета;
                                                                
	ПостроительОтчета.Параметры.Вставить("Период", Период);
	ПостроительОтчета.Параметры.Вставить("СледующийПериод", НачалоМесяца(КонецМесяца(Период)+1));
	
	МассивВидЗанятости    = Новый Массив(2);
	МассивВидЗанятости[0] = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
	МассивВидЗанятости[1] = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
	
	ПостроительОтчета.Параметры.Вставить("ПарамОсновнойСотрудник",   МассивВидЗанятости);
	
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.ОформитьМакет();
	ПостроительОтчета.Вывести(ДокументРезультат);
	
	Ширина = ДокументРезультат.ШиринаТаблицы;
	ВысотаЗаголовка = 4;
	
	// удалим из документа итог по строкам - последняя колонка отчета
	Область = ДокументРезультат.Область(, Ширина, ВысотаЗаголовка + 1, Ширина);
	ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
    Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 2, ВысотаЗаголовка + 1, Ширина - 2).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 2, ВысотаЗаголовка + 1, Ширина - 2);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		
		Область = ДокументРезультат.Область(, Ширина - 2, ВысотаЗаголовка + 1, Ширина );
		Область.Разгруппировать();
		
	КонецЕсли;

	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина );
		Область.Разгруппировать();
		
	КонецЕсли;
	
	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 4, ВысотаЗаголовка + 1, Ширина - 4).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		Область.Разгруппировать();
		Область = ДокументРезультат.Область(, Ширина - 4, ВысотаЗаголовка + 1, Ширина - 4);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;

	
	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, 3, ВысотаЗаголовка + 1, 3).Текст = "А" Тогда
		// удалим из документа колонку "А", соответствующую виртуальному виду расчета "Начальное сальдо" 
		Область = ДокументРезультат.Область(, 4, ВысотаЗаголовка + 1, 4);
		Область.Разгруппировать();
		Область = ДокументРезультат.Область(, 3, ВысотаЗаголовка + 1, 3);
		Область.Разгруппировать();
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				
	КонецЕсли; 
	
	Если ПостроительОтчета.Отбор.Организация.Использование = Истина  И  УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ВыводитьПодписиОтветственныхЛицВОтчетеРасчетнаяВедомостьОрганизации") Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СтруктурнаяЕдиница", ПостроительОтчета.Отбор.Организация.Значение);
		ТЗ = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецМесяца(Период), СтруктураОтбора);
		Директор = "";
		ГлБух = "";
		Для Каждого Строка ИЗ ТЗ Цикл
			Если Строка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
				Директор = Строка.ФизическоеЛицо
			КонецЕсли;
			
			Если Строка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда
				ГлБух = Строка.ФизическоеЛицо
			КонецЕсли;
		КонецЦикла;	
	
		ПодписиОтветственных = Макет.ПолучитьОбласть("ПодписиОтветственных");
		ПодписиОтветственных.Параметры.ФИОДиректор = Директор;
		ПодписиОтветственных.Параметры.ФИОГлБух = ГлБух;
		ДокументРезультат.Присоединить(ПодписиОтветственных);
	
	КонецЕсли;

	
КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета.Текст = 
	"ВЫБРАТЬ Разрешенные 
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение	КАК Подразделение,")+"
	|	Данные.Сотрудник КАК ФизЛицо,
	|	"+?(Не ВыводитьКодПоДРФО,"","ВЫРАЗИТЬ(""("" + Данные.Сотрудник.Физлицо.КодПоДРФО + "")"" КАК СТРОКА(20)) КАК КодПоДРФО,")+"
	|	Данные.Организация.Представление 							КАК ОрганизацияПредставление,
	|	Данные.Сотрудник.ФизЛицо.Представление						КАК ФизЛицоПредставление,
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы 										КАК ПриоритетГруппы,
	|	Данные.ИмяВидаРасчета,
	|	Данные.ПриоритетВидаРасчета 								КАК ПриоритетВидаРасчета,
	|	СУММА(Данные.Результат) 									КАК Результат										
	|
	|
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		ОсновныеНачисленияРаботниковОрганизации.Организация 	КАК Организация,
	|		ОсновныеНачисленияРаботниковОрганизации.Сотрудник 			КАК Сотрудник,
	|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета          КАК ИмяВидаРасчета,
	|		"""+НСтр("ru='Начислено';uk='Нараховано'")+"""					КАК ПриоритетВидаРасчета,
	|		"""+НСтр("ru='Всего начислено';uk='Всього нараховано'")+"""		КАК Группа,
	|		2 															КАК ПриоритетГруппы,
	|		"+?(УпрУчет,"ОсновныеНачисленияРаботниковОрганизации.РезультатУпр","ОсновныеНачисленияРаботниковОрганизации.Результат")+" 			КАК Результат
	|	ИЗ
	|		РегистрРасчета.Начисления КАК ОсновныеНачисленияРаботниковОрганизации
	|	
	|	ГДЕ
	|		(ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) И
	|		("+?(УпрУчет,"ОсновныеНачисленияРаботниковОрганизации.РезультатУпр","ОсновныеНачисленияРаботниковОрганизации.Результат")+"<>0)
	//---------------------НДФЛ-------------------------------------------------------------------
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзаиморасчетыПоНДФЛ.Организация,
	|		ВзаиморасчетыПоНДФЛ.Сотрудник,
	|		"""+НСтр("ru='НДФЛ';uk='ПДФО'")+""",
	|		"""+НСтр("ru='НДФЛ';uk='ПДФО'")+""",
	|		"""+НСтр("ru='Всего удержано';uk='Всього утримано'")+""",
	|		3,
	|		"+?(УпрУчет,"ВзаиморасчетыПоНДФЛ.НалогУпр","ВзаиморасчетыПоНДФЛ.Налог")+"									
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК ВзаиморасчетыПоНДФЛ
	|	
	|	ГДЕ
	|		(ВзаиморасчетыПоНДФЛ.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)) И
	|		(ВзаиморасчетыПоНДФЛ.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций)  И
	|		ВзаиморасчетыПоНДФЛ.ВидДвижения = &Приход 
	|
	//----------Выплаты--------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Взаиморасчеты.Организация,
	|		Взаиморасчеты.Сотрудник,
	|		ВЫБОР КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ЗарплатаКВыплатеОрганизаций
	|				ТОГДА ""Задепонировано""
	|			ИНАЧЕ Взаиморасчеты.Ведомость.ВидВыплаты.Наименование
	|		КОНЕЦ,
	|		"""",
	|		"""+НСтр("ru='Всего выплачено';uk='Всього виплачено'")+""",
	|		4,
	|		"+?(УпрУчет,"Взаиморасчеты.СуммаВзаиморасчетовУпр","Взаиморасчеты.СуммаВзаиморасчетов")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
	|	
	|	ГДЕ
	|		(Взаиморасчеты.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		И	Взаиморасчеты.ВидДвижения <> &Приход 
	|		И	Взаиморасчеты.Ведомость <> ЗНАЧЕНИЕ(Документ.ЗарплатаКВыплатеОрганизаций.ПустаяСсылка) 
	|	
	|	
	//---------------------Взносы в фонды---------------------------------------------------------
    |		"+?(УпрУчет,"","ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВзносыВФонды.Организация,
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.СтатьяНалоговойДекларации,
	|			"""",
	|			"""+НСтр("ru='Всего удержано';uk='Всього утримано'")+""",
	|			5,
	|			СУММА(ВзносыВФонды.Результат)                        
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыПоВзносамВФонды КАК ВзносыВФонды
	|		
	|		ГДЕ
	|			ВзносыВФонды.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|		  И
	|			ВзносыВФонды.ВидДвижения 		=	&Приход
	|		  И 
	|			ВзносыВФонды.Налог.Родитель = ЗНАЧЕНИЕ(Справочник.Налоги.Взносы)
	|		
	|		{ГДЕ
	|			ВзносыВФонды.Организация КАК Организация}
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзносыВФонды.Организация,
	|			ВзносыВФонды.Ставка,
    |			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.СтатьяНалоговойДекларации
	|                     ")+
	//-------------------------Удержания----------------------------------------------------------
	"
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УдержанияРаботниковОрганизации.Организация 			КАК Организация,
	|		УдержанияРаботниковОрганизации.Сотрудник 					КАК Сотрудник,
	|		УдержанияРаботниковОрганизации.ВидРасчета 					КАК ИмяВидаРасчета,
	|		"""" 														КАК ПриоритетВидаРасчета,
	|		"""+НСтр("ru='Всего удержано';uk='Всього утримано'")+"""	КАК Группа,
	|		6 															КАК ПриоритетГруппы,
	|		"+?(УпрУчет,"УдержанияРаботниковОрганизации.РезультатУпр","УдержанияРаботниковОрганизации.Результат")+"	КАК Результат
	
	|	ИЗ
	|		РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизации
	|	
	|	ГДЕ
	|		(УдержанияРаботниковОрганизации.ПериодРегистрации = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) И
	|		("+?(УпрУчет,"УдержанияРаботниковОрганизации.РезультатУпр","УдержанияРаботниковОрганизации.Результат")+" <> 0)
	|
	//-------------------------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СальдоНачальное.Организация,
	|		СальдоНачальное.Сотрудник,
	|		"""+НСтр("ru='Начальное сальдо';uk='Початкове сальдо'")+""",
	|		NULL,
	|		""А"",
	|		1,
	|		"+?(УпрУчет,"СальдоНачальное.СуммаВзаиморасчетовУпрОстаток","СальдоНачальное.СуммаВзаиморасчетовОстаток")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ) КАК СальдоНачальное
	|	
	//-------------------------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Основной.Организация,
	|		Основной.Сотрудник,
	|		"""+НСтр("ru='К выплате за месяц';uk='До виплати за місяць'")+""",
	|		NULL,
	|		""Я"",
	|		7,
	|		ВЫБОР	КОГДА Основной.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	          		ТОГДА "+?(УпрУчет,"Основной.СуммаВзаиморасчетовУпр","Основной.СуммаВзаиморасчетов")+"
	|				КОГДА	Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Взносы)
	|					ИЛИ Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.НДФЛ)
	|					ИЛИ Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Удержания)
	|	          		ТОГДА -"+?(УпрУчет,"Основной.СуммаВзаиморасчетовУпр","Основной.СуммаВзаиморасчетов")+"
	|	          ИНАЧЕ 0
	|	    КОНЕЦ
	|	ИЗ	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Основной
	|	ГДЕ  Основной.ПериодВзаиморасчетов = &Период
	|	
	|	
	//-------------------------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СальдоКонечное.Организация,
	|		СальдоКонечное.Сотрудник,
	|		"""+НСтр("ru='Конечное сальдо';uk='Кінцеве сальдо'")+""",
	|		NULL,
	|		""Я"",
	|		8,
	|		"+?(УпрУчет,"СальдоКонечное.СуммаВзаиморасчетовУпрОстаток","СальдоКонечное.СуммаВзаиморасчетовОстаток")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&СледующийПериод, ) КАК СальдоКонечное
	|	
	|	) КАК Данные
	|
	//------------------------подтягиваю подразделение организации-------------------------------
	|		"+?(УпрУчет,"ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				Работники.Подразделение									КАК Подразделение,
	|				Работники.ФизЛицо										КАК ФизЛицо
	|			ИЗ
	|				РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|	                )					КАК Работники
	|		)КАК РаботникиОрганизаций
	|
	|ПО РаботникиОрганизаций.ФизЛицо     = Данные.Сотрудник.ФизЛицо","ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				Работники.ПодразделениеОрганизации						КАК Подразделение,
	|				Работники.Сотрудник										КАК Сотрудник,
	|				Работники.Организация									КАК Организация
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|	                Сотрудник.ВидЗанятости В (&ПарамОсновнойСотрудник)
	|	                {ПодразделениеОрганизации КАК Подразделение, Организация}
	|	                )					КАК Работники
	|		)КАК РаботникиОрганизаций
	|
	|ПО РаботникиОрганизаций.Сотрудник     = Данные.Сотрудник И
	|   РаботникиОрганизаций.Организация = Данные.Организация
	|")+
	//-------------------------------------------------------------------------------------------
	//--------------------------подтягиваем информацию о физлицах-инвалидах----------------------
	"
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				ФизЛицо			КАК ФизЛицо,
	|				Инвалидность	КАК Инвалидность
	|			ИЗ
	|				РегистрСведений.СведенияОбИнвалидностиФизЛиц.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		) КАК СведенияОбИнвалидностиФизЛиц
	|	ПО Данные.Сотрудник.ФизЛицо = СведенияОбИнвалидностиФизЛиц.ФизЛицо
	//--------------------------------------------------------------------------------------------
	
	//--------------------------подтягиваем информацию о физлицах-пенсионерах[----------------------
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				ФизЛицо			КАК ФизЛицо,
	|				Пенсионер		КАК Пенсионер
	|			ИЗ
	|				РегистрСведений.СведенияОПенсионерах.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		) КАК СведенияОПенсионерах
	|	ПО Данные.Сотрудник.ФизЛицо = СведенияОПенсионерах.ФизЛицо
	//--------------------------------------------------------------------------------------------
	|ГДЕ ИСТИНА
	|	"+?(ТолькоСотрудникиИнвалиды,"И СведенияОбИНвалидностиФизЛиц.Инвалидность","")+"
	|	"+?(ТолькоСотрудникиПенсионеры,"И СведенияОПенсионерах.Пенсионер","")+"
	
	|
	|СГРУППИРОВАТЬ ПО
	|	
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	Данные.Сотрудник,
	|	"+? (Не ВыводитьКодПоДРФО,"","ВЫРАЗИТЬ(""("" + Данные.Сотрудник.Физлицо.КодПоДРФО + "")"" КАК СТРОКА(20)),")+"
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы,
	|	Данные.ИмяВидаРасчета,
	|	Данные.ПриоритетВидаРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Сотрудник.Физлицо.Наименование,
	|	ПриоритетГруппы,
	|	ПриоритетВидаРасчета
	|
	|ИТОГИ МАКСИМУМ(ПриоритетГруппы), МАКСИМУМ(ПриоритетВидаРасчета), СУММА(Результат) ПО
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	Данные.Сотрудник
	|
	|{ИТОГИ  ПО
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	ФизЛицо,
	|	Группа,
	|	ИмяВидаРасчета
	|}
	|
	|{ГДЕ
	|	Данные.Организация,
	|	РаботникиОрганизаций.Подразделение
	|}	
	|";
	

	СтруктураПредставлениеПолей = Новый Структура("ФизЛицоПредставление,Физлицо,ИмяВидаРасчета,Организация",
	НСтр("ru='Работник';uk='Працівник'"),
	НСтр("ru='Работник';uk='Працівник'"),
	НСтр("ru='Вид расчета';uk='Вид розрахунку'"),
	НСтр("ru='Организация';uk='Організація'"));
		
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	ПостроительОтчета.Отбор.Добавить("Организация");
	ПостроительОтчета.Отбор.Добавить("Подразделение");
	ПостроительОтчета.ВыводитьОбщиеИтоги = Истина;
	
	ПостроительОтчета.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПостроительОтчета.Макет = ПолучитьМакет("Макет");
	
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Группа");
	ПостроительОтчета.ИзмеренияКолонки.Добавить("ИмяВидаРасчета");
	
	ПостроительОтчета.РазмещениеИзмеренийВКолонках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	
	ПостроительОтчета.Параметры.Вставить("Приход", ВидДвиженияНакопления.Приход);
	
	ПустаяСтруктура = Новый Структура;
	
КонецПроцедуры

#КонецЕсли
