

Процедура МИКО_стПриЗаписиСобытияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Метаданные.ПланыОбмена.МИКО_стСопоставлениеСобытий.Состав.Найти(Источник.Метаданные()) <> Неопределено Тогда
		МИКО_опЗаписьКИ.ЗарегистрироватьИзмененияВПланеОбмена_стСопоставлениеСобытий(Источник.Ссылка); 
	КонецЕсли; 
	
КонецПроцедуры      
	
Процедура УДАЛИТЬ_ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
КонецПроцедуры
Процедура УДАЛИТЬ_ОбработкаПроведения(Источник, Отказ,РежимПроведения) Экспорт
		
КонецПроцедуры
