// #Область СлужебныеПроцедурыИФункции

// Обработчик операции сервиса.
// Возвращает наименование контакта по номеру телефона.
//
Функция Getivrtext(Number)
	
	Если ТипЗнч(Number) = Тип("Строка") И ЗначениеЗаполнено(Number) Тогда
		Если МИКО_опЗаписьКИ.ИспользоватьСинтезРечи() Тогда			
			Попытка
				Результат = СгенерироватьТекстIVRДляУмнойМаршрутизации(Number);
				Возврат Результат;	
			Исключение
			КонецПопытки; 
		КонецЕсли; 
		Результат = СгенерироватьТекстIVRДляУмнойМаршрутизацииПоУмолчанию();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // Getivrtext(Number)

// Производим поиск по контактной информации номера телефона.
// Number  - строка номера. 
// Возврат - наименование контакта (если контакт - контактное лицо контрагента, 
// то вернется наименование контрагента).
//
Функция СгенерироватьТекстIVRДляУмнойМаршрутизации(Number) 
	
	Если Number = "777777777" Тогда
		// Это тест системы
		Текст = Константы.МИКО_мвПримерПриветствия.Получить();
		
	Иначе
		
		ДанныеПриветствия = МИКО_мвМаршрутизацияЗвонковСервер.СформироватьКоллекциюЭлементовПриветствия(Number);
		Если ДанныеПриветствия = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		Текст = МИКО_мвМаршрутизацияЗвонков.СформироватьДанныеСтрокиПриветствияДляАТС(ДанныеПриветствия);
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции // СгенерироватьТекстIVRДляУмнойМаршрутизации(Number)	

// Возвращает строку IVR по умолчанию в json формате.
// 
Функция СгенерироватьТекстIVRДляУмнойМаршрутизацииПоУмолчанию() 
	
	ДанныеПриветствия = МИКО_мвМаршрутизацияЗвонков.СформироватьКоллекциюЭлементовПриветствияПоУмолчнию();
	Если ДанныеПриветствия = Неопределено Тогда
		Возврат "";
	КонецЕсли;
		
	Текст = МИКО_мвМаршрутизацияЗвонков.СформироватьДанныеСтрокиПриветствияДляАТС(ДанныеПриветствия);
	
	Возврат Текст;
	
КонецФункции // СгенерироватьТекстIVRДляУмнойМаршрутизации(Number)	
// #КонецОбласти
