// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)
Перем мДокументОснование       Экспорт;

Перем мУчетнаяПолитика         Экспорт;// (Общ)

Перем мВалютаРегламентированногоУчета Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;

Перем мУдалятьДвижения;

Перем мСтруктураНаименованийРеквизитовЗатраты Экспорт;

#Если Клиент Тогда
	
// Функция формирует печатную форму М-11
//
Функция ПечатьМ11()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                          КАК НомерДокумента,
	|	Док.Дата                           КАК ДатаДокумента,
	|	Док.Организация                    КАК Организация,
	|	Док.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	Док.Склад                          КАК Склад,
	|	КодыОрганизации.КодПоЕДРПОУ        КАК КодПоЕДРПОУ
	|ИЗ
	|	Документ.ТребованиеНакладная КАК Док                                                     
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату, ) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТребованиеНакладная_М11";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("М11");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Шапка);
	Область.Параметры.КодОперации = "Відпуск";
		
	ТабДокумент.Вывести(Область);
	
	ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
	ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
	
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("СчетПередачи",                 "Ссылка.СчетЗатрат");
	СтруктураПолей.Вставить("Материал",                     "Номенклатура");
	СтруктураПолей.Вставить("МатериалНаименование",         "Номенклатура.НаименованиеПолное");
	СтруктураПолей.Вставить("Характеристика",				"ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Серия",						"СерияНоменклатуры");
	СтруктураПолей.Вставить("НоменклатурныйНомер",          "Номенклатура.Код");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияНаименование", "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияКод",          "ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код");
	СтруктураПолей.Вставить("Коэффициент",          		"Коэффициент");
	СтруктураПолей.Вставить("Количество",                   "Количество");

	Область = Макет.ПолучитьОбласть("Строка");
	
	ТаблицаМатериалов = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Материалы", СтруктураПолей).Выгрузить();
	ТаблицаМатериалов.Свернуть("Материал, МатериалНаименование, Характеристика, Серия, СчетПередачи, НоменклатурныйНомер,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,Коэффициент", "Количество");
	Если ОтражатьВБухгалтерскомУчете Тогда
		ТаблицаМатериалов.ЗаполнитьЗначения(СчетЗатрат, "СчетПередачи");
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("СчетПередачи",                 "СчетПередачи");
	СтруктураПолей.Вставить("Материал",                     "Номенклатура");
	СтруктураПолей.Вставить("МатериалНаименование",         "Номенклатура.НаименованиеПолное");
	СтруктураПолей.Вставить("Характеристика",				"ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Серия",						"СерияНоменклатуры");
	СтруктураПолей.Вставить("НоменклатурныйНомер",          "Номенклатура.Код");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияНаименование", "Номенклатура.БазоваяЕдиницаИзмерения");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияКод",          "Номенклатура.БазоваяЕдиницаИзмерения.Код");
	СтруктураПолей.Вставить("Количество",                   "Количество");
	ТаблицаМатериаловЗаказчика = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "МатериалыЗаказчика", СтруктураПолей).Выгрузить();

	// Поиск сумм списания активов для заполнения Цены и Суммы
	ТаблицаСуммСписания = БухгалтерскийУчет.ПолучитьСуммуСписанияАктивов(ЭтотОБъект);
	
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	ПараметрыПодвал = ОбластьПодвал.Параметры;
	
	КоличествоВТаблице = ТаблицаМатериалов.Количество() + ТаблицаМатериаловЗаказчика.Количество();
	КоличествоОбработанных = 1;
	// В форме сказано "Кількість найменувань". Будет выводится количество позиций.
	ПараметрыПодвал.ИтогоКоличествоПрописью = ЧислоПрописью(КоличествоВТаблице, "Л=uk_UA;НП=Ложь;НД=Ложь;", ",,,,,,,,0");
															
	// сумму прописью выводим всегда на украинском - печатная форма регламенированная
	ПараметрыПодвал.ИтогоСуммаПрописью = ЧислоПрописью(ТаблицаСуммСписания.Итог("Сумма"), "Л=uk_UA; ДП=Ложь", мВалютаРегламентированногоУчета.ПараметрыПрописиНаУкраинском);


	Для Каждого СтрокаТЧ Из ТаблицаМатериалов Цикл
		
	Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(СтрокаТЧ);
		Область.Параметры.МатериалНаименование = СокрЛП(СтрокаТЧ.МатериалНаименование) 
		                                         + ФормированиеПечатныхФорм.ПредставлениеСерий(СтрокаТЧ);


		
		СтрокаСуммСписания =  ТаблицаСуммСписания.Найти(СтрокаТЧ.Материал, "Номенклатура");
		Если СтрокаСуммСписания = Неопределено Тогда
			 Область.Параметры.Цена = 0;
			 Область.Параметры.Стоимость = 0;
		 Иначе
			 Цена = ?(СтрокаСуммСписания.Количество = 0, 0, СтрокаСуммСписания.Сумма / СтрокаСуммСписания.Количество * СтрокаТЧ.Коэффициент);
			 Область.Параметры.Цена		 = Цена;
			 Область.Параметры.Стоимость = Цена * СтрокаТЧ.Количество;
		 КонецЕсли;
		 
		Если КоличествоОбработанных = КоличествоВТаблице Тогда
			// Последняя запись. Ее не следует отрывать от подписей.
			
			МассивТаблиц = Новый Массив(2);
			МассивТаблиц[0] = Область;
			МассивТаблиц[1] = ОбластьПодвал;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
		КоличествоОбработанных = КоличествоОбработанных + 1;

	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ТаблицаМатериаловЗаказчика Цикл

		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(СтрокаТЧ);
		
		СтрокаСуммСписания =  ТаблицаСуммСписания.Найти(СтрокаТЧ.Материал, "Номенклатура");
		Если СтрокаСуммСписания = Неопределено Тогда
			 Область.Параметры.Цена = 0;
			 Область.Параметры.Стоимость = 0;
		 Иначе
			 Цена = ?(СтрокаСуммСписания.Количество = 0, 0, СтрокаСуммСписания.Сумма / СтрокаСуммСписания.Количество);
			 Область.Параметры.Цена		 = Цена;
			 Область.Параметры.Стоимость = Цена * СтрокаТЧ.Количество;
		 КонецЕсли;
		 
		Если КоличествоОбработанных = КоличествоВТаблице Тогда
			// Последняя запись. Ее не следует отрывать от подписей.
			
			МассивТаблиц = Новый Массив(2);
			МассивТаблиц[0] = Область;
			МассивТаблиц[1] = ОбластьПодвал;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
		КоличествоОбработанных = КоличествоОбработанных + 1;

	КонецЦикла;
	
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьМ11()
	
// Функция формирует печатную форму документа
//
Функция ПечатьТребованиеНакладная()

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Артикул";
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Код";
		ТекстКодАртикул = "Код";
	Иначе
		ВыводитьКоды    = Ложь;
		Колонка         = "";
		ТекстКодАртикул = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	
	
	|	Номер,
	|	Дата,
	|	Организация,
	|	Организация КАК Поставщик,
	|	Ответственный.ФизЛицо.Наименование КАК Получил,
	|	Склад,
	|	Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
	|
	|ГДЕ
	|	ТребованиеНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.Текст =

	"ВЫБРАТЬ
	|	НомерСтроки КАК НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|	Номенклатура.Код     КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	КоличествоМест,
	|	ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|	ЕдиницаИзмеренияМест.Представление КАК ЕдиницаМест,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия,
	|	1 КАК ID
	|ИЗ
	|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладная
	|
	|ГДЕ
	|	ТребованиеНакладная.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	
	|	НомерСтроки КАК НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|	Номенклатура.Код     КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	0 КАК КоличествоМест,
	|	Номенклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|	&ПустаяСтрока КАК ЕдиницаМест,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия,
	|	2 КАК ID
	|ИЗ
	|	Документ.ТребованиеНакладная.МатериалыЗаказчика КАК МатериалыЗаказчика
	|
	|ГДЕ
	|	МатериалыЗаказчика.Ссылка = &ТекущийДокумент
	|	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID,
	|	НомерСтрокиТЧ
	|";
	
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТребованиеНакладная_ТН";
	
	// Вывод заголовка
	Макет = ПолучитьМакет("ТребованиеНакладная");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Выводим шапку нкладной
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Требование-накладная';uk='Вимога-накладна'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КодПоЕДРПОУ,/,ЮридическийАдрес,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим дополнительно информацию о договоре и сделке
	СписокДополнительныхПараметров = "Склад,Подразделение,";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;		
	
	Если ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	Если Материалы.Итог("КоличествоМест") > 0 Тогда
		ОбластьШапки  = ОбластьШапки  + "Мест";
		ОбластьСтроки = ОбластьСтроки + "Мест";
	Конецесли;
	
	// Вывести табличную часть (товары и услуги)
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = Колонка;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	
	Для каждого ВыборкаСтрокТовары из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);

		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТовары.КодАртикул;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	ОбластьИтого = "Итого";
	
	// Вывести Итого
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьИтого);
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьТребованиеНакладная()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если      ИмяМакета = "Накладная" Тогда
		ТабДокумент = ПечатьТребованиеНакладная();
	ИначеЕсли ИмяМакета = "М11" Тогда
		ТабДокумент = ПечатьМ11();
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка), Ссылка);
	
КонецПроцедуры // Печать()

#КонецЕсли


// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("М11, Накладная", "M-11 (Требование-накладная)", "Требование-накладная");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет счета учета по бухгалтерскому и налоговому учету.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);

	Если ЗаполнятьБУ = Истина Тогда
		СтрокаТЧ.Счет = СчетаУчета.СчетУчетаБУ;
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;

	Если ЗаполнятьНУ Тогда
		
		СтрокаТЧ.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		
	Иначе
		
		СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Функция возращает качество для номенклатуры. Для услуг возвращается пустое значение
//
//		Параметры: Номенклатура - элемент номенклатуры
//
//		Возврат: качество для элемента номенклатуры
//
Функция ПолучитьКачество(Номенклатура) Экспорт

	Если НЕ ЗначениеЗаполнено(Номенклатура) ИЛИ Номенклатура.Услуга Тогда
		Возврат Справочники.Качество.ПустаяСсылка();

	Иначе
		Возврат Справочники.Качество.Новый;

	КонецЕсли;

КонецФункции // ПолучитьКачество()

Процедура ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВСтрокеТабличногоПоля(СтрокаТабличнойЧасти) Экспорт

	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда

		СтрокаТабличнойЧасти.СтатьяЗатрат         = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
		СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;

	КонецЕсли;

КонецПроцедуры // ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВСтрокеТабличногоПоля()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета = "СчетЗатрат, Субконто1, Субконто2, Субконто3,
								|НадписьСчетЗатрат, НадписьСубконто1, НадписьСубконто2, НадписьСубконто3,
								|Материалы.Счет, МатериалыЗаказчика.Счет, МатериалыЗаказчика.СчетПередачи, 
								|Материалы.НалоговоеНазначение, ПодразделениеОрганизации, НадписьПодразделениеОрганизации";

	мСтрокаРеквизитыУпрУчета = "Подразделение, НадписьПодразделение";
	
КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Дополняет список обязательных параметров шапки
// упр. параметрами
Процедура ДополнитьОбязательныеРеквизитыШапкиУпр(Реквизиты)
	Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ")
			  + "Подразделение";
			  
КонецПроцедуры

// Проверяет правильность заполнения упр. реквизитов шапки
Процедура ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Документ нельзя оформлять на неавтоматизированную торговую точку!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, Склад";
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И Материалы.Количество() > 0 Тогда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", СчетЗатрат";
	КонецЕсли;	
		
	ДополнитьОбязательныеРеквизитыШапкиУпр(ОбязательныеРеквизитыШапки);

	УправлениеПроизводством.НепроверятьРеквизитыПоТипуУчета(ЭтотОбъект, ОбязательныеРеквизитыШапки, мСтрокаРеквизитыУпрУчета, мСтрокаРеквизитыБухУчета, мСтрокаРеквизитыУпрУчета);
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);

	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		ОбщегоНазначения.ПроверитьЗаполнениеАналитикиЗатрат(ЭтотОбъект, Отказ, Заголовок);
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			ХарактерЗатрат = Неопределено;
			НалоговоеНазначениеПроводки = Неопределено;
			НалоговоеНазначениеНДС = "ИзТабличнойЧасти";
			СтруктураСубконто = Новый Структура("Субконто1,Субконто2,Субконто3,ОбъектСтроительства,НоменклатурнаяГруппа", СтруктураШапкиДокумента.Субконто1, СтруктураШапкиДокумента.Субконто2, СтруктураШапкиДокумента.Субконто3, СтруктураШапкиДокумента.ОбъектСтроительства, СтруктураШапкиДокумента.НоменклатурнаяГруппа);
			НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(СтруктураСубконто, СтруктураШапкиДокумента.СчетЗатрат, ХарактерЗатрат,     
														НалоговоеНазначениеПроводки, , НалоговоеНазначениеНДС, НалоговоеНазначениеДоходовИЗатрат,,Ложь,Ложь,Дата);
			
			Если НЕ ЗначениеЗаполнено(НалоговоеНазначениеПроводки) Тогда
				Если ХарактерЗатрат = "Затраты" Тогда
					СтрокаСообщения = НСтр("ru = 'Не указано ""Налоговое назначение затрат""!'; uk = 'Не зазначено ""Податкове призначення витрат""!'");
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли ХарактерЗатрат = "Строительство" Тогда
					СтрокаСообщения = НСтр("ru = 'Не указано налоговое назначение для объекта строительства или НМА!'; uk = 'Не зазначено податкове призначення для об''єкта будівництва або НМА!'");
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли ХарактерЗатрат = "Производство" Тогда
					СтрокаСообщения = НСтр("ru = 'Не указано налоговое назначение для номенклатурной группы!'; uk = 'Не зазначено податкове призначення для номенклатурної групи!'");
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли ХарактерЗатрат = "РБП" Тогда
					СтрокаСообщения = НСтр("ru = 'Не указано налоговое назначение для расходов будущих периодов!'; uk = 'Не зазначено податкове призначення для витрат майбутніх періодів!'");
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли ХарактерЗатрат = "ТЗР" Тогда
				Иначе
					СтрокаСообщения = НСтр("ru = 'Невозможно определить налоговое назначение затрат для указанного счета затрат!'; uk = 'неможливо визначити податкое призначення витрат для вказанного рахунку витрат!'");
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.СписаниеНаОбъектСтроительства Тогда
			
			Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ОбъектСтроительства) Тогда
				
				Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.НалоговоеНазначениеОС) Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("У объекта строительства (аналитика счета затрат)<¤1¤> не выбрано налоговое назначение", СтруктураШапкиДокумента.ОбъектСтроительства), Отказ, Заголовок);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("В качестве склада может быть выбран только оптовый склад!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаМатериалов, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	РеквизитыТабМат = "Номенклатура, ЕдиницаИзмерения, Количество, СтатьяЗатрат, Качество, СпособСписанияОстаткаТоваров";

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		РеквизитыТабМат = РеквизитыТабМат + ", Счет";	
	
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ЕстьНДС Тогда
		РеквизитыТабМат = РеквизитыТабМат + ", НалоговоеНазначение";
	КонецЕсли;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Материалы", Новый Структура(РеквизитыТабМат), Отказ, Заголовок);

	// Здесь услуг и бланков быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Материалы", ТаблицаМатериалов, Отказ, Заголовок);
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Материалы", ТаблицаМатериалов, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Материалы", ТаблицаМатериалов, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Материалы", ТаблицаМатериалов, Отказ, Заголовок);

	// Проверим что нет услуг
	УправлениеПроизводством.НепроверятьРеквизитыПоТипуУчета(ЭтотОбъект, РеквизитыТабМат, мСтрокаРеквизитыУпрУчета, мСтрокаРеквизитыБухУчета, мСтрокаРеквизитыНалУчета, "Материалы");
	
	ПроверитьТабЧастьМатериалыПоСтрочно(ТаблицаМатериалов, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И НЕ Отказ Тогда
		ОбщегоНазначения.ПроверитьСоответствиеАналитикиЗатратНалоговомуНазначению(ЭтотОбъект, "Материалы", Отказ, Заголовок,,,Дата);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверкаРеквизитов()

Процедура ОбновитьПараметрыУчетнойПолитики() Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация);
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитикаНУ = ОбщегоНазначения.УчетнаяПолитикаНалоговыйУчет(Дата, УчетнаяПолитикаНеЗадана, Организация);
	Для каждого Элемент из УчетнаяПолитикаНУ Цикл
		мУчетнаяПолитика.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьТабЧастьМатериалыПоСтрочно(ТаблицаМатериалов, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОборудование = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Оборудование);
	НеоблагаемыйВНД = Справочники.ВидыНалоговойДеятельности.НеОблагаемая;
	
	Для каждого СтрокаТЧ Из ТаблицаМатериалов Цикл

		Если НЕ ЭтоОборудование Тогда
			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1(НСтр("ru='В строке номер ""¤1¤"" табличной части ""Материалы"": ';uk='У рядку номер ""¤1¤"" табличної частини ""Матеріали"": '"), СокрЛП(СтрокаТЧ.НомерСтроки));
		Иначе
			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1(НСтр("ru='В строке номер ""¤1¤"" табличной части ""Оборудование"": ';uk='У рядку номер ""¤1¤"" табличної частини ""Устаткування"": '"), СокрЛП(СтрокаТЧ.НомерСтроки));
		КонецЕсли;	
		
		Если НЕ Отказ  
			 И  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
			// нельзя по НДС указывать нехоз. деятельность, а по НП - хоз. деятельность
			Если НЕ Отказ  
				И  СтруктураШапкиДокумента.ЕстьНДС Тогда
				
				НехозДеятельностьНДС = (СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
				НехозДеятельностьНКУ = (СтрокаТЧ.НалоговоеНазначениеНовое = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
				
				Если НЕ СтрокаТЧ.НалоговоеНазначение = СтрокаТЧ.НалоговоеНазначениеНовое
					  И НехозДеятельностьНДС <> НехозДеятельностьНКУ Тогда 
					СтрокаСообщения = СтрокаНачалаСообщенияОбОшибке + НСтр("ru = 'ошибочно указано нехозяйственное налоговое назначение (НДС) и одновременно хозяйственную деятельность по затратам (и наоборот)!'; uk = 'Для послуги в рядку ""¤1¤""помилково зазначено негосподарське податкове призначення (ПДВ) і одночасно господарську діяльність по витратам (та навпаки)!'");
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ  
			 И  СтруктураШапкиДокумента.ЕстьНДС Тогда
		
			ХарактерЗатратНУ = СтрокаТЧ.ХарактерЗатрат;
			
			Если  ХарактерЗатратНУ = "ОПЗ"
				И СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			
				СтрокаСообщения = СтрокаНачалаСообщенияОбОшибке + НСтр("ru = ' указано нехозяйственное налоговое назначение. Списание на счет ОПЗ - невозможно!'; uk = ' зазначене негосподарське податкове призначення. Списання на рахунок ЗВВ - неможливе!'");	
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
			
			КонецЕсли;
			
		КонецЕсли;
				
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , мУчетнаяПолитика.ЕстьНалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , мУчетнаяПолитика.ЕстьНДС);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаМатериалов = РезультатЗапросаПоТоварам.Выгрузить();

	ТаблицаМатериалов.Колонки.Добавить("ДокументОприходования");
	ТаблицаМатериалов.Колонки.Добавить("Регистратор");
	ТаблицаМатериалов.Колонки.Добавить("Склад");
	ТаблицаМатериалов.Колонки.Добавить("Организация");
	ТаблицаМатериалов.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаМатериалов.Колонки.Добавить("Валюта");
	ТаблицаМатериалов.Колонки.Добавить("ВходящийНДС");
	ТаблицаМатериалов.Колонки.Добавить("КоэффОплаты");
	
	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ3");
	ТаблицаМатериалов.Колонки.Добавить("НалоговоеНазначениеНовое");
	
	КоэффОплаты      = 1;
	
	ТаблицаМатериалов.ЗаполнитьЗначения(КоэффОплаты,   							"КоэффОплаты");
	ТаблицаМатериалов.ЗаполнитьЗначения(ЭтотОбъект,    							"Регистратор");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад,      	"Склад");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,	"Организация");
	ТаблицаМатериалов.ЗаполнитьЗначения(СчетЗатрат,    							"КорСчетСписанияБУ");
	ТаблицаМатериалов.ЗаполнитьЗначения(Субконто1,     							"КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.ЗаполнитьЗначения(Субконто2,     							"КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.ЗаполнитьЗначения(Субконто3,     							"КорСубконтоСписанияБУ3");
	ТаблицаМатериалов.ЗаполнитьЗначения(НалоговоеНазначениеДоходовИЗатрат,		"НалоговоеНазначениеНовое");
	
	ТаблицаМатериалов.Колонки.Добавить("ХарактерЗатрат");
	Для Каждого Строка Из ТаблицаМатериалов Цикл
		
		// заполним ХарактерЗатрат, НалоговоеНазначениеНовое
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(Строка, Строка.КорСчетСписанияБУ, Строка.ХарактерЗатрат,
														       	Строка.НалоговоеНазначениеНовое, ,                                                           
																Строка.НалоговоеНазначение, Строка.НалоговоеНазначениеНовое, "КорСубконтоСписанияБУ", , Ложь,Дата);
	КонецЦикла;
	
	Возврат ТаблицаМатериалов;

КонецФункции // ПодготовитьТаблицуТоваров()

 // Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуМатериалыЗаказчика(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаМатериалов = РезультатЗапросаПоТоварам.Выгрузить();

	ТаблицаМатериалов.Колонки.Добавить("ДокументОприходования");
	ТаблицаМатериалов.Колонки.Добавить("Регистратор");
	ТаблицаМатериалов.Колонки.Добавить("Склад");
	ТаблицаМатериалов.Колонки.Добавить("Организация");
	ТаблицаМатериалов.Колонки.Добавить("ДоговорКонтрагента");
	//ТаблицаМатериалов.Колонки.Добавить("ОтражениеВНУ");
	ТаблицаМатериалов.Колонки.Добавить("Валюта");
	ТаблицаМатериалов.Колонки.Добавить("ВходящийНДС");
	ТаблицаМатериалов.Колонки.Добавить("КоэффОплаты");
	
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ3");
	
	ТаблицаМатериалов.Колонки.Добавить("СчетУчетаНУ");

	КоэффОплаты      = 1;
	
	
	ТаблицаМатериалов.ЗаполнитьЗначения(КоэффОплаты,   							"КоэффОплаты");
	ТаблицаМатериалов.ЗаполнитьЗначения(ЭтотОбъект,								"Регистратор");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад,       	"Склад");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, 	"Организация");
	ТаблицаМатериалов.ЗаполнитьЗначения(Контрагент,     						"КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.ЗаполнитьЗначения(Субконто2,     							"КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.ЗаполнитьЗначения(Субконто3,     							"КорСубконтоСписанияБУ3");
	
	ТаблицаМатериалов.Колонки.Добавить("СпособСписанияОстаткаТоваров");
	ТаблицаМатериалов.ЗаполнитьЗначения(Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва, "СпособСписанияОстаткаТоваров");
	ТаблицаМатериалов.Колонки.Добавить("КодОперацииПартииТоваров");
	ТаблицаМатериалов.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.СписаниеМатериаловЗаказчикаВПроизводствоОперативно, "КодОперацииПартииТоваров");
	
	ТаблицаМатериалов.Колонки.Добавить("ДопустимыйСтатус1");
	ТаблицаМатериалов.Колонки.Добавить("ДопустимыйСтатус2");
	
	ТаблицаМатериалов.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку, "ДопустимыйСтатус1");
	ТаблицаМатериалов.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция,    "ДопустимыйСтатус2");

	Возврат ТаблицаМатериалов;

КонецФункции // ПодготовитьТаблицуТоваров()

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ДВИЖЕНИЙ ПО РЕГИСТРАМ

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаМатериалов, ТаблицаДавальческихМатериалов, Отказ, Заголовок, РежимПроведения)
	
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаМатериалов, ТаблицаДавальческихМатериалов, Отказ, Заголовок);
	
	ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаМатериалов, ТаблицаДавальческихМатериалов, Отказ, Заголовок);
	
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаМатериалов, ТаблицаДавальческихМатериалов, Отказ, Заголовок);
	
	Если ОтражатьВУправленческомУчете Тогда
	
		// Проводить по партиям сразу нужно если установлен параметр
		// учетной политики СписыватьПартииПриПроведенииДокументов.
		ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;
			
		Если ПроводитьПоПартиям Тогда
			
			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
			
			//Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
			//	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаДавальческихМатериалов, Ложь, Истина, Ложь, , Отказ);
			//КонецЕсли;
			
			Если ТаблицаМатериалов.Количество() + ТаблицаДавальческихМатериалов.Количество() > 0 Тогда
				ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
				ЗаписьРегистрации.Период = Дата;
				ЗаписьРегистрации.Регистратор = Ссылка;
			КонецЕсли;
			
		Иначе
			
			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
				УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

// Формирование движений по регистрам по управленческому учету.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДавальческихМатериалов, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
	НаборДвижений = Движения.ТоварыНаСкладах;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДавальческихМатериалов, ТаблицаДвижений);
	КонецЕсли;

	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Склад,						"Склад");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	// Проверка остатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Материалы", СтруктураШапкиДокумента, Отказ, Заголовок);
		
		Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "МатериалыЗаказчика", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;	
			
	КонецЕсли;
		
	Если Не Отказ Тогда
		Движения.ТоварыНаСкладах.ВыполнитьРасход();
	КонецЕсли;
	
	// Если есть списание из резерва, то надо списать резерв
	ТаблицаПоТоварамИзРезерва = ТаблицаПоТоварам.Скопировать();
	
	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДавальческихМатериалов, ТаблицаПоТоварамИзРезерва);
	КонецЕсли;	
	
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамИзРезерва.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамИзРезерва.Получить(Сч);
		Если СтрокаТаблицы.СпособСписанияОстаткаТоваров <> Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва Тогда
			 ТаблицаПоТоварамИзРезерва.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;

	Если ТаблицаПоТоварамИзРезерва.Количество() > 0 Тогда
		
		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамИзРезерва, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Материалы", 		 СтруктураШапкиДокумента, Отказ, Заголовок);
			Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
				НаборДвижений.КонтрольОстатков(ЭтотОбъект, "МатериалыЗаказчика", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;	
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
	ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДавальческихМатериалов, Отказ, Заголовок);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТабЧасти",     "Материалы");
	ДопПараметры.Вставить("СтатусПартии",    Перечисления.СтатусыПартийТоваров.Купленный);
	ДопПараметры.Вставить("РежимПроведения", РежимПроведения);
	ДопПараметры.Вставить("ИмяРеквизитаЗаказ", "Заказ");
	ДопПараметры.Вставить("ЗаказВШапке",       Ложь);
	
	УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТаблицаПоТоварам, ДопПараметры, Отказ, Заголовок);

КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаМатериалов, ТаблицаДавальческихМатериалов, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаМатериалов, , Ложь, Истина, , , Отказ);

	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаДавальческихМатериалов, , Ложь, Истина, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Формирование движений по регистру "Товары организаций".
//
Процедура ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДавальческихМатериалов, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДавальческихМатериалов, ТаблицаДвижений);
	КонецЕсли;	

	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад, "Склад");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	// Проверка остатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Материалы", СтруктураШапкиДокумента, Отказ, Заголовок);
		Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "МатериалыЗаказчика", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;	
	КонецЕсли;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструТоварыОрганизаций()

// Заполнение реквизитов управленческого учета регистра СписанныеТовары.
//
Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам)

	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, 		"ДопустимыйСтатус1");
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Оборудование, 	"ДопустимыйСтатус1");
	КонецЕсли;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция, "ДопустимыйСтатус2");
	
	Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл
		СтрокаТЧ = ТаблицаПоТоварам.Получить(ТаблицаДвижений.Индекс(СтрокаДвижений));
		Если ЗначениеЗаполнено(СтрокаТЧ.Заказ) 
			И ТипЗнч(СтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
			И СтрокаТЧ.Заказ.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка 
			Тогда
			
			СтрокаДвижений.ДопустимыйСтатус3 = Перечисления.СтатусыПартийТоваров.ВПереработку;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр()

// Формирование движений по регистру СписанныеТовары.
//
Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДавальческихМатериалов, Отказ, Заголовок)

	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.

	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
		
		СтатьяЗатратСпис = Строка.СтатьяЗатрат;
				
		Если СтатьяЗатратСпис.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			Строка.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.СписаниеПартийВПроизводствоОперативно;
		ИначеЕсли СтатьяЗатратСпис.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			Строка.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.СписаниеНаБрак;
		ИначеЕсли СтатьяЗатратСпис.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда
			Строка.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.СписаниеНаВложенияВоВнеоборотныеАктивы;
		Иначе
			Строка.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.СписаниеНаЗатраты;
		КонецЕсли;
		
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Материалы;		
		
	КонецЦикла;
	
	ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам);
	
	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		ТаблицаДавальческихМатериалов.Колонки.Добавить("НомерСтрокиДокумента");
		ТаблицаДавальческихМатериалов.Колонки.Добавить("ВидТабличнойЧасти");
		Для каждого Строка Из ТаблицаДавальческихМатериалов Цикл
			Инд = Инд+1;
			Строка.НомерСтрокиДокумента = Инд;
		   Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.МатериалыЗаказчика;		
        КонецЦикла;
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДавальческихМатериалов, ТаблицаДвижений);
	КонецЕсли;	

	// Если ПУ по складам
	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Подразделение");
    ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете, "ОтражатьВУправленческомУчете");
	

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструСписанныеТовары()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета();
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("СписаниеНаОбъектСтроительства", Ложь);
	Субконто = Неопределено;
	
	СтруктураШапкиДокумента.Вставить("ОбъектСтроительства", Неопределено);

	Для Н = 1 По 3 Цикл
		
		Если СтруктураШапкиДокумента.Свойство("Субконто" + Н, Субконто) Тогда
			
			Если ТипЗнч(Субконто) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
				
				 СтруктураШапкиДокумента.СписаниеНаОбъектСтроительства = Истина;
				 СтруктураШапкиДокумента.Вставить("ОбъектСтроительства", Субконто);
				 НалоговоеНазначениеОС = Субконто.НалоговоеНазначение;
				 СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеОС"     , НалоговоеНазначениеОС);
				 СтруктураШапкиДокумента.Вставить("ВидНалоговойДеятельностиОС", НалоговоеНазначениеОС.ВидНалоговойДеятельности);
				 Прервать
				
			КонецЕсли;
			
		КонецЕсли;	
	
	КонецЦикла;
	
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента,Отказ,Заголовок);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад", 			"ВидСклада", 					"ВидСклада");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика", 	"ВестиПартионныйУчетПоСкладам", "ВестиПартионныйУчетПоСкладам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Проверим правильность заполнения шапки документа
	Если Материалы.Количество() <> 0 или МатериалыЗаказчика.Количество() <> 0 Тогда
		
		ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;

	Если МатериалыЗаказчика.Количество() <> 0 Тогда
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Сообщить("На закладке ""Материалы заказчика"" в реквизите ""Контрагент"" не указан поставщик давальческого сырья");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Получим необходимые данные для проведения и проверки заполнения данные по табличной части "Товары".
	СтруктураПолей = Новый Структура();      
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"			, "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                  , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Количество"                , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("СчетУчетаБУ"				, "Счет");
	СтруктураПолей.Вставить("НалоговоеНазначение"		, "НалоговоеНазначение");
	СтруктураПолей.Вставить("НомерСтроки"               , "НомерСтроки");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"         , "СерияНоменклатуры");
	СтруктураПолей.Вставить("СпособСписанияОстаткаТоваров", "СпособСписанияОстаткаТоваров");
	СтруктураПолей.Вставить("СтатьяЗатрат"				, "СтатьяЗатрат");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"		, "НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Заказ"						, "Заказ");
	СтруктураПолей.Вставить("ДокументРезерва"			, "Заказ");
	
	СтруктураПолей.Вставить("ЗаказПокупателя"           , "Заказ");
	СтруктураПолей.Вставить("ЗаказПартии"         		, "Заказ");
	СтруктураПолей.Вставить("Качество"					, "Качество");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"		, "НалоговоеНазначение.ВидДеятельностиНДС");
	
	СтруктураПолей.Вставить("ОбъектСтроительства"		, "ОбъектСтроительства");
	
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПростыхПолей.Вставить("ЗаказСписания" , ЗаказЗатрат);
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Материалы", СтруктураПолей, СтруктураПростыхПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
 	ПроверкаРеквизитовТЧ(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийТребованиеНакладная.Материалы Тогда
		
		СтруктураПолей = Новый Структура();
		СтруктураПолей.Вставить("НомерСтроки"      			, "НомерСтроки");
		СтруктураПолей.Вставить("Номенклатура"     			, "Номенклатура");
		СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
		СтруктураПолей.Вставить("СерияНоменклатуры"        	, "СерияНоменклатуры");
		СтруктураПолей.Вставить("Количество"       			, "Количество");
		СтруктураПолей.Вставить("Заказ"						, "Заказ");
		СтруктураПолей.Вставить("ДокументРезерва"			, "Заказ");
		СтруктураПолей.Вставить("ЗаказСписания"				, "Заказ");
		СтруктураПолей.Вставить("ЗаказПартии"         		, "Заказ");
		СтруктураПолей.Вставить("Качество"					, "Качество");
		СтруктураПолей.Вставить("СчетУчетаБУ"      			, "Счет");
		СтруктураПолей.Вставить("КорСчетСписанияБУ"			, "СчетПередачи");
		
		РезультатЗапросаПоМатериалам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "МатериалыЗаказчика", СтруктураПолей);
		// Подготовим таблицу товаров для проведения.
		ТаблицаДавальческихМатериалов = ПодготовитьТаблицуМатериалыЗаказчика(РезультатЗапросаПоМатериалам, СтруктураШапкиДокумента);
	Иначе
		ТаблицаДавальческихМатериалов = Новый ТаблицаЗначений();
	КонецЕсли;
	
	// Движения по документу.
	Если Не Отказ Тогда
		// Формирование движения регистров
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДавальческихМатериалов, Отказ, Заголовок, РежимПроведения);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры	// ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Заполнение на основании ПоступлениеТоваровУслуг, реквизиты шапки, упр.
//
Процедура ОбработкаЗаполненияПоПоступлениюТоваровУслугШапкаУпр(Основание)
	Подразделение = Основание.Подразделение;
КонецПроцедуры

// Процедура - обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(Основание)
	
	ВидОперации   = Перечисления.ВидыОперацийТребованиеНакладная.Материалы;
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = Основание;		

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		// Заполнение шапки
		Организация                  = Основание.Организация;
		ОтражатьВБухгалтерскомУчете  = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
		Склад                        = Основание.СкладОрдер;
		
		// каков при этом вид операции для требование-накладной?
		
		
		//Если Основание.ВидОперации  = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		//	ВидОперации   = Перечисления.ВидыОперацийТребованиеНакладная.Оборудование;
		//КонецЕсли;	
		
		Если Основание.ВидОперации  = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			Контрагент               = Основание.Контрагент;
			СтрокаТЧ                 = МатериалыЗаказчика;
		Иначе
			СтрокаТЧ                 = Материалы;
		КонецЕсли;
		
		ОбработкаЗаполненияПоПоступлениюТоваровУслугШапкаУпр(Основание);
		
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			
			НоваяСтрока = СтрокаТЧ.Добавить();
			НоваяСтрока.Количество                 = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура               = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры          = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.Качество                   = Справочники.Качество.Новый;
			Если СтрокаТЧ = Материалы Тогда
				НоваяСтрока.НалоговоеНазначение = ТекСтрокаТовары.НалоговоеНазначение;
			КонецЕсли;
			
			СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, НоваяСтрока.Номенклатура, Склад);
			Если Основание.ВидОперации  = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
				
				
				//НоваяСтрока.Счет        = СчетаУчета.СчетУчетаДавСырья;
				НоваяСтрока.Счет        = ТекСтрокаТовары.СчетУчетаБУ;
				НоваяСтрока.СчетПередачи = СчетаУчета.СчетПередачиЗабБУ;
				НоваяСтрока.Заказ       = Основание.Сделка;
			Иначе
				НоваяСтрока.Счет        = СчетаУчета.СчетУчетаБУ;
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.КоличествоМест   = ТекСтрокаТовары.КоличествоМест;
				НоваяСтрока.Коэффициент      = ТекСтрокаТовары.Коэффициент;
				
				Если ЗначениеЗаполнено(Основание.Сделка)
			   	   И Не Основание.Сделка.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
					НоваяСтрока.Заказ = Основание.Сделка;
				КонецЕсли;
				
				ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(НоваяСтрока, ЭтотОбъект);
				ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВСтрокеТабличногоПоля(НоваяСтрока);
			
			КонецЕсли;
			

		КонецЦикла;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		Если Не УправлениеЗаказами.ИспользоватьВнутренниеЗаказы() Тогда
			Возврат;
		КонецЕсли;
		
		// Заполнение шапки
		ОтражатьВУправленческомУчете = Истина;
		ОтражатьВБухгалтерскомУчете  = Истина;
		Подразделение = Основание.Заказчик;
		Организация   = Основание.Организация;
		Ответственный = Основание.Ответственный;
		Заказ         = Основание.Ссылка;
		Комментарий   = Основание.Комментарий;
		Склад         = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		
		УправлениеЗаказами.ЗаполнитьОстаткамиТоваровСРезервомПоВнутреннемуЗаказу( ЭтотОбъект, Основание, Материалы, Склад, Дата);
		
		Для Каждого Строка Из Материалы Цикл
			Строка.Заказ = Основание;
			
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Строка, "Материалы", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
			
			ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(Строка, ЭтотОбъект);
			ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВСтрокеТабличногоПоля(Строка);
			
		КонецЦикла;
		
	ИначеЕсли (ТипЗнч(Основание)=Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Или (ТипЗнч(Основание)=Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"))) Тогда

		Организация                 = Основание.Организация;
		
		ОтражатьВБухгалтерскомУчете = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете= Основание.ОтражатьВУправленческомУчете;
		СчетЗатрат                  = Основание.СчетЗатрат;
		Субконто1                   = Основание.ПодразделениеОрганизации;
		Субконто3                   = Справочники.СтатьиЗатрат.ПустаяСсылка(); 
		
		Ответственный               = Основание.Ответственный;
		Подразделение				= Основание.Подразделение;
		ПодразделениеОрганизации    = Основание.ПодразделениеОрганизации;
		
		УсловиеНаНоменклатурнуюГруппу = "";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧДок.НоменклатурнаяГруппа
		|ИЗ
		|	Документ." + ?(ТипЗнч(Основание)=Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"), "АктОбОказанииПроизводственныхУслуг.Услуги", "ОтчетПроизводстваЗаСмену.Продукция") + " КАК ТЧДок 
		|ГДЕ
		|	ТЧДок.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТаблицаНоменклатурныхГрупп = Запрос.Выполнить().Выгрузить();
		НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
		
		Если ТаблицаНоменклатурныхГрупп.Количество() > 1 Тогда 	
			
		     ВыборНоменклатурнаяГруппа = ТаблицаНоменклатурныхГрупп.ВыбратьСтроку("Выберите номенклатурную группу для формирования документа.");

			 Если ВыборНоменклатурнаяГруппа <> Неопределено Тогда 		 	
				 НоменклатурнаяГруппа = ВыборНоменклатурнаяГруппа.НоменклатурнаяГруппа;
				 УсловиеНаНоменклатурнуюГруппу = " И ДокументОснования.НоменклатурнаяГруппа  = &НоменклатурнаяГруппа";
			 КонецЕсли; 
			 
		ИначеЕсли ТаблицаНоменклатурныхГрупп.Количество() = 1 Тогда
			 
			НоменклатурнаяГруппа = ТаблицаНоменклатурныхГрупп[0].НоменклатурнаяГруппа;
			
		КонецЕсли; 
		
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
			ТекстДокумента = "Документ.АктОбОказанииПроизводственныхУслуг.Услуги";
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
			ТекстДокумента = "Документ.ОтчетПроизводстваЗаСмену.Продукция";
			Склад  = Основание.Склад;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда	
			Субконто = СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
			Если Субконто <> Неопределено Тогда 				
			     Если Субконто.НомерСтроки  = 1 Тогда
				     Субконто1 = НоменклатурнаяГруппа;
				 ИначеЕсли Субконто.НомерСтроки  = 2 Тогда
				     Субконто2 = НоменклатурнаяГруппа;
 	             ИначеЕсли Субконто.НомерСтроки  = 3 Тогда
				     Субконто3 = НоменклатурнаяГруппа;  				 
				 КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ 		
		|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура КАК Номенклатура,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		|	СУММА(ВЫБОР
		|		КОГДА (СпецификацииНоменклатуры.Количество * СпецификацииНоменклатуры.ЕдиницаИзмерения.Коэффициент) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВложенныйЗапрос.КоличествоПродукции * СпецификацииНоменклатурыИсходныеКомплектующие.Количество / (СпецификацииНоменклатуры.Количество * СпецификацииНоменклатуры.ЕдиницаИзмерения.Коэффициент)
		|	КОНЕЦ) КАК Количество
		|ИЗ
		|(ВЫБРАТЬ
		|	ДокументОснования.Спецификация КАК Спецификация,
		|	СУММА(ДокументОснования.Количество) КАК КоличествоПродукции
		|	ИЗ
		|		"+ТекстДокумента+" КАК ДокументОснования
		|ГДЕ
		|	ДокументОснования.Ссылка = &Ссылка И
		|	ДокументОснования.Спецификация <> &Спецификация " + УсловиеНаНоменклатурнуюГруппу + "	
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументОснования.Спецификация) КАК ВложенныйЗапрос
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ  Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
		|		ПО СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка = СпецификацииНоменклатуры.Ссылка
		|	 ПО ВложенныйЗапрос.Спецификация = СпецификацииНоменклатуры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ХарактеристикаНоменклатуры,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ЕдиницаИзмерения";

		Запрос.УстановитьПараметр("Ссылка", Основание.Ссылка);
		Запрос.УстановитьПараметр("Спецификация", Справочники.СпецификацииНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);		
		Результат = Запрос.Выполнить();
		ТаблицаМатериалов = Результат.Выгрузить();
		
		Материалы.Загрузить(ТаблицаМатериалов);
		Для Каждого Стр Из Материалы Цикл
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Стр, "Материалы", Истина, Истина);
			Стр.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
			Стр.Качество = Справочники.Качество.Новый;
			Стр.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		КонецЦикла;
	
	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		// Заполнение шапки
		Комментарий 				= Основание.Комментарий;
		Контрагент					= Основание.Контрагент;
		Организация 				= Основание.Организация;
		Ответственный 				= Основание.Ответственный;
		ОтражатьВБухгалтерскомУчете = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете= Основание.ОтражатьВУправленческомУчете;
		Подразделение				= Основание.Подразделение;
		
		Для Каждого ТекСтрокаМатериалыЗаказчика Из Основание.МатериалыЗаказчика Цикл
			
			НоваяСтрока = МатериалыЗаказчика.Добавить();
			НоваяСтрока.Количество 					= ТекСтрокаМатериалыЗаказчика.Количество;
			НоваяСтрока.Номенклатура 				= ТекСтрокаМатериалыЗаказчика.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаМатериалыЗаказчика.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры 			= ТекСтрокаМатериалыЗаказчика.СерияНоменклатуры;
			НоваяСтрока.Качество 					= ТекСтрокаМатериалыЗаказчика.Качество;
			
			НоваяСтрока.Счет 						= ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработку;
			НоваяСтрока.СчетПередачи 				= ТекСтрокаМатериалыЗаказчика.СчетУчетаБУ;
			
			НоваяСтрока.Заказ = Основание.Сделка;
			
		КонецЦикла;
		
	КонецЕсли;
	
	мДокументОснование = Основание;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбщегоНазначения.УдалитьРегистрациюДокументаВПоследовательностях(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАналитикуЗатратУУВТабЧасти(Отказ);
	
	Для каждого СтрокаТабличнойЧасти Из МатериалыЗаказчика Цикл
		Если СтрокаТабличнойЧасти.СпособСписанияОстаткаТоваров <> Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва Тогда
			СтрокаТабличнойЧасти.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
		КонецЕсли; 
	КонецЦикла;
	
	ОбновитьПараметрыУчетнойПолитики();
	
	Если НЕ мУчетнаяПолитика.ЕстьНДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Материалы Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено

КонецПроцедуры

Процедура ЗаполнитьАналитикуЗатратУУВТабЧасти(Отказ)

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		// если аналитика затрат в шапке заполнена - заполняем все строки табличной части Материалы
		Для Каждого СтрокаМатериалы Из Материалы Цикл
			СтрокаМатериалы.СтатьяЗатрат 		 = СтатьяЗатрат;
			СтрокаМатериалы.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
			СтрокаМатериалы.ОбъектСтроительства  = ОбъектСтроительства;
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьАналитикуЗатратУУВТабЧасти()
 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

мСтруктураНаименованийРеквизитовЗатраты = Новый Структура("СчетЗатрат, Подразделение, ПодразделениеОрганизации, НоменклатурнаяГруппа, СтатьяЗатрат, ОбъектСтроительства, НалоговоеНазначение", 
				"СчетЗатрат", "Подразделение", "ПодразделениеОрганизации", "НоменклатурнаяГруппа", "СтатьяЗатрат", "ОбъектСтроительства", "НалоговоеНазначение");

