Перем мВалютаРегламентированногоУчета Экспорт;


// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;

	//Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Заголовок = "Запись банковского счета (" + Владелец + ") " + Наименование + ", код " + Код;
	//
	//Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) Тогда 
	//	мОтказ = Отказ;
	//	ОбщегоНазначения.СообщитьОбОшибке("В номере счета есть не только цифры. Возможно, номер указан неверно.", Отказ, Заголовок);
	//	Отказ = мОтказ;
	//КонецЕсли;

	//// Проверка заполнения обязательных реквизитов
	//Если НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Не выбрана валюта.", Отказ, Заголовок);
	//КонецЕсли;
	//Если ВалютаДенежныхСредств = мВалютаРегламентированногоУчета Тогда
	//
	//	Если НЕ ЗначениеЗаполнено(НомерСчета) Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Не указан номер счета.", Отказ, Заголовок);
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Банк) Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Не выбран банк.", Отказ, Заголовок);
	//	КонецЕсли;
	//
	//КонецЕсли;


КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
