&НаСервере
Процедура ОчиститьПолучателя()
	Объект.Получатель = Справочники.ЛМ_Контрагенты.ПустаяСсылка();
	Объект.АдресПолучателя = Справочники.ЛМ_Адреса.ПустаяСсылка();
	Объект.КонтактноеЛицоПолучателя = Справочники.ЛМ_КонтактныеЛица.ПустаяСсылка();
КонецПроцедуры	
	
&НаКлиенте
Процедура НаименованиеКонтрагентаПриИзменении(Элемент)
	ОчиститьПолучателя();
КонецПроцедуры

&НаСервере
Процедура ОчиститьКонтактноеЛицоПолучателя()
	Объект.КонтактноеЛицоПолучателя = Справочники.ЛМ_КонтактныеЛица.ПустаяСсылка();
КонецПроцедуры 	

&НаКлиенте
Процедура ФамилияПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаКлиенте
Процедура ИмяПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеКонтрагента()
	Объект.НаименованиеКонтрагента = Объект.Получатель.Наименование;
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ВыборКонтрагентаДоставки(ВыбранныйКОнтрагент)
	Объект.Получатель = ВыбранныйКОнтрагент;
	Объект.НаименованиеКонтрагента = ВыбранныйКОнтрагент.Наименование;
	Объект.ГородПолучателя = ВыбранныйКОнтрагент.Город;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_КонтактныеЛица.Ссылка,
	|	ЛМ_КонтактныеЛица.Фамилия,
	|	ЛМ_КонтактныеЛица.Отчество,
	|	ЛМ_КонтактныеЛица.Имя,
	|	ЛМ_КонтактныеЛица.Телефон
	|ИЗ
	|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
	|ГДЕ
	|	ЛМ_КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
	|	И ЛМ_КонтактныеЛица.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ВыбранныйКОнтрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.КонтактноеЛицоПолучателя = Выборка.Ссылка;
		Объект.ИмяПолучателя = Выборка.Имя;
		Объект.ФамилияПолучателя = Выборка.Фамилия;
		Объект.ОтчествоПолучателя = Выборка.Отчество;
		Объект.ТелефонПолучателя = Выборка.Телефон;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьКонтрагентовДляОтбора()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) тогда
		Если Объект.ДокументОснование.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			Если ЗначениеЗаполнено(Объект.ДокументОснование.Контрагент) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
				|ИЗ
				|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
				|ГДЕ
				|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент";
				Запрос.УстановитьПараметр("Контрагент", Объект.ДокументОснование.Контрагент);
				Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтрагентДоставки");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция КонтрагентОснования()
	Если ЗначениеЗаполнено(Объект.ДокументОснование.Контрагент) Тогда
		Возврат Объект.ДокументОснование.Контрагент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура НаименованиеКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.ЛМ_Контрагенты.ФормаВыбора");
	//КонтрагентыОтбора = ПолучитьКонтрагентовДляОтбора();
	//Если КонтрагентыОтбора <> Неопределено Тогда
	КонтрагентОснования = КонтрагентОснования();
	Если НЕ КонтрагентОснования = Неопределено Тогда
		ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = КонтрагентОснования;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;	
	Рез = ФормаВыбора.ОткрытьМодально();
	Если Рез <> Неопределено Тогда
		ВыборКонтрагентаДоставки(Рез);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДокументСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ВыгрузитьЭкспрессНакладную();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьДокумент(Команда)
	ОтправитьДокументСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭкспрессНакладной(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ГУИД) Тогда
		Сообщить("Докумен не отправлен в информационную систему службы доставки");
		Возврат;
	КонецЕсли;	
	
	//ФормаХТМЛ = ПолучитьФорму("Документ.ЛМ_ЭкспрессНакладная.Форма.ФормаПечатиХТМЛ");
	ЗапуститьПриложение("https://my.novaposhta.ua/orders/printDocument/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ());
	//Возврат;
	//ФормаХТМЛ.ХТМЛ = "https://my.novaposhta.ua/orders/printDocument/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ();
	//ФормаХТМЛ.Заголовок = "Печать экспресс-накладной " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	//ФормаХТМЛ.Открыть();
	УстанвоитьПризнакРаспечатан();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМаркировки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ГУИД) Тогда
		Сообщить("Докумен не отправлен в информационную систему службы доставки");
		Возврат;
	КонецЕсли;	
	
	ЗапуститьПриложение("https://my.novaposhta.ua/orders/printMarkings/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ());
	
	//ФормаХТМЛ = ПолучитьФорму("Документ.ЛМ_ЭкспрессНакладная.Форма.ФормаПечатиХТМЛ");
	//ФормаХТМЛ.ХТМЛ = "https://my.novaposhta.ua/orders/printMarkings/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ();
	//ФормаХТМЛ.Заголовок = "Печать маркировки " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	//ФормаХТМЛ.Открыть();
	УстанвоитьПризнакРаспечатан();
    УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстанвоитьПризнакРаспечатан()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Распечатан = истина;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
КонецПроцедуры	

&НаСервере
Функция КлючАПИ()
	Возврат Константы.ЛМ_КлючAPI.Получить();	
КонецФункции	

&НаСервере
Функция ПолучитьТекстДокумента(ИмяПечФормы)
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.Печать(ИмяПечФормы);
	//ЗначениеВРеквизитФормы(Об, "Объект");
КонецФункции

&НаСервере
Процедура УдалитьДокументСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.УдалитьДокумент();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьДокумент(Команда)
	Если Вопрос("Вы действительно хотите удалить документ из информационной системы службы доставки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		УдалитьДокументСервер();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Если Объект.Распечатан Тогда
		ТолькоПросмотр = Истина;
	Иначе	
		ТолькоПросмотр = Ложь;
	КонецЕсли;	
	Если Объект.ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ Объект.ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		Элементы.СкладОтправителя.ТолькоПросмотр = Истина;
		Элементы.АдресОтправителя.ТолькоПросмотр = Ложь;
	ИначеЕсли 	Объект.ТехнологияДоставки.ГУИД = "WarehouseWarehouse" ИЛИ Объект.ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		Элементы.СкладОтправителя.ТолькоПросмотр = Ложь;
		Элементы.АдресОтправителя.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Объект.ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ Объект.ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		Элементы.СкладПолучателя.ТолькоПросмотр = Истина;
		Элементы.АдресПолучателя.ТолькоПросмотр = Ложь;
	ИначеЕсли 	Объект.ТехнологияДоставки.ГУИД = "WarehouseWarehouse" ИЛИ Объект.ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		Элементы.СкладПолучателя.ТолькоПросмотр = Ложь;
		Элементы.АдресПолучателя.ТолькоПросмотр = Истина;
	КонецЕсли;	
    Заголовок = "Экспресс накладная " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy ЧЧ:мм:сс'") + ?(Объект.Распечатан, "     ДОКУМЕНТ РАСПЕЧАТАН", "");
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ГУИД = "ОтказОтСоздания!!!" Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъем()
	Объект.Объем = Объект.Ширина * Объект.Длина * Объект.Высота / 1000000;
	Объект.ОбъемныйВес = Объект.Объем * 250;
КонецПроцедуры	

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьОбъемВСтроке()
	Элементы.ПараметрыГрузов.ТекущиеДанные.Объем = Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина / 1000000;
КонецПроцедуры	

&НаКлиенте
Процедура ПараметрыГрузовДлинаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовШиринаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовВысотаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	Объект.ОбъемныйВес = Объект.Объем * 250;
	Если Объект.Ширина <> 0  и Объект.Длина <> 0 И Объект.Высота <> 0 Тогда
		ИсходныйОбъем = Объект.Ширина * Объект.Длина * Объект.Высота;
		Коэфф = Объект.Объем / ИсходныйОбъем;
		Объект.Ширина = Объект.Ширина * Коэфф;
		Объект.Длина = Объект.Длина * Коэфф;
		Объект.Высота = Объект.Высота * Коэфф;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныйВесПриИзменении(Элемент)
	Объект.Объем = Объект.ОбъемныйВес / 250;
	Если Объект.Ширина <> 0  и Объект.Длина <> 0 И Объект.Высота <> 0 Тогда
		ИсходныйОбъем = Объект.Ширина * Объект.Длина * Объект.Высота;
		Коэфф = Объект.Объем * 1000000 / ИсходныйОбъем;
		Объект.Ширина = Объект.Ширина * Коэфф;
		Объект.Длина = Объект.Длина * Коэфф;
		Объект.Высота = Объект.Высота * Коэфф;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовОбъемПриИзменении(Элемент)
	ИсходныйОбъем = Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина / 1000000;
	Коэфф = Элементы.ПараметрыГрузов.ТекущиеДанные.Объем / ИсходныйОбъем;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Длина = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Высота = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГородОтправителя()
	Объект.ГородОтправителя = Объект.Отправитель.Город;
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	УстановитьГородОтправителя();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.КонтактноеЛицоПолучателя) И ЗначениеЗаполнено(Объект.ФамилияПолучателя) И ЗначениеЗаполнено(Объект.ИмяПолучателя) и ЗначениеЗаполнено(Объект.ОтчествоПолучателя) И ЗначениеЗаполнено(Объект.ТелефонПолучателя) Тогда
		Если ЗначениеЗаполнено(Объект.Получатель) Тогда
			Об = Справочники.ЛМ_КонтактныеЛица.СоздатьЭлемент();
			Об.Владелец = Объект.Получатель;
			Об.Имя = Объект.ИмяПолучателя;
			Об.Фамилия = Объект.ФамилияПолучателя;
			Об.Отчество = Объект.ОтчествоПолучателя;
			Об.Телефон = Объект.ТелефонПолучателя;
			Об.Записать();
			ТекущийОбъект.КонтактноеЛицоПолучателя = Об.Ссылка;
		ИначеЕсли ЗначениеЗаполнено(Объект.НаименованиеКонтрагента) Тогда
			ОбКонтрагент = Справочники.ЛМ_Контрагенты.СоздатьЭлемент();
			ОбКонтрагент.Город = Объект.ГородПолучателя;
			ОбКонтрагент.Наименование = Объект.НаименованиеКонтрагента;
			ОбКонтрагент.ВидКонтрагента = Справочники.ЛМ_ВидыПлательщиков.НайтиПоРеквизиту("ГУИД","Recipient");
			ОбКонтрагент.Имя = Объект.ИмяПолучателя;
			ОбКонтрагент.Фамилия = Объект.ФамилияПолучателя;
			ОбКонтрагент.Отчество = Объект.ОтчествоПолучателя;
			ОбКонтрагент.Телефон = Объект.ТелефонПолучателя;
			ОбКонтрагент.ЮрФизЛицо = Справочники.ЛМ_ТипыКонтрагентовОтправителей.НайтиПоРеквизиту("ГУИД", "PrivatePerson");
			ОбКонтрагент.Записать();
			ТекущийОбъект.Получатель = ОбКонтрагент.Ссылка;
			ЗапросКонтактногоЛица = Новый Запрос;
			ЗапросКонтактногоЛица.Текст = 
			"ВЫБРАТЬ
			|	ЛМ_КонтактныеЛица.Ссылка
			|ИЗ
			|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
			|ГДЕ
			|	ЛМ_КонтактныеЛица.Владелец = &Владелец";
			ЗапросКонтактногоЛица.УстановитьПараметр("Владелец", ОбКонтрагент.Ссылка);
			Выборка = ЗапросКонтактногоЛица.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущийОбъект.КонтактноеЛицоПолучателя = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеКонтрагентаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Объект.Получатель);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОКОнтактногоЛица()
	Объект.ИмяПолучателя = Объект.КонтактноеЛицоПолучателя.Имя;
	Объект.ФамилияПолучателя = Объект.КонтактноеЛицоПолучателя.Фамилия;
	Объект.ОтчествоПолучателя = Объект.КонтактноеЛицоПолучателя.Отчество;
	Объект.ТелефонПолучателя = Объект.КонтактноеЛицоПолучателя.Телефон;
КонецПроцедуры	

&НаКлиенте
Процедура КонтактноеЛицоПолучателяПриИзменении(Элемент)
	ЗаполнитьФИОКОнтактногоЛица();
КонецПроцедуры

&НаСервере
Процедура ПроставитьТелефонОтправителя()
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицоОтправителя.Телефон) тогда
		Объект.ТелефонОтправителя = Объект.КонтактноеЛицоОтправителя.Телефон;
	Иначе	
		Объект.ТелефонОтправителя = Объект.Отправитель.Телефон;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КонтактноеЛицоОтправителяПриИзменении(Элемент)
	ПроставитьТелефонОтправителя();
КонецПроцедуры

