// #Область СлужебныеПроцедурыИФункции

//
// Различные экспортные методы.
//

// Подготовка таблицы пропущенных вызовов.
// 
Функция ПолучитьПропущенные(ДатаОтсчета, КлиентаНетВБазе, ВключаяПредставление=Истина) Экспорт

	МТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонков.Дата КАК Дата,
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка КАК Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src КАК Src,
		|	МИКО_стЗаписьИсторииЗвонков.Dst КАК Dst,
		|	МИКО_стЗаписьИсторииЗвонков.Src_ID КАК Src_ID,
		|	МИКО_стЗаписьИсторииЗвонков.Направление КАК Направление,
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений КАК НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка КАК Src_Владелец_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Ссылка КАК Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Dst_ID КАК Dst_ID
		|ПОМЕСТИТЬ ДокументыЗаПериод
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.Дата > &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонков.Дата) КАК Дата,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонков.Ссылка) КАК Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src КАК Src,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонков.Src_ID) КАК Src_ID,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МИКО_стЗаписьИсторииЗвонков.Src_Ссылка = НЕОПРЕДЕЛЕНО
		|					И МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК КлиентаНетВБазе,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка) КАК Src_Владелец_Ссылка,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонков.Src_Ссылка) КАК Src_Ссылка
		|ПОМЕСТИТЬ ПропущенныеВызовы
		|ИЗ
		|	ДокументыЗаПериод КАК МИКО_стЗаписьИсторииЗвонков
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.Направление = ЗНАЧЕНИЕ(Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий)
		|	И МИКО_стЗаписьИсторииЗвонков.НетСоединений = ИСТИНА
		|	И МИКО_стЗаписьИсторииЗвонков.Src_ID <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стЗаписьИсторииЗвонков.Src
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыЗаПериод.Дата КАК Дата,
		|	ДокументыЗаПериод.Ссылка КАК Ссылка,
		|	ДокументыЗаПериод.Src КАК Src,
		|	ДокументыЗаПериод.Src_ID КАК Src_ID,
		|	ДокументыЗаПериод.Направление КАК Направление,
		|	ДокументыЗаПериод.НетСоединений КАК НетСоединений,
		|	ДокументыЗаПериод.Src_Владелец_Ссылка КАК Src_Владелец_Ссылка,
		|	ДокументыЗаПериод.Src_Ссылка КАК Src_Ссылка,
		|	ДокументыЗаПериод.Dst_ID КАК Dst_ID
		|ПОМЕСТИТЬ ОтвеченныеВызовы
		|ИЗ
		|	ДокументыЗаПериод КАК ДокументыЗаПериод
		|ГДЕ
		|	ДокументыЗаПериод.НетСоединений = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПропущенныеВызовы.Ссылка) КАК СсылкаНаПропущенный,
		|	МАКСИМУМ(ОтвеченныеВызовы.Ссылка) КАК СсылкаНаОтвеченный,
		|	ПропущенныеВызовы.Src КАК НомерТелефона,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПропущенныеВызовы.Ссылка) КАК КоличествоПропущенных,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтвеченныеВызовы.Ссылка) КАК КоличествоОтвеченных,
		|	МАКСИМУМ(ПропущенныеВызовы.Дата) КАК ДатаПропущенного,
		|	МАКСИМУМ(ПропущенныеВызовы.КлиентаНетВБазе) КАК КлиентаНетВБазе,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПропущенныеВызовы.Src_Владелец_Ссылка = НЕОПРЕДЕЛЕНО
		|				ТОГДА ПропущенныеВызовы.Src_Ссылка
		|			ИНАЧЕ ПропущенныеВызовы.Src_Владелец_Ссылка
		|		КОНЕЦ) КАК Клиент,
		|	МАКСИМУМ(ОтвеченныеВызовы.Дата) КАК ДатаОтвеченного
		|ПОМЕСТИТЬ РезультатНеУпорядоченный
		|ИЗ
		|	ПропущенныеВызовы КАК ПропущенныеВызовы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвеченныеВызовы КАК ОтвеченныеВызовы
		|		ПО (ВЫБОР
		|				КОГДА ПропущенныеВызовы.КлиентаНетВБазе
		|					ТОГДА ПропущенныеВызовы.Src_ID = ОтвеченныеВызовы.Src_ID
		|							ИЛИ ПропущенныеВызовы.Src_ID = ОтвеченныеВызовы.Dst_ID
		|				ИНАЧЕ ПропущенныеВызовы.Src_Ссылка = ОтвеченныеВызовы.Src_Ссылка
		|						ИЛИ ПропущенныеВызовы.Src_Ссылка = ОтвеченныеВызовы.Ссылка.Dst_Ссылка
		|			КОНЕЦ)
		|			И ПропущенныеВызовы.Дата < ОтвеченныеВызовы.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ПропущенныеВызовы.Src
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатНеУпорядоченный.СсылкаНаПропущенный КАК СсылкаНаПропущенный,
		|	РезультатНеУпорядоченный.СсылкаНаОтвеченный КАК СсылкаНаОтвеченный,
		|	РезультатНеУпорядоченный.НомерТелефона КАК НомерТелефона,
		|	РезультатНеУпорядоченный.КоличествоПропущенных КАК КоличествоПропущенных,
		|	РезультатНеУпорядоченный.КоличествоОтвеченных КАК КоличествоОтвеченных,
		|	РезультатНеУпорядоченный.ДатаПропущенного КАК ДатаПропущенного,
		|	РезультатНеУпорядоченный.КлиентаНетВБазе КАК КлиентаНетВБазе,
		|	РезультатНеУпорядоченный.Клиент КАК Клиент,
		|	РезультатНеУпорядоченный.ДатаОтвеченного КАК ДатаОтвеченного,
		|	РезультатНеУпорядоченный.СсылкаНаОтвеченный.Направление КАК НаправлениеОтвеченного,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МИКО_стЗвонкиИзДокументов.Дата ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК Перезвонили
		|ИЗ
		|	РезультатНеУпорядоченный КАК РезультатНеУпорядоченный
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_стЗвонкиИзДокументов КАК МИКО_стЗвонкиИзДокументов
		|		ПО РезультатНеУпорядоченный.СсылкаНаПропущенный = МИКО_стЗвонкиИзДокументов.СсылкаНаДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	РезультатНеУпорядоченный.СсылкаНаПропущенный,
		|	РезультатНеУпорядоченный.СсылкаНаОтвеченный,
		|	РезультатНеУпорядоченный.Клиент,
		|	РезультатНеУпорядоченный.ДатаПропущенного,
		|	РезультатНеУпорядоченный.НомерТелефона,
		|	РезультатНеУпорядоченный.ДатаОтвеченного,
		|	РезультатНеУпорядоченный.КлиентаНетВБазе,
		|	РезультатНеУпорядоченный.КоличествоПропущенных,
		|	РезультатНеУпорядоченный.КоличествоОтвеченных,
		|	РезультатНеУпорядоченный.СсылкаНаОтвеченный.Направление
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПропущенного,
		|	КоличествоОтвеченных,
		|	КоличествоПропущенных УБЫВ,
		|	РезультатНеУпорядоченный.НомерТелефона";
	
	
    Запрос.УстановитьПараметр("Дата"           , ДатаОтсчета);
    Запрос.УстановитьПараметр("КлиентаНетВБазе", КлиентаНетВБазе);
	
	ПропущенныеВызовы = Запрос.Выполнить().Выгрузить();
	
	Если ВключаяПредставление = Истина Тогда
		ПропущенныеВызовы.Колонки.Добавить("ПропущенныйПредставление", Новый ОписаниеТипов("Строка"));
		ПропущенныеВызовы.Колонки.Добавить("ОтвеченныйПредставление",  Новый ОписаниеТипов("Строка"));
		
		Для каждого ТекСтрока Из ПропущенныеВызовы Цикл
			стрВсегоПропущенных = ?(ТекСтрока.КоличествоПропущенных=1, "", ", Всего попыток: " + ТекСтрока.КоличествоПропущенных + ".");
			ТекСтрока.ПропущенныйПредставление = "Пропущен " + Формат(ТекСтрока.ДатаПропущенного,"ДФ='dd MMMM'") + стрВсегоПропущенных;	
			Если ТекСтрока.КоличествоОтвеченных > 0 Тогда
				ТекСтрока.ОтвеченныйПредставление = ""  + ТекСтрока.НаправлениеОтвеченного + " от " + Формат(ТекСтрока.ДатаОтвеченного,"ДФ='dd MMMM'") 
														+ ", Всего: " + ТекСтрока.КоличествоОтвеченных + ".";
			Иначе
				ТекСтрока.ОтвеченныйПредставление = "";										
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	Возврат ПропущенныеВызовы;
	
КонецФункции // ПолучитьПропущенные()
// #КонецОбласти 