#Если Клиент Тогда
	
	Перем НП Экспорт;
	
	Функция СформироватьТекстЗапроса()
		
		Текст	= "ВЫБРАТЬ
		     	  |	РасчетСебестоимостиПродукцици.ПериодРасчета КАК ПериодРасчета,
		     	  |	РасчетСебестоимостиПродукцици.СчетУчета КАК СчетУчета,
		     	  |	РасчетСебестоимостиПродукцици.Подразделение КАК Подразделение,
		     	  |	РасчетСебестоимостиПродукцици.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		     	  |	РасчетСебестоимостиПродукцици.Продукция КАК Продукция,
		     	  |	РасчетСебестоимостиПродукцици.СуммаПлан КАК СуммаПлан,
		     	  |	РасчетСебестоимостиПродукцици.Сумма КАК Сумма,
				  |	РасчетСебестоимостиПродукцици.СуммаНУ КАК СуммаНУ,
		     	  |	РасчетСебестоимостиПродукцици.СуммаНЗП КАК СуммаНЗП,
				  |	РасчетСебестоимостиПродукцици.СуммаНЗПНУ КАК СуммаНЗПНУ
		     	  |ИЗ
		     	  |	РегистрСведений.РасчетСебестоимостиПродукцици КАК РасчетСебестоимостиПродукцици
		     	  |ГДЕ
		     	  |	РасчетСебестоимостиПродукцици.Активность
		     	  |	И (НЕ РасчетСебестоимостиПродукцици.ВидОперации = &УслугиБезПлановыхЦен)
		     	  |	И РасчетСебестоимостиПродукцици.Организация = &Организация
		     	  |	И РасчетСебестоимостиПродукцици.СчетУчета В ИЕРАРХИИ(&СчетУчета)
		     	  |	И РасчетСебестоимостиПродукцици.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
		     	  |ИТОГИ
		     	  |	МАКСИМУМ(СуммаПлан),
		     	  |	СУММА(Сумма),
				  |	СУММА(СуммаНУ),
		     	  |	СУММА(СуммаНЗП),
				  |	СУММА(СуммаНЗПНУ)
		     	  |ПО
		     	  |	ПериодРасчета,
		     	  |	СчетУчета,
		     	  |	Подразделение,
		     	  |	НоменклатурнаяГруппа,
		     	  |	Продукция";		  
		Возврат Текст;
		
	КонецФункции
	
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
	//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
	//
	Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
		НачалоПериода = НачалоДня(ДатаНач);
		КонецПериода  = КонецДня(ДатаКон);
		
		ДокументРезультат.Очистить();
		
		Макет      = ПолучитьМакет("Отчет");
		МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
		
		ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
		
		
		// Когда нужен только заголовок:
		Если ТолькоЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
			ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("УслугиБезПлановыхЦен",  Перечисления.ВидыОперацийРасчетаСебестоимости.УслугиБезИспользованияПлановыхЦен);
		
		ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
		
		Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
			
			ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
			ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто1", "Подразделение");
			ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто2", "НоменклатурнаяГруппа");
			
		КонецЕсли;
		
		Запрос.Текст = СформироватьТекстЗапроса();
		
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "Активность","Активность " + ОграниченияПоПостроителюОтчета);
		
			
		Счета = Новый Массив;
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
        Запрос.УстановитьПараметр("СчетУчета",    Счета);
		
		
	Если ВариантОперации = 2 Тогда
	  Запрос.Текст  = СтрЗаменить(Запрос.Текст, "НЕ РасчетСебестоимостиПродукцици.ВидОперации", "РасчетСебестоимостиПродукцици.ВидОперации");
  КонецЕсли;
  
	Результат = Запрос.Выполнить();
				
		ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаУслуги      = Макет.ПолучитьОбласть("ШапкаУслуги");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаУслуги     = Макет.ПолучитьОбласть("СтрокаУслуги");
		ОбластьПодСтрока        = Макет.ПолучитьОбласть("ПодСтрока");
		ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		ОбластьВсегоУслуги      = Макет.ПолучитьОбласть("ВсегоУслуги");
		ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
		ОбластьОкончаниеТаблицыУслуги = Макет.ПолучитьОбласть("ОкончаниеТаблицыУслуги");
		ОбластьПодвал           = МакетОбщий.ПолучитьОбласть("Подвал");
		
		ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Всего = 0;
		ВсегоПериодБаза = 0;
		Пока ВыборкаПериод.Следующий() Цикл
			
			ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.ПериодРасчета), КонецМесяца(ВыборкаПериод.ПериодРасчета), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
			ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
			ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.ПериодРасчета);
			ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Себестоимость ';uk='Собівартість '") + ?(ВариантОперации = 1, НСтр("ru='выпущенной продукции и ';uk='випущеної продукції й '"), "") + НСтр("ru='оказанных услуг производственного характера, по которым ';uk='зроблених послуг виробничого характеру, по яких '") + ?(ВариантОперации = 2, НСтр("ru='не';uk='не'"), "") + НСтр("ru=' предусмотрены плановые цены (бухгалтерский учет)';uk=' передбачено планові ціни (бухгалтерський облік)'");
			ДокументРезультат.Вывести(ЗаголовокОтчета);
			
			СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
			Если Не ПустаяСтрока(СтрОтбор) Тогда
				ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
				ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '") + СтрОтбор;
				ДокументРезультат.Вывести(ОбластьОтбор);
			КонецЕсли;
			
			// Параметр для показа заголовка
			ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ТекстРасходов       = НСтр("ru='Прямые расходы';uk='Прямі витрати'");
			ОбластьШапка.Параметры.ТекстСебестоимости  = НСтр("ru='Сумма прямых расходов, приходящаяся на выпуск';uk='Сума прямих витрат, що доводиться на випуск'");
			ДокументРезультат.Вывести(?(ВариантОперации = 2, ОбластьШапкаУслуги, ОбластьШапка));
			
			
			ВыборкаСчет = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСчет.Следующий() Цикл
				ВыборкаПодразделение = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПодразделение.Следующий() Цикл
					ВыборкаНомГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНомГруппа.Следующий() Цикл
						ПерваяСтрока = Истина;
						ПоказыватьСтрокуИтого = Истина; 
						Выборка = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						ВсегоБаза = 0;
						ВсегоСумма = 0;
						ВсегоСуммаНУ = 0;
						Пока Выборка.Следующий() Цикл
							ВсегоБаза  = ВсегоБаза + Выборка.СуммаПлан;
							ВсегоСумма = ВсегоСумма + Выборка.СуммаПлан + Выборка.Сумма;
							ВсегоСуммаНУ = ВсегоСуммаНУ + Выборка.СуммаПлан + Выборка.СуммаНУ;
						КонецЦикла;
						Если ВариантОперации = 1 Тогда
							Выборка = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока Выборка.Следующий() Цикл
								
								Если Выборка.Сумма = 0 И Выборка.СуммаНУ = 0 Тогда
									Продолжить;
								КонецЕсли;
								
								Если ПерваяСтрока Тогда
									Область = ОбластьСтрока;
									Область.Параметры.СчетЗатрат           = ВыборкаНомГруппа.СчетУчета;
									Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
									Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
									Область.Параметры.СуммаРасходовБезНЗП  = ВсегоСумма;
									Область.Параметры.СуммаРасходовБезНЗПНУ= ВсегоСуммаНУ;
									Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
									Область.Параметры.СуммаНЗПНУ           = ВыборкаНомГруппа.СуммаНЗПНУ;
									Область.Параметры.СуммаРасходов        = ВсегоСумма + ВыборкаНомГруппа.СуммаНЗП;
									Область.Параметры.СуммаРасходовНУ      = ВсегоСуммаНУ + ВыборкаНомГруппа.СуммаНЗПНУ;
									
								Иначе
									Область =  ОбластьПодСтрока;
								КонецЕсли;
								

								Область.Параметры.Продукция            = УправлениеПроизводством.ВыводНаименованияВыпуска(Выборка.Продукция, Ложь);
								Область.Параметры.Коэффициент          = ?(ВсегоБаза = 0, 0, Выборка.СуммаПлан / ВсегоБаза);
								Область.Параметры.СуммаБазы            = Выборка.СуммаПлан;
								Область.Параметры.СуммаОтклонения      = Выборка.Сумма;
								Область.Параметры.СуммаОтклоненияНУ    = Выборка.СуммаНУ;
								Область.Параметры.Сумма                = Выборка.Сумма + Выборка.СуммаПлан;
								Область.Параметры.СуммаНУ              = Выборка.СуммаНУ + Выборка.СуммаПлан;
								ПоказыватьСтрокуИтого                  = Не (Выборка.СуммаПлан = ВсегоБаза); 
								ВсегоПериодБаза = ВсегоПериодБаза +  Выборка.СуммаПлан;
								ДокументРезультат.Вывести(Область);
								
								ПерваяСтрока = Ложь;
							КонецЦикла;  	
						Иначе
							
							Если Выборка.Сумма = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Область = ОбластьСтрокаУслуги;
							Область.Параметры.СчетЗатрат           = ВыборкаНомГруппа.СчетУчета;
							Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
							Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
							Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан;
							Область.Параметры.СуммаРасходовБезНЗПНУ= ВыборкаНомГруппа.СуммаНУ + ВыборкаНомГруппа.СуммаПлан;
							Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
							Область.Параметры.СуммаНЗПНУ           = ВыборкаНомГруппа.СуммаНЗПНУ;
							Область.Параметры.СуммаРасходов        = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан + ВыборкаНомГруппа.СуммаНЗП;
							Область.Параметры.СуммаРасходовНУ      = ВыборкаНомГруппа.СуммаНУ + ВыборкаНомГруппа.СуммаПлан + ВыборкаНомГруппа.СуммаНЗПНУ;
							ВсегоПериодБаза = ВсегоПериодБаза +  ВыборкаНомГруппа.СуммаПлан;
							ПоказыватьСтрокуИтого                      = Ложь; 
							
							ДокументРезультат.Вывести(Область);
							
							
						КонецЕсли;
						
						
						Если ПоказыватьСтрокуИтого Тогда
							ОбластьИтого.Параметры.Сумма           = ВсегоСумма;
							ОбластьИтого.Параметры.СуммаНУ           = ВсегоСуммаНУ;
							ОбластьИтого.Параметры.СуммаБазы       = ВсегоБаза;
							ОбластьИтого.Параметры.СуммаОтклонения = ВсегоСумма - ВсегоБаза;
							ОбластьИтого.Параметры.СуммаОтклоненияНУ = ВсегоСуммаНУ - ВсегоБаза;
							ДокументРезультат.Вывести(ОбластьИтого);
							
						КонецЕсли;
						
					КонецЦикла;  // НомГруппа
				КонецЦикла;  //  Подразделение
			КонецЦикла;  //  СчетУчета
			
			Область        = ?(ВариантОперации = 1, ОбластьВсего, ОбластьВсегоУслуги);
			
			Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаПериод.Сумма + ВсегоПериодБаза;
			Область.Параметры.СуммаРасходовБезНЗПНУ= ВыборкаПериод.СуммаНУ + ВсегоПериодБаза;
			Область.Параметры.СуммаНЗП             = ВыборкаПериод.СуммаНЗП;
			Область.Параметры.СуммаНЗПНУ           = ВыборкаПериод.СуммаНЗПНУ;
			Область.Параметры.СуммаРасходов        = ВыборкаПериод.Сумма + ВсегоПериодБаза + ВыборкаПериод.СуммаНЗП;
			Область.Параметры.СуммаРасходовНУ      = ВыборкаПериод.СуммаНУ + ВсегоПериодБаза + ВыборкаПериод.СуммаНЗПНУ;
			
			Если ВариантОперации = 1 Тогда
				Область.Параметры.Сумма                = ВыборкаПериод.Сумма + ВсегоПериодБаза;
				Область.Параметры.СуммаНУ              = ВыборкаПериод.СуммаНУ + ВсегоПериодБаза;
				Область.Параметры.СуммаБазы            = ВсегоПериодБаза;
				Область.Параметры.СуммаОтклонения      = Область.Параметры.Сумма - Область.Параметры.СуммаБазы;
				Область.Параметры.СуммаОтклоненияНУ    = Область.Параметры.СуммаНУ - Область.Параметры.СуммаБазы;
			КонецЕсли;
			ДокументРезультат.Вывести(Область);
			ДокументРезультат.Вывести(?(ВариантОперации = 1, ОбластьОкончаниеТаблицы, ОбластьОкончаниеТаблицыУслуги));
			
			ОбластьПодвал.Параметры.ТекстПримечания = "";
			ДокументРезультат.Вывести(ОбластьПодвал);
			
			ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
			
			ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
			
		КонецЦикла;    // Период	
		
		// Зафиксируем заголовок отчета
		ДокументРезультат.ФиксацияСверху = 10;
		
		// Первую колонку не печатаем
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Расчет себестоимости продукции';uk='Розрахунок собівартості продукції'");
		
		УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
		
	КонецПроцедуры // СформироватьОтчет
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
#КонецЕсли
