
Процедура Автозаполнение(ТаблицаЗапроса = Неопределено, Сотрудники = Неопределено, Показатели = Неопределено, ОдинВидРасчета = Ложь, ИзДокумента = Ложь) Экспорт
		
	Организация = Отбор.Организация.Значение;
	
	СписокНедоступныхВозможностейИзменения = Новый Массив;
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка());
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется);
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПарамВозможностьИзменения", СписокНедоступныхВозможностейИзменения);
	Запрос.УстановитьПараметр("ПарамДата", Отбор.ПериодДействия.Значение);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация"+ ?(ЗначениеЗаполнено(Сотрудники),"И Сотрудник В (&Сотрудники)","")+") КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период > &ПарамДата
		|	И РаботникиОрганизаций.Период <= &КонецМесяца
		|	И РаботникиОрганизаций.Организация = &Организация
		
		|"+?(ЗначениеЗаполнено(Сотрудники),"И РаботникиОрганизаций.Сотрудник В (&Сотрудники)","")+"	
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|"; 
		
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|		&Организация КАК Организация,
		|		Сотрудники.Подразделение КАК Подразделение,
		|		&ПарамДата КАК ПериодДействия,
		|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|		ВложенныйЗапрос.Показатель КАК Показатель,
		|		СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|		ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация  И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5,
		|			Показатели.Показатель
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &Организация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 6)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		
		|) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.Сотрудник,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	Сотрудник,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		
		
		Если ЗначениеЗаполнено(ТаблицаЗапроса) Тогда
			
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник
			|	ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ &ТаблицаЗапроса КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Сотрудник";
			
			Запрос.Выполнить();
			
			ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
			
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	&Организация КАК Организация,
			               |	ИтоговаяТаблица.Подразделение КАК Подразделение,
			               |	ИтоговаяТаблица.Сотрудник КАК Сотрудник,
			               |	ИтоговаяТаблица.Показатель КАК Показатель,
			               |	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			               |	ИтоговаяТаблица.Валюта КАК Валюта,
			               |	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВложеннаяТаблица.Показатель КАК Показатель,
			               |		ВложеннаяТаблица.Подразделение КАК Подразделение,
			               |		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			               |		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			               |		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			               |		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			               |	ИЗ
			               |		(ВЫБРАТЬ
			               |			Факт.Показатель КАК Показатель,
			               |			Факт.Подразделение КАК Подразделение,
			               |			Факт.Сотрудник КАК Сотрудник,
			               |			Факт.ПериодДействия КАК ПериодДействия,
			               |			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			               |			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			               |			NULL КАК ПлановоеЗначение
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Подразделение,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			               |				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
			               |				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
			               |			ИЗ
			               |				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			               |			ГДЕ
			               |				ЗначенияПоказателейСхемМотивации.Организация = &Организация
			               |				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			               |				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ЗначенияПоказателейСхемМотивации.Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ЗначенияПоказателейСхемМотивации.Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия
			               |			
			               |			ОБЪЕДИНИТЬ ВСЕ
			               |			
			               |			ВЫБРАТЬ
			               |				ТаблицаЗапроса.Показатель,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				&ПарамДата,
			               |				NULL,
			               |				СУММА(0)
			               |			ИЗ
			               |				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
			               |					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			               |					ПО (Сотрудники.Сотрудник = ТаблицаЗапроса.Сотрудник)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ТаблицаЗапроса.Показатель) КАК Факт
			               |		
			               |		СГРУППИРОВАТЬ ПО
			               |			Факт.Показатель,
			               |			Факт.Подразделение,
			               |			Факт.Сотрудник,
			               |			Факт.ПериодДействия
			               |		
			               |		ОБЪЕДИНИТЬ
			               |		
			               |		ВЫБРАТЬ
			               |			ПЛАН.Показатель,
			               |			ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |					ТОГДА ПЛАН.Сотрудник
			               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |			КОНЕЦ,
			               |			ПЛАН.ПериодДействия,
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			               |					ТОГДА NULL
			               |				ИНАЧЕ ПЛАН.Валюта
			               |			КОНЕЦ,
			               |			NULL,
			               |			ЕСТЬNULL(ПЛАН.Значение, 0)
			               |		ИЗ
			               |			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			               |	
			               |	СГРУППИРОВАТЬ ПО
			               |		ВложеннаяТаблица.Показатель,
			               |		ВложеннаяТаблица.Подразделение,
			               |		ВложеннаяТаблица.Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
						   |
						   |ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ИтоговаяТаблица.Подразделение,
			               |	ИтоговаяТаблица.Сотрудник,
			               |	ИтоговаяТаблица.Показатель,
			               |	ИтоговаяТаблица.ПериодДействия,
			               |	ИтоговаяТаблица.Валюта
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Подразделение,
			               |	ИтоговаяТаблица.Сотрудник.Наименование,
			               |	Показатель";
			
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Показатели.Организация КАК Организация,
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Организация КАК Организация,
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		ПлановыеПоказатели.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&Организация,
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = &Организация
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Подразделение,
			|	Показатели.Валюта,
			|	Показатели.Организация,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
		КонецЕсли;
	Иначе
		
		
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Работники.ФизЛицо КАК ФизЛицо,
		|	Работники.Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&ПарамДата, ) КАК Работники
		|ГДЕ
		|	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|ГДЕ
		|	Работники.Период > &ПарамДата
		|	И Работники.Период <= &КонецМесяца
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период > Работники.Период)
		|ГДЕ
		|	ПериодыПерекрытия.Период ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		
		Запрос.Текст = СотрудникиТекст;
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сотрудники.Подразделение КАК Подразделение,
		|	&ПарамДата КАК ПериодДействия,
		|	ВложенныйЗапрос.Сотрудник.ФизЛицо КАК ФизЛицо,
		|	ВложенныйЗапрос.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник КАК Сотрудник,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|				И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|				И ((НЕ Показатели.Показатель.Предопределенный))
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата,Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И Сотрудник.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		
		|			) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.ФизЛицо = ВложенныйЗапрос.Сотрудник.ФизЛицо
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.Сотрудник.ФизЛицо,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	ФизЛицо,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		
		
		
		Если ИзДокумента Тогда
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник
			|	ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ &ТаблицаЗапроса КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Сотрудник";
			
			Запрос.Выполнить();
			
			ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
			
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИтоговаяТаблица.Подразделение КАК Подразделение,
			               |	Сотрудники.Сотрудник КАК Сотрудник,
			               |	ИтоговаяТаблица.Показатель КАК Показатель,
			               |	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			               |	ИтоговаяТаблица.Валюта КАК Валюта,
			               |	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВложеннаяТаблица.Показатель КАК Показатель,
			               |		ВложеннаяТаблица.Подразделение КАК Подразделение,
			               |		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			               |		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			               |		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			               |		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			               |	ИЗ
			               |		(ВЫБРАТЬ
			               |			Факт.Показатель КАК Показатель,
			               |			Факт.Подразделение КАК Подразделение,
			               |			Факт.Сотрудник.Физлицо КАК Сотрудник,
			               |			Факт.ПериодДействия КАК ПериодДействия,
			               |			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			               |			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			               |			NULL КАК ПлановоеЗначение
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
			               |						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
			               |				КОНЕЦ КАК Подразделение,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			               |				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
			               |				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
			               |			ИЗ
			               |				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			               |			ГДЕ
			               |				ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			               |				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			               |				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ЗначенияПоказателейСхемМотивации.Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
			               |						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
			               |				КОНЕЦ,
			               |				ЗначенияПоказателейСхемМотивации.Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ
			               |			
			               |			ОБЪЕДИНИТЬ ВСЕ
			               |			
			               |			ВЫБРАТЬ
			               |				ТаблицаЗапроса.Показатель,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				&ПарамДата,
			               |				NULL,
			               |				СУММА(0)
			               |			ИЗ
			               |				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
			               |					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			               |					ПО (Сотрудники.ФизЛицо = ТаблицаЗапроса.Сотрудник.ФизЛицо)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ТаблицаЗапроса.Показатель) КАК Факт
			               |		
			               |		СГРУППИРОВАТЬ ПО
			               |			Факт.Показатель,
			               |			Факт.Подразделение,
			               |			Факт.Сотрудник,
			               |			Факт.ПериодДействия,
			               |			Факт.Сотрудник.Физлицо
			               |		
			               |		ОБЪЕДИНИТЬ
			               |		
			               |		ВЫБРАТЬ
			               |			ПЛАН.Показатель,
			               |			ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |					ТОГДА ПЛАН.ФизЛицо
			               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |			КОНЕЦ,
			               |			ПЛАН.ПериодДействия,
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			               |					ТОГДА NULL
			               |				ИНАЧЕ ПЛАН.Валюта
			               |			КОНЕЦ,
			               |			NULL,
			               |			ЕСТЬNULL(ПЛАН.Значение, 0)
			               |		ИЗ
			               |			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			               |	
			               |	СГРУППИРОВАТЬ ПО
			               |		ВложеннаяТаблица.Подразделение,
			               |		ВложеннаяТаблица.Сотрудник,
			               |		ВложеннаяТаблица.Показатель,
			               |		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			СписокСотрудников.Сотрудник КАК Сотрудник,
			               |			СписокСотрудников.Физлицо КАК Физлицо
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |				1 КАК Приоритет
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |			ГДЕ
			               |				РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			               |				РаботникиСовместительство.Сотрудник.Физлицо,
			               |				2
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |			ГДЕ
			               |				РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиСовместительство.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(СотрудникиДУ.Ссылка),
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ
			               |			ИЗ
			               |				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ) КАК СписокСотрудников
			               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |					СписокФизическихЛиц.Физлицо КАК Физлицо,
			               |					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			               |				ИЗ
			               |					(ВЫБРАТЬ
			               |						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |						1 КАК Приоритет
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |					ГДЕ
			               |						РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						РаботникиСовместительство.Сотрудник.Физлицо,
			               |						2
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |					ГДЕ
			               |						РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						СотрудникиДУ.Физлицо,
			               |						ВЫБОР
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |								ТОГДА 3
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |								ТОГДА 4
			               |							ИНАЧЕ 5
			               |						КОНЕЦ
			               |					ИЗ
			               |						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			               |				
			               |				СГРУППИРОВАТЬ ПО
			               |					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			               |				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			               |					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			               |		ПО ИтоговаяТаблица.Сотрудник = Сотрудники.Физлицо
						   |
						   |ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ИтоговаяТаблица.Подразделение,
			               |	Сотрудники.Сотрудник,
			               |	ИтоговаяТаблица.Показатель,
			               |	ИтоговаяТаблица.ПериодДействия,
			               |	ИтоговаяТаблица.Валюта
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Подразделение,
			               |	Сотрудники.Сотрудник.Наименование,
			               |	Показатель";
			
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		Сотрудники.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				СписокСотрудников.Сотрудник КАК Сотрудник,
			|				СписокСотрудников.Физлицо КАК Физлицо
			|			ИЗ
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|					1 КАК Приоритет
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|				ГДЕ
			|					РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|					РаботникиСовместительство.Сотрудник.Физлицо,
			|					2
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|				ГДЕ
			|					РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиСовместительство.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(СотрудникиДУ.Ссылка),
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ
			|				ИЗ
			|					Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ) КАК СписокСотрудников
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|						СписокФизическихЛиц.Физлицо КАК Физлицо,
			|						МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|					ИЗ
			|						(ВЫБРАТЬ
			|							РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|							1 КАК Приоритет
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|						ГДЕ
			|							РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							РаботникиСовместительство.Сотрудник.Физлицо,
			|							2
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|						ГДЕ
			|							РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							СотрудникиДУ.Физлицо,
			|							ВЫБОР
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|									ТОГДА 3
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|									ТОГДА 4
			|								ИНАЧЕ 5
			|							КОНЕЦ
			|						ИЗ
			|							Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|					
			|					СГРУППИРОВАТЬ ПО
			|						СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|					ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|						И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			|			ПО ПлановыеПоказатели.Физлицо = Сотрудники.Физлицо
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Подразделение,
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Валюта,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение

