// #Область СлужебныеПроцедурыИФункции
//****************************************************************************//
// ПОДСИСТЕМА ТЕЛЕФОНИИ
// МОДУЛЬ ОБЩЕГО НАЗНАЧЕНИЯ
//****************************************************************************//

////////////////////////////////////////////////////////////////////////////////
// ВЗАИМОДЕЙСТВИЕ С ПОЛЬЗОВАТЕЛЕМ


////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ

// Создает новый критерий для поиска данных в таблицах по условию
//
Функция НовыйКритерий(ЛевоеЗначение = Неопределено, ВидСравнения, ПравоеЗначение = Неопределено) Экспорт
	
	Возврат Новый Структура("ЛевоеЗначение,ВидСравнения,ПравоеЗначение", ЛевоеЗначение, ВидСравнения, ПравоеЗначение);
	
КонецФункции // НовыйКритерий()

// Создает и инициализирует массиив значений
//
Функция НовыйМассив(Элемент1, Элемент2 = Неопределено, Элемент3 = Неопределено, Элемент4 = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Элемент1);
	Если Элемент2 <> Неопределено Тогда
		Результат.Добавить(Элемент2);
	КонецЕсли;
	Если Элемент3 <> Неопределено Тогда
		Результат.Добавить(Элемент3);
	КонецЕсли;
	Если Элемент4 <> Неопределено Тогда
		Результат.Добавить(Элемент4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НовыйМассив()

Функция СвойствоДокументаИдентификаторЗвонка() Экспорт
	
	Возврат "ID_Звонок";
	
КонецФункции // СвойствоДокументаИдентификаторЗвонка()

Функция ПустаяТаблицаПоОбъектуМетаданных(ПолноеИмяОбъекта) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.*
		|ИЗ
		|	&ПолноеИмяОбъекта КАК Таблица";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатТаблица = РезультатЗапроса.Выгрузить().СкопироватьКолонки();
	
	Возврат РезультатТаблица;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		Реквизиты = РазложитьСтрокуВМассивПодстрок(Реквизиты, ",", Истина);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие - где ключ - ссылка на объект, а Значение - структура, которая 
//		   		содержит список свойств, как список имен в строке
//				ИменаРеквизитов, со значениям реквизитов, прочитанными из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на объект, Значение - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// РАБОТА С НАБОРАМИ ДАННЫХ

// Ищет строку в таблице значений по заданному критерию.
//
//	@ КритерийСравнения - объект созданный функцией НовыйКритерий()
//
Функция НайтиСтрокуВТаблицеПоУсловию(Таблица, КритерийСравнения) Экспорт
	
	УсловиеОтбора = НовыйКритерий(, КритерийСравнения.ВидСравнения);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
			
		УсловиеОтбора.ЛевоеЗначение = ЗначениеКритерия(СтрокаТаблицы, КритерийСравнения.ЛевоеЗначение);
		УсловиеОтбора.ПравоеЗначение = ЗначениеКритерия(СтрокаТаблицы, КритерийСравнения.ПравоеЗначение);
		
		Если КритерийУсловияВерен(УсловиеОтбора) Тогда
			Возврат СтрокаТаблицы;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // НайтиСтрокуВТаблицеПоУсловию()

// Возращает строку таблицы, где содержиться максимумальное значение
// в указаной колонке.
//
Функция НайтиСтрокуСМаксимальнымЗначениеВТаблице(Таблица, Колонка) Экспорт
	
	Если Таблица.Количество() > 0 Тогда
		
		Результат = Таблица[0];
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Если СтрокаТаблицы[Колонка] > Результат[Колонка] Тогда
				Результат = СтрокаТаблицы;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НайтиСтрокуСМаксимальнымЗначениеВТаблице()

// Возращает строку таблицы, где содержиться минимальным значение
// в указаной колонке.
//
Функция НайтиСтрокуСМинимальнымЗначениеВТаблице(Таблица, Колонка) Экспорт
	
	Если Таблица.Количество() > 0 Тогда
		
		Результат = Таблица[0];
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Если СтрокаТаблицы[Колонка] < Результат[Колонка] Тогда
				Результат = СтрокаТаблицы;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НайтиСтрокуСМинимальнымЗначениеВТаблице()

// Копирует содержание колонки таблицы в массив
//
Функция ВыгрузитьКолонкуВМассив(Таблица, Колонка) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Результат.Добавить(СтрокаТаблицы[Колонка]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВыгрузитьКолонкуВМассив()

// Заполняет колонку таблицы указанным значением аналогично методу "ЗаполнитьЗначения"
// для объекта типа "ТаблицаЗначений". Подходит для заполнения любых иных наборов
// данных табличного вида.
//
Процедура ЗаполнитьКолонкуТаблицы(Таблица, Колонка, ЗначениеЗаполнения) Экспорт
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы[Колонка] = ЗначениеЗаполнения;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКолонкуТаблицы()

// Копирует элементы одной коллекции в другую. Допускаются коллекции типа:
// СпикокЗначений, ТаблицаЗначений.
// 
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияПриемник, КоллекцияИсточник) Экспорт
	
	Для Каждого Элемент Из КоллекцияИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКоллекциюСвойств()

// Устанавливает значение свойства структуры, предварительно проверив его наличие
//
Процедура УстановитьСвойство(Объект, Свойство, Значение) Экспорт
	
	Если Объект.Свойство(Свойство) Тогда
		Объект[Свойство] = Значение;
	КонецЕсли;
	
КонецПроцедуры // УстановитьСвойство()

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  МассивИсточник - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив;
Функция СвернутьМассив(МассивИсточник) Экспорт
	
	Результат = Новый Массив;
	УникальныеЗначения = Новый Соответствие;
	
	Для каждого Значение Из МассивИсточник Цикл
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла;
	
	Для каждого Значение Из УникальныеЗначения Цикл
		Результат.Добавить(Значение.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ОставитьУникальныеЗначения()

// Удаляет все пустые значение из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить пустые значения.
// 
// Возвращаемое значение:
//  Массив;
Функция УдалитьПустыеЗначенияИзМассива(Массив) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Массив Цикл
		Если ЗначениеЗаполнено(Элемент) Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополняет таблицу значений-приемник данными из таблицы значений-источник.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения,
//	ТолькоУникальныеЗначения - булево, необязательный, если истина, 
//		то в массив будут включены только те значения, которых в нем еще нет, причем единожды.
// 
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает копию значения типа Массив.
//
// Параметры:
//  МассивИсточник - Массив - массив, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(Элемент);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

// Создает копию значения типа Структура.
//
// Параметры:
//  СтруктураИсточник - Структура - копируемая структура.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Получает строку, содержащую ключи структуры, разделенные символом разделителя.
//
// Параметры:
//	Структура - Структура - Структура, ключи которой преобразуются в строку.
//	Разделитель - Строка - Разделитель, который вставляется в строку между ключами структуры.
//
// Возвращаемое значение:
//	Строка - Строка, содержащая ключи структуры разделенные разделителем.
//
Функция КлючиСтруктурыВСтроку(Структура, Разделитель = ",") Экспорт
	
	Результат = "";
	
	Для Каждого Элемент Из Структура Цикл
		
		СимволРазделителя = ?(ПустаяСтрока(Результат), "", Разделитель);
		
		Результат = Результат + СимволРазделителя + Элемент.Ключ;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// КОПИРОВАНИЕ ДАННЫХ

// (СКД) Копирует элементы параметров отбора настроек компоновки данных
//
Процедура КопироватьОтборНастройкиКомпоновкиДанных(ОтборПриемник, ОтборИсточник) Экспорт
	
	Для Каждого элОтбора Из ОтборИсточник.Элементы Цикл
		
		Если ТипЗнч(элОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			НовыйОтбор = ОтборПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			КопироватьОтборНастройкиКомпоновкиДанных(НовыйОтбор, элОтбора);
			
		Иначе
			
			НовыйОтбор = ОтборПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, элОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // КопироватьОтборНастройкиКомпоновкиДанных


////////////////////////////////////////////////////////////////////////////////
// СТРОКОВЫЕ ФУНКЦИИ

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
//
// Примечание:
//  В случаях, когда число используемых параметров в строке совпадает с числом переданных для подстановки параметров,
//  рекомендуется использовать функцию платформы СтрШаблон.
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	
	Возврат СтрокаПодстановки;
КонецФункции

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     Е если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые
//  строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

///  Объединяет строки из массива в строку с разделителями.
//
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
//
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Объединяет строки из колонки таблицы в строку с разделителями.
//
Функция СтрокаИзЗначенийКолонкиТаблицы(Таблица, Колонка, Разделитель = ",") Экспорт
	
	Результат = "";
	
	Для Индекс = 0 По Таблица.Количество() - 1 Цикл
		Подстрока = Таблица[Индекс][Колонка];
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтрокаИзЗначенийКолонкиТаблицы()

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Склоняет переданную строку ФИО.
&НаСервере
Функция ПроскланятьФИО(Знач ФИО,Падеж=1,ТолькоИнициалы=Ложь, Знач пРазделитель=".") Экспорт

	Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
		Возврат ФИО;
	КонецЕсли;
	
	// уберем множественные пробелы
	Пока 1=1 Цикл
		ФИО=СокрЛП(СтрЗаменить(ФИО," "," "));
		Если Найти(ФИО," ")=0 Тогда Прервать КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Падеж)=Тип("Строка") Тогда
		пад=СокрЛП(НРег(Лев(Падеж,1))); 
		Если Найти("ирдвтп",пад)=0 Тогда
			Возврат ФИО; 
		КонецЕсли;
	ИначеЕсли ТипЗнч(Падеж)=Тип("Число") Тогда
		Если (Падеж<1) или (Падеж>6) Тогда
			Возврат ФИО;
		КонецЕсли; 
		пад=Падеж-1;
	КонецЕсли;
	
	ФИО=СокрЛП(НРег(ФИО)); // Так удобнее.
	
	// Свой анализатор состава
	Фамилия="";
	Для перем_й=1 По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,перем_й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Фамилия=Фамилия+символс;
	КонецЦикла;
	перем_ы=перем_й+1; // Перешли пробел
	Имя="";
	Для перем_й=перем_ы По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,перем_й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Имя=Имя+символс;
	КонецЦикла;
	перем_ы=перем_й+1; // Перешли второй перем_й пробел.
	Отчество="";
	Для перем_й=перем_ы По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,перем_й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Отчество=Отчество+символс;
	КонецЦикла;
	
	// Теперь имеем раздельно Фамилию, Имя и Отчество.
	// Начинается собственно блок анализа содержания и падежей.
	
	// Вернем, если сам именительный. Если установлен возврат ТолькоИнициалы, то преобразуем в инициалы.
	Если (Лев(Падеж,1)="И") или (Падеж=1) Тогда 
		Если НЕ ТолькоИнициалы или Найти(ФИО, ".") Тогда 
			Возврат ФИО; // Либо уже преобразованная строка, либо не нужно преобразовывать.
		КонецЕсли;
		НовоеФИО = ТРег(Фамилия) + " " + Врег(Лев(Имя,1)) + пРазделитель + Врег(Лев(Отчество,1)) + пРазделитель;
		Возврат СокрЛП(НовоеФИО); // На тот случай, если разделитель пробел. Последний срежем.
	КонецЕсли;
	
	
	// Проанализируем пол М/Ж.
	Если Прав(Отчество,1)="а" Тогда Пол="Ж" Иначе Пол="М" КонецЕсли;
	
	// Создадим структуру таблицы, хранящей окончания слов.
	ток=Новый ТаблицаЗначений;
	ТипСтроки=Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(3));
	ТипЧисла=Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
	ток.Колонки.Добавить("СтарОк",ТипСтроки); // Старое окончание 2 символа.
	// Колонки, хранящие новые окончания слов.
	ток.Колонки.Добавить("р"); // родительный
	ток.Колонки.Добавить("д"); // дательный
	ток.Колонки.Добавить("в"); // винительный
	ток.Колонки.Добавить("т"); // творительный
	ток.Колонки.Добавить("п"); // предложный
	// Для указания, сколько букв с конца слова отсечь,
	ток.Колонки.Добавить("КолвоСрез",ТипЧисла); // Кол-во срезаемых букв.
	
	Гласные="аеэоуиыяюьъ"; // Список гласных букв в виде строки.
	
	// ======== обработаем фамилию ==========
	// Заполним таблицу данными для фамилии.
	
	Если пол="М" Тогда
		строток=ток.Добавить(); // иванов
		строток.СтарОк="*s";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
		строток.КолвоСрез=0;
		
		строток=ток.Добавить(); // красинский
		строток.СтарОк="*й"; 
		строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="им"; строток.п="ом";
		строток.КолвоСрез=2; 
		
		строток=ток.Добавить(); // всемогущий
		строток.СтарОк="щий"; 
		строток.р="его"; строток.д="ему"; строток.в="его"; строток.т="им"; строток.п="ем";
		строток.КолвоСрез=2; 
		
		строток=ток.Добавить(); // белый
		строток.СтарОк="ый";
		строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="ым"; строток.п="ом";
		строток.КолвоСрез=2;
		
		строток=ток.Добавить(); // палей
		строток.СтарОк="*й";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=1;
		
		строток=ток.Добавить(); // рабинович
		строток.СтарОк="*ч";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=0;
		
		строток=ток.Добавить(); // починок, зализняк
		строток.СтарОк="*к";
		строток.р="ка"; строток.д="ку"; строток.в="ка"; строток.т="ком"; строток.п="ке";
		строток.КолвоСрез=2;
		
		строток=ток.Добавить(); // шинкарь
		строток.СтарОк="*ь";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=1;
		
		строток=ток.Добавить(); // перельман, оганесян
		строток.СтарОк="*н";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
		строток.КолвоСрез=0;
		
		строток=ток.Добавить(); // баранкин
		строток.СтарОк="ин";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
		строток.КолвоСрез=0;
		
	ИначеЕсли Пол="Ж" Тогда 
		строток=ток.Добавить(); // склодовская
		строток.СтарОк="ая";
		строток.р="ой"; строток.д="ой"; строток.в="ую"; строток.т="ой"; строток.п="ой";
		строток.КолвоСрез=2;
		
		строток=ток.Добавить(); // иванова
		строток.СтарОк="*а"; 
		строток.р="ой"; строток.д="ой"; строток.в="у"; строток.т="ой"; строток.п="ой";
		строток.КолвоСрез=1;
	КонецЕсли;
	
	// таблица заполнена. считаем 2 последних буквы и поищем их
	Если не ПустаяСтрока(Фамилия) Тогда
		пб=Прав(Фамилия,3); кол="СтарОк"; // ищем по ней
		новФамилия=Фамилия; // если ничего не изменится, так и будет
		стро=ток.Найти(пб,кол);
		Если стро<>Неопределено Тогда // нашли строгое сразу
			Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
			новФамилия=Основа+СокрЛП(стро[пад]);
		Иначе
			// Строго не нашли по трем последним символам, ищем по двум символам только по последней.
			пб=Прав(Фамилия,2);
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда
				Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
				новФамилия=Основа+СокрЛП(стро[пад]);
			Иначе // Если по двум не нашли, ищем по одному.
				пб="*"+Прав(пб,1); 
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // Нашли по последней.
					Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
					новФамилия=Основа+СокрЛП(стро[пад]);
				Иначе // По последней не нашли, ищем по виду буквы.
					пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
					стро=ток.Найти(пб,кол);
					Если стро<>Неопределено Тогда // Нашли по виду.
						Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
						новФамилия=Основа+СокрЛП(стро[пад]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		новФамилия="";
	КонецЕсли;
	
	// ======== обработаем имя ==========
	// Заполним таблицу данными для имени.
	ток.Очистить();
	
	Если Пол="М" Тогда
		// Обработаем исключения.
		Если Имя="лев" Тогда Имя="льв" КонецЕсли;
		Если Имя="павел" Тогда Имя="павл" КонецЕсли;
		
		строток=ток.Добавить(); // сергей
		строток.старок="*й";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // иван + лев + павел
		строток.старок="*s";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
		строток.колвосрез=0;
		
		строток=ток.Добавить(); // никита
		строток.старок="*а";
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // лука
		строток.старок="ка";
		строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // иеремия
		строток.старок="ия";
		строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // илья
		строток.старок="*я";
		строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // игорь
		строток.старок="*ь";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.колвосрез=1;
		
	ИначеЕсли Пол="Ж" Тогда
		// Обработаем исключения.
		
		строток=ток.Добавить(); // ирина
		строток.старок="*а";
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // инга, ольга
		строток.старок="га";
		строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // эсфирь
		строток.старок="*ь";
		строток.р="и"; строток.д="и"; строток.в="ь"; строток.т="ью"; строток.п="и";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // мария
		строток.старок="ия";
		строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
		строток.колвосрез=1;
		
		строток=ток.Добавить(); // софья
		строток.старок="*я";
		строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
		строток.колвосрез=1;
	КонецЕсли;
	
	// Таблица заполнена. считаем 2 последних буквы и поищем их.
	Если не ПустаяСтрока(Имя) Тогда
		пб=Прав(Имя,2); кол="СтарОк"; // Ищем по ней.
		новИмя=Имя; // Если ничего не изменится, так и будет.
		стро=ток.Найти(пб,кол);
		Если стро<>Неопределено Тогда // Нашли строгое сразу.
			Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
			новИмя=Основа+СокрЛП(стро[пад]);
		Иначе // Строго не нашли, ищем только по последней.
			пб="*"+Прав(пб,1); 
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // Нашли по последней.
				Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
				новИмя=Основа+СокрЛП(стро[пад]);
			Иначе // По последней не нашли, ищем по виду буквы.
				пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено=1 Тогда // Нашли по виду.
					Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
					новИмя=Основа+СокрЛП(стро[пад]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		новИмя="";
	КонецЕсли;
	
	// ======== Обработаем отчество, тут проще ==========.
	ток.Очистить();
	
	Если Пол="М" Тогда
		строток=ток.Добавить();
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
		строток.колвосрез=0;
	ИначеЕсли Пол="Ж" Тогда
		строток=ток.Добавить();
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
	КонецЕсли;
	Если не ПустаяСтрока(Отчество) Тогда
		Основа=Лев(Отчество,СтрДлина(Отчество)-ток[0].КолвоСрез); 
		новОтчество=Основа+СокрЛП(ток[0][пад]);
	Иначе
		новОтчество="";
	КонецЕсли; 
	
	Если ТолькоИнициалы Тогда
		новИмя=Лев(новИмя,1); новОтчество=Лев(новОтчество,1);
	КонецЕсли;
	
	// Установим первые буквы верхним регистром.
	новФамилия=ВРег(Лев(новФамилия,1))+Сред(новФамилия,2);
	новИмя=ВРег(Лев(новИмя,1))+Сред(новИмя,2);
	новОтчество=ВРег(Лев(новОтчество,1))+Сред(новОтчество,2);
	
	// И теперь всё вместе.
	Если ТолькоИнициалы Тогда // Если задан формат инициалов.
		новФИО=новФамилия+" "+новИмя+пРазделитель+новОтчество+пРазделитель;
	Иначе
		новФИО=новФамилия+" "+новИмя+" "+новОтчество;
	КонецЕсли;
	
	Если Найти(ФИО, ".") Тогда // На тот случай, если входной параметр Фамилию с инициалами. Инициалы не трогаем.
		новФИО = новФамилия + " " + ТРег(Имя) + Трег(Отчество);
	КонецЕсли; 
	
	Возврат СокрЛП(новФИО);

КонецФункции // ПроскланятьФИО()

// Проверяет верно ли написано ФИО.
// ФИО может быть написано либо только на кириллице, либо только на латинице.
// Также можно указать, что ФИО может быть верным только в кириллице.
//
// Параметры:
//		СтрокаПараметр - строка - ФИО.
//		ДопустимаТолькоКириллица - если Истина, то ФИО проверяется на кириллицу, латиница в этом случае считается ошибкой.
//									Ложь - ФИО считается верным, если оно написано либо на латинице, либо на кириллице.
//
// Возвращаемое значение:
//		Истина - ФИО написано верно, иначе Ложь.
//
Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ТолькоКириллица = Ложь) Экспорт
	
	ДопустимыеСимволы = "-";
	
	Возврат (НЕ ТолькоКириллица И ТолькоЛатиницаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы)) Или
			ТолькоКириллицаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы);
	
КонецФункции

// Проверяет, содержит ли строка только символы кириллического алфавита.
//
// Параметры:
//  УчитыватьРазделителиСлов - Булево - учитывать ли разделители слов или они являются исключением.
//  ДопустимыеСимволы - строка для проверки.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только кириллические (или допустимые) символы или пустая;
//           Ложь, если строка содержит иные символы.
//
Функция ТолькоКириллицаВСтроке(Знач СтрокаПроверки, Знач УчитыватьРазделителиСлов = Истина, ДопустимыеСимволы = "") Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	КодыДопустимыхСимволов.Добавить(1025); // "Ё"
	
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	КонецЦикла;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если ((КодСимвола < 1040) Или (КодСимвола > 1103)) 
			И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) 
			И Не (Не УчитыватьРазделителиСлов И ЭтоРазделительСлов(КодСимвола)) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Проверяет, содержит ли строка только символы латинского алфавита.
//
// Параметры:
//  УчитыватьРазделителиСлов - Булево - учитывать ли разделители слов или они являются исключением.
//  ДопустимыеСимволы - строка для проверки.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только латинские (или допустимые) символы;
//         - Ложь, если строка содержит иные символы.
//
Функция ТолькоЛатиницаВСтроке(Знач СтрокаПроверки, Знач УчитыватьРазделителиСлов = Истина, ДопустимыеСимволы = "") Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	КонецЦикла;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122))
			И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) 
			И Не (Не УчитыватьРазделителиСлов И ЭтоРазделительСлов(КодСимвола)) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ПРЕОБРАЗОВАНИЯ ЧИСЕЛ И ДАТ

Функция ПреобразоватьЧислоВоВремя(ЧислоСекунд) Экспорт
	
	Минуты = Цел(ЧислоСекунд / 60);
	Часы = Цел(Минуты / 60);
	Секунды = ЧислоСекунд - Минуты * 60;
	
	Результат = "";
	Если Часы > 0 Тогда
		Возврат Результат = Строка(Часы) + ":";
	КонецЕсли;
		
	Возврат Результат + Формат(Минуты, "ЧЦ=2; ЧН=; ЧВН=") + ":" + Формат(Секунды, "ЧЦ=2; ЧН=; ЧВН=");
	
КонецФункции // ПреобразоватьЧислоВоВремя()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА XML

// Создает новый объект ЧтениеXML и инициализирует переданным xml кодом
//
Функция НовыйЧтениеXML(СтрокаХМЛ) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.УстановитьСтроку(СтрокаХМЛ);
		Если ЧтениеХМЛ.Прочитать() Тогда
			Результат = ЧтениеХМЛ;
		КонецЕсли;
	Исключение
		// Невозможно разобрать данные XML
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // НовыйЧтениеXML()

// Разбирает XML-текст в соответсвие атрибут - значение, без использования
// объекта ЧтениеXML. Подходит для использования на веб-клиенте.
//
Функция мвРазложитьXMLПоАтрибутам(Данные) Экспорт
	
	Результат = Новый Соответствие;
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Данные, " ");
	
	Для Индекс = 0 По МассивПодстрок.Количество() - 1 Цикл
		
		СтрокаДляРазбора	= СокрЛП(МассивПодстрок[Индекс]);
		ПозицияРазделителя	= Найти(СтрокаДляРазбора, "=");
		
		Если ПозицияРазделителя > 0 Тогда
			Атрибут	= Лев(СтрокаДляРазбора, ПозицияРазделителя - 1);
			Значение= Прав(СтрокаДляРазбора, СтрДлина(СтрокаДляРазбора) - ПозицияРазделителя - 1);
			Значение= Лев(Значение, СтрДлина(Значение) - 1);
			
			Результат.Вставить(Атрибут, Значение);
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // РазложитьXMLПоАтрибутам()


////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

Функция КритерийУсловияВерен(КритерийСравнения)
	
	Если КритерийСравнения.ВидСравнения = ВидСравнения.Равно Тогда
		Возврат КритерийСравнения.ЛевоеЗначение = КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.НеРавно Тогда
		Возврат КритерийСравнения.ЛевоеЗначение <> КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.Меньше Тогда
		Возврат КритерийСравнения.ЛевоеЗначение < КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.Больше Тогда
		Возврат КритерийСравнения.ЛевоеЗначение > КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.МеньшеИлиРавно Тогда
		Возврат КритерийСравнения.ЛевоеЗначение <= КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.БольшеИлиРавно Тогда
		Возврат КритерийСравнения.ЛевоеЗначение >= КритерийСравнения.ПравоеЗначение;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.Содержит Тогда
		Возврат Найти(КритерийСравнения.ЛевоеЗначение, КритерийСравнения.ПравоеЗначение) > 0;
	ИначеЕсли КритерийСравнения.ВидСравнения = ВидСравнения.ВСписке Тогда
		Если ТипЗнч(КритерийСравнения.ПравоеЗначение) = Тип("Массив") Тогда
			Возврат КритерийСравнения.ПравоеЗначение.Найти(КритерийСравнения.ЛевоеЗначение) <> Неопределено;
		Иначе
			Возврат КритерийСравнения.ПравоеЗначение.НайтиПоЗначению(КритерийСравнения.ЛевоеЗначение) <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение "Критерий сравнения """ + КритерийСравнения.ВидСравнения + """ не поддерживается";
	
КонецФункции // КритерийУсловияВерен()

Функция ЗначениеКритерия(СтркокаТаблицы, КолонкаЗначение)
	
	Если Лев(КолонкаЗначение, 1) = "[" И Прав(КолонкаЗначение, 1) = "]" Тогда
		// Это колонка таблицы
		ИмяКолонки = Сред(КолонкаЗначение, 2, СтрДлина(КолонкаЗначение) - 2);
		Возврат СтркокаТаблицы[ИмяКолонки];
	КонецЕсли;
	
	// Это фиксированное значение
	Возврат КолонкаЗначение;
	
КонецФункции // ЗначениеКритерия()

// Функция склоняет переданную фразу.
// Только для работы на ОС Windows.
//
// Параметры:
//  ФИО   - Строка - фамилия, имя и отчество в именительном падеже, 
//                   которые необходимо просклонять.
//  Падеж - Число  - падеж, в который необходимо поставить ФИО:
//                   1 - Именительный
//                   2 - Родительный
//                   3 - Дательный
//                   4 - Винительный
//                   5 - Творительный
//                   6 - Предложный
//  Результат - Строка - в этот параметр помещается результат склонения.
//                       Если ФИО не удалось просклонять, то возвращается значение ФИО.
//  Пол       - Число - пол физического лица, 1 - мужской, 2 - женский.
//
// Возвращаемое значение:
//   Булево - Истина, если ФИО удалось просклонять.
//
Функция Просклонять(Знач ФИО, Падеж, Результат, Пол = Неопределено) Экспорт
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.МИКО_мвКомпонентаСклоненияФИО", "Decl");
	Компонента = Новый("AddIn.Decl.CNameDecl");
	
	Результат = "";
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	
	// Выделим первые 3 слова, так как компонента не умеет склонять фразу большую 3х символов.
	НомерНесклоняемогоСимвола = 4;
	Для Номер = 1 По Мин(МассивСтрок.Количество(), 3) Цикл
		Если Не ФИОНаписаноВерно(МассивСтрок[Номер-1], Истина) Тогда
			НомерНесклоняемогоСимвола = Номер;
			Прервать;
		КонецЕсли;

		Результат = Результат + ?(Номер > 1, " ", "") + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = ФИО;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если Пол = Неопределено Тогда
			Результат = Компонента.Просклонять(Результат, Падеж) + " ";
			
		Иначе
			Результат = Компонента.Просклонять(Результат, Падеж, Пол) + " ";
			
		КонецЕсли;
		
	Исключение
		Результат = ФИО;
		Возврат Ложь;
		
	КонецПопытки;
	
	// Остальные символы добавим без склонения.
	Для Номер = НомерНесклоняемогоСимвола По МассивСтрок.Количество() Цикл
		Результат = Результат + " " + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции
		
// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей.
//
// Возвращаемое значение:
//  Булево - истина, если символ является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат Найти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
		
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025)); 	// символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105)); 	// символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 		// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
// #КонецОбласти