
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент = Параметры.Контрагент;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
			Объект.Наименование = Контрагент.Наименование;
		КонецЕсли;	
	КонецЕсли; 
	//ЭлементОтбора = КонтактныеЛица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	//ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование = Истина;
	//
	//ЭлементОтбора = Адреса.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	//ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование = Истина;
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	
	ЭлементОтбора = Неопределено;
	Для каждого ТекОтбор из КонтактныеЛица.Отбор.Элементы Цикл
		Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") тогда
			Если ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") Тогда
				ЭлементОтбора = ТекОтбор;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = КонтактныеЛица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
	Иначе	
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;
	
	ЭлементОтбора = Неопределено;
	Для каждого ТекОтбор из Адреса.Отбор.Элементы Цикл
		Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") тогда
			Если ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") Тогда
				ЭлементОтбора = ТекОтбор;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Адреса.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
	Иначе	
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;
	
	
	
КонецПроцедуры	

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НЗ = РегистрыСведений.ЛМ_КонтрагентыДоставки.СоздатьНаборЗаписей();
		НЗ.Отбор.Контрагент.Установить(Контрагент);
		З = НЗ.Добавить();
		З.Контрагент = Контрагент;
		З.КонтрагентДоставки = ТекущийОбъект.Ссылка;
		НЗ.Записать();
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры


//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//	УстановитьОтборы();
//КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Объект.Фамилия);
	Если СокрЛП(Объект.Имя) <> "" Тогда
		Объект.Наименование = Объект.Наименование + " " +СокрЛП(Объект.Имя);  
	КонецЕсли;	
	
	Если СокрЛП(Объект.Отчество) <> "" Тогда
		Объект.Наименование = Объект.Наименование + " " +СокрЛП(Объект.Отчество);  
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры


&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

