// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрочитатьПериод()

	Если РезультатВыбора.Вариант = ВариантСтандартногоПериода.Вчера Тогда
		ТипПериода      = 1;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.Завтра Тогда
		ТипПериода      = 1;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.Месяц Тогда
		ТипПериода      = 3;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.Последние7Дней Тогда
		ТипПериода      = 2;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ПрошлаяНеделя Тогда
		ТипПериода      = 2;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ПрошлыйГод Тогда
		ТипПериода      = 4;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц Тогда
		ТипПериода      = 3;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.Сегодня Тогда
		ТипПериода      = 1;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.СледующаяНеделя Тогда
		ТипПериода      = 2;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.СледующийГод Тогда
		ТипПериода      = 4;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.СледующийМесяц Тогда
		ТипПериода      = 3;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоГода Тогда
		ТипПериода      = 4;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ЭтаНеделя Тогда
		ТипПериода      = 1;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ЭтотГод Тогда
		ТипПериода      = 4;
	ИначеЕсли РезультатВыбора.Вариант = ВариантСтандартногоПериода.ЭтотМесяц Тогда
		ТипПериода      = 3;
	Иначе
		ТипПериода      = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницу()

	Если ТипПериода = 1 Тогда
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаСтраницаДень;
	ИначеЕсли ТипПериода = 2 Тогда
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаСтраницаНеделя;
	ИначеЕсли ТипПериода = 3 Тогда
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаСтраницаМесяц;
	ИначеЕсли ТипПериода = 4 Тогда
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаСтраницаГод;
	ИначеЕсли ТипПериода = 0 Тогда
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаСтраницаПроизвольно;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Сегодня(Команда)
	
	РезультатВыбора.Вариант = ВариантСтандартногоПериода[Команда.Имя];
	Если ОповеститьОВыборе Тогда
		ОповеститьОВыборе(РезультатВыбора);
	Иначе
		Закрыть(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПериодаПриИзменении(Элемент)
	
	ПереключитьСтраницу();
	
КонецПроцедуры


&НаКлиенте
Процедура Ок(Команда)
	
	Если ОповеститьОВыборе Тогда
		ОповеститьОВыборе(РезультатВыбора);
	Иначе
		Закрыть(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗакрыватьПриЗакрытииВладельца = Истина;
	ОповеститьОВыборе = Параметры.ОповеститьОВыборе;
	
	//ЗаполнитьЗначенияСвойств(РезультатВыбора, Параметры.Период);
	РезультатВыбора = Параметры.Период;
	Если НЕ ЗначениеЗаполнено(РезультатВыбора.ДатаНачала) И НЕ ЗначениеЗаполнено(РезультатВыбора.ДатаОкончания) Тогда
		РезультатВыбора = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьПериод();
	ПереключитьСтраницу();
	
КонецПроцедуры

// #КонецОбласти