// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("UID", 			UID);
	Параметры.Свойство("OutLine", 		OutLine);
	Параметры.Свойство("OutLine", 		Наименование);
	Параметры.Свойство("Направление", 	Направление);
	
	IDЛиний = НайтиIDЛинийСервер(UID);
	Если Направление <> Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий Тогда
	 	IDЛиний.ИД_Линий.DID.Очистить();
	КонецЕсли; 
	
	Если ТипЗнч(IDЛиний) = Тип("Структура") Тогда
		
		ДанныеУчетныхЗаписей = ПолучитьУчетныеЗаписиАТС();
		Для каждого текДанные Из ДанныеУчетныхЗаписей Цикл
			Если ЗначениеЗаполнено(текДанные.Значение.did)
				 И Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий 
				 И IDЛиний.ИД_Линий.DID.Найти(текДанные.Значение.did)<>Неопределено Тогда
				OutLine = текДанные.Значение.OutLine;
				Продолжить;
			КонецЕсли; 	
			Если ЗначениеЗаполнено(текДанные.Значение.accountcode)
				 И IDЛиний.ИД_Линий.ACCOUNTCODE.Найти(текДанные.Значение.accountcode)<>Неопределено Тогда
				OutLine = текДанные.Значение.OutLine;		
				Продолжить;
			КонецЕсли; 	
			Если ЗначениеЗаполнено(текДанные.Значение.Идентификатор)
				 И IDЛиний.ИД_Линий.ID.Найти(текДанные.Значение.Идентификатор)<>Неопределено Тогда
				OutLine = текДанные.Значение.OutLine;		
				Продолжить;
			КонецЕсли;
		КонецЦикла; 
		
		Если НЕ ЗначениеЗаполнено(OutLine) Тогда
			// Заполним по умолчанию.
			Если Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий И IDЛиний.ИД_Линий.DID.Количество()>0 Тогда
				did = IDЛиний.ИД_Линий.DID[0];
			КонецЕсли; 
			Если IDЛиний.ИД_Линий.ACCOUNTCODE.Количество()>0 Тогда
				accountcode = IDЛиний.ИД_Линий.ACCOUNTCODE[0];
			КонецЕсли; 
			Если IDЛиний.ИД_Линий.ID.Количество()>0 Тогда
				Идентификатор = IDЛиний.ИД_Линий.ID[0];
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтаФорма, OutLine);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Получаем учетные записи. Возвращаем список значений.
//
Функция ПолучитьУчетныеЗаписиАТС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стУчетныеЗаписиАТС.Ссылка КАК Наименование,
		|	МИКО_стУчетныеЗаписиАТС.Ссылка КАК OutLine,
		|	МИКО_стУчетныеЗаписиАТС.Идентификатор,
		|	МИКО_стУчетныеЗаписиАТС.did,
		|	МИКО_стУчетныеЗаписиАТС.accountcode
		|ИЗ
		|	Справочник.МИКО_стУчетныеЗаписиАТС КАК МИКО_стУчетныеЗаписиАТС
		|ГДЕ
		|	МИКО_стУчетныеЗаписиАТС.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.Выполнить();
	массивСсылок = Результат.Выгрузить();
	врРезультат = Новый СписокЗначений;
	
	Для каждого текДанные Из массивСсылок Цикл
		врДанныеЗаполнения = Новый Структура("accountcode,did,Идентификатор,Наименование,OutLine","","","","",Неопределено);	
		ЗаполнитьЗначенияСвойств(врДанныеЗаполнения, текДанные);
		врРезультат.Добавить(врДанныеЗаполнения, текДанные.Наименование);
	КонецЦикла; 

	Возврат врРезультат;
	
КонецФункции // ПолучитьУчетныеЗаписиАТС()

&НаСервереБезКонтекста
// Получение идентификаторов линий 
// 
Функция НайтиIDЛинийСервер(Номер)

	врРезультат = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.НайтиИдентификаторыЛиний(Номер);  
	Возврат врРезультат;
	
КонецФункции // НайтиIDЛинийСервер()

&НаКлиенте
// Обработка выбора линии к редактированию.
// 
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Если ВыбранноеЗначение = Неопределено И НЕ ЗначениеЗаполнено(OutLine) Тогда
		врДанныеЗаполнения = Новый Структура("accountcode,did,Идентификатор","","","");	
		ЗаполнитьЗначенияСвойств(ЭтаФорма, врДанныеЗаполнения);
	ИначеЕсли ВыбранноеЗначение <> Неопределено Тогда 	
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВыбранноеЗначение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьУчетныеЗаписиАТС();
	
КонецПроцедуры
&НаКлиенте
// Выбор идентификатора линии.
// 
Процедура accountcodeНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(IDЛиний) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
	    ДанныеВыбора.ЗагрузитьЗначения(IDЛиний.ИД_Линий.ACCOUNTCODE);
	КонецЕсли; 
КонецПроцедуры
&НаКлиенте
// Выбор идентификатора линии.
// 
Процедура didНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(IDЛиний) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
	    ДанныеВыбора.ЗагрузитьЗначения(IDЛиний.ИД_Линий.DID);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Выбор идентификатора линии.
// 
Процедура ИдентификаторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(IDЛиний) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
	    ДанныеВыбора.ЗагрузитьЗначения(IDЛиний.ИД_Линий.ID);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено наименование линии!");
		Возврат;
	КонецЕсли; 
	
	ЗаписатьДанныеСервер();
	Оповестить("PT1C_NewOutLine", OutLine, ЭтаФорма);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере 
Процедура ЗаписатьДанныеСервер()

	Если ЗначениеЗаполнено(OutLine) Тогда
		врОбъект = OutLine.ПолучитьОбъект();	
	Иначе	
	    врОбъект = Справочники.МИКО_стУчетныеЗаписиАТС.СоздатьЭлемент();
	КонецЕсли; 

	ЗаполнитьЗначенияСвойств(врОбъект, ЭтаФорма);
	врОбъект.Записать();
	OutLine = врОбъект.Ссылка;
	
КонецПроцедуры

// #КонецОбласти