
// Формируется список счетов учета номенклатуры, стоимость которой
// необходимо корректировать.
Функция СписокСчетовУчетаНоменклатуры(Учет, Организация = Неопределено, Период = Неопределено) Экспорт
	
	ИмяПланаСчетов = "Хозрасчетный";
	
	СписокСчетов= Новый СписокЗначений;
	//СписокСчетов.Добавить(ПланыСчетов[ИмяПланаСчетов].ОборудованиеКУстановке);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОсновныхСредств);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеПолуфабрикатыИКомплектующиеИзделия);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Топливо);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТараИТарныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СтроительныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ЗапасныеЧасти);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыСельскохозяйственногоНазначения);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ДругиеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.Товары);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счет)";
	Счета = Запрос.Выполнить().Выгрузить();
	Для Каждого Счет Из Счета Цикл
		Если (НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.Товары) И
			(НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВТорговле) И
			(НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ) Тогда
					
			СписокСчетов.Добавить(Счет.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПродукцияСельскохозяйственногоПроизводства);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
	
	Возврат СписокСчетов;
	
КонецФункции // МассивСчетовУчетаНоменклатуры()

// В СтруктураДопПараметров добавляются СписокСчетов - список счетов учета номенклатуры, 
// стоимость которой необходимо корректировать 
// и СписокИсключаемыхСчетов - список счетов, которые не корректируются 
Процедура УстановитьСписокСчетовУчетаНоменклатуры(СтруктураДопПараметров)
	
	ИмяПланаСчетов = "Хозрасчетный";
	
	СписокСчетов = Новый СписокЗначений;
	//СписокСчетов.Добавить(ПланыСчетов[ИмяПланаСчетов].ОборудованиеКУстановке);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОсновныхСредств);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеПолуфабрикатыИКомплектующиеИзделия);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Топливо);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТараИТарныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СтроительныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ЗапасныеЧасти);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыСельскохозяйственногоНазначения);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ДругиеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Товары);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
	
	СписокИсключаемыхСчетов = Новый СписокЗначений;
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы);
	СписокИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходы);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокСчетов)
	|	И НЕ Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокИсключаемыхСчетов)
	|";
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов); 
	Запрос.УстановитьПараметр("СписокИсключаемыхСчетов", СписокИсключаемыхСчетов);
	
	Счета = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Массив;
	
	Для Каждого Счет Из Счета Цикл
		Результат.Добавить(Счет.Ссылка);
	КонецЦикла;	
	
	СтруктураДопПараметров.Вставить("СписокСчетов", Результат);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокИсключаемыхСчетов)
	|";
	
	Запрос.УстановитьПараметр("СписокИсключаемыхСчетов", СписокИсключаемыхСчетов);
	
	Счета = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Массив;
	
	Для Каждого Счет Из Счета Цикл
		Результат.Добавить(Счет.Ссылка);
	КонецЦикла;	
	
	СтруктураДопПараметров.Вставить("СписокИсключаемыхСчетов", Результат);
	
КонецПроцедуры // УстановитьСписокСчетовУчетаНоменклатуры()

// В СтруктураДопПараметров добавляются СписокСчетовПоставщиков - список счетов поставщиков, а также 
// счета и субконто учета доходов и расходов при возврате поставщику
Процедура УстановитьСписокСчетовПоставщиков(СтруктураДопПараметров)
	
	ИмяПланаСчетов = "Хозрасчетный";
	
	СписокСчетов = Новый СписокЗначений;
	
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокСчетов)
	|";
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов); 
	
	Счета = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Массив;
	
	Для Каждого Счет Из Счета Цикл
		Результат.Добавить(Счет.Ссылка);
	КонецЦикла;	
	
	СтруктураДопПараметров.Вставить("СписокСчетовПоставщиков", Результат);
	
	СчетаДоходовПриВозвратеПоставщику  = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(СтруктураДопПараметров.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДоходовВозвратПоставщику);
    СчетаРасходовПриВозвратеПоставщику = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(СтруктураДопПараметров.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратВозвратПоставщику);
	
	СтруктураДопПараметров.Вставить("СчетаДоходовПриВозвратеПоставщику",  СчетаДоходовПриВозвратеПоставщику);
	СтруктураДопПараметров.Вставить("СчетаРасходовПриВозвратеПоставщику", СчетаРасходовПриВозвратеПоставщику);
	
КонецПроцедуры // УстановитьСписокСчетовПоставщиков()

// Формируется список счетов на которых ведутся расчеты с контрагентами.
Функция ПолучитьСчетаРасчетов()

	СписокСчетов= Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторами);
		
	Возврат СписокСчетов;

КонецФункции // ПолучитьСчетаРасчетов()

Процедура ОцифроватьСостояния( Таб, СоотвПараметровСостояний1,ПрефиксПараметровНовогоСостояния)  

	Если Таб.Количество()= 0 Тогда
		Возврат;
	КонецЕсли;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Массив = Новый Массив;
	Массив.Добавить(Тип("NULL"));
	ОписаниеТиповС = Новый ОписаниеТипов(Таб.Колонки[2].ТипЗначения.Типы(), , ,);
	//Для того чтобы поместить таблицу значений во временную таблицу, необходимо чтобы у всех
	//колонок был тип, если его нет то необходимо установить путем создания новой ТЗ
	КолКолонок = Таб.Колонки.Количество();
	Для инд = 1 по КолКолонок Цикл
		ОбратныйИндекс = КолКолонок - инд; 
		Если Таб.Колонки[ОбратныйИндекс].ТипЗначения.типы().количество()=0 Тогда
			ИмяКолонки = Таб.Колонки[ОбратныйИндекс].Имя;
			Таб.Колонки.Добавить("_"+ИмяКолонки,ОписаниеТиповС,"_"+ИмяКолонки);
			Таб.Колонки.Удалить(ИмяКолонки);
			Таб.Колонки["_"+ИмяКолонки].имя=ИмяКолонки;
			Таб.Колонки[ИмяКолонки].заголовок=ИмяКолонки;
		КонецЕсли;
	КонецЦикла;
			
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Счет, 
		|	ВнешнийИсточник.Счет" + ПрефиксПараметровНовогоСостояния + ",
		|	ВнешнийИсточник.НалоговоеНазначение,
		|	ВнешнийИсточник.Субконто1, 
		|	ВнешнийИсточник.Субконто2, 
		|	ВнешнийИсточник.Субконто3,
		|	ВнешнийИсточник.Субконто4,
		|	ВнешнийИсточник.Субконто1" + ПрефиксПараметровНовогоСостояния + ",
		|	ВнешнийИсточник.Субконто2" + ПрефиксПараметровНовогоСостояния + ",
		|	ВнешнийИсточник.Субконто3" + ПрефиксПараметровНовогоСостояния + ",
		|	ВнешнийИсточник.Субконто4" + ПрефиксПараметровНовогоСостояния + ",
		|	ВнешнийИсточник.Количество, 
		|	ВнешнийИсточник.Стоимость,
		|	ВнешнийИсточник.СтоимостьНУ
		|ПОМЕСТИТЬ ИсхТаб 
		|Из &ВнешнийИсточник КАК ВнешнийИсточник";
	Запрос.УстановитьПараметр("ВнешнийИсточник", Таб );
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсхТаб.Счет КАК Счет,
		|	ИсхТаб.НалоговоеНазначение КАК НалоговоеНазначение,
		|	ИсхТаб.Субконто1 КАК Субконто1,
		|	ИсхТаб.Субконто2 КАК Субконто2,
		|	ИсхТаб.Субконто3 КАК Субконто3,
		|	ИсхТаб.Субконто4 КАК Субконто4
		|ИЗ
		|	ИсхТаб КАК ИсхТаб
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорИсхТаб.Счет" + ПрефиксПараметровНовогоСостояния + ",
		|	КорИсхТаб.НалоговоеНазначение,
		|	КорИсхТаб.Субконто1" + ПрефиксПараметровНовогоСостояния + ",
		|	КорИсхТаб.Субконто2" + ПрефиксПараметровНовогоСостояния + ",
		|	КорИсхТаб.Субконто3" + ПрефиксПараметровНовогоСостояния + ",
		|	КорИсхТаб.Субконто4" + ПрефиксПараметровНовогоСостояния + "
		|ИЗ
		|	ИсхТаб КАК КорИсхТаб" ;
		
	ТаблицаСоответствийСостояний = Запрос.Выполнить().Выгрузить();
		
	ТаблицаСоответствийСостояний.Колонки.Добавить("ИндексСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0));
	ТекИндекс = 0;
	Для каждого СтрокаСоответствия Из ТаблицаСоответствийСостояний Цикл
	
		СтрокаСоответствия.ИндексСтроки = ТекИндекс;
		
	// Переносим в соответствие
		СтрСост = Новый Структура;
		СтрСост.Вставить("Счет", СтрокаСоответствия.Счет);
		СтрСост.Вставить("НалоговоеНазначение", СтрокаСоответствия.НалоговоеНазначение);
		СтрСост.Вставить("Субконто1", СтрокаСоответствия.Субконто1);
		СтрСост.Вставить("Субконто2", СтрокаСоответствия.Субконто2);
		СтрСост.Вставить("Субконто3", СтрокаСоответствия.Субконто3);
		СтрСост.Вставить("Субконто4", СтрокаСоответствия.Субконто4);
		СоотвПараметровСостояний1.Вставить(ТекИндекс, СтрСост);
		
		ТекИндекс = ТекИндекс + 1;

	КонецЦикла; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ *  
		|ПОМЕСТИТЬ ТаблицаСоответствийИсточник 
		|Из &ВнешнийИсточник КАК ВнешнийИсточник";
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаСоответствийСостояний );
	Запрос.Выполнить();

	Запрос.Текст = 
		"ВЫБРАТЬ *  
		|ПОМЕСТИТЬ ТаблицаСоответствийПриемник 
		|Из ТаблицаСоответствийИсточник";
	Запрос.Выполнить();

	// "Свернем" встречные перемещения: вместо двух перемещений типа 1->2 и 2->1 оставим одно 
	// с количеством |Кол12 - Кол21| в направлении большего перемещения.
	
	// Проведем следующее преобразование: повернем пары так, чтобы количество перемещения стало положительным

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсхТаб.Счет, 
		|	ИсхТаб.Счет" + ПрефиксПараметровНовогоСостояния + ",
		|	ИсхТаб.НалоговоеНазначение,
		|	ИсхТаб.Субконто1, 
		|	ИсхТаб.Субконто2, 
		|	ИсхТаб.Субконто3,
		|	ИсхТаб.Субконто4,
		|	ИсхТаб.Субконто1" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб.Субконто2" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб.Субконто3" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб.Субконто4" + ПрефиксПараметровНовогоСостояния + ", 
		|	ВЫБОР КОГДА ИсхТаб.Количество<0 Тогда -ИсхТаб.Количество Иначе ИсхТаб.Количество Конец КАК Количество,
		|	ВЫБОР КОГДА ИсхТаб.Количество<0 Тогда -ИсхТаб.Стоимость Иначе ИсхТаб.Стоимость Конец КАК Стоимость,
		|	ВЫБОР КОГДА ИсхТаб.Количество<0 Тогда -ИсхТаб.СтоимостьНУ Иначе ИсхТаб.СтоимостьНУ Конец КАК СтоимостьНУ,
		|	ВЫБОР КОГДА ИсхТаб.Количество<0 Тогда ТаблицаСоответствийПриемник.ИндексСтроки Иначе ТаблицаСоответствийИсточник.ИндексСтроки Конец КАК Источник,
		|	ВЫБОР КОГДА ИсхТаб.Количество<0 Тогда ТаблицаСоответствийИсточник.ИндексСтроки Иначе ТаблицаСоответствийПриемник.ИндексСтроки Конец КАК Приемник
		|ПОМЕСТИТЬ КопияИсхТаб
		|ИЗ ИсхТаб КАК ИсхТаб
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСоответствийИсточник
		|	ПО 
		|		ИсхТаб.Счет = ТаблицаСоответствийИсточник.Счет И
		|		ИсхТаб.НалоговоеНазначение = ТаблицаСоответствийИсточник.НалоговоеНазначение И
		|		ИсхТаб.Субконто1 = ТаблицаСоответствийИсточник.Субконто1 И
		|		ИсхТаб.Субконто2 = ТаблицаСоответствийИсточник.Субконто2 И
		|		ИсхТаб.Субконто3 = ТаблицаСоответствийИсточник.Субконто3 И
		|		ИсхТаб.Субконто4 = ТаблицаСоответствийИсточник.Субконто4
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСоответствийПриемник
		|	ПО 
		|		ИсхТаб.Счет" + ПрефиксПараметровНовогоСостояния + " = ТаблицаСоответствийПриемник.Счет И
		|		ИсхТаб.НалоговоеНазначение = ТаблицаСоответствийПриемник.НалоговоеНазначение И
		|		ИсхТаб.Субконто1" + ПрефиксПараметровНовогоСостояния + " = ТаблицаСоответствийПриемник.Субконто1 И
		|		ИсхТаб.Субконто2" + ПрефиксПараметровНовогоСостояния + " = ТаблицаСоответствийПриемник.Субконто2 И
		|		ИсхТаб.Субконто3" + ПрефиксПараметровНовогоСостояния + " = ТаблицаСоответствийПриемник.Субконто3 И
		|		ИсхТаб.Субконто4" + ПрефиксПараметровНовогоСостояния + " = ТаблицаСоответствийПриемник.Субконто4
		|";
	Запрос.Выполнить();
		
	// "Свертка" встречных перемещений и удалим обнулившиеся строки
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсхТаб1.Счет, 
		|	ИсхТаб1.Счет" + ПрефиксПараметровНовогоСостояния + ",
		|	ИсхТаб1.НалоговоеНазначение,
		|	ИсхТаб1.Субконто1, 
		|	ИсхТаб1.Субконто2, 
		|	ИсхТаб1.Субконто3,
		|	ИсхТаб1.Субконто4,
		|	ИсхТаб1.Субконто1" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб1.Субконто2" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб1.Субконто3" + ПрефиксПараметровНовогоСостояния + ", 
		|	ИсхТаб1.Субконто4" + ПрефиксПараметровНовогоСостояния + ", 
		|	Выбор Когда ИсхТаб1.Количество>ЕСТЬNULL(ИсхТаб2.Количество, 0) Тогда ИсхТаб1.Количество-ЕСТЬNULL(ИсхТаб2.Количество, 0) Иначе 0 Конец КАК Количество,
		|	Выбор Когда ИсхТаб1.Количество>ЕСТЬNULL(ИсхТаб2.Количество, 0) Тогда ИсхТаб1.Стоимость-ЕСТЬNULL(ИсхТаб2.Стоимость, 0) Иначе 0 Конец КАК Стоимость,
		|	Выбор Когда ИсхТаб1.Количество>ЕСТЬNULL(ИсхТаб2.Количество, 0) Тогда ИсхТаб1.СтоимостьНУ-ЕСТЬNULL(ИсхТаб2.СтоимостьНУ, 0) Иначе 0 Конец КАК СтоимостьНУ,
		|	ИсхТаб1.Источник КАК Источник,
		|	ИсхТаб1.Приемник КАК Приемник
		|
		|ИЗ КопияИсхТаб КАК ИсхТаб1
		|ЛЕВОЕ СОЕДИНЕНИЕ КопияИсхТаб КАК ИсхТаб2
		|	ПО 
		|		ИсхТаб1.Источник = ИсхТаб2.Приемник И
		|		ИсхТаб1.Приемник = ИсхТаб2.Источник 
		|ГДЕ (Выбор Когда ИсхТаб1.Количество>ЕСТЬNULL(ИсхТаб2.Количество, 0) Тогда ИсхТаб1.Количество-ЕСТЬNULL(ИсхТаб2.Количество, 0) Иначе 0 Конец)<>0
		|";
	
	Таб = Запрос.Выполнить().Выгрузить();
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// СписаниеПоСредней
//
// Параметры:
//	ТаблицаТоваров - содержит товары, списание которых необходимо усреднить. 
//	Каждая колонка соответствует одному из постоянных параметров товара, не изменяемых в ходе перемещений. 
//	По остальным параметрам выполняется усреднение
//
Процедура РассчитатьСписаниеПоСреднейБух(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	
	// Основное допущение данного метода - игнорирование замкнутой цепочки перемещений между состояниями ("холостого хода"):
	// считаем, что если товар в ходе перемещений снова попал в исходное состояние, то он как бы не перемещался, 
	// это движение можно исключить из общего оборота, а стоимость движения принять равной 0. Цепочки перемещений 
	// таким образом размыкаются, что позволяет рассчитать стоимости движений, начиная от конца цепочки.
	
	// Получим все состояния для товара, которые он принимал за период в виде таблицы
	//	---------------------------------------------------------------------------------------------------------------------------------
	// |Состояние 1 (Источник) |Состояние 2 (Приемник)| Перемещаемое количество| Стоимость (нужна для упрощения последующей корректировки)
	
	// Последовательно обходя состояния, выделим контуры (пути, начала и концы которых совпадают)
	// В каждом контуре найдем количество, которое совершило перемещение по замкнутому кругу ("холостой ход"), 
	// и уменьшим каждое движение из контура на данное количество.
	// Будем выбирать другие состояния для получения всех контуров и применим к ним то же правило.
	
	// После нахождения контуров в графах перемещений и сокращения "холостого хода" получаем совокупность разомкнутых 
	// путей перехода товара между состояниями (остовные деревья). Внутри каждой такой цепочки выполняем расчет.
	// Важно:  в общем случае результат сокращения зависит от последовательности обхода контуров, поэтому
	// для повторяемости результата она должна подчиняться какому-либо правилу (например, чтобы сводные перемещения
	// упорядочивались по возрастанию даты первого перемещения)
	
	// Получим таблицу перемещений, содержащую суммарные перемещения между состояниями
	
	// Получаемая таблица должна содержать колонку "Количество", "Стоимость" и колонки, описывающие старое и новое состояние,
	// причем имена колонок нового состояния заканчиваются на ПрефиксПараметровНовогоСостояния
	ПрефиксПараметровНовогоСостояния="_НовоеСостояние";
	
	Таб = ПолучитьТаблицуПеремещенийБух(ТаблицаТоваров, ДатаНач, ДатаКон, ПрефиксПараметровНовогоСостояния, СтруктураДопПараметров);
	
	СоотвПараметровСостояний = Новый Соответствие;  
	ОцифроватьСостояния(Таб, СоотвПараметровСостояний,ПрефиксПараметровНовогоСостояния);
	
	// Получили таблицу перемещений в требуемом формате
	ТаблицаПеремещений = Таб;	
	
	// Таблица перемещений содержит несколько несвязанных частей, относящихся к отдельным партиям - строкам таблицы ТаблицаТоваров
	
	// Обработка перемещений: разрыв контуров
	// Получим наборы смежных вершин для каждой вершины
	// Соотв СмежныеВершины Вершина, СмежныеВершины
	
	Источники = Новый Соответствие;
	Приемники = Новый Соответствие;
	МассивНачалДеревьев = Новый Массив;
	
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		ПараметрыИсточника = Источники[Строка.Источник];
		Если ПараметрыИсточника = Неопределено Тогда
			СмежныеВершины= Новый Соответствие;
			ПараметрыИсточника = Новый Структура("Пройден, СмежныеВершины", Ложь, СмежныеВершины);
		КонецЕсли;
		
		ПараметрыИсточника.СмежныеВершины.Вставить(Строка.Приемник, ТаблицаПеремещений.Индекс(Строка)); // во вложенной структуре храним смежную вершину и номер строки перемещения
		
		Источники.Вставить(Строка.Источник, ПараметрыИсточника);
		
	КонецЦикла;
	
	// Чтобы рассчитать перемещения, заменим каждый связный граф перемещений его остовным дерево
	// Для этого обойдем их все, найдем и разорвем все контуры по предложенному выше правилу.
	Для Каждого Элемент Из Источники Цикл
		Если НЕ Элемент.Значение.Пройден Тогда // если от вершины еще не строился контур, обрабатываем
			//ПройденныеВершины = Новый Соответствие;
			//НомерВершины = Элемент.Ключ;
			//ПройденныеВершины.Вставить(НомерВершины, -1);
			ПройденныеВершины = Новый ТаблицаЗначений;
			ПройденныеВершины.Колонки.Добавить("Ключ");
			ПройденныеВершины.Колонки.Добавить("Значение");
			ПройденныеВершины.Индексы.Добавить("Ключ");
			
			НоваяСтрока = ПройденныеВершины.Добавить();
			НоваяСтрока.Ключ = Элемент.Ключ;
			НоваяСтрока.Значение = -1;
			
			НомерВершины = Элемент.Ключ;
			
			РазорватьКонтурыБух(НомерВершины, Источники, ПройденныеВершины, ТаблицаПеремещений);
		КонецЕсли;
	КонецЦикла;
	
	// После этого таблица содержит незамкнутую последовательность перемещений. 
	// Стоимость перемещений с количеством = 0 в таблице тоже должна быть приведена к 0.
	
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		Если Строка.Количество=0 Тогда
			
			ДобавитьЗаписиПоПеремещениюБух(СоотвПараметровСостояний[Строка.Источник], СоотвПараметровСостояний[Строка.Приемник], СтруктураДопПараметров, -Строка.Стоимость, -Строка.СтоимостьНУ, Строка.НалоговоеНазначение)
			
		Иначе
			
			Приемники.Вставить(Строка.Приемник, Строка.Приемник);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Теперь нужно выделить отдельные деревья, определить среднюю стоимость для каждого дерева, 
	// и начиная с самого начала каждого дерева последовательно рассчитать стоимость для каждого состояния/перемещения
	
	//Найдем начало каждого дерева - его нет в приемниках
	МассивНачалДеревьев = ПолучитьСписокВершин(Таб, Приемники);
	// На данном этапе нужна информация о начальном состоянии и внешнем поступлении в каждую вершину
	
	// Будем использовать список вершин, для каждой из которых указаны смежные вершины - приемники и 
	Вершины = Новый Соответствие; // здесь нам понадобится общее количество источников, приемники
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		Если Строка.Количество=0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Обработаем источник
		ПодчСтруктура = Вершины[Строка.Источник];
		Если ПодчСтруктура=Неопределено Тогда
			ПодчСтруктура = Новый Структура("КоличествоИсточников, Приемники, КоличествоРассчитанныхВходов", 0, Новый Соответствие, 0);
		КонецЕсли;
		
		ПодчСтруктура.Приемники.Вставить(Строка.Приемник, Новый Структура("Количество, Стоимость, СтоимостьНУ", Строка.Количество, Строка.Стоимость, Строка.СтоимостьНУ)); // Вместе с вершиной-приемником запоминаем количество перемещения
		
		Вершины.Вставить(Строка.Источник, ПодчСтруктура);
		
		// Обработаем приемник
		ПодчСтруктура = Вершины[Строка.Приемник];
		Если ПодчСтруктура=Неопределено Тогда
			ПодчСтруктура = Новый Структура("КоличествоИсточников, Приемники, КоличествоРассчитанныхВходов", 1, Новый Соответствие, 0);
		Иначе
			ПодчСтруктура.КоличествоИсточников = ПодчСтруктура.КоличествоИсточников+1;
		КонецЕсли;
		
		Вершины.Вставить(Строка.Приемник, ПодчСтруктура);
	КонецЦикла;
	
	// В структуру Вершины нужно добавить данные о начальном остатке и внешнем поступлении для каждого из состояний,
	// Можно также добавить состояний, не участвовавших в перемещениях, тогда для них тоже будет рассчитано внешнее списание
	МассивДобавленныеВершины = Новый Массив;
	ДобавитьНачальныйОстатокИВнешнееПоступлениеБух(Вершины, СоотвПараметровСостояний, ДатаНач, ДатаКон, СтруктураДопПараметров, МассивДобавленныеВершины);
	
	// Добавдленные состояния возвращаются специальным массивом, который добавляется к началам деревьев
	Для Каждого Элемент Из МассивДобавленныеВершины Цикл
		МассивНачалДеревьев.Добавить(Элемент)
	КонецЦикла;
	
	// Теперь будем обходить деревья с начала, и рассчитывать состояния и переходы между ними
	Для Каждого НачалоДерева Из МассивНачалДеревьев Цикл
		РассчитатьПутьБух(НачалоДерева, Вершины, СоотвПараметровСостояний, СтруктураДопПараметров);
	КонецЦикла;
	
КонецПроцедуры // СписаниеПоСредней()

// Находит контуры и разрывает их, сокращая на минимальное количество
//
// Параметры:
//	Нет.
//
Процедура РазорватьКонтурыБух(НомерИсхВершины, Источники, ПройденныеВершины, ТаблицаПеремещений)
	
	Приемники = Источники[НомерИсхВершины].СмежныеВершины;
	
	Для Каждого ЭлементВершина Из Приемники Цикл
		
		НомерВершины=ЭлементВершина.Ключ;
		ИндСтрокиПеремещения=ЭлементВершина.Значение;
		
		// Найдем каждую вершину-приемник в списке источников
		ПараметрыИсточника = Источники[НомерВершины];
		Если ПараметрыИсточника = Неопределено Тогда
			Продолжить; // это висячая вершина (степени 1)
		КонецЕсли;
		СмежныеВершины = ПараметрыИсточника.СмежныеВершины;
		
		// Неплохо бы запоминать уже пройденные контуры, чтобы не разбирать уже разобранные
		// Контур нужно идентифицировать последовательностью входящих в него вершин.
		
		// Проверим на замыкание
		Если ПройденныеВершины.Найти(НомерВершины,"Ключ")<> Неопределено тогда
		//Если ПройденныеВершины[НомерВершины]<>Неопределено Тогда
			
			// Контур найден: можно сокращать на мин. количество перемещения
			
			// Найдем дугу контура с мин. количеством
			
			// Начнем с текущей
			СтрокаЗамыкающая=ТаблицаПеремещений[ИндСтрокиПеремещения];
			МинКоличество=СтрокаЗамыкающая.Количество;
			ИндСтрокиСМинКоличеством = ИндСтрокиПеремещения;
			
			Инд=0;
			НачалсяКонтур = Ложь; // флаг начала контура
			Для Каждого Элемент Из ПройденныеВершины Цикл
				
				// Найдем начало контура
				НачалсяКонтур = НачалсяКонтур ИЛИ (Элемент.Ключ = НомерВершины);
				
				Если НачалсяКонтур Тогда
					Если Инд>0 Тогда // в первом элементе нет ссылки на строку
						Строка=ТаблицаПеремещений[Элемент.Значение];
						Если Строка.Количество < МинКоличество Тогда 
							МинКоличество = Строка.Количество;
							ИндСтрокиСМинКоличеством = Элемент.Значение;
						КонецЕсли;
					КонецЕсли;
					Инд=Инд+1;
				КонецЕсли;
			КонецЦикла;
			
			// Вычтем найденное минимальное количество из всех дуг контура
			
			// ... из замыкающей дуги
			СтрокаЗамыкающая.Количество = СтрокаЗамыкающая.Количество - МинКоличество;
			
			// ... из всех пройденных дуг
			Инд=0;
			НачалсяКонтур = Ложь; // флаг начала контура
			Для Каждого Элемент Из ПройденныеВершины Цикл
				
				// Найдем начало контура
				НачалсяКонтур = НачалсяКонтур ИЛИ (Элемент.Ключ = НомерВершины);
				
				Если НачалсяКонтур Тогда
					Если Инд>0 Тогда // в первом элементе нет ссылки на строку
						Строка=ТаблицаПеремещений[Элемент.Значение];
						Строка.Количество = Строка.Количество - МинКоличество;
					КонецЕсли;
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;
			
			// Если контур разорван, для повторяющейся вершины процедуру не запускаем, пеерходим к следующему приемнику
			Продолжить;
			
		КонецЕсли;
		
		// Сделаем копию ПройденныеВершины и добавим пройденную вершину
//		КопияПройденныеВершины=Новый Соответствие;
		КопияПройденныеВершины =ПройденныеВершины.Скопировать();
		//Для Каждого Элемент Из ПройденныеВершины Цикл
		//	КопияПройденныеВершины.Вставить(Элемент.Ключ, Элемент.Значение);
		//КонецЦикла;
		
		НоваяСтрока = КопияПройденныеВершины.Добавить();
		НоваяСтрока.Ключ = НомерВершины;
		НоваяСтрока.Значение = ИндСтрокиПеремещения;
		
		//КопияПройденныеВершины.Вставить(НомерВершины, ИндСтрокиПеремещения);
		
		РазорватьКонтурыБух(НомерВершины, Источники, КопияПройденныеВершины, ТаблицаПеремещений);
		
		// Отметим, что от вершины уже строился контур, чтобы не вызывать аналогичную процедуру повторно
		Источники[НомерВершины].Пройден = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // РазорватьКонтурыБух()

// Рассчитывает отрезки пути в состояния, в которые есть переход из данной вершины
//
// Параметры:
//	Источник - номер состояния-источника.
//	Состояния - соответствие, содержащее состояния, приемники и т.д.
//	СоотвПараметровСостояний - соответствие, содержащее параметры состояния, как они представлены в БД (измерения, счета, субконто и т.д.)
//
Процедура РассчитатьПутьБух(Источник, Состояния, СоотвПараметровСостояний, СтруктураДопПараметров)
	
	// Состояние в начале:
	// ............
	// ............
	
	// Расчет состояния.
	// Стоимость в состоянии складывается из:
	// Начального остатка + Внешнего прихода (определяется сразу)
	// Прихода из других состояний (входящих стрелок - оперделяется сложением стрелок)
	
	// Приход из других состояний определяем по таблице перемещений
	
	// Расчет перемещения в другие состояния
	// В каждом состоянии-приемнике КоличествоРассчитанныхВходов = КоличествоРассчитанныхВходов+1
	
	СостояниеИсточник=Состояния[Источник];
	
	// Состояние можно испоьзовать в расчете, если рассчитаны все входящие стрелки
	Если СостояниеИсточник.КоличествоИсточников=СостояниеИсточник.КоличествоРассчитанныхВходов Тогда
		
		СоотвПриемники=СостояниеИсточник.Приемники; // соответствие  - примники
		
		// Рассчитаем перемещения между состояниями
		Для Каждого ЭлементПриемник Из СоотвПриемники Цикл
			
			Приемник = ЭлементПриемник.Ключ;
			Количество = ЭлементПриемник.Значение.Количество;
			СтоимостьПерв = ЭлементПриемник.Значение.Стоимость;
			СтоимостьПервНУ = ЭлементПриемник.Значение.СтоимостьНУ;
			
			Состояние = Состояния[Приемник];
			
			Если СостояниеИсточник.Количество > Количество Тогда
				Стоимость = Окр(СостояниеИсточник.Стоимость*Количество /СостояниеИсточник.Количество, 2);
				СтоимостьНУ = Окр(СостояниеИсточник.СтоимостьНУ*Количество /СостояниеИсточник.Количество, 2);
			Иначе
				Стоимость = СостояниеИсточник.Стоимость;
				СтоимостьНУ = СостояниеИсточник.СтоимостьНУ;
			КонецЕсли;
			
			// Теперь можно сформировать записи по перемещению между состояниями
			// Передаем разницу между первоначальным движением и рассчитанным
			ДобавитьЗаписиПоПеремещениюБух(СоотвПараметровСостояний[Источник], СоотвПараметровСостояний[Приемник], СтруктураДопПараметров, Стоимость-СтоимостьПерв, СтоимостьНУ-СтоимостьПервНУ, СостояниеИсточник.НалоговоеНазначение);
			
			// Поступление в состояние
			Состояние.Количество = Состояние.Количество + Количество;
			Состояние.Стоимость  = Состояние.Стоимость + Стоимость;
			Состояние.СтоимостьНУ  = Состояние.СтоимостьНУ + СтоимостьНУ;
			
			СостояниеИсточник.Количество = СостояниеИсточник.Количество - Количество;
			СостояниеИсточник.Стоимость = СостояниеИсточник.Стоимость - Стоимость;
			СостояниеИсточник.СтоимостьНУ  = СостояниеИсточник.СтоимостьНУ - СтоимостьНУ;
			
			Состояние.КоличествоРассчитанныхВходов = Состояние.КоличествоРассчитанныхВходов+1;
			
			// Расчет пути из этой точки
			РассчитатьПутьБух(Приемник, Состояния, СоотвПараметровСостояний, СтруктураДопПараметров);
			
		КонецЦикла;
		
		// Теперь можем рассчитать внешние выходы:
		// сформируем записи по внешнему списанию из состояния Источник
		ДобавитьЗаписиПоВнешнемуСписаниюБух(СоотвПараметровСостояний[Источник], СостояниеИсточник.Количество, СостояниеИсточник.Стоимость, СостояниеИсточник.СтоимостьНУ, СостояниеИсточник.НалоговоеНазначение, СтруктураДопПараметров);
		
		// Все выходы из данного состояния рассчитаны.
		
	КонецЕсли;
	
КонецПроцедуры // РассчитатьПутьБух()

// Возвращает таблицу перемещений товаров между состояниями
// Зависит от конкретной структуры данных конфигурации
//
// Параметры:
//	Нет.
//
Функция ПолучитьТаблицуПеремещенийБух(ТаблицаТоваров, ДатаНач, ДатаКон,  Префикс, СтруктураДопПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос.Сумма КАК Стоимость,
		|	ВложенныйЗапрос.СуммаНУ КАК СтоимостьНУ,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.СчетКт КАК Счет,
		|	ВложенныйЗапрос.СчетДт КАК Счет" + Префикс + ",
		|	ВложенныйЗапрос.НалоговоеНазначение КАК НалоговоеНазначение,
		|	ВложенныйЗапрос.СубконтоКт1 КАК Субконто1,
		|	ВложенныйЗапрос.СубконтоКт2 КАК Субконто2,
		|	ВложенныйЗапрос.СубконтоКт3 КАК Субконто3,
		|	ВложенныйЗапрос.СубконтоКт4 КАК Субконто4,
		|	ВложенныйЗапрос.СубконтоДт1 КАК Субконто1" + Префикс + ",
		|	ВложенныйЗапрос.СубконтоДт2 КАК Субконто2" + Префикс + ",
		|	ВложенныйЗапрос.СубконтоДт3 КАК Субконто3" + Префикс + ",
		|	ВложенныйЗапрос.СубконтоДт4 КАК Субконто4" + Префикс + "
		|ИЗ
		|	(ВЫБРАТЬ
		|		ХозрасчетныйОбороты.СчетКт КАК СчетКт,
		|		ВЫБОР КОГДА ХозрасчетныйОбороты.СубконтоКт1 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт1 КОГДА ХозрасчетныйОбороты.СубконтоКт2 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт2 КОГДА ХозрасчетныйОбороты.СубконтоКт3 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт3 КОГДА ХозрасчетныйОбороты.СубконтоКт4 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт4 ИНАЧЕ Неопределено КОНЕЦ КАК НоменклатураКт,
		|		ВЫБОР КОГДА ХозрасчетныйОбороты.СубконтоДт1 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт1 КОГДА ХозрасчетныйОбороты.СубконтоДт2 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт2 КОГДА ХозрасчетныйОбороты.СубконтоДт3 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт3 КОГДА ХозрасчетныйОбороты.СубконтоДт4 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт4 ИНАЧЕ NULL КОНЕЦ КАК НоменклатураДт,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто1 ТОГДА ХозрасчетныйОбороты.СубконтоКт1 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоКт1,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто2 ТОГДА ХозрасчетныйОбороты.СубконтоКт2 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоКт2,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто3 ТОГДА ХозрасчетныйОбороты.СубконтоКт3 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоКт3,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто4 ТОГДА ХозрасчетныйОбороты.СубконтоКт4 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоКт4,
		|		ХозрасчетныйОбороты.СчетДт КАК СчетДт,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто1 ТОГДА ХозрасчетныйОбороты.СубконтоДт1 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоДт1,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто2 ТОГДА ХозрасчетныйОбороты.СубконтоДт2 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоДт2,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто3 ТОГДА ХозрасчетныйОбороты.СубконтоДт3 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоДт3,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто4 ТОГДА ХозрасчетныйОбороты.СубконтоДт4 ИНАЧЕ Неопределено КОНЕЦ КАК СубконтоДт4,
		|		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.СуммаОборот ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ХозрасчетныйОбороты.СуммаОборот КОНЕЦ) КАК Сумма,
		|		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.СуммаНУОборотДт ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ХозрасчетныйОбороты.СуммаНУОборотДт КОНЕЦ) КАК СуммаНУ,
		|		ХозрасчетныйОбороты.НалоговоеНазначениеДт КАК НалоговоеНазначение,
		|		СУММА(ВЫБОР КОГДА (ХозрасчетныйОбороты.КоличествоОборотКт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ХозрасчетныйОбороты.КоличествоОборотКт КОНЕЦ) КАК Количество
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, , СчетДт В (&СписокСчетов), , СчетКт В (&СписокСчетов), , Организация = &Организация) КАК ХозрасчетныйОбороты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Хозрасчетный.Ссылка КАК Счет,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто1,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто2,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто3,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 4 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто4
		|			ИЗ
		|				ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|					ПО ХозрасчетныйВидыСубконто.Ссылка = Хозрасчетный.Ссылка
		|			
		|			ГДЕ
		|				Хозрасчетный.Ссылка В (&СписокСчетов)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Хозрасчетный.Ссылка) КАК СуммовойУчетКт
		|			ПО ХозрасчетныйОбороты.СчетКт = СуммовойУчетКт.Счет
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Хозрасчетный.Ссылка КАК Счет,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто1,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто2,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто3,
		|				МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 4 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто4
		|			ИЗ
		|				ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|					ПО ХозрасчетныйВидыСубконто.Ссылка = Хозрасчетный.Ссылка
		|			
		|			ГДЕ
		|				Хозрасчетный.Ссылка В (&СписокСчетов)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Хозрасчетный.Ссылка) КАК СуммовойУчетДт
		|			ПО ХозрасчетныйОбороты.СчетДт = СуммовойУчетДт.Счет
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ХозрасчетныйОбороты.СчетКт,
		|		ХозрасчетныйОбороты.СчетДт,
		|		ХозрасчетныйОбороты.НалоговоеНазначениеДт,
		|		ВЫБОР КОГДА ХозрасчетныйОбороты.СубконтоКт1 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт1 КОГДА ХозрасчетныйОбороты.СубконтоКт2 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт2 КОГДА ХозрасчетныйОбороты.СубконтоКт3 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт3 КОГДА ХозрасчетныйОбороты.СубконтоКт4 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоКт4 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА ХозрасчетныйОбороты.СубконтоДт1 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт1 КОГДА ХозрасчетныйОбороты.СубконтоДт2 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт2 КОГДА ХозрасчетныйОбороты.СубконтоДт3 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт3 КОГДА ХозрасчетныйОбороты.СубконтоДт4 ССЫЛКА Справочник.Номенклатура ТОГДА ХозрасчетныйОбороты.СубконтоДт4 ИНАЧЕ NULL КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто1 ТОГДА ХозрасчетныйОбороты.СубконтоКт1 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто2 ТОГДА ХозрасчетныйОбороты.СубконтоКт2 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто3 ТОГДА ХозрасчетныйОбороты.СубконтоКт3 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетКт.Субконто4 ТОГДА ХозрасчетныйОбороты.СубконтоКт4 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто1 ТОГДА ХозрасчетныйОбороты.СубконтоДт1 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто2 ТОГДА ХозрасчетныйОбороты.СубконтоДт2 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто3 ТОГДА ХозрасчетныйОбороты.СубконтоДт3 ИНАЧЕ Неопределено КОНЕЦ,
		|		ВЫБОР КОГДА СуммовойУчетДт.Субконто4 ТОГДА ХозрасчетныйОбороты.СубконтоДт4 ИНАЧЕ Неопределено КОНЕЦ) КАК ВложенныйЗапрос
		|
		|ГДЕ
		|	ВЫБОР КОГДА ВложенныйЗапрос.СубконтоКт1 ССЫЛКА Документ.ОтчетПроизводстваЗаСмену ТОГДА ВложенныйЗапрос.СубконтоКт1.Дата КОГДА ВложенныйЗапрос.СубконтоКт2 ССЫЛКА Документ.ОтчетПроизводстваЗаСмену ТОГДА ВложенныйЗапрос.СубконтоКт2.Дата КОГДА ВложенныйЗапрос.СубконтоКт3 ССЫЛКА Документ.ОтчетПроизводстваЗаСмену ТОГДА ВложенныйЗапрос.СубконтоКт3.Дата КОГДА ВложенныйЗапрос.СубконтоКт4 ССЫЛКА Документ.ОтчетПроизводстваЗаСмену ТОГДА ВложенныйЗапрос.СубконтоКт4.Дата ИНАЧЕ (&ДатаНач) КОНЕЦ >= &ДатаНач И
		|	(ВложенныйЗапрос.НоменклатураКт = ВложенныйЗапрос.НоменклатураДт) И ";
		
		Если ТаблицаТоваров <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|		(ВложенныйЗапрос.НоменклатураКт В (&СписокТоваров)) И";
		КонецЕсли;
		
	Запрос.Текст = Запрос.Текст + "
	|	(ВложенныйЗапрос.СчетДт <> ВложенныйЗапрос.СчетКт ИЛИ ВложенныйЗапрос.СубконтоКт1 <> ВложенныйЗапрос.СубконтоДт1 ИЛИ ВложенныйЗапрос.СубконтоКт2 <> ВложенныйЗапрос.СубконтоДт2 ИЛИ ВложенныйЗапрос.СубконтоКт3 <> ВложенныйЗапрос.СубконтоДт3 ИЛИ ВложенныйЗапрос.СубконтоКт4 <> ВложенныйЗапрос.СубконтоДт4)";
		
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Организация", СтруктураДопПараметров.Организация);
	Запрос.УстановитьПараметр("СписокСчетов", СтруктураДопПараметров.СписокСчетов);
	Запрос.УстановитьПараметр("СписокТоваров", ТаблицаТоваров);
		
	Таб = Запрос.Выполнить().Выгрузить();
	
	Возврат Таб;
	
КонецФункции // ПолучитьТаблицуПеремещенийБух()

// Добавляет данные о начальном остатке и внешнем поступлении в состояниях
//
// Параметры:
//	Нет.
//
Процедура ДобавитьНачальныйОстатокИВнешнееПоступлениеБух(Состояния, СоотвПараметровСостояний, ДатаНач, ДатаКон, СтруктураДопПараметров, МассивДобавляемыхВершин)
	
	// Из структуры доп параметров добудем дополнительные параметры
	Учет                         = СтруктураДопПараметров.Учет;
	СписокНеКорректируемыхСчетов = СтруктураДопПараметров.СписокНеКорректируемыхСчетов; // список счетов списание номенклатуры на которые не надо корректировать
	МассивНоменклатуры           = СтруктураДопПараметров.ТаблицаТоваров;
	
	Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Счет,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто1 ТОГДА ВложенныйЗапрос.Субконто1 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто1,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто2 ТОГДА ВложенныйЗапрос.Субконто2 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто2,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто3 ТОГДА ВложенныйЗапрос.Субконто3 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто3,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто4 ТОГДА ВложенныйЗапрос.Субконто4 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто4,
	|	ВложенныйЗапрос.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаОстаток)                  ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаОстаток) КОНЕЦ КАК СуммаОстаток,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаОстатокНУ)                ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаОстатокНУ) КОНЕЦ КАК СуммаОстатокНУ,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.КоличествоОстаток)             ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоОстаток) КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаПриход)                   ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаПриход) КОНЕЦ КАК СуммаПриход,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаПриходНУ)                 ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаПриходНУ) КОНЕЦ КАК СуммаПриходНУ,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.КоличествоПриход)              ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоПриход) КОНЕЦ КАК КоличествоПриход,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаВозвратОтПокупателя)      ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаВозвратОтПокупателя) КОНЕЦ КАК СуммаВозвратОтПокупателя,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаВозвратОтПокупателяНУ)      ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаВозвратОтПокупателяНУ) КОНЕЦ КАК СуммаВозвратОтПокупателяНУ,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.КоличествоВозвратОтПокупателя) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоВозвратОтПокупателя)  КОНЕЦ КАК КоличествоВозвратОтПокупателя,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаВозвратПоставщику)        ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаВозвратПоставщику) КОНЕЦ КАК СуммаВозвратПоставщику,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СуммаВозвратПоставщикуНУ)        ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.СуммаВозвратПоставщикуНУ) КОНЕЦ КАК СуммаВозвратПоставщикуНУ,
	|	ВЫБОР КОГДА СУММА(ВложенныйЗапрос.КоличествоВозвратПоставщику)   ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоВозвратПоставщику)  КОНЕЦ КАК КоличествоВозвратПоставщику
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаОстатковИПриходов.Счет КАК Счет,
	|		ТаблицаОстатковИПриходов.Субконто1 КАК Субконто1,
	|		ТаблицаОстатковИПриходов.Субконто2 КАК Субконто2,
	|		ТаблицаОстатковИПриходов.Субконто3 КАК Субконто3,
	|		ТаблицаОстатковИПриходов.Субконто4 КАК Субконто4,
	|		ТаблицаОстатковИПриходов.НалоговоеНазначение КАК НалоговоеНазначение,
	|		СУММА(ВЫБОР КОГДА ТаблицаОстатковИПриходов.СуммаНачальныйОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаОстатковИПриходов.СуммаНачальныйОстаток КОНЕЦ) КАК СуммаОстаток,
	|		СУММА(ВЫБОР КОГДА ТаблицаОстатковИПриходов.СуммаНУНачальныйОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаОстатковИПриходов.СуммаНУНачальныйОстаток КОНЕЦ) КАК СуммаОстатокНУ,
	|		СУММА(ВЫБОР КОГДА ТаблицаОстатковИПриходов.КоличествоНачальныйОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаОстатковИПриходов.КоличествоНачальныйОстаток КОНЕЦ) КАК КоличествоОстаток,
	|		ВЫБОР КОГДА СУММА(ТаблицаОстатковИПриходов.СуммаОборотДт) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ТаблицаОстатковИПриходов.СуммаОборотДт) КОНЕЦ КАК СуммаПриход,
	|		ВЫБОР КОГДА СУММА(ТаблицаОстатковИПриходов.СуммаНУОборотДт) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ТаблицаОстатковИПриходов.СуммаНУОборотДт) КОНЕЦ КАК СуммаПриходНУ,
	|		ВЫБОР КОГДА СУММА(ТаблицаОстатковИПриходов.КоличествоОборотДт) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ СУММА(ТаблицаОстатковИПриходов.КоличествоОборотДт) КОНЕЦ КАК КоличествоПриход,
	|		0 КАК СуммаВозвратОтПокупателя,
	|		0 КАК СуммаВозвратОтПокупателяНУ,
	|		0 КАК КоличествоВозвратОтПокупателя,
	|		0 КАК СуммаВозвратПоставщику,
	|		0 КАК СуммаВозвратПоставщикуНУ,
	|		0 КАК КоличествоВозвратПоставщику
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В (&СписокСчетов), , Организация = &Организация) КАК ТаблицаОстатковИПриходов";
	
	
	Если МассивНоменклатуры <> Неопределено Тогда
		Текст = Текст + "
		|	ГДЕ
		|		(ВЫБОР КОГДА ТаблицаОстатковИПриходов.Субконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаОстатковИПриходов.Субконто1 В (&МассивНоменклатуры) КОГДА ТаблицаОстатковИПриходов.Субконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаОстатковИПриходов.Субконто2 В (&МассивНоменклатуры) КОГДА ТаблицаОстатковИПриходов.Субконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаОстатковИПриходов.Субконто3 В (&МассивНоменклатуры) КОГДА ТаблицаОстатковИПриходов.Субконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаОстатковИПриходов.Субконто4 В (&МассивНоменклатуры) ИНАЧЕ ЛОЖЬ КОНЕЦ)";
	КонецЕсли;
	
	Текст = Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаОстатковИПриходов.Счет,
	|		ТаблицаОстатковИПриходов.Субконто1,
	|		ТаблицаОстатковИПриходов.Субконто2,
	|		ТаблицаОстатковИПриходов.Субконто3,
	|		ТаблицаОстатковИПриходов.Субконто4,
	|		ТаблицаОстатковИПриходов.НалоговоеНазначение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВозвратов.Счет,
	|		ТаблицаВозвратов.Субконто1,
	|		ТаблицаВозвратов.Субконто2,
	|		ТаблицаВозвратов.Субконто3,
	|		ТаблицаВозвратов.Субконто4,
	|		ТаблицаВозвратов.НалоговоеНазначение КАК НалоговоеНазначение,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СУММА(ВЫБОР КОГДА (ТаблицаВозвратов.СуммаОборотКт < 0  И НЕ ТаблицаВозвратов.Регистратор Ссылка Документ.ОтчетПроизводстваЗаСмену) ТОГДА -(ТаблицаВозвратов.СуммаОборотКт) ИНАЧЕ 0 КОНЕЦ),
	|		СУММА(ВЫБОР КОГДА (ТаблицаВозвратов.СуммаНУОборотКт < 0  И НЕ ТаблицаВозвратов.Регистратор Ссылка Документ.ОтчетПроизводстваЗаСмену) ТОГДА -(ТаблицаВозвратов.СуммаНУОборотКт) ИНАЧЕ 0 КОНЕЦ),
    |		СУММА(ВЫБОР КОГДА (ТаблицаВозвратов.КоличествоОборотКт < 0 И НЕ ТаблицаВозвратов.Регистратор Ссылка Документ.ОтчетПроизводстваЗаСмену) ТОГДА -(ТаблицаВозвратов.КоличествоОборотКт) ИНАЧЕ 0 КОНЕЦ),
	|		СУММА(ВЫБОР КОГДА ТаблицаВозвратов.СуммаОборотКт >= 0 ТОГДА ТаблицаВозвратов.СуммаОборотКт ИНАЧЕ 0 КОНЕЦ),
	|		СУММА(ВЫБОР КОГДА ТаблицаВозвратов.СуммаНУОборотКт >= 0 ТОГДА ТаблицаВозвратов.СуммаНУОборотКт ИНАЧЕ 0 КОНЕЦ),
	|		СУММА(ВЫБОР КОГДА ТаблицаВозвратов.КоличествоОборотКт >= 0 ТОГДА ТаблицаВозвратов.КоличествоОборотКт ИНАЧЕ 0 КОНЕЦ)
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В (&СписокСчетов), , Организация = &Организация, , ) КАК ТаблицаВозвратов
	
	|	
	|   ГДЕ 
	|   ВЫБОР
	|	 КОГДА ТаблицаВозвратов.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|	 ТОГДА ВЫРАЗИТЬ(ТаблицаВозвратов.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата < &ДатаНач
	|				ИЛИ ВЫРАЗИТЬ(ТаблицаВозвратов.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата ЕСТЬ NULL 
	|	 ИНАЧЕ ЛОЖЬ
	|   КОНЕЦ
	| ИЛИ ТаблицаВозвратов.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену
	|	И (ТаблицаВозвратов.КоличествоОборотКт < 0
	|		ИЛИ ТаблицаВозвратов.СуммаОборотКт < 0)"; 
	Если МассивНоменклатуры <> Неопределено Тогда
		Текст = Текст + " И
		|		(ВЫБОР КОГДА ТаблицаВозвратов.Субконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаВозвратов.Субконто1 В (&МассивНоменклатуры) КОГДА ТаблицаВозвратов.Субконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаВозвратов.Субконто2 В (&МассивНоменклатуры) КОГДА ТаблицаВозвратов.Субконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаВозвратов.Субконто3 В (&МассивНоменклатуры) КОГДА ТаблицаВозвратов.Субконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаВозвратов.Субконто4 В (&МассивНоменклатуры) ИНАЧЕ ЛОЖЬ КОНЕЦ)";
	КонецЕсли;
	
	Текст = Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаВозвратов.Счет,
	|		ТаблицаВозвратов.Субконто1,
	|		ТаблицаВозвратов.Субконто2,
	|		ТаблицаВозвратов.Субконто3,
	|		ТаблицаВозвратов.Субконто4,
	|		ТаблицаВозвратов.НалоговоеНазначение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВнутренееПеремещение.Счет,
	|		ВнутренееПеремещение.Субконто1,
	|		ВнутренееПеремещение.Субконто2,
	|		ВнутренееПеремещение.Субконто3,
	|		ВнутренееПеремещение.Субконто4,
	|		ВнутренееПеремещение.НалоговоеНазначение,
	|		0,
	|		0,
	|		0,
	|		СУММА(-(ВЫБОР КОГДА ВнутренееПеремещение.СуммаОборотДт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ВнутренееПеремещение.СуммаОборотДт КОНЕЦ)),
	|		СУММА(-(ВЫБОР КОГДА ВнутренееПеремещение.СуммаНУОборотДт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ВнутренееПеремещение.СуммаНУОборотДт КОНЕЦ)),
	|		СУММА(-(ВЫБОР КОГДА ВнутренееПеремещение.КоличествоОборотДт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ВнутренееПеремещение.КоличествоОборотДт КОНЕЦ)),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Период, Счет В (&СписокСчетов), , Организация = &Организация, КорСчет В (&СписокСчетов), ) КАК ВнутренееПеремещение 
	|
	|	ГДЕ
	|		((ВЫБОР КОГДА ВнутренееПеремещение.Субконто1 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.Субконто1 
	|				КОГДА ВнутренееПеремещение.Субконто2 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.Субконто2 
	|				КОГДА ВнутренееПеремещение.Субконто3 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.Субконто3 
	|				КОГДА ВнутренееПеремещение.Субконто4 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.Субконто4 
	|				ИНАЧЕ 
	|					NULL КОНЕЦ) = 
	|		(ВЫБОР КОГДА ВнутренееПеремещение.КорСубконто1 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.КорСубконто1 
	|				КОГДА ВнутренееПеремещение.КорСубконто2 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.КорСубконто2 
	|				КОГДА ВнутренееПеремещение.КорСубконто3 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.КорСубконто3 
	|				КОГДА ВнутренееПеремещение.КорСубконто4 ССЫЛКА Справочник.Номенклатура 
	|					ТОГДА ВнутренееПеремещение.КорСубконто4
	|				ИНАЧЕ 
	|					NULL КОНЕЦ))";
	
	
	Если МассивНоменклатуры <> Неопределено Тогда
		Текст = Текст + "
		|	 И (ВЫБОР КОГДА ВнутренееПеремещение.Субконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ВнутренееПеремещение.Субконто1 В (&МассивНоменклатуры) КОГДА ВнутренееПеремещение.Субконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ВнутренееПеремещение.Субконто2 В (&МассивНоменклатуры) КОГДА ВнутренееПеремещение.Субконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ВнутренееПеремещение.Субконто3 В (&МассивНоменклатуры) КОГДА ВнутренееПеремещение.Субконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ВнутренееПеремещение.Субконто4 В (&МассивНоменклатуры) ИНАЧЕ ЛОЖЬ КОНЕЦ)";
		
	КонецЕсли;
	
	Текст = Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВнутренееПеремещение.Счет,
	|		ВнутренееПеремещение.Субконто1,
	|		ВнутренееПеремещение.Субконто2,
	|		ВнутренееПеремещение.Субконто3,
	|		ВнутренееПеремещение.Субконто4,
	|		ВнутренееПеремещение.НалоговоеНазначение";
	
	// Если есть операции списания, которые не должны быть скорректированы, то эти
	// операции необходимо учесть при расчете среденвзвешенной стоимости номенклатуры.
	Если СписокНеКорректируемыхСчетов <> Неопределено Тогда
		
		Текст = Текст + "
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаНеУчитываемыхСписаний.Счет,
		|		ТаблицаНеУчитываемыхСписаний.Субконто1,
		|		ТаблицаНеУчитываемыхСписаний.Субконто2,
		|		ТаблицаНеУчитываемыхСписаний.Субконто3,
		|		ТаблицаНеУчитываемыхСписаний.Субконто4,
		|		ТаблицаНеУчитываемыхСписаний.НалоговоеНазначение,
		|		0,
		|		0,
		|		0,
		|		СУММА(-(ВЫБОР КОГДА ТаблицаНеУчитываемыхСписаний.СуммаОборотКт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаНеУчитываемыхСписаний.СуммаОборотКт КОНЕЦ)),
		|		СУММА(-(ВЫБОР КОГДА ТаблицаНеУчитываемыхСписаний.СуммаНУОборотКт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаНеУчитываемыхСписаний.СуммаНУОборотКт КОНЕЦ)),
		|		СУММА(-(ВЫБОР КОГДА ТаблицаНеУчитываемыхСписаний.КоличествоОборотКт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТаблицаНеУчитываемыхСписаний.КоличествоОборотКт КОНЕЦ)),
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, , Счет В ИЕРАРХИИ (&СписокНеКорректируемыхСчетов), , Организация = &Организация, , ) КАК ТаблицаНеУчитываемыхСписаний";
		
		Если МассивНоменклатуры <> Неопределено Тогда
			Текст = Текст + "
			|	
			|	ГДЕ
			|		(ВЫБОР КОГДА ТаблицаНеУчитываемыхСписаний.Субконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаНеУчитываемыхСписаний.Субконто1 В (&МассивНоменклатуры) КОГДА ТаблицаНеУчитываемыхСписаний.Субконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаНеУчитываемыхСписаний.Субконто2 В (&МассивНоменклатуры) КОГДА ТаблицаНеУчитываемыхСписаний.Субконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаНеУчитываемыхСписаний.Субконто3 В (&МассивНоменклатуры) КОГДА ТаблицаНеУчитываемыхСписаний.Субконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаНеУчитываемыхСписаний.Субконто4 В (&МассивНоменклатуры) ИНАЧЕ ЛОЖЬ КОНЕЦ)";
		КонецЕсли;
		
		Текст = Текст + "
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаНеУчитываемыхСписаний.Счет,
		|		ТаблицаНеУчитываемыхСписаний.Субконто1,
		|		ТаблицаНеУчитываемыхСписаний.Субконто2,
		|		ТаблицаНеУчитываемыхСписаний.Субконто3,
		|		ТаблицаНеУчитываемыхСписаний.Субконто4,
		|		ТаблицаНеУчитываемыхСписаний.НалоговоеНазначение";
		
	КонецЕсли; 
	
	Текст = Текст + ") КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Хозрасчетный.Ссылка КАК Счет,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто1,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто2,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто3,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 4 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто4
	|		ИЗ
	|			ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|				ПО ХозрасчетныйВидыСубконто.Ссылка = Хозрасчетный.Ссылка
	|		
	|		ГДЕ
	|			Хозрасчетный.Ссылка В (&СписокСчетов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Хозрасчетный.Ссылка) КАК СуммовойУчет
	|		ПО ВложенныйЗапрос.Счет = СуммовойУчет.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Счет,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто1 ТОГДА ВложенныйЗапрос.Субконто1 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто2 ТОГДА ВложенныйЗапрос.Субконто2 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто3 ТОГДА ВложенныйЗапрос.Субконто3 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто4 ТОГДА ВложенныйЗапрос.Субконто4 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВложенныйЗапрос.НалоговоеНазначение";
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Организация", СтруктураДопПараметров.Организация);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("СписокСчетов",  СтруктураДопПараметров.СписокСчетов);
	Запрос.УстановитьПараметр("СчетаРасчетов", ПолучитьСчетаРасчетов());
	Запрос.УстановитьПараметр("СписокНеКорректируемыхСчетов", СписокНеКорректируемыхСчетов);
	
	
	Запрос.Текст = Текст;
	
	ТабПартий = Запрос.Выполнить().Выгрузить();
	ТабПартий.Индексы.Добавить("Счет,Субконто1,Субконто2,Субконто3,Субконто4");
	ТабПартий.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Булево"));
	
	Парам=Новый Структура;
	Для Каждого Состояние Из Состояния Цикл
		
		// Это параметры (значения измерений, счетов, субконто и т.д.), которые имеет состояние
		ПараметрыСостояния = СоотвПараметровСостояний[Состояние.Ключ];
		
		Парам.Вставить("Счет", ПараметрыСостояния["Счет"]);
		Парам.Вставить("НалоговоеНазначение", ПараметрыСостояния["НалоговоеНазначение"]);
		Парам.Вставить("Субконто1", ПараметрыСостояния["Субконто1"]);
		Парам.Вставить("Субконто2", ПараметрыСостояния["Субконто2"]);
		Парам.Вставить("Субконто3", ПараметрыСостояния["Субконто3"]);
		Парам.Вставить("Субконто4", ПараметрыСостояния["Субконто4"]);
		
		Количество = 0;
		Сумма      = 0;
		СуммаНУ    = 0;
		НалоговоеНазначение = Неопределено;
		
		НайдСтроки=ТабПартий.НайтиСтроки(Парам);
		Для Каждого СтрокаТаблицы Из НайдСтроки Цикл
			Количество = СтрокаТаблицы.КоличествоОстаток + СтрокаТаблицы.КоличествоПриход +  СтрокаТаблицы.КоличествоВозвратОтПокупателя;
			Сумма      = СтрокаТаблицы.СуммаОстаток + СтрокаТаблицы.СуммаПриход  + СтрокаТаблицы.СуммаВозвратОтПокупателя;
			СуммаНУ      = СтрокаТаблицы.СуммаОстатокНУ + СтрокаТаблицы.СуммаПриходНУ;
			НалоговоеНазначение = СтрокаТаблицы.НалоговоеНазначение;
			// Отметим найденные строки (участвующие в перемещениях), чтобы потом добавить все остальные остатки
			СтрокаТаблицы.Найдена = Истина;
		КонецЦикла;
		
		Состояние.Значение.Вставить("Количество", Количество);
		Состояние.Значение.Вставить("Стоимость",  Сумма);
		Состояние.Значение.Вставить("СтоимостьНУ",  СуммаНУ);
		Состояние.Значение.Вставить("НалоговоеНазначение",  НалоговоеНазначение);

	КонецЦикла;
	
	// Теперь добавим состояния не участвующие в перемещениях (обособленные вершины) - тем, по которым не было перемещений, чтобы по ним внешнее списание рассчиталось той же процедурой, что и для перемещений
	ИндСостояния=Состояния.Количество();
	Для Каждого СтрокаТаблицы Из ТабПартий Цикл
		Если НЕ СтрокаТаблицы.Найдена Тогда
            Количество = СтрокаТаблицы.КоличествоОстаток + СтрокаТаблицы.КоличествоПриход + СтрокаТаблицы.КоличествоВозвратОтПокупателя;
			Сумма      = СтрокаТаблицы.СуммаОстаток + СтрокаТаблицы.СуммаПриход + СтрокаТаблицы.СуммаВозвратОтПокупателя;
			СуммаНУ    = СтрокаТаблицы.СуммаОстатокНУ + СтрокаТаблицы.СуммаПриходНУ + СтрокаТаблицы.СуммаВозвратОтПокупателяНУ;
						
			ИндСостояния=ИндСостояния+1;
			
			// Добавим состояние со всеми необходимыми параметрами
			Состояния.Вставить(ИндСостояния, 
			Новый Структура("КоличествоИсточников, КоличествоРассчитанныхВходов, Приемники, Количество, Стоимость, СтоимостьНУ, НалоговоеНазначение", 0, 0, Новый Соответствие, Количество, Сумма, СуммаНУ, СтрокаТаблицы.НалоговоеНазначение));
			
			СоотвПараметровСостояний.Вставить(ИндСостояния, Новый Структура("Счет, Субконто1, Субконто2, Субконто3, Субконто4, НалоговоеНазначение", СтрокаТаблицы.Счет, СтрокаТаблицы.Субконто1, СтрокаТаблицы.Субконто2, СтрокаТаблицы.Субконто3, СтрокаТаблицы.Субконто4, СтрокаТаблицы.НалоговоеНазначение));
			
			МассивДобавляемыхВершин.Добавить(ИндСостояния);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьНачальныйОстатокИВнешнееПоступлениеБух()

// Добавляет в базу данных записи по перемещению в другое состояние
//
// Параметры:
//	Нет.
//
Процедура ДобавитьЗаписиПоПеремещениюБух(ПараметрыСостоянияИсточника, ПараметрыСостоянияПриемника, СтруктураДопПараметров, СуммаКорректировки = 0, СуммаКорректировкиНУ = 0, НалоговоеНазначение = Неопределено)
	
	Если СуммаКорректировки = 0 Тогда
		Возврат;
	КонецЕсли; 
	Учет = СтруктураДопПараметров.Учет;
	
	Движение = РегистрыБухгалтерии[?(Учет = "Нал", "Налоговый", "Хозрасчетный")].СоздатьНаборЗаписей();
	
	Проводка = Движение.Добавить();
	
	Проводка.Период        = СтруктураДопПараметров.Период;
	Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
	Проводка.Активность    = Истина;
	Проводка.Организация   = СтруктураДопПараметров.Организация;
	Проводка.Содержание    = "Корректировка стоимости перемещения";
	
	ДопПроводкаДт = Ложь;
	ДопПроводкаКт = Ложь;
	
	СчетДт = ПараметрыСостоянияПриемника.Счет;
	СчетКт = ПараметрыСостоянияИсточника.Счет;
	
	Если СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
		ДопПроводкаКт = Истина;
		СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	ИначеЕсли СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ Тогда
		ДопПроводкаКт = Истина;
		СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
	КонецЕсли;
		
	Если СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
		ДопПроводкаДт = Истина;
		СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	ИначеЕсли СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ Тогда
		ДопПроводкаДт = Истина;
		СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
	КонецЕсли;	
	
	Проводка.СчетДт = ПараметрыСостоянияПриемника.Счет;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияПриемника.Субконто1);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияПриемника.Субконто2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияПриемника.Субконто3);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ПараметрыСостоянияПриемника.Субконто4);
	
	Проводка.СчетКт = ПараметрыСостоянияИсточника.Счет;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияИсточника.Субконто1);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияИсточника.Субконто2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияИсточника.Субконто3);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияИсточника.Субконто4);
	
	Проводка.Сумма = СуммаКорректировки;
	
	Если Проводка.СчетДт.НалоговыйУчет Тогда
		Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			Проводка.СуммаНУДт = СуммаКорректировкиНУ;
		КонецЕсли;
		Проводка.НалоговоеНазначениеДт = НалоговоеНазначение;
	КонецЕсли;
	Если Проводка.СчетКт.НалоговыйУчет Тогда
		Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			Проводка.СуммаНУКт = СуммаКорректировкиНУ;
		КонецЕсли;
		Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
	КонецЕсли;
	
	Если ДопПроводкаДт Тогда
		
		Проводка = Движение.Добавить();
		
		Проводка.Период        = СтруктураДопПараметров.Период;
		Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
		Проводка.Активность    = Истина;
		Проводка.Организация   = СтруктураДопПараметров.Организация;
		Проводка.Содержание    = "Корректировка стоимости перемещения";
		
		Проводка.СчетДт = ПараметрыСостоянияПриемника.Счет;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияПриемника.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияПриемника.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияПриемника.Субконто3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ПараметрыСостоянияПриемника.Субконто4);
		
		Проводка.СчетКт = СчетДт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияПриемника.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияПриемника.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияПриемника.Субконто3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияПриемника.Субконто4);
		
		Проводка.Сумма = - СуммаКорректировки;
		
		Если Проводка.СчетДт.НалоговыйУчет Тогда
			Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУДт = - СуммаКорректировкиНУ;
			КонецЕсли;
			Проводка.НалоговоеНазначениеДт = НалоговоеНазначение;
		КонецЕсли;
		Если Проводка.СчетКт.НалоговыйУчет Тогда
			Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУКт = - СуммаКорректировкиНУ;
			КонецЕсли;
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДопПроводкаКт Тогда
		
		Проводка = Движение.Добавить();
		
		Проводка.Период        = СтруктураДопПараметров.Период;
		Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
		Проводка.Активность    = Истина;
		Проводка.Организация   = СтруктураДопПараметров.Организация;
		Проводка.Содержание    = "Корректировка стоимости перемещения";
		
		Проводка.СчетДт = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияИсточника.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияИсточника.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияИсточника.Субконто3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ПараметрыСостоянияИсточника.Субконто4);
		
		Проводка.СчетКт = ПараметрыСостоянияИсточника.Счет;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияИсточника.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияИсточника.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияИсточника.Субконто3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияИсточника.Субконто4);
		
		Проводка.Сумма = - СуммаКорректировки;
		
		Если Проводка.СчетДт.НалоговыйУчет Тогда
			Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУДт = - СуммаКорректировкиНУ;
			КонецЕсли;
			Проводка.НалоговоеНазначениеДт = НалоговоеНазначение;
		КонецЕсли;
		Если Проводка.СчетКт.НалоговыйУчет Тогда
			Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУКт = - СуммаКорректировкиНУ;
			КонецЕсли;
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
		КонецЕсли;
		
	КонецЕсли;
	
	Движение.Отбор.Регистратор.Значение      = СтруктураДопПараметров.Регистратор;
	Движение.Отбор.Регистратор.Использование = Истина;
	Движение.Записать(Ложь);
		
КонецПроцедуры // ДобавитьЗаписиПоПеремещениюБух()

// Здесь формируются все записи по внешнему списанию 
//
// Параметры:
//	Нет.
//
Процедура ДобавитьЗаписиПоВнешнемуСписаниюБух(ПараметрыСостоянияИсточника, знач ОбщееКоличество, знач ОбщаяСтоимость, знач ОбщаяСтоимостьНУ, знач НалоговоеНазначение, СтруктураДопПараметров)
	
	Учет = СтруктураДопПараметров.Учет;
	
	Движение = РегистрыБухгалтерии[?(Учет = "Нал", "Налоговый", "Хозрасчетный")].СоздатьНаборЗаписей();
	
	// Отберем из общей таблицы списания нужные операции списания.
	ОперацийСписания = СтруктураДопПараметров.ТаблицаОперацийСписания.НайтиСтроки(ПараметрыСостоянияИсточника);
	
	Для каждого ОперацияСписания Из ОперацийСписания Цикл
		
			Если ОбщееКоличество = 0 Тогда
				Прервать;
			КонецЕсли;
			Если ОперацияСписания.КорСчет.ВидыСубконто.Количество() > 1 Тогда 
				Если ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(ОперацияСписания.КорСчет.ВидыСубконто[1].ВидСубконто) = "ПартииМатериаловВЭксплуатации" Тогда
					Продолжить;
					// Возвраты спецодежды не корректируются, т.к. имеют особый порядок учета
				КонецЕсли;                                                           
			КонецЕсли;
			
			
			ДолжноБытьСписано  = Окр(ОбщаяСтоимость/ОбщееКоличество * ОперацияСписания.Количество, 2); 
			ДолжноБытьСписаноНУ  = Окр(ОбщаяСтоимостьНУ/ОбщееКоличество * ОперацияСписания.Количество, 2);
			СуммаКорректировки = ДолжноБытьСписано - ОперацияСписания.Сумма;
			СуммаКорректировкиНУ = ДолжноБытьСписаноНУ - ОперацияСписания.СуммаНУ;
			
		// Уменьшим общую стоимость и количество.
		ОбщаяСтоимость  = ОбщаяСтоимость  - ДолжноБытьСписано;
		ОбщаяСтоимостьНУ  = ОбщаяСтоимостьНУ  - ДолжноБытьСписаноНУ;
		ОбщееКоличество = ОбщееКоличество - ОперацияСписания.Количество;
		
		Если СуммаКорректировки <> 0 Тогда
			
			Проводка = Движение.Добавить();
			
			Проводка.Период        = СтруктураДопПараметров.Период;
			Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
			Проводка.Активность    = Истина;
			Проводка.Организация   = СтруктураДопПараметров.Организация;
			Проводка.Содержание    = "Корректировка стоимости списания";
			
			ОбратнаяПроводка = Ложь;
		
			ДопПроводкаДт = Ложь;
			ДопПроводкаКт = Ложь;
			
			СчетДт = ОперацияСписания.КорСчет;
			СчетКт = ПараметрыСостоянияИсточника.Счет;
			
			Если СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
				ДопПроводкаКт = Истина;
				СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
			ИначеЕсли СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ Тогда
				ДопПроводкаКт = Истина;
				СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
			КонецЕсли;
				
			Если СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
				ДопПроводкаДт = Истина;
				СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
			ИначеЕсли СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ Тогда
				ДопПроводкаДт = Истина;
				СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
			КонецЕсли;	


			Если СтруктураДопПараметров.СписокСчетовПоставщиков.Найти(ОперацияСписания.КорСчет) <> Неопределено Тогда
				// корректировка возврата поставщику производится за счет счетов доходов/расходов, указанных в регистре сведений СчетаУчетаПрочие
				Если СуммаКорректировки > 0 ИЛИ (СуммаКорректировки = 0 И СуммаКорректировкиНУ > 0) Тогда
					Проводка.СчетДт = СтруктураДопПараметров.СчетаРасходовПриВозвратеПоставщику.СчетУчетаБУ;
					Если НЕ ЗначениеЗаполнено(Проводка.СчетДт) Тогда
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;	
						ТекстСообщения = "Не заполнен счет расходов при возврате поставщику в регистре сведений ""Счета учета (прочие)""!
										 |  Сформированы проводки в корреспонденции со счетом 00!";
						#Если ВнешнееСоединение Тогда
							ВызватьИсключение (ТекстСообщения);
						#Иначе
							Сообщить(ТекстСообщения, СтатусСообщения.Важное);
						#КонецЕсли
					КонецЕсли; 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураДопПараметров.СчетаРасходовПриВозвратеПоставщику.Субконто1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураДопПараметров.СчетаРасходовПриВозвратеПоставщику.Субконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураДопПараметров.СчетаРасходовПриВозвратеПоставщику.Субконто3);
					
					Проводка.СчетКт = ПараметрыСостоянияИсточника.Счет;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияИсточника.Субконто1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияИсточника.Субконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияИсточника.Субконто3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияИсточника.Субконто4);
					
					Проводка.Сумма = СуммаКорректировки;
					
					Если Проводка.СчетДт.НалоговыйУчет Тогда
						Если ОперацияСписания.НалоговоеНазначениеКор <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
							Проводка.СуммаНУДт = СуммаКорректировкиНУ;
						КонецЕсли;
						Проводка.НалоговоеНазначениеДт = ОперацияСписания.НалоговоеНазначениеКор;
					КонецЕсли;
					Если Проводка.СчетКт.НалоговыйУчет Тогда
						Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
							Проводка.СуммаНУКт = СуммаКорректировкиНУ;
						КонецЕсли;
						Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
					КонецЕсли;
					
				Иначе	
					Проводка.СчетКт = СтруктураДопПараметров.СчетаДоходовПриВозвратеПоставщику.СчетУчетаБУ;
					Если НЕ ЗначениеЗаполнено(Проводка.СчетКт) Тогда
						Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;	
						ТекстСообщения = "Не заполнен счет доходов при возврате поставщику в регистре сведений ""Счета учета (прочие)""!
									     |  Сформированы проводки в корреспонденции со счетом 00!";
						
						#Если ВнешнееСоединение Тогда
							ВызватьИсключение (ТекстСообщения);
						#Иначе
							Сообщить(ТекстСообщения, СтатусСообщения.Важное);
						#КонецЕсли
					КонецЕсли; 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураДопПараметров.СчетаДоходовПриВозвратеПоставщику.Субконто1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураДопПараметров.СчетаДоходовПриВозвратеПоставщику.Субконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураДопПараметров.СчетаДоходовПриВозвратеПоставщику.Субконто3);
					
					Проводка.СчетДт = ПараметрыСостоянияИсточника.Счет;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияИсточника.Субконто1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияИсточника.Субконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияИсточника.Субконто3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ПараметрыСостоянияИсточника.Субконто4);
					
			        Проводка.Сумма = - СуммаКорректировки;
					
					Если Проводка.СчетДт.НалоговыйУчет Тогда
						Если ОперацияСписания.НалоговоеНазначениеКор <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
							Проводка.СуммаНУДт = - СуммаКорректировкиНУ;
						КонецЕсли;
						Проводка.НалоговоеНазначениеДт = ОперацияСписания.НалоговоеНазначениеКор;
					КонецЕсли;
					Если Проводка.СчетКт.НалоговыйУчет Тогда
						Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
							Проводка.СуммаНУКт = - СуммаКорректировкиНУ;
						КонецЕсли;
						Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
					КонецЕсли;
					
				КонецЕсли;	
			Иначе
				Проводка.СчетДт = ОперацияСписания.КорСчет;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ОперацияСписания.КорСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ОперацияСписания.КорСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ОперацияСписания.КорСубконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ОперацияСписания.КорСубконто4);
				
				Проводка.СчетКт = ПараметрыСостоянияИсточника.Счет;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияИсточника.Субконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияИсточника.Субконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияИсточника.Субконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияИсточника.Субконто4);
							
				Проводка.Сумма = СуммаКорректировки;
				
				Если Проводка.СчетДт.НалоговыйУчет Тогда
					Если ОперацияСписания.НалоговоеНазначениеКор <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУДт = СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеДт = ОперацияСписания.НалоговоеНазначениеКор;
				КонецЕсли;
				Если Проводка.СчетКт.НалоговыйУчет Тогда
					Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУКт = СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				КонецЕсли;
				
			КонецЕсли; 

			Если СтруктураДопПараметров.Свойство("ТаблицаРаспределенияДляНУ") И ЗначениеЗаполнено(Проводка.СубконтоДт.Номенклатура) И ЗначениеЗаполнено(Проводка.СубконтоКт.Номенклатура) Тогда
				
				НоменклатураКомплект = Проводка.СубконтоДт.Номенклатура;
				ХарактеристикаКомплект = Неопределено;
				СерияКомплект = Неопределено;
				КачествоКомплект = Неопределено;
				ЗаказКомплект = Неопределено;
				ОбработкаТабличныхЧастей.ПолучитьСоставляющиеНоменклатурнойПозиции(Проводка.СубконтоДт.НоменклатурныеПозиции, ХарактеристикаКомплект, СерияКомплект, КачествоКомплект, ЗаказКомплект);
				
				НоменклатураКомплектующее = Проводка.СубконтоКт.Номенклатура;
				ХарактеристикаКомплектующее = Неопределено;
				СерияКомплектующее = Неопределено;
				КачествоКомплектующее = Неопределено;
				ЗаказКомплектующее = Неопределено;
				ОбработкаТабличныхЧастей.ПолучитьСоставляющиеНоменклатурнойПозиции(Проводка.СубконтоКт.НоменклатурныеПозиции, ХарактеристикаКомплектующее, СерияКомплектующее, КачествоКомплектующее, ЗаказКомплектующее);
				
				СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Качество, Заказ",
												НоменклатураКомплектующее, ХарактеристикаКомплектующее, СерияКомплектующее, КачествоКомплектующее, ЗаказКомплектующее);
									
				МассивСтрок = СтруктураДопПараметров.ТаблицаРаспределенияДляНУ.НайтиСтроки(СтруктураПоиска);
				Если МассивСтрок.Количество() > 0 Тогда
					СтрокаКомплектующее = МассивСтрок[0];
					СтрокаКомплектующее.Количество = СтрокаКомплектующее.Количество - ОперацияСписания.Количество;
					СтрокаКомплектующее.СуммаКорректировки = СтрокаКомплектующее.СуммаКорректировки - СуммаКорректировки;
					
					СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Качество, Заказ",
													НоменклатураКомплект, ХарактеристикаКомплект, СерияКомплект, КачествоКомплект, ЗаказКомплект);
													
					МассивСтрок = СтруктураДопПараметров.ТаблицаРаспределенияДляНУ.НайтиСтроки(СтруктураПоиска);
					
					Если МассивСтрок.Количество() > 0 Тогда
						СтрокаКомплект = МассивСтрок[0];
					Иначе
						СтрокаКомплект = СтруктураДопПараметров.ТаблицаРаспределенияДляНУ.Добавить();
						СтрокаКомплект.Номенклатура = НоменклатураКомплект;
						СтрокаКомплект.ХарактеристикаНоменклатуры = ХарактеристикаКомплект;
						СтрокаКомплект.СерияНоменклатуры = СерияКомплект;
						СтрокаКомплект.Качество = КачествоКомплект;
						СтрокаКомплект.Заказ = ЗаказКомплект;
						СтрокаКомплект.Количество = 0;
						СтрокаКомплект.СуммаКорректировки = 0;
					КонецЕсли;	
					СтрокаКомплект.Количество = СтрокаКомплект.Количество + ОперацияСписания.Количество;
					СтрокаКомплект.СуммаКорректировки = СтрокаКомплект.СуммаКорректировки + СуммаКорректировки;
				КонецЕсли; 
			КонецЕсли; 
			
			Если ДопПроводкаДт Тогда
				
				Проводка = Движение.Добавить();
				
				Проводка.Период        = СтруктураДопПараметров.Период;
				Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
				Проводка.Активность    = Истина;
				Проводка.Организация   = СтруктураДопПараметров.Организация;
				Проводка.Содержание    = "Корректировка стоимости списания";
			
				Проводка.СчетДт = ОперацияСписания.КорСчет;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ОперацияСписания.КорСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ОперацияСписания.КорСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ОперацияСписания.КорСубконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ОперацияСписания.КорСубконто4);
				
				Проводка.СчетКт = СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ОперацияСписания.КорСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ОперацияСписания.КорСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ОперацияСписания.КорСубконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ОперацияСписания.КорСубконто4);
				
				Если Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ 
					И Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ 
					И ТипЗнч(ОперацияСписания.КорСубконто1) = Тип("СправочникСсылка.Номенклатура") 
					
					Тогда   
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ОперацияСписания.КорСубконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ОперацияСписания.КорСубконто3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ОперацияСписания.КорСубконто4);
					
				КонецЕсли; 
				
				Проводка.Сумма = - СуммаКорректировки;
				
				Если Проводка.СчетДт.НалоговыйУчет Тогда
					Если ОперацияСписания.НалоговоеНазначениеКор <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУДт = - СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеДт = ОперацияСписания.НалоговоеНазначениеКор;
				КонецЕсли;
				Если Проводка.СчетКт.НалоговыйУчет Тогда
					Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУКт = - СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДопПроводкаКт Тогда
				
				Проводка = Движение.Добавить();
				
				Проводка.Период        = СтруктураДопПараметров.Период;
				Проводка.Регистратор   = СтруктураДопПараметров.Регистратор;
				Проводка.Активность    = Истина;
				Проводка.Организация   = СтруктураДопПараметров.Организация;
				Проводка.Содержание    = "Корректировка стоимости списания";
				
				Проводка.СчетДт = СчетКт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияИсточника.Субконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияИсточника.Субконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияИсточника.Субконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, ПараметрыСостоянияИсточника.Субконто4);
				
				Проводка.СчетКт = ПараметрыСостоянияИсточника.Счет;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыСостоянияИсточника.Субконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыСостоянияИсточника.Субконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, ПараметрыСостоянияИсточника.Субконто3);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПараметрыСостоянияИсточника.Субконто4);
				
				
				Если Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ 
					И Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ 
					И ТипЗнч(ПараметрыСостоянияИсточника.Субконто1) = Тип("СправочникСсылка.Номенклатура") 
					
					Тогда   
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПараметрыСостоянияИсточника.Субконто2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ПараметрыСостоянияИсточника.Субконто3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ПараметрыСостоянияИсточника.Субконто4);
					
				КонецЕсли; 
				
				Проводка.Сумма = - СуммаКорректировки;
				
				Если Проводка.СчетДт.НалоговыйУчет Тогда
					Если ОперацияСписания.НалоговоеНазначениеКор <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУДт = - СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеДт = ОперацияСписания.НалоговоеНазначениеКор;
				КонецЕсли;
				Если Проводка.СчетКт.НалоговыйУчет Тогда
					Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУКт = - СуммаКорректировкиНУ;
					КонецЕсли;
					Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
	КонецЦикла; 
	
	Движение.Отбор.Регистратор.Значение      = СтруктураДопПараметров.Регистратор;
	Движение.Отбор.Регистратор.Использование = Истина;
	Движение.Записать(Ложь);
		
КонецПроцедуры // ДобавитьЗаписиПоВнешнемуСписаниюБух()

// Функция-оболочка, вызывающая корректировку списания. Вызывается из документов:
// КорректировкаСтоимостиСписанияТоваров
Процедура КорректировкаСписания(ДатаНач, ДатаКон, ТаблицаТоваров, РегламентныйДокумент,
								Организация, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете,
								ОтражатьВНалоговомУчете, ДопПараметры = Неопределено, НомерПередела=0,НомерРасчета=0) Экспорт
	
	//Признак того, что в параметр ДопПараметры передана структура и ее необходимо вернуть из процедуры
	
	флТребуетсяВозвратДопПараметров = истина;
	Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
		флТребуетсяВозвратДопПараметров = Ложь;
		ДопПараметры = Новый Структура;
	КонецЕсли;

	ДопПараметры.Вставить("Организация", Организация);
	
	// Приведение структуры доп.параметров к виду структуры параметров из основного алгоритма списания партий
	//
	
	ДопПараметры.Вставить("ОтражатьВУправленческомУчете" , ОтражатьВУправленческомУчете);
	
	ДопПараметры.Вставить("ЕстьСтрокиОтражатьВУправленческомУчете" , ОтражатьВУправленческомУчете);
	
	Если НЕ ДопПараметры.Свойство("КодыОпераций") тогда
		ДопПараметры.Вставить("КодыОпераций", Перечисления.КодыОперацийПартииТоваров);
	КонецЕсли;
	
	Если НЕ РегламентныйДокумент = Неопределено тогда
		ДопПараметры.Вставить("ТипЗначенияРегистратора", ТипЗнч(РегламентныйДокумент));
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		СкорректироватьСписание(ДатаНач, ДатаКон, ТаблицаТоваров, РегламентныйДокумент, ДопПараметры,НомерПередела,НомерРасчета);
	КонецЕсли;	
	
	Если  флТребуетсяВозвратДопПараметров Тогда
		// Последних переделов может быть несколько 
		Если ДопПараметры.Свойство("КорректироватьСтоимостьВозвратовТекущегоМесяца") тогда
			ДопПараметры.Удалить("КорректироватьСтоимостьВозвратовТекущегоМесяца");
		КонецЕсли;
	Иначе
		//необходимо для того, чтобы предотвратить возврат из процедуры мутабельных значений.
		//Если в ДопПараметры не надо ничего возвращать, то переменную необходимо удалить
		ДопПараметры = неопределено;
	КонецЕсли;

КонецПроцедуры // КорректировкаСписания

// Процедура вызова корректировки списания
//
Процедура СкорректироватьСписание(ДатаНач, ДатаКон, ТаблицаТоваров, РегламентныйДокумент, ДопПараметры = Неопределено, НомерПередела = 0, НомерРасчета = 0) Экспорт
	
	Перем НеСписыватьНаПостоянныеЗатраты;
	
	КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
	
	ИмяРесурсаСтоимость = "Стоимость";
	ИмяРесурсаНДС 		= "НДС";
	
	// Признак принадлежности формируемых движений регламентному документу
	ДвиженияПоРегламентномуДокументу = РегламентныйДокумент<>Неопределено;
	
	// Структура общих параметров, используемых в большинстве процедур
	СтруктураПараметров = Новый Структура;
	
	Если ДопПараметры <> Неопределено Тогда
		// Перенесем ключи и значения из исходной структуры
		Для Каждого Элемент Из ДопПараметры Цикл
			СтруктураПараметров.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Приведение к нужному виду
	СтруктураПараметров.Свойство("НеСписыватьНаПостоянныеЗатраты", НеСписыватьНаПостоянныеЗатраты);
	Если НеСписыватьНаПостоянныеЗатраты = Истина Тогда
		СтруктураПараметров.Вставить("НеСписыватьНаПостоянныеЗатраты", Истина);
	Иначе
		СтруктураПараметров.Вставить("НеСписыватьНаПостоянныеЗатраты", Ложь);
	КонецЕсли;
	
	// Сформируем запрос для получения фактических движений 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	
	МассивНоменклатуры = ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");
	МассивДокументовОприходования = ТаблицаТоваров.ВыгрузитьКолонку("ДокументОприходования");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивДокументовОприходования", МассивДокументовОприходования);
	
	// Формирование запроса по списанию
	
	// Общие коды операции, применяемые во всех учетах
	Запрос.УстановитьПараметр("КодОперацииПоступлениеДопРасходов", КодыОпераций.ПоступлениеДопРасходов);
	
	
	МассивСписаниеВНЗП = Новый Массив;
	МассивСписаниеВНЗП.Добавить(КодыОпераций.СписаниеПартийВПроизводствоОперативно);
	
	Запрос.УстановитьПараметр("КодыСписаниеВНЗП", МассивСписаниеВНЗП);
	
	Запрос.УстановитьПараметр("СписаниеПартийПереданныхВПроизводство", КодыОпераций.СписаниеПартийПереданныхВПроизводство);
	
	МассивСписаниеНаСебестоимость = Новый Массив;
	МассивСписаниеНаСебестоимость.Добавить(КодыОпераций.Реализация);
	МассивСписаниеНаСебестоимость.Добавить(КодыОпераций.РеализацияРозница);
	МассивСписаниеНаСебестоимость.Добавить(КодыОпераций.РеализацияКомиссия);
	Запрос.УстановитьПараметр("КодыСписаниеНаСебестоимость", МассивСписаниеНаСебестоимость);
	
	
	Если СтруктураПараметров.НеСписыватьНаПостоянныеЗатраты Тогда
		Запрос.УстановитьПараметр("КодыСписаниеНаЗатраты", Неопределено); // эти движения не учитываются
	Иначе
		Запрос.УстановитьПараметр("КодыСписаниеНаЗатраты", КодыОпераций.СписаниеНаЗатраты);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КодыСписаниеНаБрак", КодыОпераций.СписаниеНаБрак);
	
	Запрос.УстановитьПараметр("КодКомплектация", КодыОпераций.Комплектация);
	
	МассивСписаниеНаСтроительствоОбъектовОС = Новый Массив;
	МассивСписаниеНаСтроительствоОбъектовОС.Добавить(КодыОпераций.СписаниеНаВложенияВоВнеоборотныеАктивы);
	МассивСписаниеНаСтроительствоОбъектовОС.Добавить(КодыОпераций.СписаниеНаСтроительствоОбъектовОС);
	Запрос.УстановитьПараметр("КодыСтроительствоОбъектовОС", МассивСписаниеНаСтроительствоОбъектовОС);
	
	// Все коды внешних списаний
	МассивВнешСписание = Новый Массив;
	МассивВнешСписание.Добавить(КодыОпераций.ВозвратПоставщику);
	МассивВнешСписание.Добавить(КодыОпераций.Комплектация);
	МассивВнешСписание.Добавить(КодыОпераций.ПередачаТарыКонтрагенту);
	МассивВнешСписание.Добавить(КодыОпераций.Реализация);
	МассивВнешСписание.Добавить(КодыОпераций.РеализацияРозница);
	МассивВнешСписание.Добавить(КодыОпераций.РеализацияКомиссия);
	
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеПоИнвентаризации);
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеПоОрдеру);
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеПартийВПроизводствоОперативно);
	
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеНаСтроительствоОбъектовОС);
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеНаВложенияВоВнеоборотныеАктивы);
	МассивВнешСписание.Добавить(КодыОпераций.СписаниеПартийПереданныхВПроизводство);
	
	Если НЕ СтруктураПараметров.НеСписыватьНаПостоянныеЗатраты Тогда
		МассивВнешСписание.Добавить(КодыОпераций.СписаниеНаБрак);
		МассивВнешСписание.Добавить(КодыОпераций.СписаниеНаЗатраты);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КодыСписание", МассивВнешСписание);
	
	ЗаполнитьЗапросПоСписаниюУпр(Запрос, МассивНоменклатуры, СтруктураПараметров);
	
	// Таблица по списанию
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультатаЗапроса.Количество()=0 Тогда
		// Пустая строка для создния требуемых наборов записей, когда есть перемещения без списания
		ТаблицаРезультатаЗапроса.Добавить();
	КонецЕсли;
	
	ПодготовитьТаблицуКорректировкиСписания(ТаблицаРезультатаЗапроса);
	ТаблицаРезультатаЗапроса.ЗаполнитьЗначения(Истина, "ОтражатьВУправленческомУчете");
	
	
	СтруктураПараметров.Вставить("УчетнаяПолитика", УправлениеЗапасамиПартионныйУчет.ПолучитьУчетнуюПолитику(ДатаКон));
	СтруктураПараметров.Вставить("ТаблицаВыполненныхДвижений", ТаблицаРезультатаЗапроса);
	
	СтруктураПараметров.Вставить("РегламентныйДокумент", РегламентныйДокумент);
	
	// Движения - наборы записей по регистрам
	УправлениеЗапасамиПартионныйУчет.СоздатьНаборыЗаписей(СтруктураПараметров, ТаблицаРезультатаЗапроса);
	
	УправлениеЗапасамиПартионныйУчет.ПодготовитьНаборыЗаписей(СтруктураПараметров, ТаблицаРезультатаЗапроса, РегламентныйДокумент.Дата, РегламентныйДокумент, Ложь);
	
	// Вызов процедуры расчета по средней
	РассчитатьСписаниеПоСредней(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураПараметров);
	
	УправлениеЗапасамиПартионныйУчет.ЗаписатьДвиженияДокумента(СтруктураПараметров, ТаблицаРезультатаЗапроса, Ложь);
	
КонецПроцедуры

// Приведение таблицы корректировки списания к требуемому виду
//
Процедура ПодготовитьТаблицуКорректировкиСписания(ТаблицаРезультатаЗапроса)
	
	ДобавляемыеПоля = "ОтражатьВУправленческомУчете,ОтражатьВБухгалтерскомУчете,ОтражатьВНалоговомУчете,
					  |НоменклатураНовая,КоличествоПоступление,СкладПолучатель,
					  |ИзменитьХарактеристику,ИзменитьСерию,КачествоНовое,ВедениеУчетаПоПроектам,НоменклатураКомплекта,ХарактеристикаКомплекта,ВестиПартионныйУчетПоСериям";
	СтруктураДобавляемыхПолей = Новый Структура(ДобавляемыеПоля,"Булево","Булево","Булево",,"Число",,"Булево","Булево",,"Булево",,,"Булево");
	
	Для Каждого Поле Из СтруктураДобавляемыхПолей цикл 
		Если ТаблицаРезультатаЗапроса.Колонки.Найти(Поле.Ключ) = Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Поле.Значение) тогда
				ТипПоля = Неопределено;
			Иначе
				ТипПоля = Новый ОписаниеТипов(Поле.Значение);
			КонецЕсли;
			ТаблицаРезультатаЗапроса.Колонки.Добавить(Поле.Ключ, ТипПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуОперацийСписания(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров)
	ИспользуемыеКлассыСчетовРасходов = БухгалтерскийУчет.ПолучитьИспользуемыеКлассыСчетовРасходов(СтруктураДопПараметров.Период, СтруктураДопПараметров.Организация);
	Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс9 Тогда
		Использовать8Класс = Ложь;
	Иначе
		Использовать8Класс = Истина;
	КонецЕсли; 	

	Учет          = СтруктураДопПараметров.Учет;
	
	Запрос = Новый Запрос;
	
	Если Использовать8Класс Тогда
	    МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйДвиженияССубконто.Регистратор,
		|	ХозрасчетныйДвиженияССубконто.НомерСтроки,
		|	ХозрасчетныйДвиженияССубконто.НомерИсходнойПроводки,
		|	ХозрасчетныйДвиженияССубконто.СчетДт,
		|	ХозрасчетныйДвиженияССубконто.НалоговоеНазначениеДт,
		|	ХозрасчетныйДвиженияССубконто.СубконтоДт1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоДт2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоДт3,
		|	ХозрасчетныйДвиженияССубконто.СубконтоДт4,   
		|	ХозрасчетныйДвиженияССубконто.СчетКт,
		|	ХозрасчетныйДвиженияССубконто.НалоговоеНазначениеКт,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт4,    
		|	ХозрасчетныйДвиженияССубконто.СчетДополнительный,
		|	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.КоличествоКт, 0) КАК КоличествоКт,
		|	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.СуммаНУКт, 0) КАК СуммаНУ
		|ПОМЕСТИТЬ ТаблицаДвиженийССубконто
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		|			&ДатаНач,
		|			&ДатаКон,
		|			(СчетДополнительный В (&СписокСчетов)
		|				ИЛИ СчетКт В (&СписокСчетов)
		|					И СчетДополнительный = &ПустойСчет)
		|				И Организация = &Организация
		|	И  (ВЫБОР КОГДА (Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя) 
		|		          ТОГДА ВЫРАЗИТЬ(Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата > &ДатаНач И НЕ (ВЫРАЗИТЬ(Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата) ЕСТЬ NULL 
		|                 ИНАЧЕ ИСТИНА 
		|           КОНЕЦ) 
		|	 И
		|	(НЕ (Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену И (ЕСТЬNULL(КоличествоКт, 0) < 0 ИЛИ ЕСТЬNULL(Сумма, 0) < 0))) 
		|				И (НЕ(СчетДополнительный В (&СписокСчетов)
		|						И Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену
		|						И ЕСТЬNULL(Сумма, 0) < 0))
		|				И (Регистратор ССЫЛКА Документ.ЗакрытиеМесяца
		|					ИЛИ (ЕСТЬNULL(КоличествоКт, 0) <> 0
		|						ИЛИ ЕСТЬNULL(Сумма, 0) <> 0)
		|			И (НЕ Регистратор ССЫЛКА Документ.ПеремещениеТоваров ИЛИ (Регистратор ССЫЛКА Документ.ПеремещениеТоваров И СчетДт В (&СписокИсключаемыхСчетов)))
		|    		)
		|	) КАК ХозрасчетныйДвиженияССубконто";
		
		Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
		Запрос.УстановитьПараметр("Организация", СтруктураДопПараметров.Организация);
		Запрос.УстановитьПараметр("СписокСчетов", 				СтруктураДопПараметров.СписокСчетов);
		Запрос.УстановитьПараметр("СписокИсключаемыхСчетов",	СтруктураДопПараметров.СписокИсключаемыхСчетов);
		Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		Запрос.УстановитьПараметр("СписокТоваров", ТаблицаТоваров);
		
		Запрос.Выполнить();		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвиженийССубконто.Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДвиженийССубконто.Регистратор),
		|	ТаблицаДвиженийССубконто.СчетДт КАК КорСчет,
		|	ТаблицаДвиженийССубконто.НалоговоеНазначениеДт КАК НалоговоеНазначениеКор,
		|	ТаблицаДвиженийССубконто.НалоговоеНазначениеКт КАК НалоговоеНазначение,
		|	ТаблицаДвиженийССубконто.СубконтоДт1 КАК КорСубконто1,
		|	ТаблицаДвиженийССубконто.СубконтоДт2 КАК КорСубконто2,
		|	ТаблицаДвиженийССубконто.СубконтоДт3 КАК КорСубконто3,
		|	ТаблицаДвиженийССубконто.СубконтоДт4 КАК КорСубконто4,
        |	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто.СчетДополнительный
		|		ИНАЧЕ ТаблицаДвиженийССубконто.СчетКт
		|	КОНЕЦ КАК Счет,
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто1.СубконтоКт1
		|		ИНАЧЕ ТаблицаДвиженийССубконто.СубконтоКт1
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто1.СубконтоКт2
		|		ИНАЧЕ ТаблицаДвиженийССубконто.СубконтоКт2
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто1.СубконтоКт3
		|		ИНАЧЕ ТаблицаДвиженийССубконто.СубконтоКт3
		|	КОНЕЦ КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто1.СубконтоКт4
		|		ИНАЧЕ ТаблицаДвиженийССубконто.СубконтоКт4
		|	КОНЕЦ КАК Субконто4,  
		|	ТаблицаДвиженийССубконто.Сумма КАК СуммаОборотКт,
		|	ТаблицаДвиженийССубконто.СуммаНУ КАК СуммаНУОборотКт,
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|			ТОГДА ТаблицаДвиженийССубконто1.КоличествоКт
		|		ИНАЧЕ ТаблицаДвиженийССубконто.КоличествоКт
		|	КОНЕЦ КАК КоличествоОборотКт
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	ТаблицаДвиженийССубконто КАК ТаблицаДвиженийССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДвиженийССубконто КАК ТаблицаДвиженийССубконто1
		|		ПО ТаблицаДвиженийССубконто.Регистратор = ТаблицаДвиженийССубконто1.Регистратор
		|			И (ВЫБОР
		|				КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|					ТОГДА ТаблицаДвиженийССубконто.НомерИсходнойПроводки + 1 = ТаблицаДвиженийССубконто1.НомерСтроки
		|				ИНАЧЕ ТаблицаДвиженийССубконто.НомерСтроки = ТаблицаДвиженийССубконто1.НомерИсходнойПроводки + 1
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|					ТОГДА ТаблицаДвиженийССубконто.СчетДополнительный = ТаблицаДвиженийССубконто1.СчетКт
		|				ИНАЧЕ ТаблицаДвиженийССубконто.СчетКт = ТаблицаДвиженийССубконто1.СчетДополнительный
		|			   КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ТаблицаДвиженийССубконто.СчетДополнительный В (&СписокСчетов)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаДвиженийССубконто1.СчетДт ЕСТЬ NULL 
		|		КОНЕЦ";
		
		Запрос.Выполнить();   					
	КонецЕсли; 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Счет,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто1 ТОГДА ВложенныйЗапрос.Субконто1 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто1,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто2 ТОГДА ВложенныйЗапрос.Субконто2 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто2,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто3 ТОГДА ВложенныйЗапрос.Субконто3 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто3,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто4 ТОГДА ВложенныйЗапрос.Субконто4 ИНАЧЕ Неопределено КОНЕЦ КАК Субконто4,
	|	ВложенныйЗапрос.КорСчет,
	|	ВложенныйЗапрос.НалоговоеНазначение,
	|	ВложенныйЗапрос.НалоговоеНазначениеКор,
	|	ВложенныйЗапрос.КорСубконто1,
	|	ВложенныйЗапрос.КорСубконто2,
	|	ВложенныйЗапрос.КорСубконто3,
	|	ВложенныйЗапрос.КорСубконто4,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаНУ) КАК СуммаНУ,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаСписания.Счет КАК Счет,
	|		ТаблицаСписания.Субконто1 КАК Субконто1,
	|		ТаблицаСписания.Субконто2 КАК Субконто2,
	|		ТаблицаСписания.Субконто3 КАК Субконто3,
	|		ТаблицаСписания.Субконто4 КАК Субконто4,
	|		ТаблицаСписания.КорСчет КАК КорСчет,
	|		ТаблицаСписания.НалоговоеНазначение КАК НалоговоеНазначение,	
	|		ТаблицаСписания.НалоговоеНазначениеКор КАК НалоговоеНазначениеКор,
	|		ВЫБОР КОГДА (ТаблицаСписания.КорСчет В (&СписокСчетов)) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК КорСчетНоменклатуры,
	|		ТаблицаСписания.КорСубконто1 КАК КорСубконто1,
	|		ТаблицаСписания.КорСубконто2 КАК КорСубконто2,
	|		ТаблицаСписания.КорСубконто3 КАК КорСубконто3,
	|		ТаблицаСписания.КорСубконто4 КАК КорСубконто4,
	|		ВЫБОР КОГДА ТаблицаСписания.Субконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.Субконто1 КОГДА ТаблицаСписания.Субконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.Субконто2 КОГДА ТаблицаСписания.Субконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.Субконто3 КОГДА ТаблицаСписания.Субконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.Субконто4 ИНАЧЕ NULL КОНЕЦ КАК Номенклатура,
	|		ВЫБОР КОГДА ТаблицаСписания.КорСубконто1 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.КорСубконто1 КОГДА ТаблицаСписания.КорСубконто2 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.КорСубконто2 КОГДА ТаблицаСписания.КорСубконто3 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.КорСубконто3 КОГДА ТаблицаСписания.КорСубконто4 ССЫЛКА Справочник.Номенклатура ТОГДА ТаблицаСписания.КорСубконто4 ИНАЧЕ NULL КОНЕЦ КАК КорНоменклатура,
	|		ВЫБОР КОГДА (ТаблицаСписания.СуммаОборотКт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ТаблицаСписания.СуммаОборотКт КОНЕЦ КАК Сумма,
	|		ВЫБОР КОГДА (ТаблицаСписания.СуммаНУОборотКт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ТаблицаСписания.СуммаНУОборотКт КОНЕЦ КАК СуммаНУ,
	|		ВЫБОР КОГДА (ТаблицаСписания.КоличествоОборотКт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ТаблицаСписания.КоличествоОборотКт КОНЕЦ КАК Количество
	|	ИЗ " + ?(Использовать8Класс, " ТаблицаДвижений КАК ТаблицаСписания ", "	
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В (&СписокСчетов), , Организация = &Организация , , ) КАК ТаблицаСписания
	|	
	|	ГДЕ
	|	 (ВЫБОР КОГДА (ТаблицаСписания.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя) 
	|		          ТОГДА ВЫРАЗИТЬ(ТаблицаСписания.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата > &ДатаНач И НЕ (ВЫРАЗИТЬ(ТаблицаСписания.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Сделка.Дата) ЕСТЬ NULL 
	|                 ИНАЧЕ ИСТИНА 
	|           КОНЕЦ) 
	|	 И
	|	(НЕ (ТаблицаСписания.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену И (ТаблицаСписания.КоличествоОборотКт < 0 ИЛИ ТаблицаСписания.СуммаОборотКт < 0))) 
    |		 И 	
	|		((ТаблицаСписания.Регистратор ССЫЛКА Документ.ЗакрытиеМесяца) ИЛИ
	|		(ТаблицаСписания.КоличествоОборотКт <> 0 ИЛИ ТаблицаСписания.СуммаОборотКт <> 0) И (НЕ ТаблицаСписания.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ИЛИ (ТаблицаСписания.Регистратор ССЫЛКА Документ.ПеремещениеТоваров И (ТаблицаСписания.КорСчет В (&СписокИсключаемыхСчетов)))))") + "
	|		) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Хозрасчетный.Ссылка КАК Счет,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто1,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто2,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто3,
	|			МАКСИМУМ(ВЫБОР КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 4 ТОГДА ХозрасчетныйВидыСубконто.Суммовой ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Субконто4
	|		ИЗ
	|			ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|				ПО ХозрасчетныйВидыСубконто.Ссылка = Хозрасчетный.Ссылка
	|		
	|		ГДЕ
	|			Хозрасчетный.Ссылка В (&СписокСчетов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Хозрасчетный.Ссылка) КАК СуммовойУчет
	|		ПО ВложенныйЗапрос.Счет = СуммовойУчет.Счет
	|
	|ГДЕ
	|	((НЕ ВложенныйЗапрос.КорСчетНоменклатуры) ИЛИ
	|	(ВЫБОР КОГДА (ВложенныйЗапрос.КорНоменклатура) ЕСТЬ NULL ТОГДА ИСТИНА ИНАЧЕ ВложенныйЗапрос.Номенклатура <> ВложенныйЗапрос.КорНоменклатура КОНЕЦ))";
	
	Если ТаблицаТоваров <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И
		|		(ВложенныйЗапрос.Номенклатура В (&СписокТоваров))";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Счет,
	|	ВложенныйЗапрос.КорСчет,
	|	ВложенныйЗапрос.НалоговоеНазначение,
	|	ВложенныйЗапрос.НалоговоеНазначениеКор,
	|	ВложенныйЗапрос.КорСубконто1,
	|	ВложенныйЗапрос.КорСубконто2,
	|	ВложенныйЗапрос.КорСубконто3,
	|	ВложенныйЗапрос.КорСубконто4,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто1 ТОГДА ВложенныйЗапрос.Субконто1 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто2 ТОГДА ВложенныйЗапрос.Субконто2 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто3 ТОГДА ВложенныйЗапрос.Субконто3 ИНАЧЕ Неопределено КОНЕЦ,
	|	ВЫБОР КОГДА СуммовойУчет.Субконто4 ТОГДА ВложенныйЗапрос.Субконто4 ИНАЧЕ Неопределено КОНЕЦ";
	
	Если Не Использовать8Класс Тогда  	
		Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
		Запрос.УстановитьПараметр("Организация", СтруктураДопПараметров.Организация);
		Запрос.УстановитьПараметр("СписокСчетов", СтруктураДопПараметров.СписокСчетов);
		Запрос.УстановитьПараметр("СписокИсключаемыхСчетов", СтруктураДопПараметров.СписокИсключаемыхСчетов);
		Запрос.УстановитьПараметр("СчетаРасчетов", ПолучитьСчетаРасчетов());
		Запрос.УстановитьПараметр("СписокТоваров", ТаблицаТоваров);
	КонецЕсли;
	
	Таб = Запрос.Выполнить().Выгрузить();
	Таб.Индексы.Добавить("Счет,Субконто1,Субконто2,Субконто3,Субконто4");
	
	СтруктураДопПараметров.Вставить("ТаблицаОперацийСписания", Таб);
	
	Возврат Таб;
		
КонецФункции // ПолучитьТаблицуОперацийСписания()

Процедура КорректировкаСтоимости(МассивНоменклатуры, НачДата, КонДата, СтруктураДопПараметров) Экспорт

	УстановитьСписокСчетовУчетаНоменклатуры(СтруктураДопПараметров);
	УстановитьСписокСчетовПоставщиков(СтруктураДопПараметров);
	
	// В структуру дополнительных параметров добавим таблицу операции списания
	ПолучитьТаблицуОперацийСписания(МассивНоменклатуры, НачДата, КонДата, СтруктураДопПараметров);
	
	РассчитатьСписаниеПоСреднейБух(МассивНоменклатуры, НачДата, КонДата, СтруктураДопПараметров);

КонецПроцедуры

// Выполняет корреспондирующее движение, связанное со списанием партии
//
// Параметры:
//	Нет.
//
Процедура ВыполнитьКорДвижение(РегистрУчета, СтрокаДокумента, СтруктураПараметров, Движение) Экспорт
	
	УправлениеЗапасамиПартионныйУчет.ВыполнитьКорДвижениеУпр(РегистрУчета, УправлениеЗапасамиПартионныйУчет.ПолучитьНаправлениеСписанияПоКодуОперации(СтрокаДокумента.КодОперацииПартииТоваров, СтрокаДокумента.СтатьяЗатрат), СтрокаДокумента, СтруктураПараметров, Движение);
	
	// Сюда можно добавить вызов процедур для выполнения движений по другим учетам
	
КонецПроцедуры // ВыполнитьКорДвижение()

////////////////////////////////////////////////////////////////////////////////
// КОРРЕКТИРОВКА СУММ СПИСАНИЙ, ВЫПОЛНЕННЫХ В ТЕЧЕНИЕ МЕСЯЦА (ТОЛЬКО СУММОВЫЕ ДВИЖЕНИЯ)

////////////////////////////////////////////////////////////////////////////////
// Процедуры списания по-средней, зависящие от структуры данных конфигурации

// СписаниеПоСредней
//
// Параметры:
//	ТаблицаТоваров - содержит товары, списание которых необходимо усреднить. 
//	Каждая колонка соответствует одному из постоянных параметров товара, не изменяемых в ходе перемещений. 
//	По остальным параметрам выполняется усреднение
//
Процедура РассчитатьСписаниеПоСредней(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	
	// Основное допущение данного метода - игнорирование замкнутой цепочки перемещений между состояниями ("холостого хода"):
	// считаем, что если товар в ходе перемещений снова попал в исходное состояние, то он как бы не перемещался, 
	// это движение можно исключить из общего оборота, а стоимость движения принять равной 0. Цепочки перемещений 
	// таким образом размыкаются, что позволяет рассчитать стоимости движений, начиная от конца цепочки.
	
	// Получим все состояния для товара, которые он принимал за период в виде таблицы
	//	---------------------------------------------------------------------------------------------------------------------------------
	// |Состояние 1 (Источник) |Состояние 2 (Приемник)| Перемещаемое количество| Стоимость (нужна для упрощения последующей корректировки)
	
	// Последовательно обходя состояния, выделим контуры (пути, начала и концы которых совпадают)
	// В каждом контуре найдем количество, которое совершило перемещение по замкнутому кругу ("холостой ход"), 
	// и уменьшим каждое движение из контура на данное количество.
	// Будем выбирать другие состояния для получения всех контуров и применим к ним то же правило.
	
	// После нахождения контуров в графах перемещений и сокращения "холостого хода" получаем совокупность разомкнутых 
	// путей перехода товара между состояниями (остовные деревья). Внутри каждой такой цепочки выполняем расчет.
	// Важно:  в общем случае результат сокращения зависит от последовательности обхода контуров, поэтому
	// для повторяемости результата она должна подчиняться какому-либо правилу (например, чтобы сводные перемещения
	// упорядочивались по возрастанию даты первого перемещения)
	
	// Получим таблицу перемещений, содержащую суммарные перемещения между состояниями
	
	// Получаемая таблица должна содержать колонку "Количество", "Стоимость" и колонки, описывающие старое и новое состояние,
	// причем имена колонок нового состояния заканчиваются на ПрефиксПараметровНовогоСостояния
	ПрефиксПараметровНовогоСостояния="_НовоеСостояние";
	
	Таб = ПолучитьТаблицуПеремещений(ТаблицаТоваров, ДатаНач, ДатаКон, ПрефиксПараметровНовогоСостояния, СтруктураДопПараметров);
	
	
	//1. Приведем переданную таблицу перемещений к тербуемому виду:
	// Таблица имеет колонки Источник, Приемник, Количество
	// строка таблицы соответствует перемещению из состояния 1 в состояние 2, перемещения не повторяются.
	
	// Количество колонок без ПрефиксПараметровНовогоСостояния должно быть равно количеству колонок с ПрефиксПараметровНовогоСостояния
	// Сформируем также структуру, которая содержит параметры состояния товара
	СтруктураСостояния = Новый Структура;
	
	Инд=0;
	Пока Инд< Таб.Колонки.Количество() Цикл
		
		Колонка = Таб.Колонки[Инд];
		
		Если ВРег(Колонка.Имя) <> ВРег("Количество") 
			И ВРег(Колонка.Имя) <> ВРег("Стоимость") 
			И ВРег(Колонка.Имя) <> ВРег("НДС") Тогда
			
			// Колонки, оканчивающиеся на ПрефиксПараметровНовогоСостояния - правые (новое состояние), им должны соответствовать такие же левые, оканчивающиеся на ПрефиксПараметровНовогоСостояния
			Если Прав(Колонка.Имя, СтрДлина(ПрефиксПараметровНовогоСостояния)) = ПрефиксПараметровНовогоСостояния  Тогда
				ИмяСоответствующейКолонки=Лев(Колонка.Имя, СтрДлина(Колонка.Имя)-СтрДлина(ПрефиксПараметровНовогоСостояния));
				Если Таб.Колонки.Найти(ИмяСоответствующейКолонки)=Неопределено Тогда
					Таб.Колонки.Добавить(ИмяСоответствующейКолонки, Колонка.ТипЗначения)
				КонецЕсли;
				// И наоборот, колонки, не оканчивающиеся на ПрефиксПараметровНовогоСостояния - левые (новое состояние), им должны соответствовать такие же правые, оканчивающиеся на ПрефиксПараметровНовогоСостояния
			Иначе
				ИмяСоответствующейКолонки=Колонка.Имя+ПрефиксПараметровНовогоСостояния;
				Если Таб.Колонки.Найти(ИмяСоответствующейКолонки)=Неопределено Тогда
					Таб.Колонки.Добавить(ИмяСоответствующейКолонки, Колонка.ТипЗначения)
				КонецЕсли;
				
				СтруктураСостояния.Вставить(Колонка.Имя);
			КонецЕсли;
		КонецЕсли;
		
		Инд=Инд+1;
	КонецЦикла;
	
	// В таблице перемещений заменим параметры состояний индексами состояний, сами параметры будут храниться в СоотвПараметровСостояний
	
	Таб.Колонки.Добавить("Источник", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));
	Таб.Колонки.Добавить("Приемник", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));
	
	СоотвПараметровСостояний = Новый Соответствие;
	
	Для Каждого Строка Из Таб Цикл // поиск выплняется полным перебором
		
		// Состояния-источники
		// Найдем состояние в соответсвии
		НайденоСостояние=Ложь;
		Для Каждого ЭлементСостояние Из СоотвПараметровСостояний Цикл
			
			НайденоСостояние=Истина;
			Для Каждого Элемент Из СтруктураСостояния Цикл
				НайденоСостояние = НайденоСостояние И (ЭлементСостояние.Значение[Элемент.Ключ] = Строка[Элемент.Ключ]);
			КонецЦикла;
			
			Если НайденоСостояние Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденоСостояние Тогда
			ИндексСостояния = ЭлементСостояние.Ключ;
		Иначе
			// Переносим в соответствие
			СтрСост = Новый Структура;
			Для Каждого Элемент Из СтруктураСостояния Цикл
				СтрСост.Вставить(Элемент.Ключ, Строка[Элемент.Ключ]);
			КонецЦикла;
			
			ИндексСостояния = СоотвПараметровСостояний.Количество();
			СоотвПараметровСостояний.Вставить(ИндексСостояния, СтрСост);
		КонецЕсли;
		
		// Оставим в таблице ссылку на состояние
		Строка.Источник = ИндексСостояния;
		
		// То же самое для состояний-приемников
		// Найдем состояние в соответствии
		НайденоСостояние=Ложь;
		Для Каждого ЭлементСостояние Из СоотвПараметровСостояний Цикл
			
			НайденоСостояние=Истина;
			Для Каждого Элемент Из СтруктураСостояния Цикл
				НайденоСостояние = НайденоСостояние И (ЭлементСостояние.Значение[Элемент.Ключ] = Строка[Элемент.Ключ+ПрефиксПараметровНовогоСостояния]);
			КонецЦикла;
			
			Если НайденоСостояние Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденоСостояние Тогда
			ИндексСостояния = ЭлементСостояние.Ключ;
		Иначе
			// Переносим в соответствие
			СтрСост = Новый Структура;
			Для Каждого Элемент Из СтруктураСостояния Цикл
				СтрСост.Вставить(Элемент.Ключ, Строка[Элемент.Ключ+ПрефиксПараметровНовогоСостояния]);
			КонецЦикла;
			
			ИндексСостояния = СоотвПараметровСостояний.Количество();
			СоотвПараметровСостояний.Вставить(ИндексСостояния, СтрСост);
		КонецЕсли;
		
		// Оставим в таблице ссылку на состояние
		Строка.Приемник = ИндексСостояния;
		
	КонецЦикла;
	
	// "Свернем" встречные перемещения: вместо двух перемещений типа 1->2 и 2->1 оставим одно 
	// с количеством |Кол12 - Кол21| в направлении большего перемещения.
	
	// Проведем следующее преобразование: повернем пары так, чтобы количество перемещения стало положительным
	Для Каждого Строка Из Таб Цикл
		
		Если Строка.Количество<0 Тогда
			Буф=Строка.Приемник;
			Строка.Приемник = Строка.Источник;
			Строка.Источник = Буф;
			Строка.Количество 	= - Строка.Количество;
			Строка.Стоимость 	= - Строка.Стоимость;
			Строка.НДС 			= - Строка.НДС;
		КонецЕсли;
	КонецЦикла;
	
	// "Свертка" встречных перемещений
	Инд=0;
	КолВо = Таб.Количество();
	
	Пока Инд<КолВо Цикл
		
		Инд2 = Инд+1;
		Пока Инд2<КолВо Цикл
			
			Строка2 = Таб[Инд2];
			Строка  = Таб[Инд];
			
			// Если найдено соответствующее встречное перемещение
			Если Строка.Источник = Строка2.Приемник
				И Строка.Приемник = Строка2.Источник Тогда
				
				Если Строка.Количество>Строка2.Количество Тогда
					УменьшитьНаКоличество 	= Строка2.Количество;
					УменьшитьНаСтоимость 	= Строка2.Стоимость;
					УменьшитьНаНДС 			= Строка2.НДС;
				Иначе
					УменьшитьНаКоличество 	= Строка.Количество;
					УменьшитьНаСтоимость 	= Строка.Стоимость;
					УменьшитьНаНДС 			= Строка.НДС;
				КонецЕсли;
				
				Строка.Количество  	= Строка.Количество  	- УменьшитьНаКоличество;
				Строка2.Количество 	= Строка2.Количество 	- УменьшитьНаКоличество;
				
				// То же самое - со стоимостью
				Строка.Стоимость  	= Строка.Стоимость  	- УменьшитьНаСтоимость;
				Строка2.Стоимость  	= Строка2.Стоимость  	- УменьшитьНаСтоимость;
				
				// То же самое - с НДС
				Строка.НДС  		= Строка.НДС  			- УменьшитьНаНДС;
				Строка2.НДС  		= Строка2.НДС  			- УменьшитьНаНДС;
				
				// На этом обход можно прервать: быть не более одной пары встречных перемещений
				Прервать;
				
			Иначе
				Инд2 = Инд2+1;
			КонецЕсли;
			
		КонецЦикла;
		
		Инд = Инд+1;
		
	КонецЦикла;
	
	// Удалим обнулившиеся строки
	
	КолВо = Таб.Количество();
	Инд=0;
	Пока Инд<КолВо Цикл
		
		Строка  = Таб[Инд];
		
		Если Строка.Количество = 0 Тогда
			Таб.Удалить(Строка);
			
			КолВо = КолВо-1;
		Иначе
			Инд=Инд+1;
		КонецЕсли;
	КонецЦикла;
	
	
	// Получили таблицу перемещений в требуемом формате
	ТаблицаПеремещений = Таб;	
	
	// Таблица перемещений содержит несколько несвязанных частей, относящихся к отдельным партиям - строкам таблицы ТаблицаТоваров
	
	// Обработка перемещений: разрыв контуров
	// Получим наборы смежных вершин для каждой вершины
	// Соотв СмежныеВершины Вершина, СмежныеВершины
	
	Источники = Новый Соответствие;
	Приемники = Новый Соответствие;
	МассивНачалДеревьев = Новый Массив;
	
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		ПараметрыИсточника = Источники[Строка.Источник];
		Если ПараметрыИсточника = Неопределено Тогда
			СмежныеВершины= Новый Соответствие;
			ПараметрыИсточника = Новый Структура("Пройден, СмежныеВершины", Ложь, СмежныеВершины);
		КонецЕсли;
		
		ПараметрыИсточника.СмежныеВершины.Вставить(Строка.Приемник, ТаблицаПеремещений.Индекс(Строка)); // во вложенной структуре храним смежную вершину и номер строки перемещения
		
		Источники.Вставить(Строка.Источник, ПараметрыИсточника);
		
	КонецЦикла;
	
	// Чтобы рассчитать перемещения, заменим каждый связный граф перемещений его остовным дерево
	// Для этого обойдем их все, найдем и разорвем все контуры по предложенному выше правилу.
	Для Каждого Элемент Из Источники Цикл
		ПройденныеВершины = Новый Соответствие;
		НомерВершины = Элемент.Ключ;
		ПройденныеВершины.Вставить(НомерВершины, -1);
		Если НЕ Элемент.Значение.Пройден Тогда // если от вершины еще не строился контур, обрабатываем
			РазорватьКонтуры(НомерВершины, Источники, ПройденныеВершины, ТаблицаПеремещений);
		КонецЕсли;
	КонецЦикла;
	
	// После этого таблица содержит незамкнутую последовательность перемещений. 
	// Стоимость перемещений с количеством = 0 в таблице тоже должна быть приведена к 0.
	
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		Если Строка.Количество=0 Тогда
			
			ДобавитьЗаписиПоПеремещению(СоотвПараметровСостояний[Строка.Источник], СоотвПараметровСостояний[Строка.Приемник], -Строка.Стоимость, -Строка.НДС, СтруктураДопПараметров)
			
		Иначе
			
			Приемники.Вставить(Строка.Приемник, Строка.Приемник);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Теперь нужно выделить отдельные деревья, определить среднюю стоимость для каждого дерева, 
	// и начиная с самого начала каждого дерева последовательно рассчитать стоимость для каждого состояния/перемещения
	
	// Найдем начало каждого дерева - его нет в приемниках
	Для каждого Строка Из ТаблицаПеремещений Цикл
		
		// Анализируем только ненулевые дуги
		Если Строка.Количество<>0 Тогда
			
			// Если источника нет среди приемников, значит это начало дерева
			Если Приемники[Строка.Источник]=Неопределено Тогда
				
				ВершинаНайдена = Ложь; // признак того, что вершина уже есть в массиве
				Для Каждого НачалоДерева Из МассивНачалДеревьев Цикл
					
					// Такая вершина уже имеется в списке начал
					Если Строка.Источник = НачалоДерева Тогда
						ВершинаНайдена = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ВершинаНайдена Тогда
					МассивНачалДеревьев.Добавить(Строка.Источник);
				КонецЕсли;
			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// На данном этапе нужна информация о начальном состоянии и внешнем поступлении в каждую вершину
	
	// Будем использовать список вершин, для каждой из которых указаны смежные вершины - приемники и 
	Вершины = Новый Соответствие; // здесь нам понадобится общее количество источников, приемники
	Для Каждого Строка Из ТаблицаПеремещений Цикл
		
		Если Строка.Количество=0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Обработаем источник
		ПодчСтруктура = Вершины[Строка.Источник];
		Если ПодчСтруктура=Неопределено Тогда
			ПодчСтруктура = Новый Структура("КоличествоИсточников, Приемники, КоличествоРассчитанныхВходов", 0, Новый Соответствие, 0);
		КонецЕсли;
		
		ПодчСтруктура.Приемники.Вставить(Строка.Приемник, Новый Структура("Количество, Стоимость, НДС", Строка.Количество, Строка.Стоимость, Строка.НДС)); // Вместе с вершиной-приемником запоминаем количество перемещения
		
		Вершины.Вставить(Строка.Источник, ПодчСтруктура);
		
		// Обработаем приемник
		ПодчСтруктура = Вершины[Строка.Приемник];
		Если ПодчСтруктура=Неопределено Тогда
			ПодчСтруктура = Новый Структура("КоличествоИсточников, Приемники, КоличествоРассчитанныхВходов", 1, Новый Соответствие, 0);
		Иначе
			ПодчСтруктура.КоличествоИсточников = ПодчСтруктура.КоличествоИсточников+1;
		КонецЕсли;
		
		Вершины.Вставить(Строка.Приемник, ПодчСтруктура);
	КонецЦикла;
	
	// В структуру Вершины нужно добавить данные о начальном остатке и внешнем поступлении для каждого из состояний,
	// Можно также добавить состояний, не участвовавших в перемещениях, тогда для них тоже будет рассчитано внешнее списание
	МассивДобавленныеВершины = Новый Массив;
	ДобавитьНачальныйОстатокИВнешнееПоступление(ТаблицаТоваров, Вершины, СоотвПараметровСостояний, ДатаНач, ДатаКон, СтруктураДопПараметров, МассивДобавленныеВершины);
	
	// Добавдленные состояния возвращаются специальным массивом, который добавляется к началам деревьев
	Для Каждого Элемент Из МассивДобавленныеВершины Цикл
		МассивНачалДеревьев.Добавить(Элемент)
	КонецЦикла;
	
	// Теперь будем обходить деревья с начала, и рассчитывать состояния и переходы между ними
	Для Каждого НачалоДерева Из МассивНачалДеревьев Цикл
		РассчитатьПуть(НачалоДерева, Вершины, СоотвПараметровСостояний, СтруктураДопПараметров);
	КонецЦикла;
	
КонецПроцедуры // СписаниеПоСредней()

// Находит контуры и разрывает их, сокращая на минимальное количество
//
// Параметры:
//	Нет.
//
Процедура РазорватьКонтуры(НомерИсхВершины, Источники, ПройденныеВершины, ТаблицаПеремещений)
	
	Приемники = Источники[НомерИсхВершины].СмежныеВершины;
	
	Для Каждого ЭлементВершина Из Приемники Цикл
		
		НомерВершины=ЭлементВершина.Ключ;
		ИндСтрокиПеремещения=ЭлементВершина.Значение;
		
		// Найдем каждую вершину-приемник в списке источников
		ПараметрыИсточника = Источники[НомерВершины];
		Если ПараметрыИсточника = Неопределено Тогда
			Продолжить; // это висячая вершина (степени 1)
		КонецЕсли;
		СмежныеВершины = ПараметрыИсточника.СмежныеВершины;
		
		// Неплохо бы запоминать уже пройденные контуры, чтобы не разбирать уже разобранные
		// Контур нужно идентифицировать последовательностью входящих в него вершин.
		
		// Проверим на замыкание
		Если ПройденныеВершины[НомерВершины]<>Неопределено Тогда
			
			// Контур найден: можно сокращать на мин. количество перемещения
			
			// Найдем дугу контура с мин. количеством
			
			// Начнем с текущей
			СтрокаЗамыкающая=ТаблицаПеремещений[ИндСтрокиПеремещения];
			МинКоличество=СтрокаЗамыкающая.Количество;
			ИндСтрокиСМинКоличеством = ИндСтрокиПеремещения;
			
			Инд=0;
			НачалсяКонтур = Ложь; // флаг начала контура
			Для Каждого Элемент Из ПройденныеВершины Цикл
				
				// Найдем начало контура
				НачалсяКонтур = НачалсяКонтур ИЛИ (Элемент.Ключ = НомерВершины);
				
				Если НачалсяКонтур Тогда
					Если Инд>0 Тогда // в первом элементе нет ссылки на строку
						Строка=ТаблицаПеремещений[Элемент.Значение];
						Если Строка.Количество < МинКоличество Тогда 
							МинКоличество = Строка.Количество;
							ИндСтрокиСМинКоличеством = Элемент.Значение;
						КонецЕсли;
					КонецЕсли;
					Инд=Инд+1;
				КонецЕсли;
			КонецЦикла;
			
			// Вычтем найденное минимальное количество из всех дуг контура
			
			// ... из замыкающей дуги
			СтрокаЗамыкающая.Количество = СтрокаЗамыкающая.Количество - МинКоличество;
			
			// ... из всех пройденных дуг
			Инд=0;
			НачалсяКонтур = Ложь; // флаг начала контура
			Для Каждого Элемент Из ПройденныеВершины Цикл
				
				// Найдем начало контура
				НачалсяКонтур = НачалсяКонтур ИЛИ (Элемент.Ключ = НомерВершины);
				
				Если НачалсяКонтур Тогда
					Если Инд>0 Тогда // в первом элементе нет ссылки на строку
						Строка=ТаблицаПеремещений[Элемент.Значение];
						Строка.Количество = Строка.Количество - МинКоличество;
					КонецЕсли;
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;
			
			// Если контур разорван, для повторяющейся вершины процедуру не запускаем, пеерходим к следующему приемнику
			Продолжить;
			
		КонецЕсли;
		
		// Сделаем копию ПройденныеВершины и добавим пройденную вершину
		КопияПройденныеВершины=Новый Соответствие;
		Для Каждого Элемент Из ПройденныеВершины Цикл
			КопияПройденныеВершины.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
		КопияПройденныеВершины.Вставить(НомерВершины, ИндСтрокиПеремещения);
		
		РазорватьКонтуры(НомерВершины, Источники, КопияПройденныеВершины, ТаблицаПеремещений);
		
		// Отметим, что от вершины уже строился контур, чтобы не вызывать аналогичную процедуру повторно
		Источники[НомерВершины].Пройден = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // РазорватьКонтуры()

// Рассчитывает отрезки пути в состояния, в которые есть переход из данной вершины
//
// Параметры:
//	Источник - номер состояния-источника.
//	Состояния - соответствие, содержащее состояния, приемники и т.д.
//	СоотвПараметровСостояний - соответствие, содержащее параметры состояния, как они представлены в БД (измерения, счета, субконто и т.д.)
//
Процедура РассчитатьПуть(Источник, Состояния, СоотвПараметровСостояний, СтруктураДопПараметров)
	
	// Состояние в начале:
	// ............
	// ............
	
	// Расчет состояния.
	// Стоимость в состоянии складывается из:
	// Начального остатка + Внешнего прихода (определяется сразу)
	// Прихода из других состояний (входящих стрелок - оперделяется сложением стрелок)
	
	// Приход из других состояний определяем по таблице перемещений
	
	// Расчет перемещения в другие состояния
	// В каждом состоянии-приемнике КоличествоРассчитанныхВходов = КоличествоРассчитанныхВходов+1
	
	СостояниеИсточник=Состояния[Источник];
	
	// Состояние можно испоьзовать в расчете, если рассчитаны все входящие стрелки
	Если СостояниеИсточник.КоличествоИсточников=СостояниеИсточник.КоличествоРассчитанныхВходов Тогда
		
		СоотвПриемники=СостояниеИсточник.Приемники; // соответствие  - примники
		
		// Рассчитаем перемещения между состояниями
		Для Каждого ЭлементПриемник Из СоотвПриемники Цикл
			
			Приемник = ЭлементПриемник.Ключ;
			Количество 		= ЭлементПриемник.Значение.Количество;
			СтоимостьПерв 	= ЭлементПриемник.Значение.Стоимость;
			НДСПерв 		= ЭлементПриемник.Значение.НДС;
			
			Состояние = Состояния[Приемник];
			
			Если СостояниеИсточник.Количество > Количество Тогда
				Стоимость 	= Окр(СостояниеИсточник.Стоимость	* Количество / СостояниеИсточник.Количество, 2);
				НДС 		= Окр(СостояниеИсточник.НДС			* Количество / СостояниеИсточник.Количество, 2);
			Иначе
				Стоимость 	= СостояниеИсточник.Стоимость;
				НДС 		= СостояниеИсточник.НДС;
			КонецЕсли;
			
			// Теперь можно сформировать записи по перемещению между состояниями
			// Передаем разницу между первоначальным движением и рассчитанным
			ДобавитьЗаписиПоПеремещению(СоотвПараметровСостояний[Источник], СоотвПараметровСостояний[Приемник], Стоимость-СтоимостьПерв, НДС-НДСПерв, СтруктураДопПараметров);
			
			// Поступление в состояние
			Состояние.Количество 	= Состояние.Количество 	+ Количество;
			Состояние.Стоимость  	= Состояние.Стоимость 	+ Стоимость;
			Состояние.НДС  			= Состояние.НДС 		+ НДС;
			
			СостояниеИсточник.Количество 	= СостояниеИсточник.Количество 	- Количество;
			СостояниеИсточник.Стоимость 	= СостояниеИсточник.Стоимость 	- Стоимость;
			СостояниеИсточник.НДС 			= СостояниеИсточник.НДС 		- НДС;
			
			Состояние.КоличествоРассчитанныхВходов = Состояние.КоличествоРассчитанныхВходов+1;
			
			// Расчет пути из этой точки
			РассчитатьПуть(Приемник, Состояния, СоотвПараметровСостояний, СтруктураДопПараметров);
			
		КонецЦикла;
		
		// Теперь можем рассчитать внешние выходы:
		// сформируем записи по внешнему списанию из состояния Источник
		ДобавитьЗаписиПоВнешнемуСписанию(СоотвПараметровСостояний[Источник], СостояниеИсточник.Количество, СостояниеИсточник.Стоимость, СостояниеИсточник.НДС, СтруктураДопПараметров);
		
		// Все выходы из данного состояния рассчитаны.
		
	КонецЕсли;
	
КонецПроцедуры // РассчитатьПуть()

// Возвращает таблицу перемещений товаров между состояниями
// Зависит от конкретной структуры данных конфигурации
//
// Параметры:
//	Нет.
//
Функция ПолучитьТаблицуПеремещений(ТаблицаТоваров, ДатаНач, ДатаКон, ПрефиксПараметровНовогоСостояния, СтруктураДопПараметров)
	
	Таб = Новый ТаблицаЗначений;
	
	// Если таблица товаров не задана, перемещений нет
	Если ТаблицаТоваров.Количество()=0 Тогда
		Возврат Таб;
	КонецЕсли;
	
	// Из структуры доп параметров добудем дополнительные параметры
	Учет = "Упр";
	
	//Состояния в УТ:
	// Номенклатура
	// ХарактеристикаНоменклатуры
	// СерияНоменклатуры
	// СтатусПартии (у)
	// ДокументОприходования
	// Качество
	// Склад
	// Заказ
	
	// Перемещения между состояниями в УТ записываются в регистры ПартииТоваровНаСкладах и ПартииТоваровПереданные
	СтруктураИзмерений=Новый Структура;
	
	ИмяРегистра = "ПартииТоваровНаСкладах";
	СтруктураИзмерений.Вставить(ИмяРегистра, Новый Массив);
	Для Каждого Изм Из Метаданные.РегистрыНакопления[ИмяРегистра].Измерения Цикл
		СтруктураИзмерений[ИмяРегистра].Добавить(Изм.Имя);
	КонецЦикла;
	
	ИмяРегистра = "ПартииТоваровПереданные";
	СтруктураИзмерений.Вставить(ИмяРегистра, Новый Массив);
	Для Каждого Изм Из Метаданные.РегистрыНакопления[ИмяРегистра].Измерения Цикл
		СтруктураИзмерений[ИмяРегистра].Добавить(Изм.Имя);
	КонецЦикла;
	
	КодыОперацийПеремещенияСклад = Новый Массив;
	КодыОперацийПеремещенияСклад.Добавить(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами);
	КодыОперацийПеремещенияСклад.Добавить(Перечисления.КодыОперацийПартииТоваров.КорректировкаСерийИХарактеристик);
	КодыОперацийПеремещенияСклад.Добавить(Перечисления.КодыОперацийПартииТоваров.КорректировкаКачества);
	КодыОперацийПеремещенияСклад.Добавить(Перечисления.КодыОперацийПартииТоваров.РезервированиеПодЗаказ);
	КодыОперацийПеремещенияСклад.Добавить(Перечисления.КодыОперацийПартииТоваров.СнятиеРезерваПодЗаказ);
	
	КодыОперацийПередача = Новый Массив;
	КодыОперацийПередача.Добавить(Перечисления.КодыОперацийПартииТоваров.ПередачаНаКомиссию);
	КодыОперацийПередача.Добавить(Перечисления.КодыОперацийПартииТоваров.ПередачаТарыКонтрагенту);
	КодыОперацийПередача.Добавить(Перечисления.КодыОперацийПартииТоваров.ПередачаВПереработку);
	
	КодыОперацийВозвратПереданных = Новый Массив;
	КодыОперацийВозвратПереданных.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратОтКомиссионера);
	КодыОперацийВозвратПереданных.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратТарыОтКонтрагента);
	КодыОперацийВозвратПереданных.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратОтПереработчика);

	КодыОперацийПеремещенияПереданные = Новый Массив; //(таких движений нет)
	
	СтруктураВсехИзмерений= Новый Структура; // содержит все измерения
	
	Для Каждого Элемент Из СтруктураИзмерений Цикл
		Для Каждого Измерение Из Элемент.Значение Цикл
			
			// Вставляем сразу два поля - источник и приемник
			СтруктураВсехИзмерений.Вставить(Измерение);
			СтруктураВсехИзмерений.Вставить(Измерение+ПрефиксПараметровНовогоСостояния);
			
		КонецЦикла;
	КонецЦикла;
	// В соответствии с метаданными регистров генерируется текст запроса
	ПараметрыОтбораТоваров=Новый Массив;
	
	Запрос = Новый Запрос;
	
	ДопРесурсы = "";
	ДопАгрегРесурсы = "";
	
	// Заполним структуры измерений в соответствии с метаданными регистров:
	// Если в учете перемешений товаров могут участвовать n регистров, запрос будет состоять
	// из объединения n запросов, в каждом из которых используются n+1 таблица регистра 
	// (таблица i-го регистра, соединеная с таблицами всех регистров)
	ТекстОбщий="";
	Сч=1;
	Инд=0;
	Для Каждого Элемент Из СтруктураИзмерений Цикл
		
		Для Каждого ПодчЭлемент Из СтруктураИзмерений Цикл
			
			Текст="";
			
			// Условия отбора по ТаблицаТоваров
			ТекстОтборТоваров="";
			
			// Занулим значения измерений
			Для Каждого ЭлементИзмерение Из СтруктураВсехИзмерений Цикл
				СтруктураВсехИзмерений[ЭлементИзмерение.Ключ] = "NULL";
			КонецЦикла;
			
			// Откуда
			Для Каждого Измерение Из Элемент.Значение Цикл
				СтруктураВсехИзмерений[Измерение]="Источник."+Измерение;
				
				// Заполним отбор - только по тем полям, которые совпадают
				Если ТаблицаТоваров.Колонки.Найти(Измерение) <> Неопределено Тогда
					
					ПараметрыОтбораТоваров.Добавить(Измерение);
					
					ТекстОтборТоваров=ТекстОтборТоваров+" И Источник."+ Измерение+" В (&Массив"+Измерение+")";
					
					Запрос.УстановитьПараметр("Массив"+Измерение, ТаблицаТоваров.ВыгрузитьКолонку(Измерение));
					
				КонецЕсли;
			КонецЦикла;
			
			// Если таблица такая, что все ее колонки не совпадают с измерениями, то ничего не выбираем
			Если ТекстОтборТоваров="" Тогда
				Возврат Таб;
			КонецЕсли;
			
			// Куда - через соединения
			ТекстСоединения="";
			Для Каждого Измерение Из ПодчЭлемент.Значение Цикл
				СтруктураВсехИзмерений[Измерение+ПрефиксПараметровНовогоСостояния]="Приемник."+Измерение;
			КонецЦикла;;
			
			Для каждого ЭлементИзмерение Из СтруктураВсехИзмерений Цикл
				Текст=Текст+", " + Символы.ПС + Символы.Таб + ЭлементИзмерение.Значение + " КАК " + ЭлементИзмерение.Ключ;
			КонецЦикла;
			
			// Если  таблицы - одинаковые, нужно вставить условие на неравенство полей
			// Добавим условие на неравенство текущего и нового состояния
			ТекстУсловияНаНеравенствоПолей = "";
			
			Если Элемент.Ключ = ПодчЭлемент.Ключ Тогда
				Для Каждого ИмяПоля Из ПодчЭлемент.Значение Цикл
					
					ТекстУсловияНаНеравенствоПолей=ТекстУсловияНаНеравенствоПолей+
					Символы.ПС + "ИЛИ Источник." + ИмяПоля + " <> Приемник." + ИмяПоля;
				КонецЦикла;
				
				ТекстУсловияНаНеравенствоПолей = "И ( " + Сред(ТекстУсловияНаНеравенствоПолей, 5) + " )";
			КонецЕсли;
			
			Текст="
			|ОБЪЕДИНИТЬ ВСЕ 
			|ВЫБРАТЬ "+Сред(Текст+", Источник.Количество КАК Количество, Источник.Стоимость КАК Стоимость, Источник.НДС КАК НДС, Источник.Период КАК Период" + ДопРесурсы, 2) + "
			|	ИЗ РегистрНакопления."+Элемент.Ключ+" КАК Источник
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления."+ ПодчЭлемент.Ключ +" КАК Приемник
			|	ПО Источник.Регистратор = Приемник.Регистратор
			|	И Источник.НомерКорСтроки = Приемник.НомерСтроки 
			|	И Источник.КодОперации В (&КодыОпераций"+Инд+")" + "
			|ГДЕ
			|	Источник.Период МЕЖДУ &ДатаНач И &ДатаКон И
			|	Источник.ВидДвижения = &ВидДвиженияРасход 
			|" + ТекстУсловияНаНеравенствоПолей + ТекстОтборТоваров; // Количество при перемещении обязательно должно совпадать
			
			ТекстОбщий = ТекстОбщий+Текст;
			
			Инд=Инд+1;
		КонецЦикла;
	КонецЦикла;
	
	ТекстПоля = "";
	Для каждого ЭлементИзмерение Из СтруктураВсехИзмерений Цикл
		ТекстПоля=ТекстПоля + ", 
		|	"+ЭлементИзмерение.Ключ;
	КонецЦикла;
	
	
	
	ТекстПоляРесурсы = ", СУММА(Количество) КАК Количество, СУММА(Стоимость) КАК Стоимость, СУММА(НДС) КАК НДС" + ДопАгрегРесурсы;
	ТекстЗапроса = "ВЫБРАТЬ "+Сред(ТекстПоля+ТекстПоляРесурсы, 2)+" ИЗ(" + Сред(ТекстОбщий, 16) + ") КАК Подзапрос
	|СГРУППИРОВАТЬ ПО "+ Сред(ТекстПоля, 2)+"
	|УПОРЯДОЧИТЬ ПО МИНИМУМ(Подзапрос.Период) "; // Перемещения будут следовать в порядке дат первых движений
	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("КодыОпераций0", КодыОперацийПеремещенияСклад);
	Запрос.УстановитьПараметр("КодыОпераций1", КодыОперацийПередача);
	Запрос.УстановитьПараметр("КодыОпераций2", КодыОперацийВозвратПереданных);
	Запрос.УстановитьПараметр("КодыОпераций3", КодыОперацийПеремещенияПереданные);
	
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Таб=Запрос.Выполнить().Выгрузить();
	
	// Удалим из таблицы строки, не соответствующие таблице товаров (если в ней есть несколько строк, то в запросе могут быть 
	// другие комбинации значений в разных колонках)
	СтруктураОтбора = Новый Структура;
	Если ТаблицаТоваров.Количество()>1 Тогда
		Инд=0;
		Пока Инд < Таб.Количество() Цикл;
			Строка = Таб[Инд];
			
			Для каждого Параметр Из ПараметрыОтбораТоваров Цикл
				СтруктураОтбора.Вставить(Параметр, Строка[Параметр]);
			КонецЦикла;
			
			Если ТаблицаТоваров.НайтиСтроки(СтруктураОтбора).Количество()=0 Тогда
				Таб.Удалить(Строка);
			Иначе
				Инд=Инд+1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таб;
	
КонецФункции // ПолучитьТаблицуПеремещений()

// Добавляет данные о начальном остатке и внешнем поступлении в состояниях
//
// Параметры:
//	Нет.
//
Процедура ДобавитьНачальныйОстатокИВнешнееПоступление(ТаблицаТоваров, Состояния, СоотвПараметровСостояний, ДатаНач, ДатаКон, СтруктураДопПараметров, МассивДобавляемыхВершин)
	
	// Из структуры доп параметров добудем дополнительные параметры
	
	// Запросом получим данные об остатках в состояниях на начало периода
	КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
	
	ИмяРесурсаСтоимость = "Стоимость";
	ИмяРесурсаНДС 		= "НДС";
	
	МассивНоменклатуры  = Неопределено;
	
	ТабПартий = Неопределено;
	
	ЗапросНачОстПлюсПриход = Новый Запрос;
	ЗапросНачОстПлюсПриход.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	ЗапросНачОстПлюсПриход.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	ЗапросНачОстПлюсПриход.УстановитьПараметр("ДатаНач", ДатаНач);
	ЗапросНачОстПлюсПриход.УстановитьПараметр("ДатаКон", ДатаКон);
	
	// Массив для отбора товаров в запросе
	ИндСостояния=0;
	
	// Массив для отбора товаров дополним данными из ТаблицаТоваров
	МассивНоменклатуры = ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");
	
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(МассивНоменклатуры);
	
	// Товары на складах
	Учет = "Упр"; 
	
	ИмяРегистра = "ПартииТоваровНаСкладах";
	
	ДопИзмерения = ", СтатусПартии";
		
	// Переданные	
	ИмяРегистраПеред = "ПартииТоваровПереданные";
	
	ДопИзмеренияПеред = ", СтатусПартии, СтатусПередачи";
	
	Текст = 
	// Партии на складах
	"ВЫБРАТЬ		
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	ДокументОприходования,
	|	СтатусПартии,
	|	Склад,
	|	Заказ,
	|	Качество,
	|	NULL КАК СтатусПередачи,
	|	NULL КАК ДоговорКонтрагента,
	|	NULL КАК ДокументПередачи,
	|	СУММА(Количество) 	КАК Количество,
	|	СУММА(Стоимость) 	КАК Стоимость, 
	|	СУММА(НДС) 			КАК НДС 
	|ИЗ (
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Склад,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	ДокументОприходования,
	|	Заказ,
	|	Качество,
	|	КоличествоОстаток КАК Количество,
	|	"+ИмяРесурсаНДС+"Остаток КАК НДС, 
	|	"+ИмяРесурсаСтоимость+"Остаток КАК Стоимость " + ДопИзмерения + "
	|ИЗ
	|	РегистрНакопления."+ИмяРегистра+".Остатки(&ДатаНач" + ?(МассивНоменклатуры<>Неопределено, ", Номенклатура В (&МассивНоменклатуры)", "") + ") КАК ПартииОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Склад,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	ДокументОприходования,
	|	Заказ,
	|	Качество,
	|
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА Количество
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -Количество
	|		КОНЕЦ КАК Количество,
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА "+ИмяРесурсаНДС+"
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -"+ИмяРесурсаНДС+"
	|		КОНЕЦ КАК НДС,
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА "+ИмяРесурсаСтоимость+"
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -"+ИмяРесурсаСтоимость+"
	|		КОНЕЦ КАК Стоимость
	|	 " + ДопИзмерения + "
	|ИЗ
	|	РегистрНакопления."+ИмяРегистра+" КАК ПартииПриход
	|
	|ГДЕ " + ?(МассивНоменклатуры<>Неопределено, " Номенклатура В (&МассивНоменклатуры) И ", "") + "
	|	Период МЕЖДУ &ДатаНач И &ДатаКон И КодОперации В (&СписокКодов)
	|) ОстПлюсПрих
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	ДокументОприходования,
	|	Заказ,
	|	Качество"+ДопИзмерения + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// Переданные на реализацию партии
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	NULL СерияНоменклатуры,
	|	ДокументОприходования,
	|	СтатусПартии,
	|	NULL Склад,
	|	NULL Заказ,
	|	NULL Качество,
	|	СтатусПередачи,
	|	ДоговорКонтрагента,
	|	ДокументПередачи,
	|	СУММА(Количество) 	КАК Количество,
	|	СУММА(Стоимость) 	КАК Стоимость, 
	|	СУММА(НДС) 			КАК НДС 
	|ИЗ	(
	|ВЫБРАТЬ 
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДокументОприходования,
	|	ДоговорКонтрагента,
	|	ДокументПередачи,
	|	КоличествоОстаток КАК Количество,
	|	"+ИмяРесурсаНДС+"Остаток КАК НДС,
	|	"+ИмяРесурсаСтоимость+"Остаток КАК Стоимость " + ДопИзмеренияПеред +"
	|ИЗ
	|	РегистрНакопления." + ИмяРегистраПеред + ".Остатки(&ДатаНач" + ?(МассивНоменклатуры<>Неопределено, ", Номенклатура В (&МассивНоменклатуры)", "") + ") КАК ПартииТоваровПереданныеОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДокументОприходования,
	|	ДоговорКонтрагента,
	|	ДокументПередачи,
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА Количество
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -Количество
	|		КОНЕЦ КАК Количество,
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА "+ИмяРесурсаНДС+"
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -"+ИмяРесурсаНДС+"
	|		КОНЕЦ КАК НДС,
	|	ВЫБОР 
	|		КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА "+ИмяРесурсаСтоимость+"
	|		КОГДА ВидДвижения = &ВидДвиженияРасход ТОГДА -"+ИмяРесурсаСтоимость+"
	|		КОНЕЦ КАК Стоимость
	|	" + ДопИзмеренияПеред + "
	|ИЗ
	|	РегистрНакопления." + ИмяРегистраПеред + " КАК ПартииТоваровПереданные
	|
	|ГДЕ " + ?(МассивНоменклатуры<>Неопределено, " Номенклатура В (&МассивНоменклатуры) И ", "") + "
	|	Период МЕЖДУ &ДатаНач И &ДатаКон И КодОперации В (&СписокКодов)
	|) ОстПлюсПрих
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДокументОприходования,
	|	ДокументПередачи,
	|	ДоговорКонтрагента
	|	" + ДопИзмеренияПеред;
	
	ЗапросНачОстПлюсПриход.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	// Коды операций выбираемых в запросе движений (внешнего поступления)
	СписокКодов = Новый Массив;
	СписокКодов.Добавить(Перечисления.КодыОперацийПартииТоваров.Поступление);
	СписокКодов.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя); // продукии текущего месяца
	СписокКодов.Добавить(Перечисления.КодыОперацийПартииТоваров.ПоступлениеДопРасходов);
	СписокКодов.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратТарыОтКонтрагента);
	
	СписокКодов.Добавить(КодыОпераций.ВыпускПродукцииФиксНаСклад);
	СписокКодов.Добавить(КодыОпераций.ВыпускПоОперацииСтоимость);
	СписокКодов.Добавить(КодыОпераций.ПоступлениеВПереработку);
	СписокКодов.Добавить(КодыОпераций.ВозвратОтПереработчика);

	// Добавляем коды исключаемого расхода:
	
	// Вычитаем списание по возврату поставщику: оно не должно корректироваться
	СписокКодов.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратПоставщику);
	
	Если СтруктураДопПараметров.НеСписыватьНаПостоянныеЗатраты Тогда
		// Вычитаем списание на постоянные затраты, и списание на брак если передан такой признак
		СписокКодов.Добавить(КодыОпераций.СписаниеНаЗатраты);
		СписокКодов.Добавить(КодыОпераций.СписаниеНаБрак);
	КонецЕсли;
	
	
	ЗапросНачОстПлюсПриход.УстановитьПараметр("СписокКодов", СписокКодов);
	
	ЗапросНачОстПлюсПриход.Текст = Текст;
	
	ТабПартий = ЗапросНачОстПлюсПриход.Выполнить().Выгрузить();
	ТабПартий.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Булево"));
	
	Для Каждого Состояние Из Состояния Цикл
		
		// Это параметры (значения измерений и т.д.), которые имеет состояние
		ПараметрыСостояния = СоотвПараметровСостояний[Состояние.Ключ];
		
		Количество	= 0;
		Стоимость	= 0;
		НДС			= 0;
		
		// Тут должны определяться КолНачОст + КолПриход (внеш), СумНачОст + СумПриход(внеш) по данным из базы
		Парам=Новый Структура;
		Для Каждого Колонка Из ТабПартий.Колонки Цикл
			Если ПараметрыСостояния.Свойство(Колонка.Имя) Тогда
				
				Парам.Вставить(Колонка.Имя, ПараметрыСостояния[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
		
		НайдСтроки=ТабПартий.НайтиСтроки(Парам);
		Для Каждого СтрокаПартии Из НайдСтроки Цикл
			Количество 	= Количество 	+ СтрокаПартии.Количество;
			Стоимость 	= Стоимость 	+ СтрокаПартии.Стоимость;
			НДС 		= НДС 			+ СтрокаПартии.НДС;
			СтрокаПартии.Найдена = Истина;
		КонецЦикла;
		
		Состояние.Значение.Вставить("Количество", 	Количество);
		Состояние.Значение.Вставить("Стоимость",  	Стоимость);
		Состояние.Значение.Вставить("НДС",  		НДС);
	КонецЦикла;
	
	// Теперь добавим состояния не участвующие в перемещениях (обособленные вершины) - тем, по которым не было перемещений, чтобы по ним внешнее списание рассчиталось той же процедурой, что и для перемещений
	ИндСостояния=Состояния.Количество();
	Для Каждого СтрокаТаблицы Из ТабПартий Цикл
		Если НЕ СтрокаТаблицы.Найдена Тогда
			Количество 	= СтрокаТаблицы.Количество;
			Сумма      	= СтрокаТаблицы.Стоимость;
			НДС      	= СтрокаТаблицы.НДС;
					   
			ИндСостояния=ИндСостояния+1;
			
			// Добавим состояние со всеми необходимыми параметрами
			Состояния.Вставить(ИндСостояния, 
			Новый Структура("КоличествоИсточников, КоличествоРассчитанныхВходов, Приемники, Количество, Стоимость, НДС", 0, 0, Новый Соответствие, Количество, Сумма, НДС));
			
			СоотвПараметровСостояний.Вставить(ИндСостояния, 
			Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ДокументОприходования, СтатусПартии, Склад, Заказ, ДоговорКонтрагента, ДокументПередачи, СтатусПередачи, Качество", 
			СтрокаТаблицы.Номенклатура, 
			СтрокаТаблицы.ХарактеристикаНоменклатуры, 
			СтрокаТаблицы.СерияНоменклатуры, 
			СтрокаТаблицы.ДокументОприходования,
			СтрокаТаблицы.СтатусПартии,
			СтрокаТаблицы.Склад,
			СтрокаТаблицы.Заказ,
			СтрокаТаблицы.ДоговорКонтрагента,
			СтрокаТаблицы.ДокументПередачи,
			СтрокаТаблицы.СтатусПередачи,
			СтрокаТаблицы.Качество));
			
			МассивДобавляемыхВершин.Добавить(ИндСостояния);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьНачальныйОстатокИВнешнееПоступление()

// Добавляет в базу данных записи по перемещению в другое состояние
//
// Параметры:
//	Нет.
//
Процедура ДобавитьЗаписиПоПеремещению(ПараметрыСостоянияИсточника, ПараметрыСостоянияПриемника, Стоимость, НДС, СтруктураДопПараметров)
	
	// Выполним движение по сторнированию перемещения
	
	// Если сумма движения равна 0, ничего не добавляем
	Если Стоимость=0 И НДС=0 Тогда
		Возврат;
	КонецЕсли;
	
	Учет = "Упр";
	
	ИмяРесурсаСтоимость = "Стоимость";
	ИмяРесурсаНДС 		= "НДС";
	
	// По параметрам источника и приемника определим вид партий
	Договор = Неопределено;
	ПараметрыСостоянияИсточника.Свойство("ДоговорКонтрагента", Договор);
	Если ЗначениеЗаполнено(Договор) Тогда
		Источник =  "Переданные";
	Иначе
		Источник =  "НаСкладах";
	КонецЕсли;
	
	Договор = Неопределено;
	ПараметрыСостоянияПриемника.Свойство("ДоговорКонтрагента", Договор);
	Если ЗначениеЗаполнено(Договор) Тогда
		Приемник =  "Переданные";
	Иначе
		Приемник =  "НаСкладах";
	КонецЕсли;
	
	Если Источник =  "НаСкладах" Тогда
		ИмяРег="ПартииТоваровНаСкладах";
	Иначе
		ИмяРег="ПартииТоваровПереданные";
	КонецЕсли;
	
	
	СтрокаДокумента= Новый Структура;
	
	// Трансляция параметров состояния-источника в формат регистра СписанныеТовары
	СтрокаДокумента.Вставить("Номенклатура", ПараметрыСостоянияИсточника.Номенклатура);
	СтрокаДокумента.Вставить("ХарактеристикаНоменклатуры", ПараметрыСостоянияИсточника.ХарактеристикаНоменклатуры);
	СтрокаДокумента.Вставить("ВестиПартионныйУчетПоСериям", ПараметрыСостоянияИсточника.Номенклатура.ВестиПартионныйУчетПоСериям);
	
	Если Источник =  "НаСкладах" Тогда
		СтрокаДокумента.Вставить("Склад", ПараметрыСостоянияИсточника.Склад);
		СтрокаДокумента.Вставить("СерияНоменклатуры", ПараметрыСостоянияИсточника.СерияНоменклатуры);
		СтрокаДокумента.Вставить("Качество", ПараметрыСостоянияИсточника.Качество);
		СтрокаДокумента.Вставить("СтатусПартии", ПараметрыСостоянияИсточника.СтатусПартии);
	Иначе
		СтрокаДокумента.Вставить("ДоговорКонтрагента", ПараметрыСостоянияИсточника.ДоговорКонтрагента);
		СтрокаДокумента.Вставить("ДокументПередачи", ПараметрыСостоянияИсточника.ДокументПередачи);
		СтрокаДокумента.Вставить("СтатусПередачи", ПараметрыСостоянияИсточника.СтатусПередачи);
		СтрокаДокумента.Вставить("СтатусПартии", ПараметрыСостоянияИсточника.СтатусПартии);
	КонецЕсли;
	
	СтрокаДокумента.Вставить("Заказ", ПараметрыСостоянияИсточника.Заказ);
	СтрокаДокумента.Вставить("ДокументОприходования", ПараметрыСостоянияИсточника.ДокументОприходования);
	СтрокаДокумента.Вставить("ДокументОприходованияНовый", ПараметрыСостоянияПриемника.ДокументОприходования);
	
	// Трансляция параметров состояния-приемника в формат регистра СписанныеТовары
	СтрокаДокумента.Вставить("НоменклатураНовая", ПараметрыСостоянияПриемника.Номенклатура);
	СтрокаДокумента.Вставить("ХарактеристикаНоменклатурыНовая", ПараметрыСостоянияПриемника.ХарактеристикаНоменклатуры);
	СтрокаДокумента.Вставить("СерияНоменклатурыНовая", ПараметрыСостоянияПриемника.СерияНоменклатуры);
	СтрокаДокумента.Вставить("ИзменитьСерию", Ложь);
	СтрокаДокумента.Вставить("ИзменитьХарактеристику", Ложь);
	
	СтрокаДокумента.Вставить("ЗаказСписания", ПараметрыСостоянияПриемника.Заказ);
	
	Если Приемник = "Переданные" Тогда
		СтрокаДокумента.Вставить("ДоговорКонтрагента", ПараметрыСостоянияПриемника.ДоговорКонтрагента);
		СтрокаДокумента.Вставить("ДокументПередачи", ПараметрыСостоянияПриемника.ДокументПередачи);
		СтрокаДокумента.Вставить("СтатусПартии", ПараметрыСостоянияПриемника.СтатусПартии);
		СтрокаДокумента.Вставить("СтатусПередачи", ПараметрыСостоянияПриемника.СтатусПередачи);
	ИначеЕсли Приемник="НаСкладах" Тогда
		СтрокаДокумента.Вставить("КачествоНовое", ПараметрыСостоянияПриемника.Качество);
		СтрокаДокумента.Вставить("СкладПолучатель", ПараметрыСостоянияПриемника.Склад);
		СтрокаДокумента.Вставить("СтатусПартии", ПараметрыСостоянияПриемника.СтатусПартии);
	КонецЕсли;
	
	
	СтрокаДокумента.Вставить("СтатьяЗатрат", Неопределено);
	СтрокаДокумента.Вставить("ЗаказСписания", Неопределено);
	СтрокаДокумента.Вставить("ОтражатьВУправленческомУчете", Истина);
	СтрокаДокумента.Вставить("КоличествоПоступление", 0);

	
	СуммаКорректировки 	= (Стоимость);
	НДСКорректировки 	= (НДС);
	
	// Если корректировать нечего, движений не добавляем
	Если СуммаКорректировки = 0 И НДСКорректировки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение              = УправлениеЗапасамиПартионныйУчет.ДобавитьДвижениеВСтруктуруПараметров(ИмяРег+Учет, СтруктураДопПараметров);
	Движение.Период       = СтруктураДопПараметров.Период;
	Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
	
	Движение.Номенклатура = ПараметрыСостоянияИсточника.Номенклатура;
	Движение.ХарактеристикаНоменклатуры = ПараметрыСостоянияИсточника.ХарактеристикаНоменклатуры;
	
	Если Источник =  "НаСкладах" Тогда
		Движение.Склад      = ПараметрыСостоянияИсточника.Склад;
		Движение.СерияНоменклатуры = ПараметрыСостоянияИсточника.СерияНоменклатуры;
		Движение.Качество = ПараметрыСостоянияИсточника.Качество;
		Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
	Иначе
		Движение.ДоговорКонтрагента      = ПараметрыСостоянияИсточника.ДоговорКонтрагента;
		Движение.ДокументПередачи = ПараметрыСостоянияИсточника.ДокументПередачи;
		Движение.СтатусПередачи = ПараметрыСостоянияИсточника.СтатусПередачи;
		Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
	КонецЕсли;
	
	Движение.ДокументОприходования = ПараметрыСостоянияИсточника.ДокументОприходования;
	
	Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
	
	Движение.Количество   = 0;
	Движение[ИмяРесурсаСтоимость]  	= СуммаКорректировки;
	Движение[ИмяРесурсаНДС]  		= НДСКорректировки;
	
	// Коды операций
	СтрокаДокумента.Вставить("КодОперацииПартииТоваров", Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами); // по умолчанию
	Если Источник = "НаСкладах" И Приемник = "Переданные" Тогда
		СтрокаДокумента.Вставить("КодОперацииПартииТоваров", Перечисления.КодыОперацийПартииТоваров.ПередачаНаКомиссию);
	ИначеЕсли Источник = "Переданные" И Приемник = "НаСкладах" Тогда
		СтрокаДокумента.Вставить("КодОперацииПартииТоваров", Перечисления.КодыОперацийПартииТоваров.ВозвратОтКомиссионера);
	КонецЕсли;
	Движение.КодОперации = СтрокаДокумента.КодОперацииПартииТоваров;
	
	КорректировкаСтоимости.ВыполнитьКорДвижение(Источник, СтрокаДокумента, СтруктураДопПараметров, Движение)	
	
КонецПроцедуры // ДобавитьЗаписиПоПеремещению()

// Здесь формируются все записи по внешнему списанию из состояния ПараметрыСостоянияИсточника
//
// Параметры:
//	Нет.
//
Процедура ДобавитьЗаписиПоВнешнемуСписанию(ПараметрыСостоянияИсточника, Количество, Стоимость, НДС, СтруктураДопПараметров)
	
	// Если в состоянии ничего не осталось, ничего не делать
	Если Количество=0 Тогда
		Возврат;
	КонецЕсли;
	
	// Выполним движение по сторнированию перемещения
	
	Учет  = "Упр";
	
	ИмяРесурсаСтоимость = "Стоимость";
	ИмяРесурсаНДС 		= "НДС";
	
	// По параметрам источника и приемника определим вид партий
	Договор = Неопределено;
	ПараметрыСостоянияИсточника.Свойство("ДоговорКонтрагента", Договор);
	Если ЗначениеЗаполнено(Договор) Тогда
		Источник =  "Переданные";
		ИмяРег = "ПартииТоваровПереданные";
	Иначе
		Источник =  "НаСкладах";
		ИмяРег = "ПартииТоваровНаСкладах";
	КонецЕсли;
	
	Ст= Новый Структура;
	
	// Трансляция параметров состояния-источника в формат регистра СписанныеТовары
	Ст.Вставить("Номенклатура", ПараметрыСостоянияИсточника.Номенклатура);
	Ст.Вставить("ХарактеристикаНоменклатуры", ПараметрыСостоянияИсточника.ХарактеристикаНоменклатуры);
	
	Если Источник =  "НаСкладах" Тогда
		Ст.Вставить("Склад", ПараметрыСостоянияИсточника.Склад);
		Ст.Вставить("СерияНоменклатуры", ПараметрыСостоянияИсточника.СерияНоменклатуры);
		Ст.Вставить("Качество", ПараметрыСостоянияИсточника.Качество);
		Ст.Вставить("СтатусПартии", ПараметрыСостоянияИсточника.СтатусПартии);
	Иначе
		Ст.Вставить("ДоговорКонтрагента", ПараметрыСостоянияИсточника.ДоговорКонтрагента);
		Ст.Вставить("ДокументПередачи", ПараметрыСостоянияИсточника.ДокументПередачи);
		Ст.Вставить("СтатусПередачи", ПараметрыСостоянияИсточника.СтатусПередачи);
		Ст.Вставить("СтатусПартии", ПараметрыСостоянияИсточника.СтатусПартии);
	КонецЕсли;
	
	Ст.Вставить("ДокументОприходования", ПараметрыСостоянияИсточника.ДокументОприходования);
	Ст.Вставить("Заказ", ПараметрыСостоянияИсточника.Заказ);
	
	
	// Найдем уже выполненные движения по списанию из этого состояния
	ВыпДвижения = СтруктураДопПараметров.ТаблицаВыполненныхДвижений.НайтиСтроки(Ст);
	//	ИтогоСтоимость = 0;
	Для Каждого ВыпДвижение Из ВыпДвижения Цикл
		
		Если Количество=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВыпДвижение.ВестиПартионныйУчетПоСериям = ПараметрыСостоянияИсточника.Номенклатура.ВестиПартионныйУчетПоСериям;
		
		// Коды операций
		Ст.Вставить("КодОперацииПартииТоваров", ВыпДвижение.КодОперацииПартииТоваров);
		
		Ст.Вставить("СтатьяЗатрат", ВыпДвижение.СтатьяЗатрат);
		Ст.Вставить("ЗаказСписания", ВыпДвижение.ЗаказСписания);
		Ст.Вставить("ОтражатьВУправленческомУчете", Истина);
		Ст.Вставить("КоличествоПоступление", 0);
		
		СтрокаДокумента = Ст;
		
		Если ВыпДвижение.Количество<Количество Тогда
			КоэффСписания = ВыпДвижение.Количество/Количество;
		Иначе
			КоэффСписания = 1;
		КонецЕсли;
		
		
		// Стоимость
		СтоимостьСписанияПоСредней = Окр(Стоимость*КоэффСписания, 2);
		СуммаКорректировки = (СтоимостьСписанияПоСредней - ВыпДвижение.Стоимость);
		
		// НДС
		НДССписанияПоСредней = Окр(НДС*КоэффСписания, 2);
		НДСКорректировки = (НДССписанияПоСредней - ВыпДвижение.НДС);
		
		// Если корректировать нечего, движений не добавляем
		Если СуммаКорректировки = 0 И НДСКорректировки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение              = УправлениеЗапасамиПартионныйУчет.ДобавитьДвижениеВСтруктуруПараметров(ИмяРег+Учет, СтруктураДопПараметров);
		Движение.Период       = СтруктураДопПараметров.Период;
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		
		Движение.Номенклатура = ПараметрыСостоянияИсточника.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ПараметрыСостоянияИсточника.ХарактеристикаНоменклатуры;
		
		Если Источник =  "НаСкладах" Тогда
			Движение.Склад      = ПараметрыСостоянияИсточника.Склад;
			Движение.СерияНоменклатуры = ПараметрыСостоянияИсточника.СерияНоменклатуры;
			Движение.Качество = ПараметрыСостоянияИсточника.Качество;
			Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
		Иначе
			Движение.ДоговорКонтрагента      = ПараметрыСостоянияИсточника.ДоговорКонтрагента;
			Движение.ДокументПередачи = ПараметрыСостоянияИсточника.ДокументПередачи;
			Движение.СтатусПередачи = ПараметрыСостоянияИсточника.СтатусПередачи;
			Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
		КонецЕсли;
		
		Движение.ДокументОприходования = ПараметрыСостоянияИсточника.ДокументОприходования;
		
		Движение.СтатусПартии = ПараметрыСостоянияИсточника.СтатусПартии;
		
		Движение.Количество   = 0;
		Движение[ИмяРесурсаСтоимость]  	= СуммаКорректировки; // корректировка выполненного движения
		Движение[ИмяРесурсаНДС]  		= НДСКорректировки; // корректировка выполненного движения
		
		Количество 	= Количество 	- ВыпДвижение.Количество;
		Стоимость 	= Стоимость 	- СтоимостьСписанияПоСредней;
		НДС 		= НДС 			- НДССписанияПоСредней;
		
		
		Движение.КодОперации = ВыпДвижение.КодОперацииПартииТоваров;
		
		// При внешнем списании оставляем ссылку на исходное движение
		Движение.ДокументДвиженияПериод = ВыпДвижение.Период;
		Движение.ДокументДвижения = ВыпДвижение.Регистратор;
		
		КорректировкаСтоимости.ВыполнитьКорДвижение(Источник, ВыпДвижение, СтруктураДопПараметров, Движение);
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьЗаписиПоВнешнемуСписанию()

// Запрос по списанию: Упр учет
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьЗапросПоСписаниюУпр(Запрос, МассивНоменклатуры, ДопПараметры)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""НаСкладах"" КАК СписаноИз,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	Источник.Номенклатура,
	|	Источник.Склад,
	|	Источник.ХарактеристикаНоменклатуры,
	|	Источник.СерияНоменклатуры,
	|	Источник.ДокументОприходования,
	|	Источник.СтатусПартии,
	|	Источник.Заказ,
	|	СУММА(Источник.Количество) КАК Количество,
	|	СУММА(Источник.Стоимость) КАК Стоимость,
	|	СУММА(Источник.НДС) КАК НДС,
	|	0 КАК СтоимостьПоступление,
	|	NULL КАК СтатусПередачи,
	|	NULL КАК ДокументПередачи,
	|	NULL КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.ЗаказПокупателя ЕСТЬ NULL )
	|			ТОГДА Себестоимость.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказСписания,
	|	Источник.КодОперации КАК КодОперацииПартииТоваров,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвижения
	|		ИНАЧЕ Источник.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвиженияПериод
	|		ИНАЧЕ Источник.Период
	|	КОНЕЦ КАК Период,
	|	Источник.Качество,
	|	ВЫБОР
	|		КОГДА (НЕ Затраты.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА Затраты.СтатьяЗатрат
	|		КОГДА (НЕ НЗП.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА НЗП.СтатьяЗатрат
	|		КОГДА (НЕ БракВПроизводстве.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.СтатьяЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.Подразделение ЕСТЬ NULL )
	|			ТОГДА Себестоимость.Подразделение
	|		КОГДА (НЕ Затраты.Подразделение ЕСТЬ NULL )
	|			ТОГДА Затраты.Подразделение
	|		КОГДА (НЕ НЗП.Подразделение ЕСТЬ NULL )
	|			ТОГДА НЗП.Подразделение
	|		КОГДА (НЕ БракВПроизводстве.Подразделение ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА НЗП.НоменклатурнаяГруппа
	|		КОГДА (НЕ Затраты.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА Затраты.НоменклатурнаяГруппа
	|		КОГДА (НЕ БракВПроизводстве.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.НоменклатурнаяГруппа
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НоменклатурнаяГруппа,
	|	СтроительствоОбъектовОсновныхСредств.ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.ХарактеристикаНоменклатуры ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.ХарактеристикаНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ХарактеристикаНоменклатурыНовая,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.СерияНоменклатуры ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.СерияНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СерияНоменклатурыНовая,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.Номенклатура ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.Номенклатура
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НоменклатураНовая,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.ДокументОприходования ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.ДокументОприходования
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументОприходованияНовый,
	|	ИсточникДляКомплектации.СтатусПартии КАК СтатусПартииНовый
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах КАК Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Затраты КАК Затраты
	|		ПО Источник.Регистратор = Затраты.Регистратор
	|			И Источник.НомерКорСтроки = Затраты.НомерСтроки
	|			И (Источник.КодОперации В (&КодыСписаниеНаЗатраты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость КАК Себестоимость
	|		ПО Источник.Регистратор = Себестоимость.Регистратор
	|			И Источник.НомерКорСтроки = Себестоимость.НомерСтроки
	|			И (Источник.КодОперации В (&КодыСписаниеНаСебестоимость))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НезавершенноеПроизводство КАК НЗП
	|		ПО Источник.Регистратор = НЗП.Регистратор
	|			И Источник.НомерКорСтроки = НЗП.НомерСтроки
	|			И (Источник.КодОперации В (&КодыСписаниеВНЗП))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БракВПроизводстве КАК БракВПроизводстве
	|		ПО Источник.Регистратор = БракВПроизводстве.Регистратор
	|			И Источник.НомерКорСтроки = БракВПроизводстве.НомерСтроки
	|			И (Источник.КодОперации В (&КодыСписаниеНаБрак))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтроительствоОбъектовОсновныхСредств КАК СтроительствоОбъектовОсновныхСредств
	|		ПО Источник.Регистратор = СтроительствоОбъектовОсновныхСредств.Регистратор
	|			И (Источник.КодОперации В (&КодыСтроительствоОбъектовОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ИсточникДляКомплектации
	|		ПО Источник.Регистратор = ИсточникДляКомплектации.Регистратор
	|			И Источник.НомерКорСтроки = ИсточникДляКомплектации.НомерСтроки
	|			И (Источник.КодОперации В (&КодКомплектация))
	|ГДЕ
	|	Источник.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Источник.ВидДвижения = &ВидДвиженияРасход
	|	И Источник.КодОперации В(&КодыСписание)
	|
	|СГРУППИРОВАТЬ ПО
	|	Источник.Номенклатура,
	|	Источник.Склад,
	|	Источник.ХарактеристикаНоменклатуры,
	|	Источник.СерияНоменклатуры,
	|	Источник.ДокументОприходования,
	|	Источник.СтатусПартии,
	|	Источник.Заказ,
	|	Источник.КодОперации,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвижения
	|		ИНАЧЕ Источник.Регистратор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвиженияПериод
	|		ИНАЧЕ Источник.Период
	|	КОНЕЦ,
	|	Источник.Качество,
	|	СтроительствоОбъектовОсновныхСредств.ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА (НЕ Затраты.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА Затраты.СтатьяЗатрат
	|		КОГДА (НЕ НЗП.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА НЗП.СтатьяЗатрат
	|		КОГДА (НЕ БракВПроизводстве.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.СтатьяЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.Подразделение ЕСТЬ NULL )
	|			ТОГДА Себестоимость.Подразделение
	|		КОГДА (НЕ Затраты.Подразделение ЕСТЬ NULL )
	|			ТОГДА Затраты.Подразделение
	|		КОГДА (НЕ НЗП.Подразделение ЕСТЬ NULL )
	|			ТОГДА НЗП.Подразделение
	|		КОГДА (НЕ БракВПроизводстве.Подразделение ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА НЗП.НоменклатурнаяГруппа
	|		КОГДА (НЕ Затраты.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА Затраты.НоменклатурнаяГруппа
	|		КОГДА (НЕ БракВПроизводстве.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА БракВПроизводстве.НоменклатурнаяГруппа
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.ЗаказПокупателя ЕСТЬ NULL )
	|			ТОГДА Себестоимость.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.ХарактеристикаНоменклатуры ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.ХарактеристикаНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.СерияНоменклатуры ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.СерияНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.Номенклатура ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.Номенклатура
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ИсточникДляКомплектации.ДокументОприходования ЕСТЬ NULL )
	|			ТОГДА ИсточникДляКомплектации.ДокументОприходования
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ИсточникДляКомплектации.СтатусПартии
	|
	|ИМЕЮЩИЕ
	|	СУММА(Источник.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Переданные"",
	|	НЕОПРЕДЕЛЕНО,
	|	Источник.Номенклатура,
	|	NULL,
	|	Источник.ХарактеристикаНоменклатуры,
	|	NULL,
	|	Источник.ДокументОприходования,
	|	Источник.СтатусПартии,
	|	NULL,
	|	СУММА(Источник.Количество),
	|	СУММА(Источник.Стоимость),
	|	СУММА(Источник.НДС),
	|	0,
	|	Источник.СтатусПередачи,
	|	Источник.ДокументПередачи,
	|	Источник.ДоговорКонтрагента,
	|	Себестоимость.ЗаказПокупателя,
	|	Источник.КодОперации,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвижения
	|		ИНАЧЕ Источник.Регистратор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвиженияПериод
	|		ИНАЧЕ Источник.Период
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА НЗП.СтатьяЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.Подразделение ЕСТЬ NULL )
	|			ТОГДА Себестоимость.Подразделение
	|		КОГДА (НЕ НЗП.Подразделение ЕСТЬ NULL )
	|			ТОГДА НЗП.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА НЗП.НоменклатурнаяГруппа
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданные КАК Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость КАК Себестоимость
	|		ПО Источник.Регистратор = Себестоимость.Регистратор
	|			И Источник.НомерКорСтроки = Себестоимость.НомерСтроки
	|			И (Источник.КодОперации В (&КодыСписаниеНаСебестоимость))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НезавершенноеПроизводство КАК НЗП
	|		ПО Источник.Регистратор = НЗП.Регистратор
	|			И Источник.НомерКорСтроки = НЗП.НомерСтроки
	|			И (Источник.КодОперации В (&СписаниеПартийПереданныхВПроизводство))
	|ГДЕ
	|	Источник.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Источник.ВидДвижения = &ВидДвиженияРасход
	|	И Источник.КодОперации В(&КодыСписание)
	|
	|СГРУППИРОВАТЬ ПО
	|	Источник.Номенклатура,
	|	Источник.ДоговорКонтрагента,
	|	Источник.ДокументПередачи,
	|	Источник.ХарактеристикаНоменклатуры,
	|	Источник.ДокументОприходования,
	|	Источник.СтатусПартии,
	|	Источник.СтатусПередачи,
	|	Себестоимость.ЗаказПокупателя,
	|	Источник.КодОперации,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвижения
	|		ИНАЧЕ Источник.Регистратор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Источник.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Источник.ДокументДвиженияПериод
	|		ИНАЧЕ Источник.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ Себестоимость.Подразделение ЕСТЬ NULL )
	|			ТОГДА Себестоимость.Подразделение
	|		КОГДА (НЕ НЗП.Подразделение ЕСТЬ NULL )
	|			ТОГДА НЗП.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.СтатьяЗатрат ЕСТЬ NULL )
	|			ТОГДА НЗП.СтатьяЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ НЗП.НоменклатурнаяГруппа ЕСТЬ NULL )
	|			ТОГДА НЗП.НоменклатурнаяГруппа
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Источник.Количество) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор";
	
	
	// Если параметр не списывать на постоянные затраты
	Если ДопПараметры.НеСписыватьНаПостоянныеЗатраты Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "ГДЕ Источник.КодОперации <> &КодСписанияНаЗатраты И ");
		Запрос.УстановитьПараметр("КодСписанияНаЗатраты", Перечисления.КодыОперацийПартииТоваров.СписаниеНаЗатраты);
		
	КонецЕсли;
	
	
	// Добавим дополнительный отбор по номенклатуре
	Если МассивНоменклатуры <> Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "ГДЕ Источник.Номенклатура В (&МассивНоменклатуры)
		|	И Источник.ДокументОприходования В (&МассивДокументовОприходования) И ");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьЗапросПоСписанию()

Функция ПолучитьСписокВершин(Таб, Приемники)  
	
	Если Таб.Количество()=0 Тогда
		Возврат новый массив;
	КонецЕсли;
	
	массивПриемников = новый массив;
	Для каждого Строка Из Приемники Цикл
		массивПриемников.Добавить(Строка.ключ);
	КонецЦикла;
		
	Запрос = Новый Запрос;
			
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Различные ВнешнийИсточник.Источник как Источник 
		|Поместить ВРтаблица 
		|Из &ВнешнийИсточник КАК ВнешнийИсточник
		|ГДЕ ВнешнийИсточник.Количество<>0 и Не ВнешнийИсточник.Источник в (&МассивПриемников)
		|; 
		|ВЫБРАТЬ
		|	ВнешнийИсточник.Источник как Источник 
		|
		|Из ВРтаблица КАК ВнешнийИсточник";
		
	Запрос.УстановитьПараметр("ВнешнийИсточник", Таб );
	Запрос.УстановитьПараметр("МассивПриемников", массивПриемников);
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	Возврат Таб.ВыгрузитьКолонку("Источник");
	
КонецФункции
