Функция НайтиДокумент(Номенклатура, Дата = неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УстановкаЦенНоменклатурыТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	|ГДЕ
	|	УстановкаЦенНоменклатурыТовары.Номенклатура = &Номенклатура"; 
	
	Если Дата <> неопределено Тогда
		Запрос.Текст = Запрос.Текст + 
		"
		|	И УстановкаЦенНоменклатурыТовары.Ссылка.Дата >= &НачалоДня
		|	И УстановкаЦенНоменклатурыТовары.Ссылка.Дата <=&КонецДня"; 
		
		Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("КонецДня",КонецДня(ТекущаяДата()));
		
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().ВыбратЬ();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции