
&НаКлиенте
Процедура ПоискАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ТекЭлементОтбораНаим = Неопределено;
	ДЛя Каждого ТекЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТекЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка") Тогда
			ТекЭлементОтбораНаим = ТекЭлементОтбора;
		КонецЕсли;	
	КонецЦикла; 	
	Если ТекЭлементОтбораНаим = Неопределено ТОгда
		ТекЭлементОтбораНаим = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекЭлементОтбораНаим.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	КонецЕсли;	
	ТекЭлементОтбораНаим.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Сп = Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(ПолучитьМассивСсылок(Текст));
	ТекЭлементОтбораНаим.ПравоеЗначение = Сп;
	ТекЭлементОтбораНаим.Использование = истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылок(Текст)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_Города.Ссылка
	|ИЗ
	|	Справочник.ЛМ_Города КАК ЛМ_Города
	|ГДЕ
	|	ЛМ_Города.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", ВРег(Лев(Текст, 1)) + НРег(Сред(Текст,2)) + "%");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	ТекЭлементОтбораНаим = Неопределено;
	ДЛя Каждого ТекЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТекЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка") Тогда
			ТекЭлементОтбораНаим = ТекЭлементОтбора;
		КонецЕсли;	
	КонецЦикла; 	
	Если ТекЭлементОтбораНаим = Неопределено ТОгда
		ТекЭлементОтбораНаим = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекЭлементОтбораНаим.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	КонецЕсли;	
	ТекЭлементОтбораНаим.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Сп = Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(ПолучитьМассивСсылок(Поиск));
	ТекЭлементОтбораНаим.ПравоеЗначение = Сп;
	ТекЭлементОтбораНаим.Использование = истина;

КонецПроцедуры
