
Функция СчетПринадлежитРодителю(Счет, СчетРодитель) Экспорт
	
	Результат = Ложь;
	Если ТипЗнч(СчетРодитель) = Тип("Массив") Тогда
		Для каждого ИндСчетРодитель Из СчетРодитель Цикл
			Если Счет = ИндСчетРодитель ИЛИ Счет.ПринадлежитЭлементу(ИндСчетРодитель) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	Иначе	
		Если Счет = СчетРодитель ИЛИ Счет.ПринадлежитЭлементу(СчетРодитель) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка 
	   И НЕ ЭтоГруппа Тогда

		Если ВидЗатрат.Пустая() Тогда
			Сообщить("Укажите вид затрат!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если ХарактерЗатрат.Пустая() Тогда
			Сообщить("Укажите характер затрат!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Счет8Класса) Тогда
			Если БухгалтерскийУчет.ПолучитьИспользоватьКлассыСчетовВКачествеГрупп() Тогда
				мСчетЗатратыПоЭлементам 		= ПланыСчетов.Хозрасчетный.ЗатратыПоЭлементам;
			Иначе
				мСчетЗатратыПоЭлементам	= Новый Массив;
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.Амортизация);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам);
			КонецЕсли;
			
			Если НЕ СчетПринадлежитРодителю(Счет8Класса, мСчетЗатратыПоЭлементам) Тогда
				Сообщить(Локализация.СтрШаблон1(НСтр("ru='Счет ¤1¤ ""¤2¤"" не является счетом 8-ого класса.';uk='Рахунок ¤1¤ ""¤2¤"" не є рахунком 8-ого классу.'"), СокрЛП(Счет8Класса), Счет8Класса.Наименование));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


