// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
	Если ПозицияЗагрузкиКодовГородов <> 0 Тогда
	 	Элементы.декИнфо.Заголовок = "Прогресс заполнения регистра: всего записей 285000 ";
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьИндексНомеров(Команда)
	ПерезаполнитьИндексНомеровНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПерезаполнитьИндексНомеровНаСервере()
	
	МассивСправочниковКИ = Новый Массив;
	Для каждого Источник Из Метаданные.Справочники Цикл
		// наличие таблицы КИ
		КонтактнаяИнформация = Источник.ТабличныеЧасти.Найти("КонтактнаяИнформация");
		Если КонтактнаяИнформация = Неопределено Тогда
		  	Продолжить;
		КонецЕсли;                                        
		// наличие прав доступа к таблице КИ
		Если НЕ ПравоДоступа("Чтение", Источник)
			 ИЛИ НЕ ПравоДоступа("Чтение", Источник.ТабличныеЧасти.КонтактнаяИнформация) Тогда
			Продолжить;
		КонецЕсли; 
		// наличие реквизитов
		Если КонтактнаяИнформация.реквизиты.Найти("НомерТелефона")=Неопределено Тогда
		   	Продолжить;
		КонецЕсли;
		
		МассивСправочниковКИ.Добавить(Источник.Имя);
	КонецЦикла; 
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ {РАЗРЕШЕННЫЕ} 
		|	{Имя}КонтактнаяИнформация.Ссылка
		|ИЗ
		|	Справочник.{Имя} КАК {Имя}КонтактнаяИнформация";
	ТекстЗапроса = "";
	Для Каждого врТекИмя Из МассивСправочниковКИ Цикл
		Если Не ТекстЗапроса = "" Тогда
		  	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "");
		Иначе
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "РАЗРЕШЕННЫЕ");
			врЗапрос = СтрЗаменить(врЗапрос, "//{ПОМЕСТИТЬ}", "ПОМЕСТИТЬ");
		КонецЕсли; 
		врЗапрос = СтрЗаменить(врЗапрос, "{Имя}", врТекИмя);
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + врЗапрос + Символы.ПС;
	КонецЦикла; 
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
			    врОбъект = Выборка.Ссылка.ПолучитьОбъект();
				врОбъект.Записать();
			Исключение
			КонецПопытки; 
		КонецЦикла;
	КонецЕсли; 
		
	// заполним индексы по данным РС "КонтактнаяИнформация"
	ЕстьРегистрКонтактнаяИнформация = (НЕ Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") = Неопределено);
	Если НЕ ЕстьРегистрКонтактнаяИнформация Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|ИТОГИ ПО
	|	Объект";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ВыборкаПоОбъектам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОбъектам.Следующий() Цикл
	
		ОбъектКИ = ВыборкаПоОбъектам.Объект;
		
		ВыборкаПоТелефонам = ВыборкаПоОбъектам.Выбрать();
		
		Буквенные = Новый Массив;
		Числовые  = Новый Массив;
		
		Пока ВыборкаПоТелефонам.Следующий() Цикл
			Представление = ""+ВыборкаПоТелефонам.Поле1+ВыборкаПоТелефонам.Поле2+ВыборкаПоТелефонам.Поле3;
			Если ЗначениеЗаполнено(ВыборкаПоТелефонам.Поле4) И НЕ ЗначениеЗаполнено(Представление) Тогда
				НомерТелефона = "" + ВыборкаПоТелефонам.Поле4;
			Иначе
				НомерТелефона = "" + ВыборкаПоТелефонам.Поле1 + ВыборкаПоТелефонам.Поле2 + ВыборкаПоТелефонам.Поле3;
			КонецЕсли; 
			
			// Наполним массивы номеров для обновления информации в истории звонков.
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(Представление, """' /*+=\,!;%:?()");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Продолжить;
			КонецЕсли; 

			Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
				Если Числовые.Найти(НомерТелефона)=Неопределено Тогда
					Числовые.Добавить(НомерТелефона);
				КонецЕсли; 
			ИначеЕсли МИКО_опЗаписьКИ.ВСловеТолькоЛатиница(НомерТелефона) Тогда
				// Это скайп
				Если Буквенные.Найти(НомерТелефона)=Неопределено Тогда
					Буквенные.Добавить(НомерТелефона);
				КонецЕсли; 
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла; 
		
		НаборЗаписей = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);

		НаборЗаписейБуквенные = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьНаборЗаписей();
		НаборЗаписейБуквенные.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);
			
		Если Числовые.Количество()>0 Тогда
			Для каждого текНомер Из Числовые Цикл
			 	новЗапись = НаборЗаписей.Добавить();
				новЗапись.НомерТелефонаИндекс = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(текНомер);
			    новЗапись.СсылкаНаКлиента 	  = ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой= МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(текНомер);
			КонецЦикла; 
		КонецЕсли; 
		
		Если Буквенные.Количество()>0 Тогда
			Для каждого текНомер Из Буквенные Цикл
			 	новЗапись = НаборЗаписейБуквенные.Добавить();
				новЗапись.НомерТелефонаИндекс 	= СтрЗаменить(текНомер," ","");
			    новЗапись.СсылкаНаКлиента 		= ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой 	= СтрЗаменить(текНомер," ","");
			КонецЦикла; 
		КонецЕсли; 
		
		Попытка
		НаборЗаписей.Записать();                                   
		Исключение
		КонецПопытки; 
		
		Попытка
		НаборЗаписейБуквенные.Записать();                                   
		Исключение
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыГородов(Команда)
	ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
	Если ПозицияЗагрузкиКодовГородов = 0 Тогда
	 	УстановитьТекущуюПозицию(1);
	КонецЕсли; 
	
	НачатьЗагрузкуЗаписей(); 
КонецПроцедуры

&НаКлиенте
// Процедура инициирует очередной этап загрузки кодов городов.
// Объем записей довольно большой, по этой причине процедура выполняет загрузку этапами по 100000 записей за раз.
// 
Процедура НачатьЗагрузкуЗаписей()
	ДатаНачала = ТекущаяДата();
	НомерПопытки 		= 0;
	КодыУкраиныЗаписаны = Ложь;
	TimeZones			= Неопределено;

	Пока Истина Цикл
		
		МИКО_опЗаписьКИ.ЗагрузитьКодыГородов(НомерПопытки, КодыУкраиныЗаписаны, TimeZones);
		ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
		Если ПозицияЗагрузкиКодовГородов <> 0 Тогда
		 	Элементы.декИнфо.Заголовок = "Прогресс заполнения регистра: " + ПозицияЗагрузкиКодовГородов + " всего записей 285000, загружено ";
		Иначе
			Элементы.декИнфо.Заголовок = "Загрузка завершена";
			Прервать;
		КонецЕсли;
		
		Если ТекущаяДата() - ДатаНачала > 3600 Тогда
		 	Элементы.декИнфо.Заголовок = "Загрузка остановлена: " + ПозицияЗагрузкиКодовГородов + " всего записей 285000, загружено ";
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
// Возврвщает текущую позицию загрузки данных.
// Если загрузка завершена - возвратит 0;
// 
Функция ПолучитьТекущуюПозицию()

 	ПозицияЗагрузкиКодовГородов = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов();
   	Возврат ПозицияЗагрузкиКодовГородов;
КонецФункции // ПолучитьТекущуюПозицию()

&НаСервереБезКонтекста
// Корректирует текущую позицию загрузки данных.
// 
Процедура УстановитьТекущуюПозицию(позиция)

 	ПозицияЗагрузкиКодовГородов = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов(позиция);
КонецПроцедуры // ПолучитьТекущуюПозицию()

// #КонецОбласти