Перем мУдалятьДвижения;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("СобытиеОС");
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("Организация");
	КонецЕсли;	
		

	// Документ должен принадлежать хотя бы к одному виду учета (бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Проверим на виды операций, которые не будут полностью отработаны в данном документе
	Если СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Передача
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Списание
	тогда
		ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("События с основными средствами с видом <¤1¤>"
"не будут полноценно отражены данным документом (учетное состояние ОС не изменится)!", строка(СтруктураШапкиДокумента.ВидСобытияОС)),,Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

//// Проверка реквизитов в ТЧ по регл. учету
//// 
//Процедура ПроверкаРеквизитовТЧРегл(Отказ, Заголовок)

//	// Проверим соответствие организайий ОС и организации документа
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("СписокОС"      , ОС.ВыгрузитьКолонку("ОсновноеСредство"));
//	Запрос.УстановитьПараметр("ВыбОрганизация", Организация);
//	Запрос.УстановитьПараметр("ДатаСреза"     , Дата);
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	МестонахождениеОС.Организация          КАК Организация,
//	|	ОсновныеСредства.Код                   КАК Инв,
//	|	ОсновныеСредства.Ссылка                КАК ОсновноеСредство,
//	|	Представление(ОсновныеСредства.Ссылка) КАК ОсновноеСредствоПредставление
//	|ИЗ
//	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
//	|ЛЕВОЕ СОЕДИНЕНИЕ 
//	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
//	|	                &ДатаСреза,
//	|	                (ОсновноеСредство В(&СписокОС) 
//	|	                 И Организация = &ВыбОрганизация)) КАК МестонахождениеОС
//	|	ПО ОсновныеСредства.Ссылка = МестонахождениеОС.ОсновноеСредство
//	|
//	|ГДЕ
//	|	ОсновныеСредства.Ссылка В(&СписокОС)
//	|	И
//	|	НЕ ОсновныеСредства.ЭтоГруппа
//	|	И
//	|	МестонахождениеОС.Организация ЕСТЬ NULL";
//	Выборка = Запрос.Выполнить().Выбрать();

//	Если Выборка.Количество() > 0 Тогда

//		Пока Выборка.Следующий() Цикл
//			
//			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Бух.учет: Несоответствие организаций ОС ""¤1¤"" код ¤2¤ и организации указанной в документе.", СокрЛП(Выборка.ОсновноеСредствоПредставление), СокрЛП(Выборка.Инв)), ,
//							  Заголовок);
//							  
//		КонецЦикла;

//	КонецЕсли;

//КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОС(ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОсновноеСредство");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Проверим соответствие организайий ОС и организации документа

	Упр 	= СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
	Бухг 	= СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете;
	
	//Проверка на наличие основных средств
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата",        СтруктураШапкиДокумента.Дата);
	Запрос.УстановитьПараметр("СписокОС",       ТаблицаПоОС.ВыгрузитьКолонку("ОсновноеСредство"));
	Запрос.УстановитьПараметр("ТекОрганизация", СтруктураШапкиДокумента.Организация);
	Запрос.Текст = "ВЫБРАТЬ" + ?(Упр,"
	|	МестонахождениеОС_УУ.ОсновноеСредство            КАК ОС_УУ", "") + ?(Бухг, ?(Упр, ",", "") + "
	|	МестонахождениеОС_БУ.ОсновноеСредство КАК ОС_БУ", "") + "
	|ИЗ" + ?(Упр,"
	|	РегистрСведений.МестонахождениеОС.СрезПоследних(&ТекДата, 
	|	                ОсновноеСредство В (&СписокОС)
	|	                ) КАК МестонахождениеОС_УУ", "") + ?(Упр и Бухг,"
	|		ПОЛНОЕ СОЕДИНЕНИЕ", "") + ?(Бухг,"
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ТекДата, 
	|	                ОсновноеСредство В (&СписокОС)
	|	                И Организация = &ТекОрганизация
	|	                ) КАК МестонахождениеОС_БУ", "") + ?(Упр и Бухг,"
	|		ПО МестонахождениеОС_УУ.ОсновноеСредство = МестонахождениеОС_БУ.ОсновноеСредство", "");
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок);
	ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)
	
	//ПроверкаРеквизитовТЧРегл(Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	//Проверка на наличие основных средств
	Для каждого СтрокаТЧ Из ОС Цикл
		
		ТекОС          = СтрокаТЧ.ОсновноеСредство;
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекОС, "ОС_УУ");
		
		Если СтрокаОстатков = Неопределено Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
			                    + "Упр.учет: По основному средству """ + ТекОс + """ нет записей до даты документа"
			                    + Символы.ПС + Символы.Таб + "в регистре сведений ""Местонахождение основных средств организаций""."
			                    + Символы.ПС + Символы.Таб + "Возможно оно еще не принято к управленческому учету.",
			                    Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)

	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете ) Тогда
		Возврат;
	КонецЕсли;
	
	ТекОрганизация =  СтруктураШапкиДокумента.Организация;
	
	//Проверка на наличие основных средств
	Для каждого СтрокаТЧ Из ОС Цикл
		
		ТекОС          = СтрокаТЧ.ОсновноеСредство;
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекОС, "ОС_БУ");
		
		Если СтрокаОстатков = Неопределено Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
			                    + "Бух.учет: Организация """ + ТекОрганизация + """. По основному средству """ + ТекОс + """ нет записей до даты документа"
			                    + Символы.ПС + Символы.Таб + "в регистре сведений ""Местонахождение основных средств организаций""."
			                    + Символы.ПС + Символы.Таб + "Возможно оно еще не принято к бухгалтерскому учету.",
			                    Отказ, Заголовок);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧ

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)
	

КонецПроцедуры // ДвиженияПоРегистрам

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		Возврат
		
	КонецЕсли;

	ДатаДока					= Дата;
	СобытияОС					= Движения.СобытияОС;
	НачислениеАмортизацииОС		= Движения.НачислениеАмортизацииОС;
	СостояниеОС					= Движения.СостоянияОС;
	НазваниеДокумента			= Метаданные().Представление();
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		Движение = СобытияОС.Добавить();
		Движение.Период                   = ДатаДока;
		Движение.ОсновноеСредство         = СтрокаТЧ.ОсновноеСредство;
		Движение.Событие                  = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НомерДокумента           = Номер;
		Движение.НазваниеДокумента        = НазваниеДокумента;
		
		// Движения по регистру СостоянияОС
		Если СтруктураШапкиДокумента.СобытиеОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию Тогда
			Движение = СостояниеОС.Добавить();
			Движение.ОсновноеСредство  = СтрокаТЧ.ОсновноеСредство;
			Движение.Состояние         = Перечисления.СостоянияОС.ВведеноВЭксплуатацию;
			Движение.ДатаСостояния     = ДатаДока;
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ВлияетНаНачилениеАмортизации Тогда
			
			Движение = НачислениеАмортизацииОС.Добавить();
			Движение.Период                             = ДатаДока;
			Движение.ОсновноеСредство                   = СтрокаТЧ.ОсновноеСредство;
			Движение.НачислятьАмортизацию               = СтруктураШапкиДокумента.НачислятьАмортизацию;
			Движение.НачислятьАмортизациюВТекущемМесяце = СтруктураШапкиДокумента.НачислятьАмортизациюВТекущемМесяце;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Возврат
		
	КонецЕсли;

	ДатаДока      = Дата;
	
	УправлениеВнеоборотнымиАктивами.ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл(МоментВремени(), ТаблицаПоОС,
	                                                  СтруктураШапкиДокумента, 
													  Отказ, Заголовок, , Истина);
	
	ОперацииОСБух = Движения.СобытияОСОрганизаций;
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		Движение = ОперацииОСБух.Добавить();
		
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация       = СтруктураШапкиДокумента.Организация;
		Движение.Событие           = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента = Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента    = СтруктураШапкиДокумента.Номер;
		
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВлияетНаНачилениеАмортизации Тогда
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			
			НачислениеАмортизацииБух = Движения.НачислениеАмортизацииОСБухгалтерскийУчет;
			НачислениеАмортизацииНал = Движения.НачислениеАмортизацииОСНалоговыйУчет;
			СостояниеОС              = Движения.СостоянияОСОрганизаций;
			
			Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
				
				Движение = НачислениеАмортизацииБух.Добавить();
				
				Движение.Период               = ДатаДока;
				Движение.ОсновноеСредство     = СтрокаТЧ.ОсновноеСредство;
				Движение.Организация          = СтруктураШапкиДокумента.Организация;
				Движение.НачислятьАмортизацию = СтруктураШапкиДокумента.НачислятьАмортизацию;
				
				Непроизводственное = СтрокаТЧ.ВидНалоговойДеятельности_ОС = Справочники.ВидыНалоговойДеятельности.НеОблагаемая;
				
				НачислятьАмортизациюНУ = СтруктураШапкиДокумента.НачислятьАмортизацию И НЕ Непроизводственное;
				
				// Движение по регистру сведений НачислениеАмортизацииОСНалоговыйУчет 
				Движение = НачислениеАмортизацииНал.Добавить();
				Движение.Период               = ДатаДока;
				Движение.ОсновноеСредство     = СтрокаТЧ.ОсновноеСредство;
				Движение.Организация          = СтруктураШапкиДокумента.Организация;
				Движение.НачислятьАмортизацию = НачислятьАмортизациюНУ;
				
				// Движения по регистру сведений СостоянияОСОрганизаций
				Если СтруктураШапкиДокумента.СобытиеОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию Тогда
					
					Движение = СостояниеОС.Добавить();
					Движение.ОсновноеСредство  = СтрокаТЧ.ОсновноеСредство;
					Движение.Организация       = СтруктураШапкиДокумента.Организация;
					Движение.Состояние         = Перечисления.СостоянияОС.ВведеноВЭксплуатацию;
					Движение.ДатаСостояния     = ДатаДока;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
  		Если Основание.ЭтоГруппа Тогда
			Сообщить("Нельзя изменять состояние по группе основных средств",СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли; 
			
		СобытиеОС = УправлениеВнеоборотнымиАктивами.ПолучитьСобытиеПоОСИзСправочника(Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);

		СтрокаТабличнойЧасти = ОС.Добавить();
		СтрокаТабличнойЧасти.ОсновноеСредство = Основание.Ссылка;

	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Заголовок = "";

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	
	СтруктураШапкиДокумента.Вставить("ВидСобытияОС",СтруктураШапкиДокумента.СобытиеОС.ВидСобытияОС);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Сформируем структуру табличной части
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ОсновноеСредство" , "ОсновноеСредство");
	
	РезультатЗапросаПоОС = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей);
	ТаблицаПоОС          = РезультатЗапросаПоОС.Выгрузить();
	
	ПроверитьЗаполнениеТабличнойЧастиОС(ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	//проверка, нет ли списанных ОС в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанность(Дата, Организация, ТаблицаПоОС, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(ОС, "ОсновноеСредство", "Основное средство", Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
