// Проверяет возможность запуска с пустым списком пользователей для клиентских соединений.
//
// Для фоновых заданий, внешних соединений, вызовов веб-сервисов запуск с
// пустым списком пользователей всегда возможен - для пустого пользователя ИБ
// всегда используется пользователь <Не указан> справочника Пользователи.
//
// В случае, когда основная роль пустого пользователя не обеспечивает
// требуемых прав в обработчике фонового задания или веб-сервиса,
// привилегированный режим устанавливается прямо в обработчике.
// Для внешних соединений можно использовать запуск в привилегированном
// режиме (параметр командной строки "/UsePrivilegedMode").
//
Функция ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ(ВернутьТекстОшибки = Ложь) Экспорт
	
	Если ПривилегированныйРежим() Тогда
		// Выполнен запуск в привилегированном режиме
		// (параметр командной строки "/UsePrivilegedMode").
		//
		// В этом режиме пользователь имеет все права,
		// первого администратора не требуется создавать.
		Возврат "";
	КонецЕсли;
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(ТекущийПользовательИБ.Имя) Тогда
		// Список пользователей ИБ не пустой.
		Возврат "";
	КонецЕсли;
	
	ОсновнаяРоль = Метаданные.ОсновнаяРоль;
	
	Если ОсновнаяРоль = Неопределено Тогда
		// Основная роль не назначена, поэтому пустой пользователь
		// имеет права, соответствующие привилегированному режиму.
		Возврат "";
	КонецЕсли;
	
	Если ПравоДоступа("Администрирование", Метаданные, ОсновнаяРоль) Тогда
		// Когда основная роль имеет право Администрирование предполагается,
		// что она содержит все права необходимые для администрирования.
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Администрирование", Метаданные, ТекущийПользовательИБ) Тогда
		// Список пользователей не пустой.
		//
		// Когда основная роль не содержит право Администрирование,
		// а пустой текущий пользователь содержит право Администрирование,
		// то оно было добавлено принудительно, что возможно только при пустом
		// списке пользователей информационной базы.
		Возврат "";
	КонецЕсли;
	
	ТекстОшибки =
		НСтр("ru = 'Запуск с пустым списком пользователей информационной базы невозможен.
		           |Необходимо добавить администратора системы с двумя ролями
		           |""Администратор системы"", ""Полные права"" и повторить запуск программы от его имени.
		           |
		           |Для перехода к списку пользователей информационной базы необходимо открыть
		           |Конфигуратор и воспользоваться пунктом меню ""Администрирование - Пользователи"".'");
	
	Если НЕ ВернутьТекстОшибки Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Вызывается при начале работы системы, чтобы проверить возможность выполнения авторизации и
// вызвать заполнение значений параметров сеанса ТекущийПользователь и ТекущийВнешнийПользователь.
// Также вызывается при входе в область данных.
//
// Возвращаемое значение:
//  Строка - пустая строка   - авторизация выполнена успешно.
//           непустая строка - описание ошибки.
//                             При начале работы системы следует
//                             завершить работу 1С:Предприятия.
//
Функция АвторизоватьТекущегоПользователя(ПриНачалеРаботыСистемы = Ложь) Экспорт
	
	Если НЕ ПриНачалеРаботыСистемы Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		// Программное заполнение списка пользователей.
		Перезапустить = Ложь;
		ДополнительныеПараметрыКоманднойСтроки = "";
		
		ПередАвторизациейТекущегоПользователяПриНачалеРаботыСистемы(
			Перезапустить, ДополнительныеПараметрыКоманднойСтроки);
		
		Если Перезапустить Тогда
			Возврат Новый Структура(
				"ДополнительныеПараметрыКоманднойСтроки",
				ДополнительныеПараметрыКоманднойСтроки);
		КонецЕсли;
		
		// Проверка возможности продолжения.
		ТекстОшибки = ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ(Истина);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Возврат ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПроверитьПраваПользователя(ТекущийПользовательИБ);
	
	ЗарегистрироватьНеразделенногоПользователя();
	
	Если ПустаяСтрока(ТекущийПользовательИБ.Имя) Тогда
		// Авторизуется пользователь по умолчанию
		Возврат "";
	КонецЕсли;
	
	ЭтоНеразделенныйПользователь = ОбщегоНазначенияПовтИспДополнительно.РазделениеВключено()
	                             И ТекущийПользовательИБ.РазделениеДанных.Количество() = 0;
	
	НайденныйПользователь = Неопределено;
	Если ПользовательПоИдентификаторуСуществует(
	       ТекущийПользовательИБ.УникальныйИдентификатор, , НайденныйПользователь) Тогда
		// ПользовательИБ найден в справочнике.
		
		Если ПриНачалеРаботыСистемы
		   И ПользователиДополнительно.ЭтоПолноправныйПользователь(ТекущийПользовательИБ, , Ложь)
		   И НЕ ЭтоНеразделенныйПользователь Тогда
			
			ПриАвторизацииАдминистратораПриНачалеРаботыСистемы(НайденныйПользователь);
		КонецЕсли;
		
		Возврат "";
	КонецЕсли;
	
	Если ЭтоНеразделенныйПользователь Тогда
		// Это неразделенный пользователь, требуется создать элемент в текущей области.
		НачатьТранзакцию();
		Попытка
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Наименование = ПользователиДополнительно.ПолноеИмяСлужебногоПользователя(
				ТекущийПользовательИБ.УникальныйИдентификатор);
			
			ОписаниеПользователяИБ = Новый Структура;
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			ОписаниеПользователяИБ.Вставить(
				"УникальныйИдентификатор", ТекущийПользовательИБ.УникальныйИдентификатор);
			
			ПользовательОбъект.ДополнительныеСвойства.Вставить(
				"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
			ПользовательОбъект.Записать();
		
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		Возврат "";
	КонецЕсли;
	
	// Требуется либо создать администратора, либо сообщить об отказе авторизации.
	ТекстСообщенияОбОшибке = "";
	ТребуетсяСоздатьАдминистратора = Ложь;
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Если ПользователиИБ.Количество() = 1 Или ПользователиДополнительно.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
		// Авторизуется администратор, созданный в конфигураторе.
		ТребуетсяСоздатьАдминистратора = Истина;
	Иначе
		// Авторизуется обычный пользователь, созданный в конфигураторе.
		ТекстСообщенияОбОшибке = ТекстСообщенияПользовательНеНайденВСправочнике(ТекущийПользовательИБ.Имя);
	КонецЕсли;
	
	Если ТребуетсяСоздатьАдминистратора Тогда
		
		Если РольДоступна(Метаданные.Роли.ПолныеПрава)
			И (РольДоступна(ПользователиДополнительно.РольАдминистратораСистемы())
			   ИЛИ ОбщегоНазначенияПовтИспДополнительно.РазделениеВключено() ) Тогда
			
			Пользователь = ПользователиДополнительно.СоздатьАдминистратора(ТекущийПользовательИБ);
			
			Комментарий =
				НСтр("ru = 'Выполняется запуск от имени пользователя с ролью ""Полные права"",
				           |который не зарегистрирован в списке пользователей.
				           |Выполнена автоматическая регистрация в списке пользователей.
				           |
				           |Для ведения списка и настройки прав пользователей предназначен список Пользователи,
				           |режим конфигурирования 1С:Предприятия для этого использовать не следует.'");
			
			ПослеЗаписиАдминистратораПриАвторизации(Комментарий);
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Пользователи.Администратор зарегистрирован в справочнике Пользователи'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.Пользователи,
				Пользователь,
				Комментарий);
		Иначе
			ТекстСообщенияОбОшибке =
				НСтр("ru = 'Запуск от имени пользователя с правом Администрирование невозможен,
				           |так как он не зарегистрирован в списке пользователей.
				           |
				           |Для ведения списка и настройки прав пользователей предназначен список Пользователи,
				           |режим конфигурирования 1С:Предприятия для этого использовать не следует.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстСообщенияОбОшибке;
	
КонецФункции

// Возвращает недоступные роли для указанного типа пользователей.
//
// Параметры:
//  ТипПользователей - ПеречислениеСсылка.ТипыПользователей.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие, где Ключ - имя роли, а Значение - Истина.
//
Функция НедоступныеРолиПоТипуПользователей(ТипПользователей) Экспорт
	
	НедоступныеРоли = ПользователиСлужебныйПовтИсп.Параметры(
		).НедоступныеРолиПоТипамПользователей;
	
	Возврат НедоступныеРоли.Получить(ТипПользователей);
	
КонецФункции

// Переопределяет действие перед авторизацией пользователя,
// выполняемой при начале работы системы (в процессе получения
// параметров работы клиента при запуске).
//
// Можно заполнить состав пользователей и выполнить перезапуск.
// 
// Требуется, например, при настройке автономного рабочего места.
// 
// Параметры:
//  Перезапустить - Булево, начальное значение Ложь. Если указать
//                  Истина, тогда работа системы будет прекращена.
//
//  ДополнительныеПараметрыКоманднойСтроки - Строка, которая может
//                  быть заполнена для передачи во второй параметр
//                  метода ПрекратитьРаботуСистемы.
//
Процедура ПередАвторизациейТекущегоПользователяПриНачалеРаботыСистемы(
		Перезапустить,
		ДополнительныеПараметрыКоманднойСтроки) Экспорт
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("АвтономнаяРаботаСлужебный");
		Модуль.ПередАвторизациейТекущегоПользователяПриНачалеРаботыСистемы(Перезапустить);
	КонецЕсли;
	
КонецПроцедуры


// Проверяет права указанного Пользователя ИБ в режиме разделения данных.
//
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы.
//
Процедура ПроверитьПраваПользователя(ПользовательИБ)
	
	Если ОбщегоНазначенияПовтИспДополнительно.РазделениеВключено() Тогда
		
		Если ПользовательИБ.РазделениеДанных.Количество() > 0 Тогда
			
			НедоступныеРоли = НедоступныеРолиПоТипуПользователей(
				Перечисления.ТипыПользователей.ПользовательОбластиДанных);
			
			НайденныеНедоступныеРоли = Новый Массив;
			
			Для каждого Роль Из ПользовательИБ.Роли Цикл
				ИмяРоли = Роль.Имя;
				
				СвойстваНедоступнойРоли = НедоступныеРоли.Получить(ИмяРоли);
				Если СвойстваНедоступнойРоли <> Неопределено Тогда
					НайденныеНедоступныеРоли.Добавить(Роль);
					
					Если СвойстваНедоступнойРоли.Свойство("ИзменяемыеНеразделенныеДанные") Тогда
						Запись = Новый ЗаписьXML;
						Запись.УстановитьСтроку();
						СериализаторXDTO.ЗаписатьXML(Запись, СвойстваНедоступнойРоли.ИзменяемыеНеразделенныеДанные);
						ТаблицаСтрокой = Запись.Закрыть();
						
						ЗаписьЖурналаРегистрации(
							НСтр("ru = 'Пользователи.Ошибка при установке ролей пользователю ИБ'"),
							УровеньЖурналаРегистрации.Ошибка,
							,
							ПользовательИБ,
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Разделенному пользователю назначена роль
								           |""%1"",
								           |предоставляющая права на изменение общих данных:
								           |""%2"".'"),
								Роль.Представление(),
								ТаблицаСтрокой) );
					КонецЕсли;
					
					Если СвойстваНедоступнойРоли.Свойство("Права") Тогда
						
						Для каждого Право Из СвойстваНедоступнойРоли.Права Цикл
							ЗаписьЖурналаРегистрации(
								НСтр("ru = 'Пользователи.Ошибка при установке ролей пользователю ИБ'"),
								УровеньЖурналаРегистрации.Ошибка,
								,
								ПользовательИБ,
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Разделенному пользователю назначена роль
									           |""%1"",
									           |предоставляющая право ""%2"".'"),
									Роль.Представление(),
									Право));
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденныеНедоступныеРоли.Количество() > 0 Тогда
				
				Если НайденныеНедоступныеРоли.Количество() = 1 Тогда
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Разделенным пользователям не может быть назначена роль
						           |""%1"".'"),
						НайденныеНедоступныеРоли[0].Представление());
				Иначе
					Роли = "";
					Для каждого Роль Из НайденныеНедоступныеРоли Цикл
						Роли = "
						|" + Роль.Представление();
					КонецЦикла;
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Разделенным пользователям не могут быть назначены роли:%1.'"),
						Роли);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// При работе в модели сервиса, заносит текущего пользователя в список неразделенных,
// если у него не установлено использование разделителей.
//
Процедура ЗарегистрироватьНеразделенногоПользователя() Экспорт
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПользователиВМоделиСервиса") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("ПользователиСлужебныйВМоделиСервиса");
		Модуль.ЗарегистрироватьНеразделенногоПользователя();
	КонецЕсли;
	
КонецПроцедуры

// Определяет наличие элемента в справочнике Пользователи
// по уникальному идентификатору
// пользователя информационной.
//  Функция используется для проверки наличия связи пользователяИБ только
// с одним элементом справочников Пользователи.
//
// Параметры:
//  УникальныйИдентификатор - идентификатор пользователя ИБ.
//
//  СсылкаНаТекущего - СправочникСсылка.Пользователи - исключить
//                       указанную ссылку из поиска.
//                     Неопределено - искать среди всех элементов справочников.
//
//  НайденныйПользователь (Возвращаемое значение):
//                     Неопределено - пользователь не существует.
//                     СправочникСсылка.Пользователи, если найден.
//
// Возвращаемое значение:
//  Булево.
//
Функция ПользовательПоИдентификаторуСуществует(УникальныйИдентификатор,
                                               СсылкаНаТекущего = Неопределено,
                                               НайденныйПользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаТекущего", СсылкаНаТекущего);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &УникальныйИдентификатор
	|	И Пользователи.Ссылка <> &СсылкаНаТекущего
	|";
	
	Результат = Ложь;
	НайденныйПользователь = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НайденныйПользователь = Выборка.Пользователь;
			Результат = Истина;
			ПользователиДополнительно.НайтиНеоднозначныхПользователейИБ(, УникальныйИдентификатор);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Переопределяет действие при авторизации администратора локальной ИБ
// или администратора области данных.
//
Процедура ПриАвторизацииАдминистратораПриНачалеРаботыСистемы(Администратор) Экспорт
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("УправлениеДоступомСлужебный");
		Модуль.ПриАвторизацииАдминистратораПриНачалеРаботыСистемы(Администратор);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстСообщенияПользовательНеНайденВСправочнике(ИмяПользователя)
	
	ТекстСообщенияОбОшибке = НСтр("ru = 'Авторизация не выполнена. Работа системы будет завершена.
	                                    |
	                                    |Пользователь ""%1"" не найден в справочнике ""Пользователи"".
	                                    |
	                                    |Обратитесь к администратору.'");
	
	ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ИмяПользователя);
	
	Возврат ТекстСообщенияОбОшибке;
	
КонецФункции

// Переопределяет текст комментария при авторизации пользователя ИБ,
// созданного в конфигураторе с административными правами.
//  Вызывается из Пользователи.АвторизоватьТекущегоПользователя().
//  Комментарий записывается в журнал регистрации.
// 
// Параметры:
//  Комментарий  - Строка - начальное значение задано.
//
Процедура ПослеЗаписиАдминистратораПриАвторизации(Комментарий) Экспорт
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("УправлениеДоступомСлужебный");
		Модуль.ПослеЗаписиАдминистратораПриАвторизации(Комментарий);
	КонецЕсли;
	
КонецПроцедуры

