// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Запись.Приоритетный = 100 ИЛИ Запись.Приоритетный = 0 Тогда
		Отказ = Ложь;
	Иначе	
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Запись.Приоритетный = 100;
	Если ЗначениеЗаполнено(Запись.Страна) Тогда
		врРегион  = врРегион + Запись.Страна;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Запись.Область) Тогда
		врРегион  = ?(ЗначениеЗаполнено(врРегион), врРегион+"; ", врРегион);
		врРегион  = врРегион + Запись.Область;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Запись.Город) Тогда
		врРегион  = ?(ЗначениеЗаполнено(врРегион), врРегион+"; ", врРегион);
		врРегион  = врРегион + Запись.Город;
	КонецЕсли;
	
	врНачалоД = ЧислоВСтроку(Запись.НачалоДиапазона);
	врКонецД  = ЧислоВСтроку(Запись.КонецДиапазона);
КонецПроцедуры

&НаСервере
Функция ЧислоВСтроку(Число)

	врСтрока = Формат(Число, "ЧРГ=; ЧГ=");
	Если Лев(врСтрока,1)="1" Тогда
	 	врСтрока = Прав(врСтрока, СтрДлина(врСтрока)-1);
	КонецЕсли; 

	Возврат врСтрока;
КонецФункции // ЧислоВСтроку()
 
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Запись.КодСтраны) 
		 ИЛИ НЕ ЗначениеЗаполнено(Запись.КодГорода) 
		 ИЛИ НЕ ЗначениеЗаполнено(врРегион) Тогда
	 	Отказ = Истина;
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Все поля формы обязательно необходимо заполнить!");
	КонецЕсли; 
	НачалоД = СокрЛП(врНачалоД);
	КонецД  = СокрЛП(врКонецД);
	
	КодыНомера = СокрЛП(Запись.КодСтраны) + СокрЛП(Запись.КодГорода); 
	Если Лев(НачалоД, СтрДлина(КодыНомера)) <> КодыНомера Тогда
	 	Отказ = Истина;
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Начало диапазона должно начинаться с " + КодыНомера);
	КонецЕсли; 
	
	Если Лев(КонецД, СтрДлина(КодыНомера)) <> КодыНомера Тогда
	 	Отказ = Истина;
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Конец диапазона должен начинаться с " + КодыНомера);
	КонецЕсли; 
	
	Если СтрДлина(НачалоД) <> СтрДлина(КонецД) Тогда
	 	Отказ = Истина;
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Начало и конце диапазона имеют различный порядок.");
	КонецЕсли; 
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Запись.ШаблонПоиска    = "" + Запись.КодСтраны + Запись.КодГорода + "%";
	Запись.Город 		   = врРегион;
	Запись.НачалоДиапазона = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(НачалоД, 32);
	Запись.КонецДиапазона  = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(КонецД, 32);
КонецПроцедуры
// #КонецОбласти