
Перем мВалютаРегламентированногоУчета Экспорт;

// Хранит вид малоценки МБП
Перем мМБП Экспорт;

Перем ВестиУчетПоДопРазрезамРегл Экспорт; 
Перем ВестиСкладскойУчетБУ;

Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"           , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , МоментВремени());
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("Отпустил"         , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата                           КАК ДатаАкта,
	|	Док.Номер                          КАК НомерАкта,
	|	Док.Организация.НаименованиеПолное КАК Организация,
	|	Док.ПодразделениеОрганизации       КАК ПринялоПодразделение,
	|	ПРЕДСТАВЛЕНИЕ(Док.Склад)           КАК СдалоПодразделение,
	|	Док.Дата                           КАК ДатаВвода,
	|	КодыОрганизации.КодПоЕДРПОУ        КАК ЕДРПОУ,
	|	ФИООтпустил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""         КАК СдалФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)               КАК СдалДолжность,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&НаДату,
	|		                                 Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Отпустил) КАК ФИООтпустил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо = &Отпустил
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ПодразделениеОрганизации = РаботникиОрганизаций.ПодразделениеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ 
	|	Док.Ссылка = &Ссылка
	|	";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

													
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"         , Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	Запрос.УстановитьПараметр("Организация"    , Организация);
	Запрос.УстановитьПараметр("Подразделение"  , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	
	ВидыМалоценки = Новый Массив;
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.МалоценныйНеоборотныйАктив);
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.БиблиотечныеФонды);
	Запрос.УстановитьПараметр("ВидМалоценки", ВидыМалоценки);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.ФизЛицо.Код                                    КАК КодМОЛа,
	|	ФИОПолучил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОПолучил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОПолучил.Отчество, 1, 1) + ""."" КАК ПолучилФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)      КАК ПолучилДолжность,
	|	Док.НазначениеИспользования.СчетБУДляПечати        КАК СчетДт,
	|	Док.СчетУчетаБУ                                    КАК СчетКт,
	|	Док.Номенклатура.НаименованиеПолное                КАК НаименованиеОС" + ?(Проведен, ",
	|	ВЫБОР
	|		КОГДА Хозрасчетный.КоличествоОборотДт = 0
	|			ТОГДА Хозрасчетный.СуммаОборот
	|		ИНАЧЕ Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт
	|	КОНЕЦ                                              КАК ПервоначальнаяСтоимость", "") + "
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо В (&СписокРаботников)) КАК ФИОПолучил
	|		ПО Док.ФизЛицо = ФИОПолучил.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо В (&СписокРаботников)
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|			И (РаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение)" + ?(Проведен, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			                   &МоментДокумента,
	|			                   &МоментДокумента, , 
	|			                   СчетДт = &СчетМЦ,
	|			                   &Субконто, , , ) КАК Хозрасчетный
	|		ПО Док.ФизЛицо = Хозрасчетный.СубконтоДт1
	|			И Док.НазначениеИспользования = Хозрасчетный.СубконтоДт2", "") + "
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|	И Док.НазначениеИспользования.ВидМалоценки В(&ВидМалоценки)";
		
	
	Результат = Запрос.Выполнить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводВЭксплуатациюОС_ОЗ1";
	Макет = ПолучитьОбщийМакет("ОЗ1");
	
    ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Если Результат.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	ВыборкаПоОС = Результат.Выбрать();
	
	Пока ВыборкаПоОС.Следующий() Цикл

		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(ВыборкаПоШапке);
		Параметры.Заполнить(ВыборкаПоКомиссии);
		Параметры.Заполнить(ВыборкаПоОС);
		Параметры.ВидОперации = "Передача в эксплуатацію";
		Параметры.Валюта      = ВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	ТабДокумент.ОбластьПечати = ТабДокумент.Область(2, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Функция формирует печатную форму М-11
//
Функция ПечатьМ11()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("ЧерезКого"        , ЧерезКого);
	Запрос.УстановитьПараметр("ОтпускРазрешил"   , ОтпускРазрешил);
	Запрос.УстановитьПараметр("Отпустил"         , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	Док.Склад                                                   КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	Док.Основание                                               КАК Основание,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ФИОЧерезКого.Имя + "" ""
	|		+ ФИОЧерезКого.Отчество                                 КАК ЧерезКого,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Отчество, 1, 1) + "".""        КАК ЧерезКогоФИО,
	|	ФИООтпускРазрешил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Отчество, 1, 1) + "".""   КАК ОтпускРазрешил,
	|	ФИООтпустил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""         КАК Отпустил,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ЧерезКого) КАК ФИОЧерезКого
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ОтпускРазрешил) КАК ФИООтпускРазрешил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Отпустил) КАК ФИООтпустил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	                            
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Если Проведен Тогда
		
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
		Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
		
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
		Запрос.УстановитьПараметр("Субконто", МассивСубконто);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФИОКому.Фамилия + "" ""
		|		+ ФИОКому.Имя + "" ""
		|		+ ФИОКому.Отчество                                              КАК Кому,
		|	ФИОКому.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
		|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
		|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
		|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
		|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
		|	ВложенныйЗапрос.Количество                                          КАК Количество,
		|	ВложенныйЗапрос.Цена                                                КАК Цена,
		|	ВложенныйЗапрос.Стоимость                                           КАК Стоимость
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт1 КАК Справочник.ФизическиеЛица)                          КАК Кому,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).Владелец        КАК Номенклатура,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати КАК СчетПередачиБУ,
		|		СУММА(Хозрасчетный.КоличествоОборотДт)                                                    КАК Количество,
		|		ВЫБОР
		|			КОГДА Хозрасчетный.КоличествоОборотДт = 0
		|				ТОГДА Хозрасчетный.СуммаОборот
		|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт КАК ЧИСЛО(15, 2))
		|		КОНЕЦ КАК Цена,
		|		СУММА(Хозрасчетный.СуммаОборот) КАК Стоимость
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|		                   &МоментДокумента,
		|		                   &МоментДокумента, , 
		|		                   СчетДт = &СчетМЦ,
		|		                   &Субконто, , , ) КАК Хозрасчетный
		|	ГДЕ
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).ВидМалоценки = &ВидМалоценки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт1 КАК Справочник.ФизическиеЛица),
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).Владелец,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати,
		|		ВЫБОР
		|			КОГДА Хозрасчетный.КоличествоОборотДт = 0
		|				ТОГДА Хозрасчетный.СуммаОборот
		|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт КАК ЧИСЛО(15, 2))
		|		КОНЕЦ
		|		) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизЛицо В (&СписокРаботников)) КАК ФИОКому
		|		ПО ВложенныйЗапрос.Кому = ФИОКому.ФизЛицо
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Стоимость)
		|ПО
		|	Кому";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОКому.Фамилия + "" ""
		|		+ ФИОКому.Имя + "" ""
		|		+ ФИОКому.Отчество                                             КАК Кому,
		|	ФИОКому.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
		|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
		|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
		|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
		|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
		|	ВложенныйЗапрос.Количество                                          КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.ФизЛицо                                 КАК Кому,
		|		Док.Номенклатура                            КАК Номенклатура,
		|		Док.НазначениеИспользования.СчетБУДляПечати КАК СчетПередачиБУ,
		|		СУММА(Док.Количество)                       КАК Количество
		|	ИЗ
		|		Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ТекущийДокумент
		|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
		|	                                                          
		|	СГРУППИРОВАТЬ ПО
		|		Док.ФизЛицо,
		|		Док.Номенклатура,
		|		Док.НазначениеИспользования.СчетБУДляПечати) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизЛицо В (&СписокРаботников)) КАК ФИОКому
		|		ПО ВложенныйЗапрос.Кому = ФИОКому.ФизЛицо
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Кому";
		
	КонецЕсли;

	ЗапросПоНоменклатуре = Запрос.Выполнить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценкиВЭксплуатацию_М11";
	
	Макет = ПолучитьОбщийМакет("М11");
	
	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаКому   = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НеПервый      = Ложь;
	ЕстьЧерезКого = ЗначениеЗаполнено(ЧерезКого);
	ОбластьНомера = Макет.ПолучитьОбласть("Номера");
	
	Пока ВыборкаКому.Следующий()Цикл
		
		Если НеПервый Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		НеПервый = Истина;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.Кому = ВыборкаКому.Кому;
		Область.Параметры.КодОперации = "Передача в эксплуатацію";	
		Область.Параметры.Валюта      = мВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(Область);
		ТабДокумент.Вывести(ОбластьНомера);
		
		ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		ПараметрыПодвал = ОбластьПодвал.Параметры;
		ПараметрыПодвал.Заполнить(Шапка);
		
		Если Проведен Тогда
			
			ПрописьВалюты = мВалютаРегламентированногоУчета.ПараметрыПрописиНаУкраинском;
			ПараметрыПодвал.ИтогоСуммаПрописью = ЧислоПрописью(ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаКому.Стоимость),
			"Л=uk_UA;ДП=Истина;", ПрописьВалюты);
			
		КонецЕсли;
		
		ВыборкаПоСтрокам = ВыборкаКому.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
		КоличествоОбработанных = 1;
		// В форме сказано "Кількість найменувань". Будет выводится количество позиций.
		ПараметрыПодвал.ИтогоКоличествоПрописью = ЧислоПрописью(КоличествоВВыборке, 
		"Л=uk_UA;НП=Ложь;НД=Ложь;", ",,,,,,,,0");
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			Если КоличествоОбработанных = КоличествоВВыборке Тогда
				// Последняя запись. Ее не следует отрывать от подписей.
				
				МассивТаблиц = Новый Массив(2);
				МассивТаблиц[0] = Область;
				МассивТаблиц[1] = ОбластьПодвал;
				
				Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьНомера);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
			КоличествоОбработанных = КоличествоОбработанных + 1;
			КомуФИО                = ВыборкаПоСтрокам.КомуФИО;
			
		КонецЦикла;
		
		ПараметрыПодвал.Получил = ?(ЕстьЧерезКого, Шапка.ЧерезКогоФИО, КомуФИО);
		ТабДокумент.Вывести(ОбластьПодвал);
	
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область("C2:C" + ТабДокумент.ШиринаТаблицы);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьМ11()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("МОЛ"              , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	Док.Склад                                                   КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОМОЛ.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Отчество, 1, 1) + "".""              КАК МОЛ,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &МОЛ) КАК ФИОМОЛ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
 	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура.Код                                    КАК НоменклатурныйНомер,
	|	Док.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
	|	Док.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
	|	Док.СчетПередачиБУ                                      КАК СчетПередачи,
	|	Док.Количество                                          КАК Количество,
	|	Док.ФизЛицо                                             КАК Сотрудник,
	|	Док.ФизЛицо.Код                                         КАК ТабельныйНомер,
	|	Док.ДатаДокумента                                       КАК ДатаДокумента,
	|	Док.СрокСлужбы                                          КАК СрокСлужбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Номенклатура                            КАК Номенклатура,
	|		Док.НазначениеИспользования.СчетБУДляПечати КАК СчетПередачиБУ,
	|		СУММА(Док.Количество)                       КАК Количество,
	|		МИНИМУМ(Док.НомерСтроки) 		            КАК НомерСтроки,
	|		Док.ФизЛицо                                 КАК ФизЛицо,
	|		Док.Ссылка.Дата                             КАК ДатаДокумента,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы
	|	ИЗ
	|		Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ТекущийДокумент
	|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
	|
	|	СГРУППИРОВАТЬ ПО
	|		Док.Номенклатура,
	|		Док.НазначениеИспользования.СчетБУДляПечати,
	|		Док.ФизЛицо,
	|		Док.Ссылка.Дата,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования) КАК Док
	|
	|УПОРЯДОЧИТЬ ПО НомерСтроки ВОЗР";

	ЗапросПоНоменклатуре = Запрос.Выполнить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценкиВЭксплуатацию_МШ7";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("МШ7");
	
	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Шапка);
	Область.Параметры.КодОперации = "Передача в эксплуатацію";	
	
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(Шапка);
	
	ТабДокумент.Вывести(Область);

	ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
	ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
	
	ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
	КоличествоОбработанных = 1;
	
	Пока ВыборкаПоСтрокам.Следующий() Цикл

		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(ВыборкаПоСтрокам);
		Область.Параметры.НомерПП = КоличествоОбработанных;
		
		Если КоличествоОбработанных = КоличествоВВыборке Тогда
			// Последняя запись. Ее не следует отрывать от подписей.
			
			МассивТаблиц = Новый Массив(2);
			МассивТаблиц[0] = Область;
			МассивТаблиц[1] = ОбластьПодвал;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
        КоличествоОбработанных = КоличествоОбработанных + 1;

	КонецЦикла;

	// Вывод подвала
	ТабДокумент.Вывести(ОбластьПодвал);

	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ2(ПечатьПоДаннымУпрУчета = Истина)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"	, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("НаДату"          , Дата);
	Запрос.УстановитьПараметр("Организация"     , Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаМалоценкиВЭксплуатацию.Номер 	                      КАК НомерДокумента,
	|	ПередачаМалоценкиВЭксплуатацию.Дата	                       	  КАК ДатаДокумента,
	|	ПередачаМалоценкиВЭксплуатацию.Организация                    КАК Организация,
	|	ПередачаМалоценкиВЭксплуатацию.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ПередачаМалоценкиВЭксплуатацию.Склад                          КАК Склад,
	|	КодыОрганизации.КодПоЕДРПОУ    										  КАК КодПоЕДРПОУ,
	|	ПередачаМалоценкиВЭксплуатацию.ПодразделениеОрганизации 	  КАК ПредставлениеПодразделения
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию КАК ПередачаМалоценкиВЭксплуатацию
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО ПередачаМалоценкиВЭксплуатацию.Организация = КодыОрганизации.Организация
	|
	|ГДЕ
	|	ПередачаМалоценкиВЭксплуатацию.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
 	Запрос.УстановитьПараметр("ВидМалоценногоАктива"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура.Код КАК НоменклатурныйНомер,
	|	ВЫРАЗИТЬ(Док.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК МатериалНаименование,
	|	Док.Количество КАК Количество,
	|	Док.ФизЛицо КАК Сотрудник,
	|	Док.ФизЛицо.Код КАК ТабельныйНомер,
	|	Док.ДатаДокумента КАК ДатаДокумента,
	|	Док.СрокСлужбы КАК СрокСлужбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Номенклатура КАК Номенклатура,
	|		СУММА(Док.Количество) КАК Количество,
	|		МИНИМУМ(Док.НомерСтроки) КАК НомерСтроки,
	|		Док.ФизЛицо КАК ФизЛицо,
	|		Док.Ссылка.Дата КАК ДатаДокумента,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы
	|	ИЗ
	|		Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ТекущийДокумент
	|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценногоАктива
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.Номенклатура,
	|		Док.ФизЛицо,
	|		Док.Ссылка.Дата,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования) КАК Док
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки
	|ИТОГИ ПО
	|	Сотрудник";

	ЗапросПоНоменклатуре = Запрос.Выполнить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценкиВЭксплуатацию_МШ2";
	
	// Вывод заголовка
	Макет = ПолучитьМакет("МШ2");
	
	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(Шапка);
	
	НеПервый                 = Ложь;
	
	ВыборкаСотрудники = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		Если НеПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			НеПервый = Истина;
		КонецЕсли;
		
		ВыборкаПоСтрокам = ВыборкаСотрудники.Выбрать();
	
		КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
		КоличествоОбработанных = 1;
		
		ДанныеСотрудника = ОбщегоНазначения.ДанныеФизЛица(Организация, ВыборкаСотрудники.Сотрудник, Дата);
		
		ОбластьШапка.Параметры.Сотрудник 		= ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
		ОбластьШапка.Параметры.Должность 		= ДанныеСотрудника.Должность;
		
		ОбластьШапка.Параметры.ТабельныйНомер	= ВыборкаСотрудники.ТабельныйНомер; //ДанныеСотрудника.ТабельныйНомер
	
		ТабДокумент.Вывести(ОбластьШапка);
		ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
		ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
		ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
		ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
			
		Пока ВыборкаПоСтрокам.Следующий() Цикл

			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			Область.Параметры.МатериалНаименование = СокрЛП(ВыборкаПоСтрокам.МатериалНаименование);
			
			Если КоличествоОбработанных = КоличествоВВыборке Тогда
				// Последняя запись. Ее не следует отрывать от подписей.
				
				МассивТаблиц = Новый Массив(1);
				МассивТаблиц[0] = Область;
				
				Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
			КоличествоОбработанных = КоличествоОбработанных + 1;

		КонецЦикла;
			
	КонецЦикла;		

	Возврат ТабДокумент;

КонецФункции // ПечатьМШ2()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "МШ7" Тогда
		
		ТабДокумент = ПечатьМШ7();
		
	ИначеЕсли ИмяМакета = "МШ2" Тогда
		
		ТабДокумент = ПечатьМШ2();
		
	ИначеЕсли ИмяМакета = "М11" Тогда
		
		ТабДокумент = ПечатьМ11();
		
	ИначеЕсли ИмяМакета = "ОЗ1" Тогда
		
		ТабДокумент = ПечатьОЗ1();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка), Ссылка);
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("МШ2, МШ7, М11, ОЗ1",
							"Ведомость МШ-2",
							"Ведомость МШ-7",
							"Накладная M-11",
							"Форма ОЗ-1");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


// Процедура заполняет счета  учета по бухгалтерскому учету 
// по назначению использования 
//
Процедура ЗаполнитьСчетУчетаБУПоНазначениюИспользования(СтрокаТЧ) Экспорт
	
	Если ЗначениеЗаполнено(СтрокаТЧ.НазначениеИспользования) Тогда
		
		Если СтрокаТЧ.НазначениеИспользования.ВидМалоценки = мМБП Тогда
			
			СтрокаТЧ.СчетУчетаБУ                = ПланыСчетов.Хозрасчетный.МалоценныеИБыстроизнашивающиесяПредметыНаСкладе;
			
		Иначе                                      
			
			СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетУчетаБУПоНазначениюИспользования()
 
// Процедура заполняет счета учета по бухгалтерскому и налоговому учету.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ЗаполнятьБУ, ЗаполнятьНУ = Истина) Экспорт

	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);

	Если ЗаполнятьБУ Тогда
		СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
	КонецЕсли;	
	
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, Склад";
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", Подразделение";
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", ПодразделениеОрганизации";
	КонецЕсли;
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура дополняет список реквизитов шапки регл. реквизитами
//
Процедура ДополнитьРеквизитыТабличнойЧастиРегл(СтруктураШапкиДокумента, Реквизиты)
	
	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	Реквизиты = Реквизиты 
	          + ?(ПустаяСтрока(Реквизиты), "", ", ") 
	          + "СчетУчетаБУ";
			  
КонецПроцедуры // ДополнитьРеквизитыТабличнойЧастиРегл()

// Функция проверяет правильность заполнения документа
// Возврат - структура с данными шапки документа
//
Функция ПроверкаРеквизитов(Отказ, Заголовок) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад", "ВидСклада", "ВидСклада");
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	РеквизитыТЧ = "Номенклатура, Количество, ФизЛицо, НазначениеИспользования";
	
	ДополнитьРеквизитыТабличнойЧастиРегл(СтруктураШапкиДокумента, РеквизитыТЧ);
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "МалоценныеАктивы", Новый Структура(РеквизитыТЧ), Отказ, Заголовок);
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции // ПроверкаРеквизитов()

// Проверяет правильность выбора назначений использования, выбранных
// в табличной части.
//
Процедура ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Для каждого СтрокаТЧ Из ТаблицаПоМалоценке Цикл
	
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("Строка номер ""¤1¤"" табличной части ""малоценные активы"": ", СокрЛП(СтрокаТЧ.НомерСтроки)) + Символы.ПС;
										
		Если СтрокаТЧ.Номенклатура <> СтрокаТЧ.ВладелецНазначения Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + Локализация.СтрШаблон1("Назначение использования <¤1¤> не соответствует номенклатуре <¤2¤>.", СтрокаТЧ.НазначениеИспользования, СтрокаТЧ.Номенклатура),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособОтраженияРасходов) Тогда
				
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
							 + Локализация.СтрШаблон1("В назначении использования <¤1¤> не выбран ""Способ отражения расходов"".", СтрокаТЧ.НазначениеИспользования),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВидМалоценки) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + Локализация.СтрШаблон1("В назначении использования <¤1¤> не выбран ""Вид малоценки"".", СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КорСчетСписанияБУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
				                 + Локализация.СтрШаблон1("В назначении использования <¤1¤> не выбран ""Счет передачи"".", СтрокаТЧ.НазначениеИспользования),
				                 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
			Если (СтрокаТЧ.ВидМалоценки <> мМБП)
				И НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетАмортизацииБУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
				                 + Локализация.СтрШаблон1("В назначении использования <¤1¤> не выбран ""Счет амортизации"".", СтрокаТЧ.НазначениеИспользования),
				                 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
								 
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ЕстьНДС Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
						
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
									 + Локализация.СтрШаблон1("Не заполнено ""Налоговое назначение""."),
									 Отказ, Заголовок);
					СтрокаНачалаСообщенияОбОшибке = "";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНазначенияИспользования()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаПоМалоценке, СтруктураШапкиДокумента, Отказ, Заголовок)
		
	// Формирование движений по перемещению малоценки.
	Если Не Отказ Тогда
		
		ФормированиеДвиженийПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);	
		ФормированиеДвиженийУпр(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
		ФормированиеДвиженийПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
		
		ДвиженияПоРегистрамБухРегл(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

Функция ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НомерСтроки                                                          		 КАК НомерСтроки,
	|	&ПустойДоговор                                                           		 КАК ДоговорКонтрагента,
	|	Док.Ссылка.Склад                                                         		 КАК Склад,
	|	Док.Ссылка.Склад.ВидСклада                                                       КАК ВидСклада,
	|	Док.Номенклатура                                                         		 КАК Номенклатура,
	|	Док.НоменклатурнаяПозиция                                                  		 КАК НоменклатурнаяПозиция,
	|	Док.Ссылка.Организация                                                   		 КАК Организация,
	|	Док.Ссылка.Подразделение                                                         КАК Подразделение,
	|	Док.Номенклатура.Услуга                                                  		 КАК Услуга,
	|	Док.Количество* Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент 	 КАК Количество,
	|	Док.ХарактеристикаНоменклатуры                                             		 КАК ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры                                                      		 КАК СерияНоменклатуры,
	|	Док.СчетУчетаБУ                                                         		 КАК СчетУчетаБУ,
	|	Док.НазначениеИспользования.СчетПередачиБУ                              		 КАК КорСчетСписанияБУ,
	|	Док.Номенклатура                                                        		 КАК КорСубконтоСписанияБУ1,
	|	&НомерЖурнала                                                           		 КАК НомерЖурналаБУ,
	|	НЕОПРЕДЕЛЕНО                                                            		 КАК ДокументОприходования,
	|	ИСТИНА                                                                  		 КАК УчитываетсяКакЗапасНУ,
	|	Док.НазначениеИспользования                                             		 КАК НазначениеИспользования,
	|	Док.НазначениеИспользования.Владелец                                    		 КАК ВладелецНазначения,
	|	Док.НалоговоеНазначение                          						 		 КАК НалоговоеНазначениеНовое,
	|	Док.НалоговоеНазначение                          						 		 КАК НалоговоеНазначение,
	|	Док.НазначениеИспользования.СпособОтраженияРасходов                     		 КАК СпособОтраженияРасходов,
	|	Док.НазначениеИспользования.ВидМалоценки                                		 КАК ВидМалоценки,
	|	Док.НазначениеИспользования.СчетАмортизацииБУ                           		 КАК СчетАмортизацииБУ,
	|	Док.Качество																	 КАК Качество,
	|	Док.ФизЛицо                                                             		 КАК ФизЛицо
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка"           , СтруктураШапкиДокумента.Ссылка );
	Запрос.УстановитьПараметр("ПустойДоговор"    , Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("НомерЖурнала"     , "МЦ");
	
	Результат = Запрос.Выполнить();
	ТаблицаМалоценки = Результат.Выгрузить();
		
	ТаблицаМалоценки.Колонки.Добавить("Регистратор");
	ТаблицаМалоценки.ЗаполнитьЗначения(ЭтотОбъект, "Регистратор");
	ТаблицаМалоценки.Колонки.Добавить("СчетДоходовБУ");
	
	ТаблицаМалоценки.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");
	ТаблицаМалоценки.ЗаполнитьЗначения(Истина,"СписыватьТолькоПоЗаказуРегл");
	
	ТаблицаМалоценки.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаМалоценки, "Склад", "ВидСклада");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаМалоценки.ВыгрузитьКолонку("Склад"),
		                 ТаблицаМалоценки.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаМалоценки, ТаблицаПоЦенам, "ВидСклада");
	КонецЕсли;
	
	Для каждого Строка Из ТаблицаМалоценки Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Качество) Тогда
			Строка.Качество = Справочники.Качество.Новый;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТаблицаМалоценки;
	
КонецФункции

// Процедура формирования движений упр. регистров
//
Процедура ФормированиеДвиженийУпр(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// По регистру ТоварыНаСкладах
	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
		НаборДвижений = Движения.ТоварыВРознице;
	Иначе	
		НаборДвижений = Движения.ТоварыНаСкладах;
	КонецЕсли;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Для каждого Строка Из ТаблицаПоМалоценке Цикл

		СтрокаДвижений = ТаблицаДвижений.Добавить();

		СтрокаДвижений.Номенклатура               = Строка.Номенклатура;
 		СтрокаДвижений.Качество					  = Строка.Качество;
		СтрокаДвижений.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры;
		СтрокаДвижений.СерияНоменклатуры		  = Строка.СерияНоменклатуры;
		СтрокаДвижений.Количество                 = Строка.Количество;
		СтрокаДвижений.Склад                      = СтруктураШапкиДокумента.Склад;
		
		Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			СтрокаДвижений.СуммаПродажная = Строка.СуммаПродажная;	
		КонецЕсли;	
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			
			Движения.ТоварыВРознице.ВыполнитьРасход();
			
		Иначе	
			
			Движения.ТоварыНаСкладах.ВыполнитьРасход();
			
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	// По регистру МалоценкаВЭксплуатации.
	НаборДвижений = Движения.МалоценкаВЭксплуатации;
	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийМалоценкиВЭксплуатации.СписаниеПартийВЭксплуатацию, "КодОперации");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.МалоценкаВЭксплуатации.ВыполнитьПриход();
	Иначе
		Возврат;
	КонецЕсли;
	
	
	// По погашению стоимости 
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", СтруктураШапкиДокумента.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииУУ.Номенклатура                                    КАК ОбъектУчета,
	|	ПартииУУ.НазначениеИспользования.СпособОтраженияРасходов КАК НаправлениеАмортизации,
	|	СУММА(ПартииУУ.Стоимость)                                КАК Амортизация
	|ИЗ
	|	РегистрНакопления.ПартииМалоценкиВЭксплуатации КАК ПартииУУ
	|ГДЕ
	|	ПартииУУ.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииУУ.Номенклатура,
	|	ПартииУУ.НазначениеИспользования.СпособОтраженияРасходов";
	ТабАмортизации = Запрос.Выполнить().Выгрузить();
	
	ТабАмортизации.Колонки.Добавить("Местонахождение", 			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТабАмортизации.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Местонахождение");
	
	Если ТабАмортизации.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента);
	
КонецПроцедуры

// Процедура формирования движений по регистру ТоварыОрганизаций
//
Процедура ФормированиеДвиженийПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// По регистру ТоварыОрганизаций
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);

	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	
	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "МалоценныеАктивы", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Формирование движений по регистрам списанные товары и партии товаров на складах.
//
Процедура ФормированиеДвиженийПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НомСтр   = 0;
	ДатаДока = Дата;
	
	Для каждого Строка Из ТаблицаПоМалоценке Цикл

		НомСтр = НомСтр + 1;

		Движение = Движения.СписанныеТовары.Добавить();

		Движение.Период                     = ДатаДока;
		Движение.НомерСтрокиДокумента       = НомСтр;
		Движение.Регистратор                = Ссылка;
		Движение.ДокументПередачи 			= Ссылка;
		Движение.Номенклатура               = Строка.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры			= Строка.СерияНоменклатуры;
		Движение.Количество                 = Строка.Количество;
		Движение.Качество 		            = Строка.Качество;
		Движение.Склад                      = СтруктураШапкиДокумента.Склад;
		Движение.КодОперацииПартииТоваров 	= Перечисления.КодыОперацийПартииТоваров.ПередачаМалоценкиВЭксплуатацию;

		Движение.ДопустимыйСтатус1            = Перечисления.СтатусыПартийТоваров.Купленный;
		Движение.ДопустимыйСтатус2            = Перечисления.СтатусыПартийТоваров.Продукция;
		Движение.ДопустимыйСтатус3            = Перечисления.СтатусыПартийТоваров.Оборудование;
		Движение.ОтражатьВУправленческомУчете = СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
		
		Движение.Подразделение                = Строка.Подразделение;
		Движение.ФизЛицо                      = Строка.ФизЛицо;
		Движение.НазначениеИспользования      = Строка.НазначениеИспользования;
		
	КонецЦикла;

	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

КонецПроцедуры // ФормированиеДвиженийПоРегиструСписанныеТовары()

// Формирование движения по регистру бухгалтерии.
//
Процедура ДвиженияПоРегистрамБухРегл(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьНалогНаПрибыль = СтруктураШапкиДокумента.ЕстьНалогНаПрибыль;
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоМалоценке, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, , "Передача малоценки в эксплуатацию");
	
	Если Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
		// для товаров необходимо списать наценку 
		
		ТаблицаНаценок = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаАТТ(Ссылка, ТаблицаПоМалоценке.ВыгрузитьКолонку("Склад"), ТаблицаПоМалоценке.ВыгрузитьКолонку("Номенклатура"));
		СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
		
		Для каждого Строка Из ТаблицаПоМалоценке Цикл
			
			// только по товам на счетах 2821
			Если НЕ Строка.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.СписанныеПартииБУ.Колонки.Добавить("СуммаНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
			
			Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Номенклатура",			Строка.Номенклатура);
				СтруктураОтбора.Вставить("Склад",					Строка.Склад);
				СтруктураОтбора.Вставить("НоменклатурнаяПозиция",	Партия.НоменклатурнаяПозиция);
				СтруктураОтбора.Вставить("Партия",					Партия.Партия);
				
				СтрокаТаблицыНаценок = ТаблицаНаценок.НайтиСтроки(СтруктураОтбора);
				
				Сумма = Строка.СуммаПродажная / Строка.Количество * Партия.Количество;
				
				Если СтрокаТаблицыНаценок.Количество() = 0 Тогда
					ПокупнаяЦена = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок[0].ПС = 0 Тогда
					СуммаНаценки = СтрокаТаблицыНаценок[0].ТН * Сумма / (СтрокаТаблицыНаценок[0].ПС);
					ПокупнаяЦена = Сумма - СуммаНаценки;
				Иначе
					ПокупнаяЦена = 0;
				КонецЕсли;
				
				Если Сумма - ПокупнаяЦена <> 0 Тогда
					
					Партия.СуммаНаценки = Сумма - ПокупнаяЦена;
					
					// наценку спишем в корреспонденции со счетом учета в АТТ, двумя проводками
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период      = Дата;
					Проводка.Организация = Организация;
					Проводка.Содержание  = "Торговая наценка";
					
					Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УправлениеЗапасамиПартионныйУчет.ЗаполнитьСубконто(Проводка, Строка);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Строка.Склад);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					
					Проводка.Сумма       = -(Сумма - ПокупнаяЦена);
					
					// собственно наценка
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период      = Дата;
					Проводка.Организация = Организация;
					Проводка.Содержание  = "Торговая наценка";
					
					Проводка.СчетДт      = СчетНаценки;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  Строка.Склад);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Строка.Склад);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					
					Проводка.Сумма       = Сумма - ПокупнаяЦена;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;	
	
	КонецЕсли;
	
	ПроводкиБУ   = Движения.Хозрасчетный;
	НомерЖурнала = "МЦ";
	МБП          = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет; 
	
	// Удаление проводок по счету 00 для МБП.
	// Необходимые проводки будут сформированы
	// при погашении стоимости.
	
	ВспомогательныйСчет = ПланыСчетов.Хозрасчетный.Вспомогательный;
	СчетаДт             = ПроводкиБУ.ВыгрузитьКолонку("СчетДт");
	Себестоимость       = ПроводкиБУ.ВыгрузитьКолонку("Сумма");
	КоличествоПроводок  = СчетаДт.Количество();
	
	Для Индекс = 1 По КоличествоПроводок Цикл
		
		ОбратныйИндекс = КоличествоПроводок - Индекс;
		
		Если (СчетаДт[ОбратныйИндекс] = ВспомогательныйСчет) И Себестоимость[ОбратныйИндекс] <> 0 Тогда
			
			ПроводкиБУ.Удалить(ОбратныйИндекс);
			
		КонецЕсли;
	
	КонецЦикла;
	
	// Подготовим таблицу с данными по амортизации для начисления амортизации по направлениям затрат
	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации",
	                                Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета", 
	                                Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабАмортизации.Колонки.Добавить("НоменклатурнаяПозиция", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеПозиции"));
	ТабАмортизации.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТабАмортизации.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТабАмортизации.Колонки.Добавить("Количество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 3));
	ТабАмортизации.Колонки.Добавить("СчетАмортизации");
	ТабАмортизации.Колонки.Добавить("ВидМалоценки", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыМалоценки"));
	ТабАмортизации.Колонки.Добавить("Партия");
	ТабАмортизации.Колонки.Добавить("Склад");          
	ТабАмортизации.Колонки.Добавить("НалоговоеНазначение"	, Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	
	Для Каждого СтрокаТЧ Из ТаблицаПоМалоценке Цикл
		
		СписанныеПартииБУ = СтрокаТЧ.СписанныеПартииБУ;
		
		// проводка по счету МЦ.
		Проводка = ПроводкиБУ.Добавить();
		
		Если СписанныеПартииБУ.Колонки.Найти("СуммаНаценки") = Неопределено Тогда
			
			 СписанныеПартииБУ.Колонки.Добавить("СуммаНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		
		КонецЕсли;
		
		СуммаПроводки = СписанныеПартииБУ.Итог("СуммаСписания") - СписанныеПартииБУ.Итог("СуммаНаценки");
		СуммаПроводкиНУ = СписанныеПартииБУ.Итог("СуммаСписанияНУ");
		
		Проводка.Период       = СтруктураШапкиДокумента.Дата;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание   = "Передача малоценки в эксплуатацию";
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Сумма        = СуммаПроводки;
		
		Проводка.СуммаНУДт    = СуммаПроводкиНУ;
		Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение;;
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций"        , СтрокаТЧ.ФизЛицо);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НазначенияИспользования"     , СтрокаТЧ.НазначениеИспользования);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПартииМалоценкиВЭксплуатации", СтруктураШапкиДокумента.Ссылка);
		Проводка.КоличествоДт = СтрокаТЧ.Количество;
		
		// подготовка к списанию стоимости
		
		Если СтрокаТЧ.ВидМалоценки = МБП Тогда
			
			// Разворот по партиям
			Для каждого СтрокаПартий Из СписанныеПартииБУ Цикл
			
				НоваяСтрока = ТабАмортизации.Добавить();
				
				НоваяСтрока.ОбъектУчета            = СтрокаТЧ.Номенклатура;
				НоваяСтрока.НоменклатурнаяПозиция  = СтрокаПартий.НоменклатурнаяПозиция;
				НоваяСтрока.СчетАмортизации        = СтрокаТЧ.СчетУчетаБУ;
				НоваяСтрока.ВидМалоценки           = СтрокаТЧ.ВидМалоценки;
				НоваяСтрока.НаправлениеАмортизации = СтрокаТЧ.СпособОтраженияРасходов;
				НоваяСтрока.НалоговоеНазначение    = СтрокаТЧ.НалоговоеНазначение;
				НоваяСтрока.Сумма                  = СтрокаПартий.СуммаСписания - СтрокаПартий.СуммаНаценки;
				НоваяСтрока.СуммаНУ                = СтрокаПартий.СуммаСписанияНУ;
				НоваяСтрока.Количество             = СтрокаПартий.Количество;
				НоваяСтрока.Партия                 = СтрокаПартий.Партия;
				НоваяСтрока.Склад                  = СтрокаТЧ.Склад;
			
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока = ТабАмортизации.Добавить();
			
			НоваяСтрока.ОбъектУчета            = СтрокаТЧ.Номенклатура;
			НоваяСтрока.НоменклатурнаяПозиция  = СтрокаТЧ.НоменклатурнаяПозиция;
			НоваяСтрока.СчетАмортизации        = СтрокаТЧ.СчетАмортизацииБУ;
			НоваяСтрока.ВидМалоценки           = СтрокаТЧ.ВидМалоценки;
			НоваяСтрока.НаправлениеАмортизации = СтрокаТЧ.СпособОтраженияРасходов;
			НоваяСтрока.НалоговоеНазначение    = СтрокаТЧ.НалоговоеНазначение;
			НоваяСтрока.Сумма                  = СуммаПроводки;
			НоваяСтрока.СуммаНУ                = СуммаПроводкиНУ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТабАмортизации.Количество() > 0 Тогда
		
		ТабАмортизации.Свернуть("НаправлениеАмортизации,
		                         |ОбъектУчета,
								 |НоменклатурнаяПозиция,
								 |СчетАмортизации,
								 |ВидМалоценки,
								 |Партия,
								 |НалоговоеНазначение,
								 |Склад",
								 "Сумма,
								 |СуммаНУ,
								 |Количество");
		
		УправлениеМалоценнымиАктивами.ПолучитьРаспределениеПогашенияСтоимости(ЭтотОбъект,
	                                            Отказ,
												Заголовок,
												ТабАмортизации,
												СтруктураШапкиДокумента,
												НомерЖурнала,
												"Списание стоимости малоценки");
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамБухРегл()

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Заголовок = "";
	СтруктураШапкиДокумента = ПроверкаРеквизитов(Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	ТаблицаПоМалоценке = ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента);
	ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаПоМалоценке, СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры	// ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

// Обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Организация             		= Основание.Организация;
		
		ОтражатьВУправленческомУчете 	= Основание.ОтражатьВУправленческомУчете;
		ОтражатьВБухгалтерскомУчете	 	= Основание.ОтражатьВБухгалтерскомУчете;

		Если Основание.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			Склад = Основание.СкладОрдер.Склад;
		Иначе
			Склад = Основание.СкладОрдер;
		КонецЕсли;
		
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			
			НоваяСтрока = МалоценныеАктивы.Добавить();
			
			НоваяСтрока.Количество                 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура               	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры           = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.Коэффициент               	= ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.ЕдиницаИзмерения            = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.СчетУчетаБУ                	= ТекСтрокаТовары.СчетУчетаБУ;
			
			НоваяСтрока.НалоговоеНазначение         = ТекСтрокаТовары.НалоговоеНазначение;
			
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовары Из Основание.Оборудование Цикл
		
			НоваяСтрока = МалоценныеАктивы.Добавить();
			
			НоваяСтрока.Количество                 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура               	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры           = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.Коэффициент               	= ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.ЕдиницаИзмерения            = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.СчетУчетаБУ                	= ТекСтрокаТовары.СчетУчетаБУ;
			
			НоваяСтрока.НалоговоеНазначение         = ТекСтрокаТовары.НалоговоеНазначение;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаТабличныхЧастей.ЗаполнитьКачествоПоУмолчанию(МалоценныеАктивы);
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "МалоценныеАктивы");
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	
	Если НЕ УчетнаяПолитика.ЕстьНДС Тогда
		
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из МалоценныеАктивы Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОблНДСДеятельность;
		КонецЦикла; 
		
	КонецЕсли; 	
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 
// 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мМБП                            = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет;

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
