// #Область СлужебныеПроцедурыИФункции

// Обработчик операции сервиса
// Возвращает наименование контакта по номеру телефона.
// 
Функция identify(Number)
	Результат = "";
	
	Если ТипЗнч(Number) = Тип("Строка") 
		 И ЗначениеЗаполнено(Number) Тогда
		// Производим поиск.
		Попытка
		Результат = ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(Number);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // identify(Number)

// Производим поиск по контактной информации номера телефона.
// Number  - строка номера. 
// Возврат - наименование контакта (если контакт - контактное лицо контрагента, 
// то вернется наименование контрагента).
//
Функция ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(Number) 
	
	ТаблицаКонтактов = МИКО_стОбработкаКонтактнойИнформации.ОпределитьКонтактПоНомеруТелефона(Number);
	Если НЕ ТипЗнч(ТаблицаКонтактов) = Тип("ТаблицаЗначений")
		 ИЛИ ТаблицаКонтактов.Количество()=0 Тогда
	 	Возврат "";
	КонецЕсли; 
	СтрокаТаблицы = ТаблицаКонтактов[0];
	
	Представление = ""+СтрокаТаблицы.Объект;
	ПредставлениеКлиента = Транслитерация(Представление);
	
	// Необходимо получить текст для генерации средствами Яндекс.
	// Просто кирилицей!
	Возврат ПредставлениеКлиента;
КонецФункции // ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(Number)	

///////////////////////////////////////////////////////////////////////////////////////////////////////////.
// Вспомогательные процедуры / функции. 

// Преобразует русские слова в транслит.
// 
Функция Транслитерация(знач Слово)
	НовоеСлово= "";
	спТранслит = Новый ("Соответствие");
	спТранслит.Вставить("й","j");
	спТранслит.Вставить("ц","c");
	спТранслит.Вставить("у","u");
	спТранслит.Вставить("к","k");
	спТранслит.Вставить("е","e");
	спТранслит.Вставить("н","n");
	спТранслит.Вставить("г","g");
	спТранслит.Вставить("ш","sh");
	спТранслит.Вставить("щ","sch");
	спТранслит.Вставить("з","z");
	спТранслит.Вставить("х","h");
	спТранслит.Вставить("ъ","#");
	спТранслит.Вставить("ф","f");
	спТранслит.Вставить("ы","y");
	спТранслит.Вставить("в","v");
	спТранслит.Вставить("а","a"); 
	спТранслит.Вставить("п","p"); 
	спТранслит.Вставить("р","r"); 
	спТранслит.Вставить("о","o"); 
	спТранслит.Вставить("л","l"); 
	спТранслит.Вставить("д","d"); 
	спТранслит.Вставить("ж","zh"); 
	спТранслит.Вставить("э","je"); 
	спТранслит.Вставить("я","ja"); 
	спТранслит.Вставить("ч","ch"); 
	спТранслит.Вставить("с","s"); 
	спТранслит.Вставить("м","m"); 
	спТранслит.Вставить("и","i"); 
	спТранслит.Вставить("т","t"); 
	спТранслит.Вставить("ь","'"); 
	спТранслит.Вставить("б","b"); 
	спТранслит.Вставить("ю","ju");
	спТранслит.Вставить("ё","jo");
	
	спТранслит.Вставить("i","i"); 
	спТранслит.Вставить("q","q");
	спТранслит.Вставить("w","w");
	спТранслит.Вставить("e","e");
	спТранслит.Вставить("r","r");
	спТранслит.Вставить("t","t");
	спТранслит.Вставить("y","y");
	спТранслит.Вставить("u","u");
	спТранслит.Вставить("i","i");
	спТранслит.Вставить("o","o");
	спТранслит.Вставить("p","p");
	спТранслит.Вставить("","");
	спТранслит.Вставить("a","a");
	спТранслит.Вставить("s","s");
	спТранслит.Вставить("d","d");
	спТранслит.Вставить("f","f");
	спТранслит.Вставить("g","g");
	спТранслит.Вставить("h","h");
	спТранслит.Вставить("j","j");
	спТранслит.Вставить("k","k");
	спТранслит.Вставить("l","l");
	спТранслит.Вставить("z","z");
	спТранслит.Вставить("x","x");
	спТранслит.Вставить("c","c");
	спТранслит.Вставить("v","v");
	спТранслит.Вставить("b","b");
	спТранслит.Вставить("n","n");
	спТранслит.Вставить("m","m");
	
	спТранслит.Вставить(" "," ");
	спТранслит.Вставить("""","""");
	спТранслит.Вставить("-","-");
	спТранслит.Вставить(".",".");
	спТранслит.Вставить(",",",");
	спТранслит.Вставить("/","/");
	спТранслит.Вставить("\","\");
	спТранслит.Вставить("*","*");
	спТранслит.Вставить("#","#");  
	спТранслит.Вставить("#","№"); 
	спТранслит.Вставить("|","|"); 
	
	спТранслит.Вставить("!","!"); 
	спТранслит.Вставить("?","?"); 
	
	спТранслит.Вставить("$","$"); 
	спТранслит.Вставить("%","%"); 
	спТранслит.Вставить("@","@"); 
	спТранслит.Вставить("&","&"); 
	спТранслит.Вставить("=","="); 
	спТранслит.Вставить("+","+"); 
	
	спТранслит.Вставить("~","~"); 
	спТранслит.Вставить("'","'"); 
	спТранслит.Вставить("`","`"); 
	спТранслит.Вставить(":",":"); 
	спТранслит.Вставить(";",";"); 
	
	спТранслит.Вставить("(","(");
	спТранслит.Вставить(")",")");  
	спТранслит.Вставить("[","["); 
	спТранслит.Вставить("]","]");  
	спТранслит.Вставить("}","}"); 
	спТранслит.Вставить("{","{");
	спТранслит.Вставить("0","0");
	спТранслит.Вставить("1","1");
	спТранслит.Вставить("2","2");
	спТранслит.Вставить("3","3");
	спТранслит.Вставить("4","4");
	спТранслит.Вставить("5","5");
	спТранслит.Вставить("6","6");
	спТранслит.Вставить("7","7");
	спТранслит.Вставить("8","8");  
	спТранслит.Вставить("9","9");
	Для а=1 по СтрДлина(Слово) Цикл
		НовоеСлово = НовоеСлово + спТранслит.Получить(НРЕГ(Сред(Слово,а,1)))
	КонецЦикла; 
	
	Возврат ВРЕГ(НовоеСлово);
КонецФункции // Транслитерация(знач Слово)
// #КонецОбласти
