
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = "";
	Для каждого Способ Из Способы Цикл
		Если НЕ ЗначениеЗаполнено(Способ.Коэффициент) Тогда
			СтрокаСообщения = СтрокаСообщения +Символы.ПС+
				Локализация.СтрШаблон1(" строка ¤1¤: не заполнен коэффициент", Способ.НомерСтроки);
		КонецЕсли; 
	КонецЦикла; 
	
	Если не ПустаяСтрока(СтрокаСообщения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Обнаружены ошибки в заполнении способов отражения расходов:"+СтрокаСообщения,Отказ); 
	КонецЕсли; 
	
КонецПроцедуры
