
&НаКлиенте
Процедура СформироватьНаименование()
	Наименование = СокрЛП(Объект.Фамилия) + " ";
	Если СокрЛП(Объект.Имя) <> "" Тогда
		Наименование = СокрЛП(Объект.Имя) + " ";
	КонецЕсли;	
	Если СокрЛП(Объект.Отчество) <> "" Тогда
		Наименование = СокрЛП(Объект.Отчество);
	КонецЕсли;	
	Объект.Наименование = СокрЛП(Наименование);
КонецПроцедуры	

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры
