#Если Клиент Тогда

// Валюта управленческого учета организаций
Перем мВалютаУправленческогоУчета Экспорт;
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт

	// Настройка общих параметров универсального отчета

	Если ДополнительныеПараметры <> Неопределено Тогда
		УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;

	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);

	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;

	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;

	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;

	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
//
	//Запрос был тут!
	ТекстЗапроса = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
		|	ОКР(ЦеныНоменклатурыСрезПоследних.Цена * (1 - ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки, 0) / 100) * ВЫБОР
		|			КОГДА ТипыЦенНоменклатуры.БазовыйТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
		|				ТОГДА 1
		|			ИНАЧЕ (1 + ТипыЦенНоменклатуры.ПроцентСкидкиНаценки / 100) * (1 - ЕСТЬNULL(ПолучимУточняющийПроцент.Процент, 0) / 100)
		|		КОНЕЦ, 0) КАК Цена,
		|	ОКР(ТоварыНаСкладахОстатки.КоличествоОстаток * ЦеныНоменклатурыСрезПоследних.Цена * (1 - ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки, 0) / 100) * ВЫБОР
		|			КОГДА ТипыЦенНоменклатуры.БазовыйТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
		|				ТОГДА 1
		|			ИНАЧЕ (1 + ЕСТЬNULL(ТипыЦенНоменклатуры.ПроцентСкидкиНаценки, 0) / 100) * (1 - ЕСТЬNULL(ПолучимУточняющийПроцент.Процент, 0) / 100)
		|		КОНЕЦ, 0) КАК Сумма,
		|	ПолучимУточняющийПроцент.Процент КАК Наценка
		|{ВЫБРАТЬ
		|	Склад.*,
		|	Номенклатура.*,
		|	Характеристика.*,
		|	Остаток,
		|	Сумма,
		|	Цена,
		|	Наценка}
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&НаДату, ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ) КАК ЦеныНоменклатурыСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|			ПО (ВЫБОР
		|					КОГДА ТипыЦенНоменклатуры.БазовыйТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
		|						ТОГДА ТипыЦенНоменклатуры.Ссылка
		|					ИНАЧЕ ТипыЦенНоменклатуры.БазовыйТипЦен
		|				КОНЕЦ = ЦеныНоменклатурыСрезПоследних.ТипЦен)
		|		ПО ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
		|				&НаДату,
		|				ДатаОкончания >= &НаДату
		|					ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|						И Регистратор.ДляВсехПолучателей
		|						И Регистратор.ВидСкидки = ЗНАЧЕНИЕ(Перечисление.ВидыСкидок.Оптовая)) КАК СкидкиНаценкиНоменклатурыСрезПоследних
		|		ПО ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(НайдемПроцентРодителя.Период, ДАТАВРЕМЯ(1, 1, 1)) >= ЕСТЬNULL(ПолучимПроцентНоменклатурыПоЦвету.Период, ДАТАВРЕМЯ(1, 1, 1))
		|						И ЕСТЬNULL(НайдемПроцентРодителя.Период, ДАТАВРЕМЯ(1, 1, 1)) >= ЕСТЬNULL(ПолучимПроцентНоменклатурыБезЦвета.Период, ДАТАВРЕМЯ(1, 1, 1))
		|					ТОГДА НайдемПроцентРодителя.УточняющийПроцент
		|				КОГДА ЕСТЬNULL(ПолучимПроцентНоменклатурыПоЦвету.Период, ДАТАВРЕМЯ(1, 1, 1)) >= ЕСТЬNULL(ПолучимПроцентНоменклатурыБезЦвета.Период, ДАТАВРЕМЯ(1, 1, 1))
		|					ТОГДА ПолучимПроцентНоменклатурыПоЦвету.УточняющийПроцент
		|				ИНАЧЕ ПолучимПроцентНоменклатурыБезЦвета.УточняющийПроцент
		|			КОНЕЦ КАК Процент,
		|			ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|		ИЗ
		|			Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ВЫБОР
		|						КОГДА НЕ цветСтар.Значение ЕСТЬ NULL
		|							ТОГДА цветСтар.Значение
		|						ИНАЧЕ ЦветПредопределенный.Значение
		|					КОНЕЦ КАК Цвет,
		|					ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗначенияСвойствОбъектов.Значение КАК Значение,
		|						ЗначенияСвойствОбъектов.Объект КАК Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|					ГДЕ
		|						ЗначенияСвойствОбъектов.Свойство.Код = ""000000069"") КАК ЦветПредопределенный
		|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ЗначенияСвойствОбъектов.Значение КАК Значение,
		|								ЗначенияСвойствОбъектов.Объект КАК Объект
		|							ИЗ
		|								РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|							ГДЕ
		|								ЗначенияСвойствОбъектов.Свойство.Код = ""000000072"") КАК цветСтар
		|							ПО (цветСтар.Объект = ХарактеристикиНоменклатуры.Ссылка)
		|						ПО ЦветПредопределенный.Объект = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимЦвет
		|					ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УточнениеРасчетаЦенПоНоменклатуре.СрезПоследних(
		|							&НаДату,
		|							НоменклатураИлиГруппа В
		|									(ВЫБРАТЬ
		|										Номенклатура.Ссылка КАК Номенклатура
		|									ИЗ
		|										Справочник.Номенклатура КАК Номенклатура)
		|								И Цвет <> ЗНАЧЕНИЕ(Справочник.АСБ_ЦветаНоменклатуры.ПустаяСсылка)
		|								И Период <= &НаДату) КАК ПолучимПроцентНоменклатурыПоЦвету
		|					ПО ПолучимЦвет.Цвет = ПолучимПроцентНоменклатурыПоЦвету.Цвет
		|						И ПолучимЦвет.Характеристика.Владелец = ПолучимПроцентНоменклатурыПоЦвету.НоменклатураИлиГруппа
		|				ПО ХарактеристикиНоменклатуры.Ссылка = ПолучимЦвет.Характеристика
		|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УточнениеРасчетаЦенПоНоменклатуре.СрезПоследних(
		|						&НаДату,
		|						НоменклатураИлиГруппа В
		|								(ВЫБРАТЬ
		|									Номенклатура.Ссылка КАК Номенклатура
		|								ИЗ
		|									Справочник.Номенклатура КАК Номенклатура)
		|							И Цвет = ЗНАЧЕНИЕ(Справочник.АСБ_ЦветаНоменклатуры.ПустаяСсылка)
		|							И Период <= &НаДату) КАК ПолучимПроцентНоменклатурыБезЦвета
		|				ПО ХарактеристикиНоменклатуры.Владелец = ПолучимПроцентНоменклатурыБезЦвета.НоменклатураИлиГруппа
		|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УточнениеРасчетаЦенПоНоменклатуре.СрезПоследних(
		|						&НаДату,
		|						НоменклатураИлиГруппа В
		|								(ВЫБРАТЬ
		|									Номенклатура.Родитель КАК Родитель
		|								ИЗ
		|									Справочник.Номенклатура КАК Номенклатура)
		|							И Цвет = ЗНАЧЕНИЕ(Справочник.АСБ_ЦветаНоменклатуры.ПустаяСсылка)
		|							И Период <= &НаДату) КАК НайдемПроцентРодителя
		|				ПО ХарактеристикиНоменклатуры.Владелец.Родитель = НайдемПроцентРодителя.НоменклатураИлиГруппа) КАК ПолучимУточняющийПроцент
		|		ПО ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ПолучимУточняющийПроцент.Характеристика
		|ГДЕ
		|	ТипыЦенНоменклатуры.Ссылка = &ТипЦен
		|{ГДЕ
		|	ТоварыНаСкладахОстатки.Склад.*,
		|	ТоварыНаСкладахОстатки.Номенклатура.*,
		|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.*,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток}
		|{УПОРЯДОЧИТЬ ПО
		|	Склад.*,
		|	Номенклатура.*,
		|	Характеристика.*,
		|	Остаток,
		|	Сумма,
		|	Цена,
		|	Наценка}
		|ИТОГИ
		|	СУММА(Остаток),
		|	МИНИМУМ(Цена),
		|	СУММА(Сумма),
		|	МАКСИМУМ(Наценка)
		|ПО
		|	ОБЩИЕ
		|{ИТОГИ ПО
		|	Склад.*,
		|	Номенклатура.*,
		|	Характеристика.*,
		|	Остаток,
		|	Сумма,
		|	Цена,
		|	Наценка}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТоварыНаСкладахОстатки.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТоварыНаСкладахОстатки.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры", "Характеристика", "Характеристика", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);

		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Склад", "Склад");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоОстаток", "Количество (в ед. хранения)");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдОстаток", "Количество (в базовых ед.)");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НеотфактурованныйОстаток", "Количество неотфактурованных (в ед. хранения)");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НеотфактурованныйБазовыхЕдОстаток", "Количество неотфактурованных (в базовых ед.)");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Себестоимость", "Себестоимость");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипЦенЦена", "Цена в выбранном типе цен");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипЦенСтоимость", "Стоимость в выбранном типе цен");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипЦенНаценка", "Наценка в выбранном типе цен");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипЦенРентабельность", "Рентабельность (%) в выбранном типе цен");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	 //УниверсальныйОтчет.ДобавитьПоказатель("Остаток", <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	 УниверсальныйОтчет.ДобавитьПоказатель("Остаток","Остаток", Истина, "ЧЦ=10; ЧДЦ=2", "Остаток", "Остаток");
	 УниверсальныйОтчет.ДобавитьПоказатель("Цена","Цена", Истина, "ЧЦ=10; ЧДЦ=2", "Остаток", "Остаток");
	 УниверсальныйОтчет.ДобавитьПоказатель("Сумма","Сумма", Истина, "ЧЦ=10; ЧДЦ=2", "Остаток", "Остаток"); 
	 УниверсальныйОтчет.ДобавитьПоказатель("Наценка","Наценка", Истина, "ЧЦ=10; ЧДЦ=2", "Остаток", "Остаток"); 

	 
	 

	
	// Добавление предопределенных группировок строк отчета.
	//УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Склад");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Характеристика");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");

	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

Функция ТабЦен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез;
КонецФункции

Процедура ЗапросБыл()
	Если Режим = 0 Тогда // Оперативный режим
		УниверсальныйОтчет.Показатели.Строки.Очистить();

		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОстаток", "в ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдОстаток", "в базовых ед.", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенЦена", "Цена", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенСтоимость", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ //РАЗЛИЧНЫЕ
		|	Склад                                                                                      КАК Склад,
		|	ТаблицаРегистра.Номенклатура                                                               КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры                                                 КАК ХарактеристикаНоменклатуры,
		|	КоличествоОстаток                                                                   КАК КоличествоОстаток,
		|	КоличествоОстаток*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент  КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость	
		|	//ПОЛЯ_СВОЙСТВА
		|	//ПОЛЯ_КАТЕГОРИИ
		|{ВЫБРАТЬ 
		|	Склад.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	КоличествоОстаток,
		|	КоличествоБазовыхЕдОстаток,
		|	ТипЦенЦена,
		|	ТипЦенСтоимость
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}
		
		|
		|ИЗ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта = &ВалютаУпрУчета) КАК УпрВалюты,
		|	(ВЫБРАТЬ
		|	Склад КАК Склад,
		|	Номенклатура КАК Номенклатура,
		|	ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон,
		|	{Склад.*                       КАК Склад,
		|	Номенклатура.*                 КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|//	ЦенаВРознице.*                 КАК ЦенаВРознице
		|}
		|)КАК ОстаткиТоваровОпт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Склад КАК Склад,
		|	Номенклатура КАК Номенклатура,
		|	ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВРознице.Остатки(&ДатаКон,
		|	{Склад.*                       КАК Склад,
		|	Номенклатура.*                 КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|//	ЦенаВРознице.*                 КАК ЦенаВРознице
		|}
		|)КАК ОстаткиТоваровРозница			
		|) КАК ТаблицаРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ТипЦен = &БазовыйТипЦен {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатуры
		|		ПО ТаблицаРегистра.Номенклатура               = ЦеныНоменклатуры.Номенклатура И
		|		   ТаблицаРегистра.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ((ТипЦен = &БазовыйТипЦен) И (ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатурыБезХарактеристик
		|		ПО ТаблицаРегистра.Номенклатура = ЦеныНоменклатурыБезХарактеристик.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон) КАК КурсыВалютСрезПоследних
		|		ПО ЦеныНоменклатуры.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследнихБезХарактеристик
		|		ПО ЦеныНоменклатурыБезХарактеристик.Валюта = КурсыВалютСрезПоследнихБезХарактеристик.Валюта
		|//СОЕДИНЕНИЯ
		|
		|{ГДЕ 
		|	Склад.*                                                                                      КАК Склад,
		|	ТаблицаРегистра.Номенклатура.*                                                               КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*                                                 КАК ХарактеристикаНоменклатуры,
		|	КоличествоОстаток                                                                   КАК КоличествоОстаток,
		|	КоличествоОстаток*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент  КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость
		|	//УСЛОВИЯ_СВОЙСТВА
		|	//УСЛОВИЯ_КАТЕГОРИИ
		|}
		
		|
		|{УПОРЯДОЧИТЬ ПО 
		|	Склад.*                                                                                      КАК Склад,
		|	ТаблицаРегистра.Номенклатура.*                                                               КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*                                                 КАК ХарактеристикаНоменклатуры,
		|	КоличествоОстаток                                                                   КАК КоличествоОстаток,
		|	КоличествоОстаток*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент  КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}
		
		|
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоБазовыхЕдОстаток),
		|	СУММА(ТипЦенСтоимость),
		|	МАКСИМУМ(ТипЦенЦена)
		|	//ИТОГИ_СВОЙСТВА
		|	//ИТОГИ_КАТЕГОРИИ
		|ПО ОБЩИЕ
		|
		|{ИТОГИ ПО
		|	Склад.*                КАК Склад,
		|	ТаблицаРегистра.Номенклатура.* КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}
		
		|";
	ИначеЕсли Режим = 1 Тогда // Неоперативный режим
		УниверсальныйОтчет.Показатели.Строки.Очистить();

		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОстаток", "в ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдОстаток", "в базовых ед.", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("НеотфактурованныйОстаток", "в ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "КоличествоНеотфактурованных", "Количество неотфактурованных");
		УниверсальныйОтчет.ДобавитьПоказатель("НеотфактурованныйБазовыхЕдОстаток", "в базовых ед.", Истина, "ЧЦ=15; ЧДЦ=3", "КоличествоНеотфактурованных", "Количество неотфактурованных");
		УниверсальныйОтчет.ДобавитьПоказатель("Себестоимость", "Себестоимость
		|("+мВалютаУправленческогоУчета+")", Истина, "ЧЦ=15; ЧДЦ=2");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенЦена", "Цена", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенСтоимость", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенНаценка", "Наценка", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенРентабельность", "Рентабельность (%)", Истина, "ЧЦ=9; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ //РАЗЛИЧНЫЕ
		|	Склад                                                                              КАК Склад,
		|	ТаблицаРегистра.Номенклатура                                                       КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры                                         КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА 0
		|		  ИНАЧЕ КоличествоОстаток
		|	КОНЕЦ                                                                             КАК КоличествоОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		   ТОГДА 0
		|		   ИНАЧЕ КоличествоОстаток
		|		         *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	КОНЕЦ                                                                             КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		        *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйБазовыхЕдОстаток,
		|	СтоимостьОстаток                                                            КАК Себестоимость,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//ПОЛЯ_СВОЙСТВА
		|	//ПОЛЯ_КАТЕГОРИИ
		|
		|{ВЫБРАТЬ 
		|	Склад.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	КоличествоОстаток,
		|	КоличествоБазовыхЕдОстаток,
		|	НеотфактурованныйОстаток,
		|	НеотфактурованныйБазовыхЕдОстаток,
		|	Себестоимость,
		|	ТипЦенЦена,
		|	ТипЦенСтоимость,
		|	ТипЦенНаценка,
		|	ТипЦенРентабельность
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|
		|ИЗ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта = &ВалютаУпрУчета) КАК УпрВалюты,
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаКон, СтатусПартии В (&СписокСтатусовПартии)
		|	{Склад.*                       КАК Склад,
		|	Номенклатура.*                 КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|}
		|	) КАК ТаблицаРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ТипЦен = &БазовыйТипЦен {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатуры
		|		ПО ТаблицаРегистра.Номенклатура = ЦеныНоменклатуры.Номенклатура И
		|		   ТаблицаРегистра.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ((ТипЦен = &БазовыйТипЦен) И (ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатурыБезХарактеристик
		|		ПО ТаблицаРегистра.Номенклатура = ЦеныНоменклатурыБезХарактеристик.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон) КАК КурсыВалютСрезПоследних
		|		ПО ЦеныНоменклатуры.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследнихБезХарактеристик
		|		ПО ЦеныНоменклатурыБезХарактеристик.Валюта = КурсыВалютСрезПоследнихБезХарактеристик.Валюта
		|//СОЕДИНЕНИЯ
		|
		|{ГДЕ 
		|	Склад.*                        КАК Склад,
		|	ТаблицаРегистра.Номенклатура.* КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА 0
		|		  ИНАЧЕ КоличествоОстаток
		|	КОНЕЦ                                                                             КАК КоличествоОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		   ТОГДА 0
		|		   ИНАЧЕ КоличествоОстаток
		|		         *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	КОНЕЦ                                                                             КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		        *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйБазовыхЕдОстаток,
		|	СтоимостьОстаток                                                            КАК Себестоимость,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//УСЛОВИЯ_СВОЙСТВА
		|	//УСЛОВИЯ_КАТЕГОРИИ
		|}

		|{УПОРЯДОЧИТЬ ПО 
		|	Склад.*                        КАК Склад,
		|	ТаблицаРегистра.Номенклатура.* КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА 0
		|		  ИНАЧЕ КоличествоОстаток
		|	КОНЕЦ                                                                             КАК КоличествоОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		   ТОГДА 0
		|		   ИНАЧЕ КоличествоОстаток
		|		         *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	КОНЕЦ                                                                             КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйОстаток,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|		  ТОГДА КоличествоОстаток
		|		        *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		  ИНАЧЕ 0
		|	КОНЕЦ                                                                             КАК НеотфактурованныйБазовыхЕдОстаток,
		|	СтоимостьОстаток                                                            КАК Себестоимость,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоБазовыхЕдОстаток),
		|	СУММА(НеотфактурованныйОстаток),
		|	СУММА(НеотфактурованныйБазовыхЕдОстаток),
		|	СУММА(Себестоимость),
		|	СУММА(ТипЦенСтоимость),
		|	СУММА(ТипЦенНаценка),
		|	СУММА(ТипЦенРентабельность),
		|	МАКСИМУМ(ТипЦенЦена)
		|	//ИТОГИ_СВОЙСТВА
		|	//ИТОГИ_КАТЕГОРИИ
		|
		|ПО ОБЩИЕ
		|
		|{ИТОГИ ПО 
		|	Склад.*                        КАК Склад,
		|	ТаблицаРегистра.Номенклатура.* КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|";
	ИначеЕсли Режим = 2 Тогда // "Смешанный" режим
		УниверсальныйОтчет.Показатели.Строки.Очистить();

		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОстаток", "в ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдОстаток", "в базовых ед.", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("Себестоимость", "Себестоимость
		|("+мВалютаУправленческогоУчета+")", Истина, "ЧЦ=15; ЧДЦ=2");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенЦена", "Цена", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенСтоимость", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенНаценка", "Наценка", Истина, "ЧЦ=15; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");
		УниверсальныйОтчет.ДобавитьПоказатель("ТипЦенРентабельность", "Рентабельность (%)", Истина, "ЧЦ=9; ЧДЦ=2", "ВВыбранномТипеЦен", "В выбранном типе цен ("+мВалютаУправленческогоУчета+")");

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ //РАЗЛИЧНЫЕ
		|	ТаблицаРегистра.Склад                                                               КАК Склад,
		|	ТаблицаРегистра.Номенклатура                                                        КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры                                          КАК ХарактеристикаНоменклатуры,
		|	ТаблицаРегистра.КоличествоОстаток                                            КАК КоличествоОстаток,
		|	ТаблицаРегистра.КоличествоОстаток
		|	                 *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ПартииТоваров.КоличествоОстаток                                              КАК ОстатокПоПартиям,
		|	ПартииТоваров.СтоимостьОстаток /
		|		ВЫБОР КОГДА ПартииТоваров.КоличествоОстаток ЕСТЬ NULL ИЛИ ПартииТоваров.КоличествоОстаток = 0 ТОГДА
		|			1
		|		ИНАЧЕ
		|			ПартииТоваров.КоличествоОстаток
		|		КОНЕЦ * ТаблицаРегистра.КоличествоОстаток КАК Себестоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//ПОЛЯ_СВОЙСТВА
		|	//ПОЛЯ_КАТЕГОРИИ
		|
		|{ВЫБРАТЬ
		|	Склад.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	КоличествоОстаток,
		|	КоличествоБазовыхЕдОстаток,
		|	ТипЦенЦена,
		|	ТипЦенСтоимость,
		|	ОстатокПоПартиям,
		|	Себестоимость,
		|	ТипЦенРентабельность,
		|	ТипЦенНаценка
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|
		|ИЗ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта = &ВалютаУпрУчета) КАК УпрВалюты,
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон, 
		|	{Склад.*                       КАК Склад,
		|	Номенклатура.*                 КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры}
		|	) КАК ТаблицаРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ТипЦен = &БазовыйТипЦен {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатуры
		|		ПО ТаблицаРегистра.Номенклатура = ЦеныНоменклатуры.Номенклатура И
		|		   ТаблицаРегистра.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ((ТипЦен = &БазовыйТипЦен) И (ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) {Номенклатура.* КАК Номенклатура}) КАК ЦеныНоменклатурыБезХарактеристик
		|		ПО ТаблицаРегистра.Номенклатура = ЦеныНоменклатурыБезХарактеристик.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон) КАК КурсыВалютСрезПоследних
		|		ПО ЦеныНоменклатуры.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследнихБезХарактеристик
		|		ПО ЦеныНоменклатурыБезХарактеристик.Валюта = КурсыВалютСрезПоследнихБезХарактеристик.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаКон, НЕ(СтатусПартии = &Неотфактурованный){Номенклатура.*                 КАК Номенклатура,
		|																															ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры})КАК ПартииТоваров
		|		ПО ТаблицаРегистра.Номенклатура = ПартииТоваров.Номенклатура
		|		   И ТаблицаРегистра.ХарактеристикаНоменклатуры = ПартииТоваров.ХарактеристикаНоменклатуры
		//|		   И (НЕ ТаблицаРегистра.Номенклатура.ВестиПартионныйУчетПоСериям ИЛИ ТаблицаРегистра.СерияНоменклатуры = ПартииТоваров.СерияНоменклатуры)
		|//СОЕДИНЕНИЯ
		|
		|{ГДЕ 
		|	ТаблицаРегистра.Склад.*                                                               КАК Склад,
		|	ТаблицаРегистра.Номенклатура.*                                                        КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*                                          КАК ХарактеристикаНоменклатуры,
		|	ТаблицаРегистра.КоличествоОстаток                                            КАК КоличествоОстаток,
		|	ТаблицаРегистра.КоличествоОстаток
		|	                 *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ПартииТоваров.КоличествоОстаток                                              КАК ОстатокПоПартиям,
		|	ПартииТоваров.СтоимостьОстаток /
		|		ВЫБОР КОГДА ПартииТоваров.КоличествоОстаток ЕСТЬ NULL ИЛИ ПартииТоваров.КоличествоОстаток = 0 ТОГДА
		|			1
		|		ИНАЧЕ
		|			ПартииТоваров.КоличествоОстаток
		|		КОНЕЦ * ТаблицаРегистра.КоличествоОстаток КАК Себестоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//УСЛОВИЯ_СВОЙСТВА
		|	//УСЛОВИЯ_КАТЕГОРИИ
		|}

		|
		|{УПОРЯДОЧИТЬ ПО 
		|	ТаблицаРегистра.Склад.*                        КАК Склад,
		|	ТаблицаРегистра.Номенклатура.*                 КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры,
		|	ТаблицаРегистра.КоличествоОстаток                                            КАК КоличествоОстаток,
		|	ТаблицаРегистра.КоличествоОстаток
		|	                 *ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоБазовыхЕдОстаток,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ЦеныНоменклатурыБезХарактеристик.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ЦеныНоменклатуры.Цена * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенЦена,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатурыБезХарактеристик.Цена / ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследнихБезХарактеристик.Курс / КурсыВалютСрезПоследнихБезХарактеристик.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	ИНАЧЕ	
		|		ТаблицаРегистра.КоличествоОстаток * (ЦеныНоменклатуры.Цена / ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент) * ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) / (УпрВалюты.Курс / УпрВалюты.Кратность) * &КоэффициентБазовогоТипаЦен
		|	КОНЕЦ КАК ТипЦенСтоимость,
		|	ПартииТоваров.КоличествоОстаток                                              КАК ОстатокПоПартиям,
		|	ПартииТоваров.СтоимостьОстаток /
		|		ВЫБОР КОГДА ПартииТоваров.КоличествоОстаток ЕСТЬ NULL ИЛИ ПартииТоваров.КоличествоОстаток = 0 ТОГДА
		|			1
		|		ИНАЧЕ
		|			ПартииТоваров.КоличествоОстаток
		|		КОНЕЦ * ТаблицаРегистра.КоличествоОстаток КАК Себестоимость,
		|	ВЫБОР КОГДА СтатусПартии = &Неотфактурованный
		|	ТОГДА 0
		|	ИНАЧЕ ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		ИНАЧЕ
		|		ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|	      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|	      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|	      *(&КоэффициентБазовогоТипаЦен)
		|	      -СтоимостьОстаток
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенНаценка,
		|	ВЫБОР КОГДА ЦеныНоменклатуры.Цена ЕСТЬ NULL ТОГДА
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|	    	  /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатурыБезХарактеристик.Цена/ЦеныНоменклатурыБезХарактеристик.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследнихБезХарактеристик.Курс/КурсыВалютСрезПоследнихБезХарактеристик.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР КОГДА ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен) = 0 ТОГДА
		|			0
		|		ИНАЧЕ
		|			(ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		      *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		      /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		      *(&КоэффициентБазовогоТипаЦен)
		|		      -СтоимостьОстаток)
		|		    / (ТаблицаРегистра.КоличествоОстаток*(ЦеныНоменклатуры.Цена/ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент)*ТаблицаРегистра.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		|		    *(КурсыВалютСрезПоследних.Курс/КурсыВалютСрезПоследних.Кратность)
		|		    /(УпрВалюты.Курс/УпрВалюты.Кратность)
		|		    *(&КоэффициентБазовогоТипаЦен)) *100
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипЦенРентабельность
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоБазовыхЕдОстаток),
		|	СУММА(ТипЦенСтоимость),
		|	СУММА(Себестоимость),
		|	СУММА(ОстатокПоПартиям),
		|	СУММА(ТипЦенРентабельность),
		|	СУММА(ТипЦенНаценка),
		|	МАКСИМУМ(ТипЦенЦена)
		|	//ИТОГИ_СВОЙСТВА
		|	//ИТОГИ_КАТЕГОРИИ
		|ПО ОБЩИЕ
		|
		|{ИТОГИ ПО 
		|	ТаблицаРегистра.Склад.*                        КАК Склад ,
		|	ТаблицаРегистра.Номенклатура.*                 КАК Номенклатура,
		|	ТаблицаРегистра.ХарактеристикаНоменклатуры.*   КАК ХарактеристикаНоменклатуры
		|	//ПСЕВДОНИМЫ_СВОЙСТВА
		|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}

		|";
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТипЦен"        ,  ТипЦен);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПустДата"      , Дата(1, 1, 1));
	
	Если ЗначениеЗаполнено( УниверсальныйОтчет.ДатаКон) Тогда
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НаДату", УниверсальныйОтчет.ДатаКон);
	Иначе
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НаДату", ТекущаяДата());
	КонецЕсли;

	
	//ТабЦен = ТабЦен();
	//УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТабЦен", ТабЦен);


	Если ТипЦен.Рассчитывается Тогда
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("БазовыйТипЦен"             , ТипЦен.БазовыйТипЦен);
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КоэффициентБазовогоТипаЦен", 1+ТипЦен.ПроцентСкидкиНаценки/100);
	Иначе
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("БазовыйТипЦен"             , ТипЦен);
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КоэффициентБазовогоТипаЦен", 1);
	КонецЕсли;

	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Неотфактурованный"         , Перечисления.СтатусыПартийТоваров.ПоОрдеру);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаУпрУчета"            , мВалютаУправленческогоУчета);

	СписокСтатусовПартии = Новый Массив;
	СписокСтатусовПартии.Добавить(Перечисления.СтатусыПартийТоваров.Купленный);
	СписокСтатусовПартии.Добавить(Перечисления.СтатусыПартийТоваров.НаКомиссию);
	СписокСтатусовПартии.Добавить(Перечисления.СтатусыПартийТоваров.ПоОрдеру);

	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СписокСтатусовПартии", СписокСтатусовПартии);

	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

Процедура Сформировать1() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	ТЗЦен.Номенклатура КАК Номенклатура,
	                |	ТЗЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                |	ТЗЦен.Цена КАК Цена
	                |ПОМЕСТИТЬ Цены
	                |ИЗ
	                |	&ТабЦен КАК ТЗЦен
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТоварыНаСкладахОстатки.Склад КАК Склад,
	                |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры КАК Характеристика,
	                |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	                |	Цены.Цена КАК Цена,
	                |	Цены.Цена * ТоварыНаСкладахОстатки.КоличествоОстаток КАК Сумма
	                |ИЗ
	                |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	                |		ПО ТоварыНаСкладахОстатки.Номенклатура = Цены.Номенклатура
	                |			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = Цены.ХарактеристикаНоменклатуры
	                |ИТОГИ ПО
	                |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ТабЦен",ТабЦен());
	Рез  = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

УниверсальныйОтчет.мРежимВводаПериода = 1;

мВалютаУправленческогоУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");

#КонецЕсли
