#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой инвентарной карточки НМА (форма НА-2)
// Возвращаемое значение:
// Табличный документ - печатная форма инвентарной карточки НМА
Функция ПечатьНА2()
	
	Макет       = ПолучитьМакет("НА2");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма_НА2";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НематериальныйАктив",   Ссылка);
	Запрос.УстановитьПараметр("СостояниеПринятКУчету", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	Запрос.УстановитьПараметр("СостояниеСписан",       Перечисления.ВидыСостоянийНМА.Списан);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияНМА_БУ.Организация                             КАК Организация,
	|	ПервоначальныеСведенияНМА_БУ.Организация.НаименованиеПолное          КАК НаименованиеПолноеОрганизации,
	|	КодыОрганизации.КодПоЕДРПОУ                                          КАК КодЕДРПОУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.ПервоначальнаяСтоимость, 0)    КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.СрокПолезногоИспользования, 0) КАК СрокИспользования,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.ЛиквидационнаяСтоимость, 0)    КАК ЛиквидационнаяСтоимость,
	|	ПринятиеКУчету.РегистраторДата                                       КАК ДатаЗаписи,
	|	ПринятиеКУчету.РегистраторНомер                                      КАК НомерЗаписи,
	|	Списание.РегистраторДата                                             КАК ДатаУбытия,
	|	Списание.РегистраторНомер                                            КАК НомерУбытия,
	|	СчетаУчетаНМА_БУ.СчетУчета                                           КАК СчетУчета
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(, 
	|	                НематериальныйАктив = &НематериальныйАктив) КАК ПервоначальныеСведенияНМА_БУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				СостоянияНМАОрганизаций.Организация         КАК Организация,
	|				СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|				СостоянияНМАОрганизаций.Регистратор.Дата    КАК РегистраторДата,
	|				СостоянияНМАОрганизаций.Регистратор.Номер   КАК РегистраторНомер
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|			ГДЕ
	|				СостоянияНМАОрганизаций.Состояние = &СостояниеПринятКУчету
	|				И СостоянияНМАОрганизаций.НематериальныйАктив = &НематериальныйАктив
	|		
	|			УПОРЯДОЧИТЬ ПО
	|				РегистраторДата УБЫВ) КАК ПринятиеКУчету
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = ПринятиеКУчету.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = ПринятиеКУчету.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				СостоянияНМАОрганизаций.Организация         КАК Организация,
	|				СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|				СостоянияНМАОрганизаций.Регистратор.Дата    КАК РегистраторДата,
	|				СостоянияНМАОрганизаций.Регистратор.Номер   КАК РегистраторНомер
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|			ГДЕ
	|				СостоянияНМАОрганизаций.Состояние = &СостояниеСписан
	|				И СостоянияНМАОрганизаций.НематериальныйАктив = &НематериальныйАктив
	|		
	|			УПОРЯДОЧИТЬ ПО
	|				РегистраторДата УБЫВ) КАК Списание
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = Списание.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = Списание.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(,
	|			                НематериальныйАктив = &НематериальныйАктив) КАК СчетаУчетаНМА_БУ
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = СчетаУчетаНМА_БУ.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = СчетаУчетаНМА_БУ.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(, ) КАК КодыОрганизации
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = КодыОрганизации.Организация";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Сообщить("Нет данных для печати. Актив еще не принят к учету.");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ОбластьМакета = Макет.ПолучитьОбласть("НА2");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(Выборка);
		Параметры.ИнвентарныйНомер             = СокрЛП(Код);
		Параметры.НаименованиеПолное           = СокрЛП(НаименованиеПолное);
		Параметры.НаименованиеСХарактеристикой = СокрЛП(НаименованиеПолное) 
		                                         + Символы.ПС + СокрЛП(ПрочиеСведения);
		Параметры.ПрочиеСведения = СокрЛП(ПрочиеСведения);
		
		Если Выборка.СрокИспользования = 0 Тогда
			
			Параметры.ГодичнаяСуммаАмортизации = 0;
			
		Иначе
			
			Параметры.ГодичнаяСуммаАмортизации = 12 * (Выборка.ПервоначальнаяСтоимость - Выборка.ЛиквидационнаяСтоимость)
			                                     / Выборка.СрокИспользования; 
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область( , 2, , ТабДокумент.ШиринаТаблицы);
	
	Возврат ТабДокумент
	
КонецФункции  

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура осуществляет печать справочника. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
// Параметры:
//  НазваниеМакета - строка, название макета.
// Возвращаемое значение:
//  Нет.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, ФормаЭлемента = Неопределено) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "НА2" тогда
		
		ТабДокумент = ПечатьНА2();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Инвентарная карточка НМА (Форма НА-2)");

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати справочника.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("НА2","Форма НА-2");

КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
	Если ЭтоНовый() или ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// Получение старых значений
	НалоговоеНазначениеСтарый  = Ссылка.НалоговоеНазначение;
	// Проверка изменений
	ИзмененНалоговоеНазначение = ЗначениеЗаполнено(НалоговоеНазначениеСтарый) И (НалоговоеНазначение <> НалоговоеНазначениеСтарый);
	
	Если ИзмененНалоговоеНазначение Тогда
		
		Если ПолныеПрава.НематериальныеАктивы_БылиДвиженияПоРегистрам(Ссылка) Тогда
			
			Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Налоговое назначение"",потому что были движения по регистру бухгалтерии ""Хозрасчетный""."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", НалоговоеНазначение, НалоговоеНазначениеСтарый);
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			НалоговоеНазначение = НалоговоеНазначениеСтарый
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Заголовок = Локализация.СтрШаблон1("Запись элемента справочника ""¤1¤"" Наим: <¤2¤> код: <¤3¤>:", Метаданные().Представление(), Наименование, Код);
				
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
КонецПроцедуры
