
// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	

	Заголовок = "Запись банковского счета (" + Владелец + ") " + Наименование + ", код " + Код;
	
	//Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) Тогда 
	//	мОтказ = Отказ;
	//	ОбщегоНазначения.СообщитьОбОшибке("В номере счета есть не только цифры. Возможно, номер указан неверно.", Отказ, Заголовок);
	//	Отказ = мОтказ;
	//КонецЕсли;

	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбрана валюта.", Отказ, Заголовок);
    КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ВидСчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран вид счета", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерСчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран номер счета", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран банк", Отказ, Заголовок);
	КонецЕсли;	

КонецПроцедуры

Функция ПроверитьКорректностьКоррсчета(Коррсчет, ТекстОшибки = "") Экспорт

	Если НЕ ТипЗнч(Коррсчет) = Тип("Строка") Тогда
		ТекстОшибки = "Корр.счет банка должен быть строкой.";
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Коррсчет) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(Коррсчет) Тогда
		ТекстОшибки = "В составе корр.счета банка должны быть только цифры.";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректностьКоррсчета()

Функция ПроверитьКорректностьНомераСчета(Номер, ТекстОшибки = "") Экспорт

	Если НЕ ТипЗнч(Номер) = Тип("Строка") Тогда
		ТекстОшибки = "Номер счета должен быть строкой.";
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Номер) Тогда
		Возврат Истина;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(Номер) Тогда
		ТекстОшибки = "В номере счета есть не только цифры. Возможно, номер указан неверно.";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректностьНомераСчета()

функция ПолучимQrКодИзображения() Экспорт 
	
	Запрос = Новый Запрос(
	
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.Наименование = &Наименование");
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Наименование", "qr");
	
	рез = Запрос.Выполнить().Выбрать(); 
	
	Пока Рез.Следующий() Цикл
		Возврат Рез.ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
		
КонецФункции

функция ПолучитьТекстДляОплаты() Экспорт 
	ЕГРПОУСтрока= "";
	
	Если ЗначениеЗаполнено(ЕГРПОУ) Тогда		
		ЕГРПОУСтрока = Символы.ПС + "ЕГРПОУ " + ЕГРПОУ;
		
	КонецЕсли;
	
	Возврат  Символы.ПС +  ФИО + Символы.ПС + НомерСчета + ЕГРПОУСтрока; 
	         	
КонецФункции