// Строки, хранят реквизиты имеющие смысл только для бухгалтерского и
// налогового учетов соответственно в случае если документ не отражается
// в каком-то виде учета, делаются невидимыми.
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета = "НадписьПодразделениеОрганизации, ПодразделениеОрганизации, НадписьСчетЗатрат, СчетЗатрат, Состав.СуммаБУ, Состав.СуммаНУ";
	мСтрокаРеквизитыУпрУчета = "НадписьПодразделение, Подразделение, Состав.СуммаУУ, Состав.НДСУУ";

	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры
