Перем чСуммаЗаказаОт;
Перем чСуммаЗаказаДо;
Перем бОтладка;

&НаКлиенте
Процедура ТочностьСуммыПриИзменении(Элемент)
	Если Число(Элемент.ТекстРедактирования) <> 0 Тогда 
		ТочностьПроцент = 0;
	КонецЕсли;	
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ТочностьПроцентПриИзменении(Элемент)
	Если Элемент.ТекстРедактирования <> 0 Тогда 
		ТочностьСуммы = 0;
	КонецЕсли;	
	ОбновитьСписок();
КонецПроцедуры

//&НаКлиенте
Процедура ОбновитьСписок();
	//чСуммаОт = 0;
	//чСуммаДо = 0;
	//Если ТочностьСуммы <> 0 Тогда 
	//	чСуммаОт = СуммаПоступилоПоЗаказу - ТочностьСуммы;
	//	чСуммаОт = ?(чСуммаОт<0,0, чСуммаОт);		
	//	чСуммаДо = СуммаПоступилоПоЗаказу + ТочностьСуммы;
	//КонецЕсли;
	//Если ТочностьПроцент <> 0 Тогда 
	//	чСуммаОт = СуммаПоступилоПоЗаказу * (1-ТочностьПроцент/100);
	//	чСуммаОт = ?(чСуммаОт<0,0, чСуммаОт);
	//	чСуммаДо = СуммаПоступилоПоЗаказу * (1+ТочностьПроцент/100);
	//КонецЕсли;
	//чСуммаЗаказаОт = чСуммаОт;
	//чСуммаЗаказаДо = чСуммаДо;
	чСуммаОт = 0;
	чСуммаДо = 0;
	
	ДельтаСуммы = 0; ДельтаПроцент = 0; Дельта = 0;
	Если ТочностьСуммы <> 0 Тогда 
		ДельтаСуммы = ТочностьСуммы;
	КонецЕсли;
	Если ТочностьПроцент <> 0 Тогда 
		ДельтаПроцент = СуммаПоступилоПоЗаказу * (ТочностьПроцент/100);
	КонецЕсли;
	Если ДельтаПроцент < ДельтаСуммы Тогда
		Дельта = ДельтаСуммы;
	Иначе 	
		Дельта = ДельтаПроцент;
	КонецЕсли;
	чСуммаОт = СуммаПоступилоПоЗаказу - Дельта;
	чСуммаОт = ?(чСуммаОт<0,0, чСуммаОт);
	чСуммаДо = СуммаПоступилоПоЗаказу + Дельта;
	
	чСуммаЗаказаОт = чСуммаОт;
	чСуммаЗаказаДо = чСуммаДо;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.СуммаДокумента,
	|	ЗаказПокупателя.СтатусЗаказа
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.СуммаДокумента МЕЖДУ &Предел1 И &Предел2
	|	И ЗаказПокупателя.СтатусЗаказа = &СтатусЗаказаОжидаетОплаты
	//	|АВТОУПОРЯДОЧИВАНИЕ
	|";
	
	Запрос.УстановитьПараметр("СтатусЗаказаОжидаетОплаты", Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты"));			
	Запрос.УстановитьПараметр("Предел1", чСуммаЗаказаОт);			
	Запрос.УстановитьПараметр("Предел2", чСуммаЗаказаДо);			
	тз = Запрос.Выполнить().Выгрузить();
	КолвоРаскрашенныхЗаказов = тз.Количество();
	
	//КолвоРаскрашенныхЗаказов = 0;
	//Для Каждого тс Из Список Цикл 
	//	Если тс.Окрашена Тогда 
	//		КолвоРаскрашенныхЗаказов = КолвоРаскрашенныхЗаказов + 1;
	//	КонецЕсли;	
	//КонецЦикла;
	
	//Для Каждого тс Из Табло Цикл 
	//	тс.Окрашена = ?(((тс.СуммаДокумента>=чСуммаОт)И(тс.СуммаДокумента<=чСуммаДо)),"1","0");				
	//КонецЦикла;
	//Табло.Сортировать("Окрашена Убыв, Дата Возр, Номер Возр");
	//сз = Новый СписокЗначений;
	//СЗ.ЗагрузитьЗначения(Табло.ВыгрузитьКолонку("Ссылка"));
	//ДокументСписок.Отбор.ССылка.Использование = Истина;
	//ДокументСписок.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	//ДокументСписок.Отбор.ССылка.Значение = СЗ;
	//ДокументСписок.Порядок.Очистить();
	//	ДокументСписок.НастройкаПорядка.Организация.Доступность = Истина; 
	
	//ЭлементыФормы.ДокументСписок.Колонки.Дата.ТекстПодвала               = "Диапазон сумм заказов";	
	//ЭлементыФормы.ДокументСписок.Колонки.Номер.ТекстПодвала              = Формат(чСуммаЗаказаОт,"ЧЦ=10; ЧДЦ=2; ЧН=0");	
	//ЭлементыФормы.ДокументСписок.Колонки.НомерЗаказа2ССайта.ТекстПодвала = Формат(чСуммаЗаказаДо,"ЧЦ=10; ЧДЦ=2; ЧН=0");	
	
	//ДекорацияСуммОтИДо.Заголовок = 
	
	//СклонениеЗаказа = " " 
	//+ ЧислоПрописью(КолвоРаскрашенныхЗаказов,, "заказ, заказа, заказов, М,,,,,0")
	//+": ";
	
	сЗаказ = ЧислоПрописью(КолвоРаскрашенныхЗаказов,, "заказ, заказа, заказов, М,,,,,0");
	пЗаказ = Найти(сЗаказ,"заказ");
	сЗаказ1 = Сред(сЗаказ, пЗаказ);
	СклонениеЗаказа = " " + сЗаказ1 + ": ";
	ЭтаФорма.Элементы.ДекорацияСуммОтИДо.Заголовок = 
	"%  Раскрашены "+КолвоРаскрашенныхЗаказов+СклонениеЗаказа+Формат(чСуммаЗаказаОт,"ЧЦ=10; ЧДЦ=2; ЧН=0")+" - "+Формат(чСуммаЗаказаДо,"ЧЦ=10; ЧДЦ=2; ЧН=0")+" грн.";;		
	
	Список.Параметры.УстановитьЗначениеПараметра("СуммаЗаказаОт", чСуммаЗаказаОт);
	Список.Параметры.УстановитьЗначениеПараметра("СуммаЗаказаДо", чСуммаЗаказаДо);
	//	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры // Процедура ОбновитьСписок();

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сообщить1("Параметры.ТочностьСуммы         ="+Параметры.ТочностьСуммы);
	Сообщить1("Параметры.ТочностьПроцент       ="+Параметры.ТочностьПроцент);
	Сообщить1("Параметры.СуммаПоступилоПоЗаказу="+Параметры.СуммаПоступилоПоЗаказу);
	Сообщить1("Параметры.КонтрагентЗаказа      ="+Параметры.КонтрагентЗаказа);
	
	ТочностьСуммы         = Параметры.ТочностьСуммы;
	ТочностьПроцент       = Параметры.ТочностьПроцент;
	СуммаПоступилоПоЗаказу= Параметры.СуммаПоступилоПоЗаказу;
	
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЗаказаОжидаетОплаты", 
	Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты"));			
	
	// не надо		  
	//////Список.Параметры.УстановитьЗначениеПараметра("ЗаказПокупателяКонтрагент", Параметры.КонтрагентЗаказа);
	////
	////Список.Параметры.УстановитьЗначениеПараметра("СостояниеУтвержден", Перечисления.СостоянияОбъектов.Утвержден);
	////Список.Параметры.УстановитьЗначениеПараметра("СостояниеОтклонен", Перечисления.СостоянияОбъектов.Отклонен);
	
	// из 3.1
	Если Параметры.Свойство("КонтрагентЗаказа") И ЗначениеЗаполнено(Параметры.КонтрагентЗаказа) Тогда
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		Эл.ПравоеЗначение = Параметры.КонтрагентЗаказа;
		Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Эл.Использование = Истина;
	КонецЕсли;	
	
	ОбновитьСписок();	
	
КонецПроцедуры   

Процедура Сообщить1(сТекст)
	Если бОтладка Тогда 
		Сообщить(сТекст);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ном="";
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
		Оповестить("ВыбралиЗаказ",Ном);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Ном = Элементы.Список.ТекущиеДанные.Номер;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

// не исп
//&НаКлиенте
//Процедура ПриЗакрытии()
//	//ТекущиеДанные = Список.ТекущиеДанные; // чушь
//	//Закрыть("ОК"); 
//КонецПроцедуры

//&НаКлиенте
//Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//////	// Заполним структуру возвращаемых параметров
//////	СтруктураВозвращаемыхЗначений = Новый Структура();
//////	СтруктураВозвращаемыхЗначений.Вставить("Заказ", Элемент.ТекущиеДанные.Ссылка);
//////	СтруктураВозвращаемыхЗначений.Вставить("ТочностьСуммы", ТочностьСуммы);
//////	СтруктураВозвращаемыхЗначений.Вставить("ТочностьПроцент", ТочностьПроцент);
//////	
//////	// Все сделали, можно закрывать форму
////////	Закрыть(СтруктураВозвращаемыхЗначений);

//    	//Закрыть(Заказ);
//КонецПроцедуры

бОтладка = Ложь;