
			///////////////////////////////////////////////////////////////////
			//			 			ЗАГРУЗКА ДОКУМЕНТОВ                     //
			/////////////////////////////////////////////////////////////////
			
Процедура ЗагрузкаДокументов(ПараметрыОбмена) Экспорт
	
	Если ПараметрыОбмена.ВыгружатьНаСайт тогда
		
		ЗагрузитьДокументыССайта(ПараметрыОбмена);	
		
	Иначе
	
		ЗагрузитьДокументыИзФайла(ПараметрыОбмена);
		
	КонецЕсли;
				
КонецПроцедуры
			
Процедура ЗагрузитьДокументыИзФайла(ПараметрыОбмена)
	
	Файл = Новый Файл(ПараметрыОбмена.ФайлЗагрузки);
	
	Если НЕ Файл.Существует()
		ИЛИ Файл.ЭтоКаталог() Тогда
		
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Файл загрузки не найден: " + ПараметрыОбмена.ФайлЗагрузки, ПараметрыОбмена);
		Возврат;
		
	КонецЕсли;
	
	ФайлXML = Новый ТекстовыйДокумент;
	ФайлXML.Прочитать(ПараметрыОбмена.ФайлЗагрузки);
	СтрокаXML = ФайлXML.ПолучитьТекст();
	
	ОбработатьКонтейнеры(СтрокаXML, ПараметрыОбмена);
	
КонецПроцедуры
			
Процедура ЗагрузитьДокументыССайта(ПараметрыОбмена)
	
	ОтветСервера = "";
	Соединение = Неопределено;
	ТипСоединения = "sale";
	
	НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;
	
	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отправка запроса на авторизацию.", ПараметрыОбмена);
	
	Успешно = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);
	
	Если Не Успешно Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Авторизация на сайте не выполнена.", ПараметрыОбмена);	
		Возврат;
	КонецЕсли;
	
	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	Попытка
		Токен			= "&" + СтрПолучитьСтроку(ОтветСервера, 4);
	Исключение
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("CSRF токен не поддерживается. Для того, чтобы поддерживался - необходимо обновить БУС.", ПараметрыОбмена);	
	КонецПопытки;
	
	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отправка запроса на инициализацию, для определения версии обмена данных.", ПараметрыОбмена);
	ОтветСервераОИнициализации = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_Инициализация + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы , ЗаголовкиЗапросов, ПараметрыОбмена);
	
	Если ОтветСервераОИнициализации = Неопределено Тогда 
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось провести инициализацию. Загрузка с сайта невозможна", ПараметрыОбмена);	
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ВерсияXML		= СтрПолучитьСтроку(ОтветСервераОИнициализации, 4);
		
		ВерсияЧислом 	= Число(Прав(ВерсияXML,4)); 
		
	Исключение
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось получить версию XML. Загрузка с сайта невозможна", ПараметрыОбмена);	
		Возврат;
		
	КонецПопытки;
	
	Если ВерсияЧислом < 2.08 тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Версия Commerce ML не 2.08, а " + Строка(ВерсияЧислом) + ". Загрузка документов этим модулем обмена невозможна.", ПараметрыОбмена);	
		Возврат;
		
	КонецЕсли;

	лЕстьДокументы = Истина;
	
	Пока лЕстьДокументы Цикл
		ОписаниеОшибки = "";
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отправка запроса на получение заказов с сайта.", ПараметрыОбмена);
		
		ОтветСервера = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ПолучитьДанные + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы, ЗаголовкиЗапросов, ПараметрыОбмена);
		
		Если ОтветСервера = Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось загрузить данные с сервера.", ПараметрыОбмена);	
			Возврат;
			
		КонецЕсли;
		
		СтрокаCML = "";
		ОтветСервера = СокрЛ(ОтветСервера);
		
		Если Лев(ОтветСервера, 2) = "PK" Тогда
			СтрокаCML = РаспаковатьZIPАрхив(ОтветСервера);
		Иначе
			Если Лев(ОтветСервера, 5) = "<?xml" Тогда
				СтрокаCML = ОтветСервера;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаCML) Тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось прочитать данные, загруженные с сервера.", ПараметрыОбмена);
			Возврат;
		КонецЕсли;

		лЕстьДокументы = ОбработатьКонтейнеры(СтрокаCML, ПараметрыОбмена);
		
	КонецЦикла;
	
	ОтветСервера = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы , ЗаголовкиЗапросов, ПараметрыОбмена);
	
	Если ОтветСервера = Неопределено Тогда 
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось отправить сообщение на сайт, что заказы получены и обработаны.", ПараметрыОбмена);	
	КонецЕсли;
	
	Если СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) <> "success" Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось отправить сообщение на сайт, что заказы получены и обработаны.", ПараметрыОбмена);	
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Сообщение на сайт, что заказы получены и обработаны, доставлено.", ПараметрыОбмена);	
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция РаспаковатьZIPАрхив(СтрокаZIP) Экспорт
	
	СтрокаСодержимого = "ZIP_ERROR";
	
	ИмяФайла    = ПолучитьИмяВременногоФайла("zip");
	ИмяКаталога = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
	СоздатьКаталог(ИмяКаталога);
	
	СтрокаВФайл = Новый ТекстовыйДокумент;
	СтрокаВФайл.УстановитьТекст(СтрокаZIP);
	Попытка
		СтрокаВФайл.Записать(ИмяФайла);
	Исключение
	КонецПопытки;
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяКаталога);
	ЧтениеZIP.Закрыть();
	
	РаспакованныеФайлы = НайтиФайлы(ИмяКаталога, "*.xml");
	
	Если РаспакованныеФайлы.Количество() = 1 Тогда
		СтрокаИзФайла 	  = Новый ТекстовыйДокумент;
		СтрокаИзФайла.Прочитать(РаспакованныеФайлы[0].ПолноеИмя);
		СтрокаСодержимого = СтрокаИзФайла.ПолучитьТекст();
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(ИмяКаталога);
	Исключение
	КонецПопытки;
	
	Возврат СтрокаСодержимого;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ОбработатьКонтейнеры(ДанныеЗаказов, ПараметрыОбмена)
	
	Если ТипЗнч(ДанныеЗаказов) = Тип("ОбъектXDTO") Тогда
		ДокументыXDTO 	= ДанныеЗаказов;
	Иначе
		ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
		ДокументыXDTO 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДанныеЗаказовВXDTO(ПараметрыОбмена, ДанныеЗаказов);
                            
	КонецЕсли;
	
	Если ДокументыXDTO 	= Неопределено Тогда 
		
		Возврат Ложь;
		
	ИначеЕсли НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументыXDTO, "Контейнер") Тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Нет документов для обработки", ПараметрыОбмена);
		Возврат Ложь;
		
	КонецЕсли;
	
	МассивДокументовXDTO = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьМассивОбъектовСпискаXDTO(ДокументыXDTO.Контейнер);
	
	ТзнДокументов = Новый ТаблицаЗначений;
	ТзнДокументов.Колонки.Добавить("Валюта");
	ТзнДокументов.Колонки.Добавить("Время");
	ТзнДокументов.Колонки.Добавить("Дата");
	ТзнДокументов.Колонки.Добавить("Дата1С");
	ТзнДокументов.Колонки.Добавить("Номер");
	ТзнДокументов.Колонки.Добавить("Номер1С");
	ТзнДокументов.Колонки.Добавить("НомерВерсии");
	ТзнДокументов.Колонки.Добавить("ЗначенияРеквизитов");
	ТзнДокументов.Колонки.Добавить("ИнформацияОЧеках");
	ТзнДокументов.Колонки.Добавить("Основание");
	ТзнДокументов.Колонки.Добавить("Ид");
	ТзнДокументов.Колонки.Добавить("Комментарий");
	ТзнДокументов.Колонки.Добавить("Курс");
	ТзнДокументов.Колонки.Добавить("Контрагент");
	ТзнДокументов.Колонки.Добавить("ПометкаУдаления");
	ТзнДокументов.Колонки.Добавить("Склад");
	ТзнДокументов.Колонки.Добавить("Сумма");
	ТзнДокументов.Колонки.Добавить("Товары");
	ТзнДокументов.Колонки.Добавить("ХозОперация");
	ТзнДокументов.Колонки.Добавить("НДСВСумме");
	ТзнДокументов.Колонки.Добавить("СуммаНДС");
	ТзнДокументов.Колонки.Добавить("Скидки");
	
	Результат = Ложь;
	
	Для Каждого КонтейнерXDTO Из МассивДокументовXDTO Цикл
		
		Результат = Истина;
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(КонтейнерXDTO.Документ) тогда
			Для Каждого ДокументXDTO Из КонтейнерXDTO.Документ Цикл
				ЗагрузитьДокументы(ПараметрыОбмена, ТзнДокументов, ДокументXDTO);
			КонецЦикла;
		Иначе	
			ЗагрузитьДокументы(ПараметрыОбмена, ТзнДокументов, КонтейнерXDTO.Документ);
		КонецЕсли;

	КонецЦикла;
	
	СоздатьОбновитьТиповыеДокументы(ПараметрыОбмена, ТзнДокументов);	
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьДокументы(ПараметрыОбмена, ТзнДокументов, ДокументXDTO)
	
	лНомер 	= "";
	лДата	= "";
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Номер") Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Номер> документа XML. Документ будет пропущен.", ПараметрыОбмена);
		Возврат;
	Иначе
		Если НЕ	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СвойствоXDTOЗаполнено(ДокументXDTO.Номер) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Некорректные данные в <Документ>.<Номер> документа XML. Документ будет пропущен.", ПараметрыОбмена);
			Возврат;
		Иначе
			лНомер = ДокументXDTO.Номер;
		конецЕсли;
	КонецЕсли;	
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Дата") Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Дата> документа XML. Документ будет пропущен.", ПараметрыОбмена);
		Возврат;
		
	Иначе
		Если НЕ	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СвойствоXDTOЗаполнено(ДокументXDTO.Дата) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Некорректные данные в <Документ>.<Дата> документа XML. Документ будет пропущен.", ПараметрыОбмена);
			Возврат;
		Иначе
			лДата = ДокументXDTO.Дата;
		конецЕсли;
	КонецЕсли;	
	
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ХозОперация")
		ИЛИ (НЕ НРег(ДокументXDTO.ХозОперация) = "заказ товара"	И НЕ НРег(ДокументXDTO.ХозОперация) = "отпуск товара" И НЕ НРег(ДокументXDTO.ХозОперация) = "выплата наличных денег" И НЕ НРег(ДокументXDTO.ХозОперация) = "выплата безналичных денег" И НЕ НРег(ДокументXDTO.ХозОперация) = "эквайринговая операция") Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<ХозОперация> документа XML: " + лНомер + "от " + лДата + ". Документ с таким типом не обрабатывается. Документ будет пропущен.", ПараметрыОбмена);
	КонецЕсли;		
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Контрагенты") Тогда
		лКонтрагент = Неопределено;
		
	Иначе
		Контрагенты = ДокументXDTO.Контрагенты;
		Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(Контрагенты, "Контрагент") Тогда
			лКонтрагент = Неопределено;
		Иначе
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(Контрагенты.Контрагент) тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Контрагенты> документа XML: " + лНомер + "от " + лДата + ". Указано несколько контрагентов. Будет взят первый.", ПараметрыОбмена);
				лКонтрагентXDTO =  Контрагенты.Контрагент[0];
			иначе
				лКонтрагентXDTO =  Контрагенты.Контрагент;
			КонецЕсли;
			
			лКонтрагент= ОбработатьИнформациюОКонтрагентеXDTO(ПараметрыОбмена, лКонтрагентXDTO, лНомер);   
			
		КонецЕсли;	
		
	КонецЕсли;	 		
	
	Если  ДокументXDTO.ХозОперация = "Заказ товара" ИЛИ ДокументXDTO.ХозОперация = "Отпуск товара" тогда
		
		Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Товары")  Тогда
			лТовары = Неопределено;	
		Иначе
			//ТоварыXDTO 	= ДокументXDTO.Товары;
			
			лТовары 	= ОбработатьИнформациюОТабличнойЧастиДокументаXDTO(ПараметрыОбмена, ТзнДокументов, ДокументXDTO);
			
		КонецЕсли;
	Иначе
		лТовары = Неопределено;	
	КонецЕсли;
	
	НовСтр = ТзнДокументов.Добавить();
	
	НовСтр.Дата 			= лДата;
	НовСтр.Номер 			= лНомер;
	НовСтр.Дата1С 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Дата1С"			, "Дата");
	НовСтр.Номер1С 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Номер1С"			, "Строка");
	НовСтр.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "НомерВерсии"		, "Строка");
	НовСтр.ПометкаУдаления 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "ПометкаУдаления"	, "Булево");
	НовСтр.Время 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Время"				, "Строка");
	НовСтр.ХозОперация 		= ДокументXDTO.ХозОперация;
	НовСтр.Ид 				= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Ид"				, "Строка");
	лВалюта					= Справочники.Валюты.НайтиПоНаименованию(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Валюта", "Строка")).Ссылка;
	НовСтр.Валюта 			= ?(ЗначениеЗаполнено(лВалюта), лВалюта, Константы.ВалютаУправленческогоУчета.Получить());
	
	НовСтр.Комментарий 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Комментарий"		, "Строка");
	НовСтр.Курс 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Курс"				, "Число");
	НовСтр.Сумма 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Сумма"				,  "Число");
	
	НовСтр.Контрагент		= лКонтрагент;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Склады") Тогда
		
		Склады = ДокументXDTO.Склады;
		Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(Склады, "Склад") Тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Склады>.<Склад> документа XML: " + лНомер + "от " + лДата + "", ПараметрыОбмена);
		Иначе
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(Склады.Склад) тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Склады> документа XML: " + лНомер + "от " + лДата + ". Указано несколько складов. Будет взят первый.", ПараметрыОбмена);
				лСкладXDTO			=  Склады.Склад[0];
				лСклад 				= ОбработатьИнформациюОСкладеXDTO(ПараметрыОбмена, лСкладXDTO, лНомер);
				НовСтр.Склад		= лСклад;
			иначе
				лСкладXDTO 			=  Склады.Склад;
				лСклад 				= ОбработатьИнформациюОСкладеXDTO(ПараметрыОбмена, лСкладXDTO, лНомер);
				НовСтр.Склад		= лСклад;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Основание") Тогда
		
		НовСтр.Основание = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству( ДокументXDTO, "Основание",		  "Строка");
	Иначе
		Если ДокументXDTO.ХозОперация = "Отпуск товара" тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Для отгрузки с номером: " + лНомер + "от " + лДата + " не указано основание.", ПараметрыОбмена);
		КонецЕсли;	
	КонецЕсли;	
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Налоги") Тогда
		НалогиXDTO = ДокументXDTO.Налоги;
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(НалогиXDTO, "Налог") Тогда
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(НалогиXDTO.Налог) тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Налоги> документа XML: " + лНомер + "от " + лДата + ". Указано несколько НДС. Будет взят первый.", ПараметрыОбмена);
				НалогXDTO			= НалогиXDTO.Налог[0];
				НовСтр.НДСВСумме 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "УчтеноВСумме",	  "Булево");
				НовСтр.СуммаНДС 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "Сумма",			  "Число");
			иначе   				
				НалогXDTO = НалогиXDTO.Налог;
				
				НовСтр.НДСВСумме 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "УчтеноВСумме",	  "Булево");
				НовСтр.СуммаНДС 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "Сумма",			  "Число");
			КонецЕсли;	
		Конецесли;
	Иначе
		НовСтр.НДСВСумме 	= Неопределено;
		НовСтр.СуммаНДС 	= 0;
	КонецЕсли;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Скидки") Тогда
		СкидкиXDTO 		= ДокументXDTO.Скидки;
		НовСтр.Скидки 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбработатьЗначенияСкидокXDTO(ПараметрыОбмена, СкидкиXDTO);
	КонецЕсли;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ЗначенияРеквизитов") Тогда
		ЗначенияРеквизитовXDTO 		= ДокументXDTO.ЗначенияРеквизитов;
		НовСтр.ЗначенияРеквизитов 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбработатьЗначенияРеквизитовXDTO(ПараметрыОбмена, ЗначенияРеквизитовXDTO);
	КонецЕсли;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ИнформацияОЧеках") Тогда
		ИнформацияОЧекахXDTO 		= ДокументXDTO.ИнформацияОЧеках;
		НовСтр.ИнформацияОЧеках 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбработатьИнформацияОЧекахXDTO(ПараметрыОбмена, ИнформацияОЧекахXDTO);
	КонецЕсли;
	
	НовСтр.Товары		= лТовары;
	
КонецПроцедуры


Функция ОбработатьИнформациюОКонтрагентеXDTO(ПараметрыОбмена, КонтрагентXDTO, НомерДокумента)
	
	СтрИнформацияОКонтрагенте = Новый Структура;
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Ид") Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Контрагент>.<Ид> документа XML: " + НомерДокумента + ". Контрагент не будет создан.", ПараметрыОбмена);
		
		Возврат Неопределено;

	КонецЕсли;		
	
	СтрИнформацияОКонтрагенте.Вставить("Ид"						, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "Ид"						, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("НомерВерсии"			, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "НомерВерсии"				, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("ПометкаУдаления"		, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "ПометкаУдаления"			, "Булево"));
	СтрИнформацияОКонтрагенте.Вставить("Наименование"			, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "Наименование"				, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("Фамилия"				, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "Фамилия"					, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("Имя"					, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "Имя"						, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("Отчество"				, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "Отчество"					, "Строка"));
	
	лОфициальноеНаименование    = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "ОфициальноеНаименование"	, "Строка");
	лПолноеНаименование			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "ПолноеНаименование"			, "Строка");
	
	Если ЗначениеЗаполнено(лОфициальноеНаименование) тогда
		СтрИнформацияОКонтрагенте.Вставить("НаименованиеПолное"	, лОфициальноеНаименование);
		СтрИнформацияОКонтрагенте.Вставить("ЮрФизЛицо"			, Перечисления.ЮрФизЛицо.ЮрЛицо);
	Иначе
		СтрИнформацияОКонтрагенте.Вставить("НаименованиеПолное"	, лПолноеНаименование);
		СтрИнформацияОКонтрагенте.Вставить("ЮрФизЛицо"			, Перечисления.ЮрФизЛицо.ФизЛицо);
	КонецЕсли;
	
	СтрИнформацияОКонтрагенте.Вставить("ИНН"					, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "ИНН"						, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("КПП"					, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "КПП"						, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("КодПоОКПО"				, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO, "КодПоОКПО"				, "Строка"));
	СтрИнформацияОКонтрагенте.Вставить("Контакты",);
	
	тзнРасчетныеСчета = Новый ТаблицаЗначений;
	тзнРасчетныеСчета.Колонки.Добавить("НомерСчета");
	тзнРасчетныеСчета.Колонки.Добавить("БанкДляРасчетов");
	тзнРасчетныеСчета.Колонки.Добавить("Банк");
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "РасчетныеСчета") Тогда
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO.РасчетныеСчета, "РасчетныйСчет") Тогда
			РасчетныйСчет = КонтрагентXDTO.РасчетныеСчета.РасчетныйСчет;
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(РасчетныйСчет) тогда
				Для каждого ТекСчет из РасчетныйСчет Цикл
					НовРасчтСчет 					= тзнРасчетныеСчета.Добавить();
					НовРасчтСчет.НомерСчета 		= ТекСчет.НомерСчета; 
					Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТекСчет, "БанкКорреспондент") тогда
						НовРасчтСчет.БанкДляРасчетов 	= ОбработатьИнформациюОБанкеXDTO(ТекСчет.БанкКорреспондент);
					КонецЕсли;
					Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТекСчет, "Банк") тогда
						НовРасчтСчет.Банк		 		= ОбработатьИнформациюОБанкеXDTO(ТекСчет.Банк);
					КонецЕсли;
				КонецЦикла;
			Иначе
				НовРасчтСчет 					= тзнРасчетныеСчета.Добавить();
				НовРасчтСчет.НомерСчета 		= РасчетныйСчет.НомерСчета; 
				Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(РасчетныйСчет, "БанкКорреспондент") тогда
					НовРасчтСчет.БанкДляРасчетов 	= ОбработатьИнформациюОБанкеXDTO(РасчетныйСчет.БанкКорреспондент);
				КонецЕсли;
				Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(РасчетныйСчет, "Банк") тогда
					НовРасчтСчет.Банк		 		= ОбработатьИнформациюОБанкеXDTO(РасчетныйСчет.Банк);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если тзнРасчетныеСчета.Количество() > 0 тогда
		СтрИнформацияОКонтрагенте.Вставить("БанковскиеСчета", тзнРасчетныеСчета);
	Иначе
		СтрИнформацияОКонтрагенте.Вставить("БанковскиеСчета", Неопределено);
	КонецЕсли;
	
	лКонтакты = ОбработатьКонтактнуюИнформациюКонтрагентаXDTO(КонтрагентXDTO, ПараметрыОбмена, СтрИнформацияОКонтрагенте.ЮрФизЛицо);
	
	Если лКонтакты.Количество() > 0 тогда
		СтрИнформацияОКонтрагенте.Вставить("Контакты", лКонтакты);
	Иначе
		СтрИнформацияОКонтрагенте.Вставить("Контакты", Неопределено);
	КонецЕсли;
	
	лКонтактныеЛица = ОбработатьКонтактныеЛицаКонтрагентаXDTO(КонтрагентXDTO);
	
	Если лКонтактныеЛица.Количество() > 0 тогда
		СтрИнформацияОКонтрагенте.Вставить("КонтактныеЛица", лКонтактныеЛица);
	Иначе
		СтрИнформацияОКонтрагенте.Вставить("КонтактныеЛица", Неопределено);
	КонецЕсли;
	
	Возврат СтрИнформацияОКонтрагенте;
	
КонецФункции

Функция ОбработатьИнформациюОБанкеXDTO(БанкXDTO)
	
	стрИнформацияОБанке = Новый Структура;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(БанкXDTO, "Адрес") Тогда
		стрИнформацияОБанке.Вставить("Адрес", Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(БанкXDTO.Адрес, "Представление"	, "Строка"));	
	Иначе
		стрИнформацияОБанке.Вставить("Адрес", Неопределено);	
	КонецЕсли;
	
	стрИнформацияОБанке.Вставить("БИК"					, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(БанкXDTO, "БИК"					, "Строка"));
	стрИнформацияОБанке.Вставить("Наименование"			, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(БанкXDTO, "Наименование"			, "Строка"));
	стрИнформацияОБанке.Вставить("СчетКорреспондентский", Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(БанкXDTO, "СчетКорреспондентский"	, "Строка"));
	
	Возврат стрИнформацияОБанке;
	
КонецФункции

Функция ОбработатьКонтактнуюИнформациюКонтрагентаXDTO(КонтрагентXDTO, ПараметрыОбмена, ЮрФизЛицо)
	
	тзнКонтакты = Новый ТаблицаЗначений;
	
	тзнКонтакты.Колонки.Добавить("ТипВидКонтактнойИнформации");
	тзнКонтакты.Колонки.Добавить("Представление");
	тзнКонтакты.Колонки.Добавить("АдресныеПоля");
	
	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо тогда
		тзнСоответствийАдресов = ПараметрыОбмена.СоответствиеАдресовЮрЛиц;
	Иначе
		тзнСоответствийАдресов = ПараметрыОбмена.СоответствиеАдресовФизЛиц;
	КонецЕсли;
	
	Для Каждого ТекСтр из тзнСоответствийАдресов Цикл
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO, ТекСтр.НаименованиеПоля) Тогда
			лАдрес = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(КонтрагентXDTO[ТекСтр.НаименованиеПоля], "Представление"	, "Строка");
			//Если ЗначениеЗаполнено(лАдрес) тогда
				
				НовСтр 	= тзнКонтакты.Добавить();
				
				НовСтр.ТипВидКонтактнойИнформации	= ТекСтр.ВидКонтактнойИнформации;
				НовСтр.Представление				= лАдрес;
				НовСтр.АдресныеПоля					= ОбработатьАдресныеПоляXDTO(КонтрагентXDTO[ТекСтр.НаименованиеПоля]);
				                  
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Контакты") Тогда
		
		Контакты = КонтрагентXDTO.Контакты;
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(Контакты.Контакт) тогда
			Для каждого ТекКонтакт из Контакты.Контакт Цикл
				
				лАдрес = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекКонтакт, "Значение"	, "Строка");
				Если ЗначениеЗаполнено(лАдрес) тогда
					
					НовСтр 	= тзнКонтакты.Добавить();
					
					Если  ТекКонтакт.Тип = "Электронная почта"  ИЛИ ТекКонтакт.Тип 	= "Почта" тогда
						НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами; 
					ИначеЕсли  ТекКонтакт.Тип = "Телефон рабочий" ИЛИ ТекКонтакт.Тип 	= "ТелефонРабочий" тогда
						НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
					ИначеЕсли  ТекКонтакт.Тип = "Факс" тогда
						НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
					КонецЕсли;	
					
					НовСтр.Представление	= лАдрес;
					
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			ТекКонтакт = Контакты.Контакт;
			лАдрес = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекКонтакт, "Значение"	, "Строка");
			Если ЗначениеЗаполнено(лАдрес) тогда
				
				НовСтр 	= тзнКонтакты.Добавить();
				
				Если  ТекКонтакт.Тип 		= "Электронная почта"  ИЛИ ТекКонтакт.Тип 	= "Почта" тогда
					НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
				ИначеЕсли  ТекКонтакт.Тип 	= "Телефон рабочий" ИЛИ ТекКонтакт.Тип 	= "ТелефонРабочий" тогда
					НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				ИначеЕсли  ТекКонтакт.Тип 	= "Факс" тогда
					НовСтр.ТипВидКонтактнойИнформации	= Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
				КонецЕсли;	
				                                          
				НовСтр.Представление		= лАдрес;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Конецесли;
	
	Возврат тзнКонтакты;

КонецФункции

Функция ОбработатьКонтактныеЛицаКонтрагентаXDTO(КонтрагентXDTO)
	
	тзнКонтактныеЛица = Новый ТаблицаЗначений;
	
	тзнКонтактныеЛица.Колонки.Добавить("Ид");
	тзнКонтактныеЛица.Колонки.Добавить("Наименование");
	тзнКонтактныеЛица.Колонки.Добавить("Отношение");
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Представители") Тогда
		Представители = КонтрагентXDTO.Представители;
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(Представители, "Представитель") Тогда
			Представитель = Представители.Представитель;

			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(Представитель) тогда
				Для каждого ТекПредставитель из Представитель Цикл
					
					НовСтр 				= тзнКонтактныеЛица.Добавить();
					НовСтр.Ид 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекПредставитель.Контрагент, "Ид"				, "Строка");
					НовСтр.Наименование = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекПредставитель.Контрагент, "Наименование"	, "Строка");
					НовСтр.Отношение 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекПредставитель.Контрагент, "Отношение"		, "Строка");
					
				КонецЦикла;
			Иначе
				
				НовСтр 				= тзнКонтактныеЛица.Добавить();
				НовСтр.Ид 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(Представитель.Контрагент, "Ид"				, "Строка");
				НовСтр.Наименование = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(Представитель.Контрагент, "Наименование"	, "Строка");
				НовСтр.Отношение 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(Представитель.Контрагент, "Отношение"		, "Строка");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат тзнКонтактныеЛица; 
	
КонецФункции

Функция ОбработатьИнформациюОСкладеXDTO(ПараметрыОбмена, СкладXDTO, НомерДокумента)
	
	стрИнформацияОСкладе = Новый Структура;
	
	стрИнформацияОСкладе.Вставить("Ид"			, Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(СкладXDTO, "Ид"						, "Строка"));
	стрИнформацияОСкладе.Вставить("Наименование", Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(СкладXDTO, "Наименование"				, "Строка"));
	
	
	Возврат стрИнформацияОСкладе;
	
КонецФункции

Функция ОбработатьИнформациюОТабличнойЧастиДокументаXDTO(ПараметрыОбмена, ТзнДокументов, ДокументXDTO)
	
	ТоварыXDTO = ДокументXDTO.Товары;
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Основание") Тогда
		лОснование = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству( ДокументXDTO, "Основание",  "Строка");
	Иначе
		лОснование = "";
	КонецЕсли;
	
	тзнТовары = Новый ТаблицаЗначений;
	тзнТовары.Колонки.Добавить("Ид");
	тзнТовары.Колонки.Добавить("Наименование");
	тзнТовары.Колонки.Добавить("СтавкаНДСТовара");
	тзнТовары.Колонки.Добавить("Коэффициент");
	тзнТовары.Колонки.Добавить("Количество");
	тзнТовары.Колонки.Добавить("Цена");
	тзнТовары.Колонки.Добавить("Сумма");
	тзнТовары.Колонки.Добавить("Единица");
	тзнТовары.Колонки.Добавить("НаименованиеНалога");
	тзнТовары.Колонки.Добавить("СуммаНДС");
	тзнТовары.Колонки.Добавить("УчтеноВСумме");
	тзнТовары.Колонки.Добавить("ЗначенияРеквизитов");
	тзнТовары.Колонки.Добавить("Скидки");
	тзнТовары.Колонки.Добавить("КлючСтроки");
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварыXDTO, "Товар") Тогда

		Возврат тзнТовары;
	Иначе
		
		лКлючСтроки = 1; 
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(ТоварыXDTO.Товар) тогда
			
			Для каждого ТекТовар из ТоварыXDTO.Товар Цикл
				
				Если НРег(ДокументXDTO.ХозОперация) = "заказ товара" тогда				
					лКлючСтроки = лКлючСтроки + 1;  				
				Иначе
					
					НайденныеСтроки = ТзнДокументов.НайтиСтроки(Новый Структура("ХозОперация, Номер", "Заказ товара", лОснование));
					Если НайденныеСтроки.Количество() > 0 тогда
						
						НашиТовары = НайденныеСтроки[0].Товары;
						
						идТовара = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекТовар, "Ид", "Строка");
						
						НайденнаяСтрока = НашиТовары.Найти(идТовара,"Ид");
 
						Если НайденнаяСтрока = Неопределено Тогда
							лКлючСтроки = лКлючСтроки + 1;  				
						Иначе
						    лКлючСтроки = НайденнаяСтрока.КлючСтроки;
						КонецЕсли;

					Иначе
						лКлючСтроки = лКлючСтроки + 1;  				
					КонецЕсли;
					
				КонецЕсли;
				
				ОбработатьИнформациюОТовареДокументаXDTO(ПараметрыОбмена, ТекТовар, тзнТовары, лКлючСтроки);	
				
			КонецЦикла; 			
		Иначе
			ОбработатьИнформациюОТовареДокументаXDTO(ПараметрыОбмена, ТоварыXDTO.Товар, тзнТовары, лКлючСтроки);	
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат тзнТовары;	
КонецФункции

Процедура ОбработатьИнформациюОТовареДокументаXDTO(ПараметрыОбмена, ТоварXDTO, тзнТовары, КлючСтроки)
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "Ид") Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка в значении узла <Документ>.<Товары>.<Товар>.<Ид> документа XML. Товар в документ не будет добавлен.", ПараметрыОбмена);
	Иначе
		
		НовСтр = тзнТовары.Добавить();
		
		НовСтр.Ид 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "Ид"			, "Строка");             
		НовСтр.Наименование = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "Наименование", "Строка");
		
		НовСтр.Количество 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "Количество"	, "Число");             
		НовСтр.Коэффициент 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "Коэффициент"	, "Число");             
		НовСтр.Цена 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "ЦенаЗаЕдиницу"	, "Число");             
		НовСтр.Сумма 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТоварXDTO, "Сумма"			, "Число");             
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "ЗначенияРеквизитов") Тогда
			ЗначенияРеквизитовXDTO 		= ТоварXDTO.ЗначенияРеквизитов;
			НовСтр.ЗначенияРеквизитов 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбработатьЗначенияРеквизитовXDTO(ПараметрыОбмена, ЗначенияРеквизитовXDTO);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовСтр.ЗначенияРеквизитов) тогда
			
			НайденнаяСтрока = НовСтр.ЗначенияРеквизитов.Найти("НомерПозицииКорзины","Наименование");
			
			Если НайденнаяСтрока = Неопределено Тогда
				НовСтр.КлючСтроки = КлючСтроки;    
			Иначе
			    НовСтр.КлючСтроки = XMLЗначение(Тип("Число"), НайденнаяСтрока.Значение);
			КонецЕсли;		
			
		Иначе
			НовСтр.КлючСтроки 	= КлючСтроки;    
		КонецЕсли;
		
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "Налоги") Тогда
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO.Налоги, "Налог") Тогда
				
				НалогXDTO 	= ТоварXDTO.Налоги.Налог;
				
				НовСтр.НаименованиеНалога	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "Наименованние"		, "Строка");
				НовСтр.СуммаНДС 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "Сумма"			, "Число");             
				НовСтр.УчтеноВСумме			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(НалогXDTO, "УчтеноВСумме"	, "Булево");             
				
			КонецЕсли;
		КонецЕсли;
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "СтавкиНалогов") Тогда
			Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO.СтавкиНалогов, "СтавкаНалога") Тогда
				
				СтавкаНалогаXDTO 		= ТоварXDTO.СтавкиНалогов.СтавкаНалога;
				
				лСтрокойНДС 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(СтавкаНалогаXDTO, "Ставка"		, "Строка");
				НовСтр.СтавкаНДСТовара 	= Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ПолучитьНДСПоставке(лСтрокойНДС);
			КонецЕсли;
		КонецЕсли;
		
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "Единица") Тогда
			
			ЕдиницаXDTO 		= ТоварXDTO.Единица;
			стрЕдиницыИзмерения = Новый Структура;
			
			стрЕдиницыИзмерения.Вставить("Ид"					,Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ЕдиницаXDTO, "Ид"					, "Строка"));
			стрЕдиницыИзмерения.Вставить("Код"					,Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ЕдиницаXDTO, "Код"					, "Строка"));
			стрЕдиницыИзмерения.Вставить("НаименованиеКраткое"	,Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ЕдиницаXDTO, "НаименованиеКраткое"	, "Строка"));
			стрЕдиницыИзмерения.Вставить("НаименованиеПолное"	,Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ЕдиницаXDTO, "НаименованиеПолное"	, "Строка"));
			
			НовСтр.Единица = стрЕдиницыИзмерения
		КонецЕсли;
		
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(ТоварXDTO, "Скидки") Тогда
			ЗначенияРеквизитовXDTO 		= ТоварXDTO.Скидки;
			НовСтр.Скидки 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбработатьЗначенияСкидокXDTO(ПараметрыОбмена, ЗначенияРеквизитовXDTO);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ОбработатьАдресныеПоляXDTO(XDTOАдрес)	
	
	тзнАдресныеПоля = Новый ТаблицаЗначений;
	тзнАдресныеПоля.Колонки.Добавить("Значение");
	тзнАдресныеПоля.Колонки.Добавить("ТипЗначения");
	
	Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ОбъектXDTOСодержитСвойство(XDTOАдрес, "АдресноеПоле") тогда
	
		АдресноеПоле = XDTOАдрес.АдресноеПоле;
		Если Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЭтоСписокXDTO(АдресноеПоле) тогда
			
			Для каждого ТекАдресноеПоле из АдресноеПоле Цикл
				
				НовСтр = тзнАдресныеПоля.Добавить();
				НовСтр.ТипЗначения 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекАдресноеПоле, "Тип"			, "Строка");
				НовСтр.Значение 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(ТекАдресноеПоле, "Значение"	, "Строка");
				
			КонецЦикла;
			
		Иначе
			
			НовСтр = тзнАдресныеПоля.Добавить();
			НовСтр.ТипЗначения 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(АдресноеПоле, "Тип"				, "Строка");
			НовСтр.Значение 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЗначениеПоСвойству(АдресноеПоле, "Значение"			, "Строка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат тзнАдресныеПоля;
	
КонецФункции

Функция ПолучитьВидаКонтактойИнформации(ПолеXML, ПараметрыОбмена, ЮрФизЛицо)
	
	Результат = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	
	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо тогда
		тзнСоответствийАдресов = ПараметрыОбмена.СоответствиеАдресовЮрЛиц;
	Иначе
		тзнСоответствийАдресов = ПараметрыОбмена.СоответствиеАдресовФизЛиц;
	КонецЕсли;
	
	Для Каждого ТекСтр из тзнСоответствийАдресов Цикл
		
		Если ТекСтр.НаименованиеПоля = ПолеXML тогда
			Результат = ТекСтр.ВидКонтактнойИнформации;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьЗначениеРеквизитаДокумента(ЗначенияРеквизитов, ИмяРеквизита)
	
	Если ЗначенияРеквизитов = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденнаяСтрока = ЗначенияРеквизитов.Найти(ИмяРеквизита, "Наименование");
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденнаяСтрока.Значение;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ТаблицаСоответствий)
	
	НайденныеСтроки =  ТаблицаСоответствий.НайтиСтроки(Новый Структура("Документ", НазваниеДокумента));

	Возврат НайденныеСтроки; 
	
КонецФункции


Функция СоздатьОбновитьТиповыеДокументы(ПараметрыОбмена, ТзнДокументов)
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокИдДокументов"			, ТзнДокументов.ВыгрузитьКолонку("Ид"));
	
	лКоличествоСтрок 	= ПараметрыОбмена.ДокументыЗагрузки.Количество()-1; 	
	Для Итератор = 0 по лКоличествоСтрок Цикл
		ТекВидДокумента = ПараметрыОбмена.ДокументыЗагрузки[Итератор]; 
		лВидДокумента = ТекВидДокумента.ВидДокумента;
		Если Итератор = 0 тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документ.Ссылка КАК Ссылка,
			|	"""+лВидДокумента+""" КАК ТипДокумента,
			|	Документ.Б_НомерВерсии,
			|	Документ.Б_Идентификатор КАК Б_Идентификатор
			|ПОМЕСТИТЬ ВремДокументы
			|ИЗ
			|	Документ."+ТекВидДокумента.Документ+" КАК Документ
			|ГДЕ
			|	Документ.Б_Идентификатор В(&СписокИдДокументов)";
		ИначеЕсли ((лВидДокумента = "Отпуск товара" И ПараметрыОбмена.ЗагрузкаОтгрузок) 
			ИЛИ ((лВидДокумента = "Выплата наличных денег" И ПараметрыОбмена.ЗагрузкаОплат) 
			ИЛИ (лВидДокумента = "Эквайринговая операция" И ПараметрыОбмена.ЗагрузкаОплат) 
			ИЛИ (лВидДокумента = "Выплата безналичных денег" И ПараметрыОбмена.ЗагрузкаОплат))
			И ПроверитьЗагружаемостьОплаты(ПараметрыОбмена, лВидДокумента)) тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|  ВЫБРАТЬ
			|	Документ.Ссылка КАК Ссылка,
			|	"""+лВидДокумента+""" КАК ТипДокумента,
			|	Документ.Б_НомерВерсии,
			|	Документ.Б_Идентификатор КАК Б_Идентификатор
			|ИЗ
			|	Документ."+ТекВидДокумента.Документ+" КАК Документ
			|ГДЕ
			|	Документ.Б_Идентификатор В(&СписокИдДокументов)";
		КонецЕсли;
		
		Если Итератор = лКоличествоСтрок тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ТипДокумента,	
			|	Б_Идентификатор";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	              
	Для каждого ТекДокумент из ТзнДокументов Цикл
		
		Если ТекДокумент.ХозОперация = "Отпуск товара" И НЕ ПараметрыОбмена.ЗагрузкаОтгрузок тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отгрузка с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит, ччобы отгрузки не загружались.", ПараметрыОбмена);
			Продолжить;	
		КонецЕсли;
		
		Если ТекДокумент.ХозОперация = "Выплата наличных денег" ИЛИ ТекДокумент.ХозОперация = "Выплата безналичных денег" ИЛИ ТекДокумент.ХозОперация = "Эквайринговая операция" тогда
			Если НЕ ПараметрыОбмена.ЗагрузкаОплат тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Оплата с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит, чтобы оплаты не загружались.", ПараметрыОбмена);
				Продолжить;	
			КонецЕсли;
			
			Если ПроверитьЗагружаемостьОплаты(ПараметрыОбмена, ТекДокумент.ХозОперация) = Ложь тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Оплата с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит индивидуальная настройка, чтобы оплаты этого типа не загружались.", ПараметрыОбмена);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		НайденнаяСтрока = ПараметрыОбмена.ДокументыЗагрузки.Найти(ТекДокумент.ХозОперация, "ВидДокумента");

		Если НайденнаяСтрока = Неопределено тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("ОШИБКА!!! Не определено, с каким документом 1С сопоставлять документ XML с типом:" + ТекДокумент.ХозОперация, ПараметрыОбмена);
			Продолжить;	
		КонецЕсли;
		
		ИмяДокумента 	= НайденнаяСтрока.Документ;
		
	    Документ = ПолучитьДокументПоКоду(ИмяДокумента, ТекДокумент.Номер1С, ТекДокумент.Дата1С, ТекДокумент.Ид, ТекДокумент.ХозОперация, МенеджерВременныхТаблиц);
		
		Если НЕ Документ.Пустая() тогда
			
			Если ТекДокумент.НомерВерсии <> Документ.Б_НомерВерсии тогда
				
				Если НЕ ПараметрыОбмена.НеРедактироватьДокументыПришедшиеССайта тогда
					СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Ложь, Документ);
				Иначе
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Стоит настройка, чтобы документы в 1С не обновлялись. Документ: " + Строка(Документ.Ссылка) + " будет пропущен.", ПараметрыОбмена);
				КонецЕсли;
			Иначе
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("С последней загрузки из БУС документ: " + Строка(Документ.Ссылка) + " не менялся. Документ будет пропущен.", ПараметрыОбмена);
			КонецЕсли;
		Иначе
			СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Истина);
		КонецЕсли;
		
	КонецЦикла;	
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецФункции

Функция ПроверитьЗагружаемостьОплаты(ПараметрыОбмена, ВидДокумента)
	
	НайденноеЗначение = ПараметрыОбмена.ЗагружаемыеТипыОплат.НайтиПоЗначению(ВидДокумента);
	
	Если НайденноеЗначение = Неопределено тогда
		Результат = Ложь;	
	Иначе
		Результат = НайденноеЗначение.Пометка;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьОбновитьДокумент(ПараметрыОбмена, НазваниеДокумента, ДокументXML, НовыйДокумент, СсылкаНаДокумент = Неопределено)
	
	Если НовыйДокумент И НЕ ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Документ = Документы[НазваниеДокумента].СоздатьДокумент();	
	ИначеЕсли НовыйДокумент И ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Помеченный на удаление документ  '"+ НазваниеДокумента + "' не загружаем.", ПараметрыОбмена);
		Возврат;   
	Иначе             
		Документ = СсылкаНаДокумент.ПолучитьОбъект();  		
	КонецЕсли;   
	
	Если ДокументXML.ПометкаУдаления = ИСТИНА тогда
		
		Попытка 
			Документ.УстановитьПометкуУдаления(Истина);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Помечен на удаление документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		Исключение
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось удалить документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		КонецПопытки;
				
		Возврат;

	КонецЕсли;	
	
	ВремТабТЧ = ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов.Скопировать();
	ВремТабТЧ.Свернуть("ТабличнаяЧасть, Документ, ПолеXML");
	
	мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ДокументыЗагрузки);
	мРеквизитыДокумента = ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияШапокДокументов);
	мТабличныеЧасти		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ВремТабТЧ); 
	мРеквизитыТЧ		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов);
	
	Если мНастройкиДокумента.Количество() = 0 тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("У документа " + НазваниеДокумента + " не найдены основные параметры документа в настройках соответствий. Загрузка документа невозможна.", ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	ОсновныеНастройкиДокумента = мНастройкиДокумента[0];
	
	Для Каждого ТекРеквизит из мРеквизитыДокумента Цикл
																																																										
		Если НЕ ПустаяСтрока(ТекРеквизит.Значение) тогда
			
			//БВ
			Попытка
				//	
				Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
			//БВ
			Исключение
			КонецПопытки;
			//
		КонецЕсли;
			
	КонецЦикла;
	
	ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
	ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);
	
	Если ОсновныеНастройкиДокумента.НумерацияДокументов =  "С сайта" тогда
		Документ.Номер = ДокументXML.Номер; 	
	Иначе
		Если НовыйДокумент тогда
			
			Документ.УстановитьНовыйНомер();	
			
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ТекТабЧасть из мТабличныеЧасти Цикл
		
		Документ[ТекТабЧасть.ТабличнаяЧасть].Очистить();
		
		Если ТекТабЧасть.ПолеXML = "" тогда
			
			НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
			
			Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл
				
				Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) тогда
					
					НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, , НовСтрока);	
					
				КонецЕсли;
				
			КонецЦикла;
			
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(НовСтрока);
			
		Иначе
			
			Для каждого ТекСтрокаТЗ из ДокументXML[ТекТабЧасть.ПолеXML] Цикл
				
				Если ДокументXML[ТекТабЧасть.ПолеXML].Колонки.Найти("Количество") <> Неопределено тогда
					Если ТекСтрокаТЗ.Количество = 0 тогда
						Продолжить;	
					КонецЕсли;
				КонецЕсли;	
				
				//т.к. услуги с сайта не грузятся, то можно не смотреть тип товара, а сразу прописать
				Если ТекТабЧасть.ТабличнаяЧасть = "Товары" И ТекСтрокаТЗ.Ид = "ORDER_DELIVERY" тогда
					Продолжить;	
				КонецЕсли;
				
				Если ТекТабЧасть.ТабличнаяЧасть = "Услуги" И ТекСтрокаТЗ.Ид <> "ORDER_DELIVERY" тогда 
					Продолжить;	
				КонецЕсли;
				
				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
				
				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл
					
					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) И ТекРеквизитТЧ.ТабличнаяЧасть = ТекТабЧасть.ТабличнаяЧасть тогда
						
						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, ТекСтрокаТЗ, НовСтрока);	
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если (ТекТабЧасть.ТабличнаяЧасть = "Товары" ИЛИ ТекТабЧасть.ТабличнаяЧасть = "Услуги") И (НазваниеДокумента = "ЗаказПокупателя" или НазваниеДокумента = "РеализацияТоваровУслуг") тогда
					
					ПересчитатьСтрокуДокумента(Документ, НовСтрока);

				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НазваниеДокумента = "ЗаказПокупателя" или НазваниеДокумента = "РеализацияТоваровУслуг" тогда
		
		Если ДокументXML.Скидки <> Неопределено тогда
			СуммаСкидки = 0;
			Для Каждого СтрокаСкидки Из ДокументXML.Скидки Цикл
				
				Если ЗначениеЗаполнено(СтрокаСкидки.Сумма)  И СтрокаСкидки.УчтеноВСумме Тогда
					
					СуммаСкидки = СуммаСкидки + СтрокаСкидки.Сумма;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СуммаСкидки <> 0 Тогда
				
				Если Документ.Товары.Количество() > 0 Тогда
					РаспределитьСуммуПоКолонке(Документ, Документ.Товары, "Товары", -СуммаСкидки);
				Иначе
					РаспределитьСуммуПоКолонке(Документ, Документ.Услуги, "Услуги", -СуммаСкидки);
				КонецЕсли;
				
			КонецЕсли;  				
			
		КонецЕсли;
		
		//тут расчет скидок
		Документ.СуммаДокумента = Документ.Товары.Итог("Сумма") + Документ.Услуги.Итог("Сумма");
		
	ИначеЕсли НазваниеДокумента = "ОплатаОтПокупателяПлатежнойКартой" тогда	
		Документ.Эквайрер 						= Документ.ДоговорЭквайринга.Эквайрер;	
		Документ.ДоговорВзаиморасчетовЭквайрера = Документ.ДоговорЭквайринга.ДоговорВзаиморасчетов;	
	КонецЕсли;
	
	Если ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Истина);
	ИначеЕсли ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить не оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Ложь);
	Иначе
		
		лПроводитьДокумент = ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ);
		
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, лПроводитьДокумент, Ложь);
			
	КонецЕсли;
	
	Если ДокументСозданИзменен тогда 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		Если НазваниеДокумента = "ОплатаОтПокупателяПлатежнойКартой" ИЛИ НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда
			ЗаполнитьИнформациюОЧеке(Документ.Ссылка, ДокументXML);
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли НазваниеДокумента = "ЗаказПокупателя" тогда 
			
			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда
					
				ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");
				                            
				Если ИдСтатуса 	<> Неопределено тогда
					                                    
					НайденноеЗначениеСвойства =ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияЗначенийСвойствЗаказа.Найти(ИдСтатуса);
							
					Если НайденноеЗначениеСвойства <> Неопределено тогда
						
							НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Объект 		= Документ.Ссылка;
							НоваяЗапись.Свойство 	= ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа;
							НоваяЗапись.Значение 	= НайденноеЗначениеСвойства.Статус;
							НоваяЗапись.Записать();
						
						КонецЕсли;
							
					КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
					
					ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");
				                            
					Если ИдМетодаДоставки 	<> Неопределено тогда
					                                    
						НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствЗаказа.Найти(ИдМетодаДоставки);
							
						Если НайденноеЗначениеСвойства <> Неопределено тогда
							
							НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Объект 		= Документ.Ссылка;
							НоваяЗапись.Свойство 	= ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа;
							НоваяЗапись.Значение 	= НайденноеЗначениеСвойства.Служба;
							НоваяЗапись.Записать();
						
						КонецЕсли;
							
					КонецЕсли;
			КонецЕсли;			
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли НазваниеДокумента = "РеализацияТоваровУслуг" тогда
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
				
				ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");
				
				Если ИдМетодаДоставки 	<> Неопределено тогда
					
					НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствОтгрузки.Найти(ИдМетодаДоставки);
					
					Если НайденноеЗначениеСвойства <> Неопределено тогда
							
							НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Объект 		= Документ.Ссылка;
							НоваяЗапись.Свойство 	= ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки;
							НоваяЗапись.Значение 	= НайденноеЗначениеСвойства.Служба;
							НоваяЗапись.Записать();
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ)
	
	ПроводитьДокумент = Ложь;
	
	Если НазваниеДокумента = "РеализацияТоваровУслуг" И НЕ ДокументОтменен И ПараметрыОбмена.ПроводитьЕслиОтгружен  тогда
		
		лОтгружено = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отгружено");
		лОтгружено = ?((лОтгружено = Неопределено ИЛИ лОтгружено = "false"), Ложь, Истина);
		
		Если лОтгружено = Истина тогда
			ПроводитьДокумент = Истина;
		КонецЕсли;
		
		
	ИначеЕсли НазваниеДокумента = "ПриходныйКассовыйОрдер"  И НЕ ДокументОтменен И ПараметрыОбмена.ПроводитьЕслиОплачен  тогда
		
		лОплачено = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оплачено");
		лОплачено = ?((лОплачено = Неопределено ИЛИ лОплачено = "false"), Ложь, Истина);
		
		Если лОплачено = Истина тогда
			Документ.Оплачено = Истина;     	
			ПроводитьДокумент = Истина;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "ОплатаОтПокупателяПлатежнойКартой" И НЕ ДокументОтменен И ПараметрыОбмена.ПроводитьЕслиОплачен тогда
		
		лОплачено = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оплачено");
		лОплачено = ?((лОплачено = Неопределено ИЛИ лОплачено = "false"), Ложь, Истина);
		
		Если лОплачено = Истина тогда
			ПроводитьДокумент = Истина;
		КонецЕсли;
		
	ИначеЕсли (НазваниеДокумента = "ПлатежноеПоручениеВходящее") И НЕ ДокументОтменен И ПараметрыОбмена.ПроводитьЕслиОплачен тогда
		
		лОплачено = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оплачено");
		лОплачено = ?((лОплачено = Неопределено ИЛИ лОплачено = "false"), Ложь, Истина);
		
		Если лОплачено = Истина тогда
				
				Документ.Оплачено = Истина; 
				
				лДатаОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Дата оплаты");

				Попытка
					Документ.ДатаОплаты = XMLЗначение(Тип("Дата"),лДатаОплаты); 
				Исключение
					Документ.ДатаОплаты = Документ.Дата;
				КонецПопытки;
				
				ПроводитьДокумент = Истина;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПроводитьДокумент;
	
КонецФункции

Функция ПолучитьДокумент(МенеджерВременныхТаблиц, ТипДокумента, ТекДокумент)
	
	Если ТипДокумента = "Заказ" тогда
		ВидДокумента = Документы.ЗаказПокупателя;
	ИначеЕсли ТипДокумента = "Отгрузка" тогда
		ВидДокумента = Документы.РеализацияТоваровУслуг;
	ИначеЕсли ТипДокумента = "ПКО" тогда
		ВидДокумента = Документы.ПриходныйКассовыйОрдер;
	КонецЕсли;	
	
	Документ = ВидДокумента.ПустаяСсылка();
	
	Результат = Новый Структура;
	Результат.Вставить("Документ", Документ);
	Результат.Вставить("ЕстьСсылка", Ложь);
	
	Если ЗначениеЗаполнено(ТекДокумент.Номер1С) и ЗначениеЗаполнено(ТекДокумент.Дата1С) тогда
		
		Документ = ВидДокумента.НайтиПоНомеру(ТекДокумент.Номер1С, ТекДокумент.Дата1С);	
				
		Результат.Документ 		= Документ;
		Результат.ЕстьСсылка 	= Ложь;
		
	КонецЕсли;
	
	Если Документ.Пустая() тогда	
		ЗапросЗ = Новый Запрос;
		ЗапросЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросЗ.Текст = "ВЫБРАТЬ * 			
		|ИЗ
		|	ВремДокументы КАК ВремДокументы
		|ГДЕ
		|	ВремДокументы.ТипДокумента = &ТипДокумента
		|	И ВремДокументы.Б_Идентификатор = &Идентификатор";
		ЗапросЗ.УстановитьПараметр("Идентификатор"	, ТекДокумент.Номер);
		ЗапросЗ.УстановитьПараметр("ТипДокумента"	, ТипДокумента);
		
		тзнВрем = ЗапросЗ.Выполнить().Выгрузить();
		Если тзнВрем.Количество() > 0 тогда
			Документ = тзнВрем[0].Ссылка; 	
							
			Результат.Документ 		= Документ;
			Результат.ЕстьСсылка 	= Ложь;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Документ) тогда
			
			ЗапросЗ = Новый Запрос;
			ЗапросЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросЗ.Текст = "ВЫБРАТЬ
			|	Документ.Ссылка КАК Объект
			|ИЗ
			|	Документ." + ?(ТипДокумента = "Заказ", "ЗаказПокупателя", "РеализацияТоваровУслуг") + " КАК Документ
			|ГДЕ
			|	Документ.Б_Идентификатор = &Идентификатор";
			ЗапросЗ.УстановитьПараметр("Идентификатор"	, ТекДокумент.Номер);
			
			тзнВрем = ЗапросЗ.Выполнить().Выгрузить();
			Если тзнВрем.Количество() > 0 тогда
				
				Результат.Документ 		= тзнВрем[0].Объект;
				Результат.ЕстьСсылка 	= ложь;

			КонецЕсли;
			
		Конецесли;
		
	КонецЕсли;	
	
	Возврат Результат;	
	
КонецФункции


Процедура ПересчитатьСтрокуДокумента(Док, СтрокаТЧ)
	
	Если СтрокаТЧ.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТЧ, Док, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Услуги");
	Иначе
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТЧ, Док, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Товары");
	КонецЕсли;
	
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, Док);
	
КонецПроцедуры


Функция ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекущийРеквизит, СтрокаXML = Неопределено, СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено тогда
		лРеквизит = Документ.Метаданные().Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С);
	Иначе
		лРеквизит = Метаданные.НайтиПоТипу(Тип(СтрокаТабличнойЧасти)).Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С)	
	КонецЕсли;
	
	Если лРеквизит = Неопределено тогда
		
		Массив = Новый Массив;
		Массив.Добавить(ТипЗнч(Документ[ТекущийРеквизит.НаименованиеРеквизита1С]));
		лТипРеквизита = Новый ОписаниеТипов(Массив);
		
	Иначе
		
		лТипРеквизита = лРеквизит.Тип;
		
	КонецЕсли;
	
	мПростыеТипы = Новый Массив;
	мПростыеТипы.Добавить(Тип("Строка"));	
	мПростыеТипы.Добавить(Тип("Число"));	
	мПростыеТипы.Добавить(Тип("Булево"));	
	мПростыеТипы.Добавить(Тип("Дата"));	
	
	Результат = Неопределено;
	
	Если ТекущийРеквизит.ТипДанных = "Из поля XML документа" тогда
		
		Если ТекущийРеквизит.Значение = "Дата с сайта с учетом настройки обмена" тогда
			
			ДатаДокументаНаСайте 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);
			
			Если ОсновныеНастройкиДокумента.ДатаДокументов = "Текущая дата" тогда
				Результат = ТекущаяДата();
			Иначе
				Результат = ДатаДокументаНаСайте;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата с сайта" тогда
			
			Результат 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата 1С" тогда
			
			Результат =  XMLЗначение(Тип("Дата"),ДокументXML.Дата1С);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер с сайта" тогда
			
			Результат =  ДокументXML.Номер;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Ид с сайта" тогда
			
			Результат =  ДокументXML.Ид;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер 1С" тогда
			
			Результат = ДокументXML.Номер1С;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер версии с сайта" тогда
			
			Результат = ДокументXML.НомерВерсии;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Пометка удаления" тогда
	
			Результат = ДокументXML.ПометкаУдаления;	
	
		ИначеЕсли ТекущийРеквизит.Значение = "Комментарий" тогда
			
			Результат = ФормированиеКомментарияДокумента(ДокументXML.Номер,  ДокументXML.Комментарий);	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Контрагент" тогда
			
			Результат = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Договор контрагента" тогда
			
			Контрагент = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
			Результат = ПолучитьДоговорКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, Документ, ДокументXML)
			
		ИначеЕсли ТекущийРеквизит.Значение = "Банковский счет организации" тогда
			
			Результат = Документ.Организация.ОсновнойБанковскийСчет	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Склад" тогда
			
			Результат = ПолучитьСклад(ПараметрыОбмена, Документ, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Валюта" тогда
			
			Результат = ДокументXML.Валюта;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Курс взаиморасчетов" тогда
			
			Результат = ДокументXML.Курс;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Кратность" тогда
			
			Результат = 1;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки" тогда
			
			Результат = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Адрес доставки");
			
		ИначеЕсли ТекущийРеквизит.Значение = "Телефон контрагента" тогда
			
			Результат =  "";	
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Телефон", "ТипВидКонтактнойИнформации");
				
				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес эл. почты контрагента" тогда
			
			Результат =  "";	
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Почта", "ТипВидКонтактнойИнформации");
				
				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Учитывать НДС" тогда
			
			Результат = ДокументXML.НДСВСумме;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма включает НДС" тогда
			
			Результат = ДокументXML.НДСВСумме;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма" тогда
			
			Результат = ДокументXML.Сумма;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма НДС" тогда
			
			Результат = ДокументXML.СуммаНДС;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Касса" тогда
			
			Результат = Справочники.Кассы.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");
				
			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;
				
			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда
					
				НайденныеСтроки = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.НайтиСтроки(Новый Структура("ИдПлатежнойСистемы", ИдОплаты));
				
				Если НайденныеСтроки.Количество() > 0 тогда
					Результат = НайденныеСтроки[0].Касса;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Ставка НДС по первому товару" тогда
			
			Результат = Перечисления.СтавкиНДС.БезНДС;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Основание" тогда
			
			Результат = ПолучитьОснование(ДокументXML, лТипРеквизита);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Договор эквайринга" тогда
			
			Результат = Справочники.ДоговорыЭквайринга.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");
				
			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;
				
			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда
					
				НайденныеСтроки = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.НайтиСтроки(Новый Структура("ИдПлатежнойСистемы", ИдОплаты));
				
				Если НайденныеСтроки.Количество() > 0 тогда
					Результат = НайденныеСтроки[0].ДоговорЭквайринга;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Вид оплаты" тогда
			
			Результат = Справочники.ВидыОплатЧекаККМ.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");
				
			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;
				
			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда
					
				НайденныеСтроки = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.НайтиСтроки(Новый Структура("ИдПлатежнойСистемы", ИдОплаты));
				
				Если НайденныеСтроки.Количество() > 0 тогда
					Результат = НайденныеСтроки[0].ВидОплаты;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Процент торговой уступки" тогда
			
			Результат = 0;
			Попытка
				ДоговорЭквайринга = Документ.ДоговорЭквайринга;
				
				НайденнаяСтрока = ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание.найти(Документ.ВидОплаты);
				
				Если НайденнаяСтрока <> Неопределено Тогда
				    Результат = НайденнаяСтрока.ПроцентТорговойУступки;
				КонецЕсли;
				
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Для документа: " + Строка(Документ) + " не удалось установить процент торговой уступки. Возможно не тот тип документа.", ПараметрыОбмена);
			КонецПопытки;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма торговой уступки" тогда
			
			Результат = Документ.СуммаДокумента * Документ.ПроцентТорговойУступки / 100;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номенклатура" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
			
			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("В документе: " + Строка(Документ) + " не найдена/создана номенклатура. ", ПараметрыОбмена);
				Результат = Справочники.Номенклатура.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.Номенклатура;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Характеристика номенклатуры" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
		
			Если СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры = Неопределено тогда
				Результат = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Содержание номенклатуры" тогда
			
			Результат = СтрокаXML.Наименование;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Ставка НДС" тогда
				
			Если ЗначениеЗаполнено(СтрокаXML.СтавкаНДСТовара) Тогда
				Результат = СтрокаXML.СтавкаНДСТовара;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
					Результат = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Единица измерения" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
		
			Результат = СтрИнформацииОНоменклатуре.ЕдиницаИзмерения;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Количество" тогда
			
			Результат = СтрокаXML.Количество;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Коэффициент" тогда
			
			Результат = СтрокаXML.Коэффициент;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Цена" тогда
			
			Если СтрокаXML.Количество = 0 тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция, с 0 количеством. Цена будет установлена 0", ПараметрыОбмена);
				Возврат 0;
			КонецЕсли;
			
			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда
			
				Результат = 0;	
					
				Если ЗначениеЗаполнено(СтрокаXML.Цена) Тогда
					Результат = СтрокаXML.Цена;
				КонецЕсли;
				
				Если Результат = 0 Тогда
					Результат = СтрокаXML.Сумма / СтрокаXML.Количество;
				КонецЕсли;
			Иначе	
				
				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;
				
				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;
				
				Результат = ЦенаДоСкидки + лСкидка;
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Процент ручной скидки" тогда
			
			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда
			
				Результат = 0;
				
			Иначе	
				
				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;
				
				Если ЦенаДоСкидки = 0 тогда
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция с суммой без скидок = 0. Скидка будет установлена = 0", ПараметрыОбмена);
					Возврат 0;
				КонецЕсли;
				
				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;
				
				Результат = лСкидка*100/(ЦенаДоСкидки+лСкидка);
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма позиции" тогда
			
			Результат = СтрокаXML.Сумма;

		ИначеЕсли ТекущийРеквизит.Значение = "Ключ строки" тогда
			Результат = СтрокаXML.КлючСтроки;	 		
		КонецЕсли;
		
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Фиксированное значение" тогда
		
		Результат = ТекущийРеквизит.Значение;	
		
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по наименованию)" тогда
		
		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);
		
		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип из лТипРеквизита.Типы() Цикл
			
			Если мПростыеТипы.Найти(ТекТип) = Неопределено тогда
				
				лОбъект = Метаданные.НайтиПоТипу(ТекТип);
				
				Если лОбъект <> Неопределено тогда
					
					лПолноеИмяОбъектаПоиска = лОбъект.ПолноеИмя();
					
					Если Лев(лПолноеИмяОбъектаПоиска, 3) = "Пер" тогда
						
						Для каждого ТекЗначение из лОбъект.ЗначенияПеречисления Цикл
							
							Если ТекЗначение.Синоним = лЗначениеДопСвойства тогда
								
								Результат = Перечисления[лОбъект.Имя][ТекЗначение.Имя];
								
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
						
					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Док" тогда
						
						Результат = Документы[лОбъект.Имя].НайтиПоНомеру(лЗначениеДопСвойства, ТекущаяДата());
						
						Прервать;
						
					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Спр" тогда
						
						
						Если лОбъект.Имя = "ДоговорКонтрагента" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.ДоговорКонтрагентаФизлицо) тогда	
							Возврат ПараметрыОбмена.ДоговорКонтрагентаФизлицо; 	
						КонецЕсли;
						
						Если лОбъект.Имя = "Контрагент" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
							Возврат ПараметрыОбмена.КонтрагентФизлицо; 	
						КонецЕсли;
						
						Результат = Справочники[лОбъект.Имя].НайтиПоНаименованию(лЗначениеДопСвойства);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Попытка 
					Результат =    XMLЗначение(ТекТип, лЗначениеДопСвойства);    
				Исключение 
					Результат =""; 
				КонецПопытки ; 	  
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;			
			
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по ид)" тогда
		
		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);
		
		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип из лТипРеквизита.Типы() Цикл
			
			Попытка
				
				Результат =	XMLЗначение(ТекТип, лЗначениеДопСвойства);	
				
				Прервать;
				
			Исключение
				
			КонецПопытки
	
		КонецЦикла;
	
	ИначеЕсли ТекущийРеквизит.ТипДанных = "<Свой алгоритм>" тогда
		
		лИтоговоеНазваниеПоля = ТекущийРеквизит.Значение;	
		
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Документ]"		, "Документ");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Результат]"		, "Результат");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[НоваяСтрока]"		, "СтрокаТабличнойЧасти");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ПараметрыОбмена]"	, "ПараметрыОбмена");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ДокументXML]"		, "ДокументXML");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[СтрокаXML]"		, "СтрокаXML");
		
		Если ЗначениеЗаполнено(лИтоговоеНазваниеПоля) тогда
			Выполнить(лИтоговоеНазваниеПоля);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ФормированиеКомментарияДокумента(Номер, Комментарий)
	
	Если Найти(Комментарий, "[Номер документа на сайте:") = 0 Тогда
		лКомментарий = "[Номер документа на сайте: " + Номер + "] " + Комментарий;	
	Иначе
		лКомментарий = Комментарий;	
	КонецЕсли;
	
	Возврат лКомментарий;

КонецФункции

Функция ПолучитьКонтрагента(ПараметрыОбмена, ЮрФизЛицо, ДокументXML)
	
	Если ЮрФизЛицо 	= Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
		Возврат ПараметрыОбмена.КонтрагентФизлицо;
	КонецЕсли;
	
	Результат = Справочники.Контрагенты.ПустаяСсылка();
	
	ИнформацияОКонтрагенте = ДокументXML.Контрагент;
	
	Если ИнформацияОКонтрагенте.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо тогда
		лПорядокИдентификации = ПараметрыОбмена.ПорядокИдентификацииЮрЛиц;	
	Иначе
		лПорядокИдентификации = ПараметрыОбмена.ПорядокИдентификацииФизЛиц;	
	КонецЕсли;
	
	Для Каждого ТекЗначение из лПорядокИдентификации Цикл
		
		Критерий = ТекЗначение.Значение;
		
		Если Критерий = "Внешний идентификатор" тогда	
			Контрагент = ПолучениеКонтрагентаПоКоду(ПараметрыОбмена, ИнформацияОКонтрагенте.Ид, ИнформацияОКонтрагенте.Наименование);
		ИначеЕсли Критерий = "Не использовать" тогда			
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			Контрагент = ПолучитьКонтрагентаПоКритерию(ПараметрыОбмена, Критерий, ИнформацияОКонтрагенте)
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент) или  Контрагент = Неопределено тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Контрагент = Неопределено тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Из за того, что по критерию было найдено несколько контрагентов,в документ это поле не будет заполнено. Документ с Ид:" + ДокументXML.Ид, ПараметрыОбмена);		
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	ИначеЕсли НЕ Контрагент = Справочники.Контрагенты.ПустаяСсылка() тогда
		
		//Если Контрагент.ВерсияДанных 	= ИнформацияОКонтрагенте.НомерВерсии тогда
		//	Возврат Контрагент.Ссылка;	
		//КонецЕсли;
		
		Если ПараметрыОбмена.НеРедактироватьКонтрагентовПришедшихССайта тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("В настройках указано, что контрагенты не обновляются. Контрагент: " + ИнформацияОКонтрагенте.Наименование + " не будет обновлен.", ПараметрыОбмена);
			Возврат Контрагент.Ссылка;	
		Иначе
			Контрагент 	= Контрагент.ПолучитьОбъект();
		КонецЕсли;

	Иначе
		Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
		Контрагент.Родитель 		= ПараметрыОбмена.ГруппаДляНовыхКонтрагентов;
		
	КонецЕсли;	
	
	Контрагент.Б_Идентификатор 		= ИнформацияОКонтрагенте.Ид;
	Контрагент.Б_НомерВерсии 		= ИнформацияОКонтрагенте.НомерВерсии;
	
	Контрагент.Наименование			= ИнформацияОКонтрагенте.Наименование;
	
	
	Если ИнформацияОКонтрагенте.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ПараметрыОбмена.ИспользоватьФИОДляФизЛиц тогда
		
		лПолноеНаименование = "";
		
		Если ЗначениеЗаполнено(ИнформацияОКонтрагенте.Фамилия) Тогда
			лПолноеНаименование = ИнформацияОКонтрагенте.Фамилия;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИнформацияОКонтрагенте.Имя) Тогда
			лПолноеНаименование = СокрЛП(лПолноеНаименование + " " + Строка(ИнформацияОКонтрагенте.Имя));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИнформацияОКонтрагенте.Отчество) Тогда
			лПолноеНаименование = СокрЛП(лПолноеНаименование + " " + Строка(ИнформацияОКонтрагенте.Отчество));
		КонецЕсли;
			
		Контрагент.НаименованиеПолное	= лПолноеНаименование;
	Иначе
		Контрагент.НаименованиеПолное	= ИнформацияОКонтрагенте.НаименованиеПолное;
	КонецЕсли;
	
	
	Контрагент.Покупатель 			= Истина;
	
	Контрагент.ЮрФизЛицо			= ИнформацияОКонтрагенте.ЮрФизЛицо;
	Контрагент.ИНН		 			= ИнформацияОКонтрагенте.ИНН;
	//БВ	
	//Контрагент.КПП					= ИнформацияОКонтрагенте.КПП;
	//Контрагент.КодПоОКПО 			= ИнформацияОКонтрагенте.КодПоОКПО;
	Контрагент.КодПоЕДРПОУ 			= ИнформацияОКонтрагенте.КодПоОКПО;
	//
	Контрагент.ПометкаУдаления		= ИнформацияОКонтрагенте.ПометкаУдаления;
	
	Попытка
		Контрагент.Записать();
		Результат = Контрагент.Ссылка;
		ЗаполнитьПодчиненныеДанныеКонтрагента(ПараметрыОбмена, Результат, ДокументXML);	
	Исключение
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);

	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ЗаполнитьПодчиненныеДанныеКонтрагента(ПараметрыОбмена, КонтрагентСсылка, ДокументXML)

	тзнКонтактыхЛиц = ДокументXML.Контрагент.КонтактныеЛица;
	
	Если тзнКонтактыхЛиц <> Неопределено тогда
		
		Для каждого ТекКонтактноеЛицо из тзнКонтактыхЛиц Цикл
			
			КонтактноеЛицо = ПолучениеОбъектаПоКоду(ТекКонтактноеЛицо.Ид, "СправочникСсылка.КонтактныеЛицаКонтрагентов", "Справочник.КонтактныеЛицаКонтрагентов");
			
			Если КонтактноеЛицо = Неопределено тогда
				
				Элемент = Справочники.КонтактныеЛицаКонтрагентов.СоздатьЭлемент();
				Элемент.Б_Идентификатор = ТекКонтактноеЛицо.Ид;
				Элемент.Владелец 		= КонтрагентСсылка;
				Элемент.Наименование 	= ТекКонтактноеЛицо.Наименование;
				Элемент.Записать();
				
				КонтактноеЛицо = Элемент.Ссылка;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
			
	тзнКонтактактов = ДокументXML.Контрагент.Контакты;
	
	Если тзнКонтактактов <> Неопределено тогда
		
		Для каждого ТекКонтакт из тзнКонтактактов Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекКонтакт.ТипВидКонтактнойИнформации) тогда
				Продолжить;	
			КонецЕсли;
			
			НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборКИ.отбор.Объект.Установить(КонтрагентСсылка);
			НаборКИ.отбор.Тип.Установить(ТекКонтакт.ТипВидКонтактнойИнформации.Тип);
			НаборКИ.отбор.Вид.Установить(ТекКонтакт.ТипВидКонтактнойИнформации);
			
			СтрокаКи = НаборКИ.Добавить();                            
			СтрокаКи.Объект = КонтрагентСсылка;
			СтрокаКи.Тип = ТекКонтакт.ТипВидКонтактнойИнформации.Тип;
			СтрокаКи.Вид = ТекКонтакт.ТипВидКонтактнойИнформации;
			
			СтрокаКи.Представление = ТекКонтакт.Представление;
			
			Если ТекКонтакт.ТипВидКонтактнойИнформации 		= Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента 
				ИЛИ ТекКонтакт.ТипВидКонтактнойИнформации 	= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента 
				ИЛИ ТекКонтакт.ТипВидКонтактнойИнформации 	= Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента тогда
				
					Если ТекКонтакт.АдресныеПоля <> Неопределено тогда
						Для Каждого СтрокаУточнения Из ТекКонтакт.АдресныеПоля Цикл
							Если  СтрокаУточнения.Типзначения = "Почтовый индекс" тогда
								СтрокаКи.Поле1	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Регион" тогда
								СтрокаКи.Поле2	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Район" тогда
								СтрокаКи.Поле3	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Населенный пункт" тогда
								СтрокаКи.Поле4	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Город" тогда
								СтрокаКи.Поле5	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Улица" тогда
								СтрокаКи.Поле6	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Дом" тогда
								СтрокаКи.Поле7	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Корпус" тогда
								СтрокаКи.Поле8	= СтрокаУточнения.Значение;	
							ИначеЕсли СтрокаУточнения.Типзначения = "Квартира" тогда
								СтрокаКи.Поле9	= СтрокаУточнения.Значение;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;  
					
				СтрокаКи.Представление = ?(ЗначениеЗаполнено(СтрокаКи.Представление), СтрокаКи.Представление, УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(СтрокаКи));	
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаКи.Представление) тогда	
			
				НаборКИ.Записать();
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКонтрагентаПоКритерию(ПараметрыОбмена, Критерий, ИнформацияОКонтрагенте)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	лЗначениеПоиска = "";
	
	Запрос = Новый Запрос();
	
	Если Критерий = "Email" ИЛИ Критерий = "Телефон" тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Объект КАК Контрагент,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|	И КонтактнаяИнформация.Тип = &ТипКИ";
		
		Если Критерий = "Email" тогда
			
			Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
			Запрос.Текст = Запрос.Текст + "
			|	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(250))) = &Почта";
			
			тзнКонтактактов = ИнформацияОКонтрагенте.Контакты;
			
			Если тзнКонтактактов <> Неопределено тогда
				Для каждого ТекКонтакт из тзнКонтактактов Цикл
					Если ТекКонтакт.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами тогда
						
						лЗначениеПоиска = ТекКонтакт.Представление;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Почта", лЗначениеПоиска);
			
		ИначеЕсли Критерий = "Телефон" тогда
			
			Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			Запрос.Текст = Запрос.Текст + "
			|	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(250))) = &Телефон";
			
			тзнКонтактактов = ИнформацияОКонтрагенте.Контакты;
			
			Если тзнКонтактактов <> Неопределено тогда
				Для каждого ТекКонтакт из тзнКонтактактов Цикл
					Если ТекКонтакт.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента тогда
						
						лЗначениеПоиска 	= ТекКонтакт.Представление;
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Телефон", лЗначениеПоиска);
			
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст =		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка Как Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|";
		
		Если Критерий = "ИНН" тогда
			
			лЗначениеПоиска = ИнформацияОКонтрагенте.ИНН;
			Запрос.УстановитьПараметр("ИНН", ?(ЗначениеЗаполнено(ИнформацияОКонтрагенте.ИНН), ИнформацияОКонтрагенте.ИНН, "Это физ. лицо. Поиск по ИНН пропускаем."));
			//БВ закомментировал
			//Запрос.УстановитьПараметр("КПП", ИнформацияОКонтрагенте.КПП);
			//
			Запрос.Текст = Запрос.Текст + "
			//БВ
			//| Контрагенты.ИНН = &ИНН
			//| И Контрагенты.КПП = &КПП ";
			| Контрагенты.ИНН = &ИНН";
			//
		ИначеЕсли Критерий = "Наименование" тогда
			
			лЗначениеПоиска = ИнформацияОКонтрагенте.Наименование;			
			Запрос.УстановитьПараметр("Наименование", лЗначениеПоиска);
			
			Запрос.Текст = Запрос.Текст + "
			|Контрагенты.Наименование = &Наименование ";
				
		ИначеЕсли Критерий = "Полное наименование" тогда
			
			лЗначениеПоиска = ИнформацияОКонтрагенте.НаименованиеПолное;			
			Запрос.УстановитьПараметр("Наименование", лЗначениеПоиска);
			
			Запрос.Текст = Запрос.Текст + "
			|Контрагенты.Наименование = &Наименование ";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если лЗначениеПоиска = "" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найдено значение по критерию: " + Критерий + ". Будет произведен поиск по другим критериям. Контрагент: " + ИнформацияОКонтрагенте.Наименование, ПараметрыОбмена);		
		Возврат Контрагент;
	
	КонецЕсли;
	
	тзнКонтрагента 	= Запрос.Выполнить().Выгрузить();

	КоличествоНайденных = тзнКонтрагента.Количество();
	
	Если КоличествоНайденных > 1 тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Найдено несколько контрагентов по критерию: " + Критерий + " с значением: " + лЗначениеПоиска, ПараметрыОбмена);		
		Контрагент = Неопределено;
		
	ИначеЕсли КоличествоНайденных = 1 тогда
		Контрагент = тзнКонтрагента[0].Контрагент; 	   
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции




Функция ПолучитьДоговорКонтрагента(ПараметрыОбмена, ЮрФизЛицо, ДокОбъект, ДокументXML)
	
	Если ЮрФизЛицо 	= Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.ДоговорКонтрагентаФизлицо) тогда	
		Возврат ПараметрыОбмена.ДоговорКонтрагентаФизлицо;
	КонецЕсли;

	Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ДокОбъект.Организация) Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось определить основной договор контрагента (не найдена организация).", ПараметрыОбмена);
		Возврат Результат;
	КонецЕсли;
	
	лНаименованиеДоговора = "";
	
	// ищем договр по контрагенту, организации и валюте
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация"	, ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Контрагент"	, ДокОбъект.Контрагент);
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	И ДоговорыКонтрагентов.Владелец = &Контрагент";
	
	Если НЕ ПустаяСтрока(лНаименованиеДоговора) тогда			   
		ТекстЗапроса = ТекстЗапроса + "
		|	И ДоговорыКонтрагентов.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование"	, лНаименованиеДоговора);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;			 
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущийДоговор = Неопределено;
	
	ВалютаВзаиморасчетов = ДокументXML.Валюта;
	
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ТекущийДоговор = Выборка.Ссылка;
		Если Выборка.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов Тогда
			
			Результат = ТекущийДоговор;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда
		
		Результат = СоздатьДоговорПоПараметрам(ПараметрыОбмена, ДокОбъект.Контрагент, ДокОбъект.Организация, ВалютаВзаиморасчетов);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьДоговорПоПараметрам(ПараметрыОбмена, Контрагент, Организация, ВалютаВзаиморасчетов)
	
	НайденныйДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НайденныйДоговорОбъект.Наименование = "Договор WEB - сайт";
	
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
	КонецЕсли;
	
	НайденныйДоговорОбъект.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	НайденныйДоговорОбъект.Организация 			= Организация;
	НайденныйДоговорОбъект.Владелец           	= Контрагент;
	НайденныйДоговорОбъект.ВидУсловийДоговора 	= Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	НайденныйДоговорОбъект.ВидДоговора 			= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НайденныйДоговорОбъект.ВедениеВзаиморасчетов= Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
	
	Попытка
		НайденныйДоговорОбъект.Записать();
	Исключение
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать договор контрагента. " + ОписаниеОшибки(), ПараметрыОбмена);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НайденныйДоговорОбъект.Ссылка;
	
КонецФункции

Функция ПолучитьСклад(ПараметрыОбмена, Документ, ДокументXML)
	
	лСклад 		= Неопределено;
	
	ИнформацияОСкладе = ДокументXML.Склад;
	
	Если ИнформацияОСкладе <> Неопределено тогда
		лСклад = ПолучениеОбъектаПоКоду(ИнформацияОСкладе.Ид, "СправочникСсылка.Склады", "Справочник.Склады");
	КонецЕсли;
	
	Если лСклад <> Неопределено тогда
		Возврат лСклад;
	КонецЕсли;
	
	Если Документ.Метаданные().Имя = "ЗаказПокупателя" тогда
		Если ЗначениеЗаполнено(Документ.СкладГруппа) тогда
			лСклад = Документ.СкладГруппа;
		КонецЕсли;
	ИначеЕсли Документ.Метаданные().Имя = "РеализацияТоваровУслуг" тогда
		Если ЗначениеЗаполнено(Документ.Склад) тогда
			лСклад = Документ.Склад;
		КонецЕсли;
	КонецЕсли;
	
	Если  лСклад = Неопределено тогда
		лСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	Возврат лСклад;
	
КонецФункции

Функция ПолучитьОснование(ДокументXML, лТипРеквизита)
	
	Результат = Документы.ЗаказПокупателя.ПустаяСсылка();
	
	Если Результат.Пустая() тогда	
		ЗапросЗ = Новый Запрос;
		
		ЗапросЗ.Текст = "ВЫБРАТЬ
		|	ИскомыйДокумент.Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ИскомыйДокумент
		|ГДЕ
		|	ИскомыйДокумент.Б_Идентификатор = &Идентификатор";
		ЗапросЗ.УстановитьПараметр("Идентификатор"	, ДокументXML.Основание);
		
		тзнВрем = ЗапросЗ.Выполнить().Выгрузить();
		Если тзнВрем.Количество() > 0 тогда
			Результат = тзнВрем[0].Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаТовара)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура"				, Справочники.Номенклатура.ПустаяСсылка());
	Результат.Вставить("ХарактеристикаНоменклатуры"	, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Результат.Вставить("ЕдиницаИзмерения"			, Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	ИдТовара = СтрокаТовара.Ид;
	
	ПозицияРазделителя = Найти(ИдТовара, "#");
	Если ПозицияРазделителя > 0 Тогда
		ИдНоменклатуры = Лев(ИдТовара, ПозицияРазделителя - 1);
	Иначе
		ИдНоменклатуры = СтрокаТовара.Ид;
	КонецЕсли;
	Если ПозицияРазделителя > 0 Тогда
		ИдХарактеристики = Прав(ИдТовара, СтрДлина(ИдТовара) - ПозицияРазделителя);
	Иначе
		ИдХарактеристики = "";
	КонецЕсли;
	
	ЭтоНоваяНоменклатура = Ложь;
	Номенклатура = ПолучениеОбъектаПоКоду(ИдНоменклатуры, "СправочникСсылка.Номенклатура", "Справочник.Номенклатура");
	
	Если ЗначениеЗаполнено(ИдХарактеристики) тогда
		
		ХарактеристикаНоменклатуры = ПолучениеОбъектаПоКоду(ИдХарактеристики, "СправочникСсылка.ХарактеристикиНоменклатуры", "Справочник.ХарактеристикиНоменклатуры");
	
	КонецЕсли;
	
	//Если Номенклатура = Неопределено И ИдХарактеристики <> ИдТовара тогда
	Если Номенклатура = Неопределено тогда
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.Б_Идентификатор 	= ИдНоменклатуры; 
		НоваяНоменклатура.Родитель			= ПараметрыОбмена.ГруппаДляНовойНоменклатуры;
		
		НоваяНоменклатура.Наименование 		= СтрокаТовара.Наименование; 
		НоваяНоменклатура.СтавкаНДС 		= СтрокаТовара.СтавкаНДСТовара; 
		
		Если ЗначениеЗаполнено(ИдХарактеристики) тогда
			НоваяНоменклатура.ВестиУчетПоХарактеристикам = Истина;
		Конецесли;
		
		//Добавляем вид номенклатуры для товара
		Если СтрокаТовара.ЗначенияРеквизитов <> Неопределено тогда
			
			ВидНоменклатурыНаименование = ПолучитьЗначениеРеквизитаДокумента(СтрокаТовара.ЗначенияРеквизитов, "ВидНоменклатуры");
			ТипНоменклатурыНаименование = ПолучитьЗначениеРеквизитаДокумента(СтрокаТовара.ЗначенияРеквизитов, "ТипНоменклатуры");
			
			Если ЗначениеЗаполнено(ТипНоменклатурыНаименование) тогда						
				Если ТипНоменклатурыНаименование = "Товар" тогда
					ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
				ИначеЕсли ТипНоменклатурыНаименование = "Услуга" тогда
					ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
				ИначеЕсли ТипНоменклатурыНаименование = "Набор" тогда
					ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;
				ИначеЕсли ТипНоменклатурыНаименование = "Комплект" тогда
					ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект;
				КонецЕсли;
			Иначе
				ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
			КонецЕсли;
		Иначе
			ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
			ВидНоменклатурыНаименование = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидНоменклатурыНаименование) тогда
			
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(ВидНоменклатурыНаименование, Истина);
			
			Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) тогда
				
				Выборка = Справочники.ВидыНоменклатуры.Выбрать();	
				Пока Выборка.Следующий() Цикл
					Если Выборка.ТипНоменклатуры = ТипНоменклатуры тогда
						ВидНоменклатуры = Выборка.Ссылка;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Выборка = Справочники.ВидыНоменклатуры.Выбрать();	
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипНоменклатуры = ТипНоменклатуры тогда
					ВидНоменклатуры = Выборка.Ссылка;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		НоваяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;	
		
		ТипТовара = НоваяНоменклатура.ВидНоменклатуры.ТипНоменклатуры;
		
		Если ТипТовара = Перечисления.ТипыНоменклатуры.Услуга тогда
			НоваяНоменклатура.Услуга = Истина;	
		ИначеЕсли ТипТовара = Перечисления.ТипыНоменклатуры.Набор тогда
			НоваяНоменклатура.Набор = Истина;	
		ИначеЕсли ТипТовара = Перечисления.ТипыНоменклатуры.Комплект тогда
			НоваяНоменклатура.Комплект = Истина;	
		КонецЕсли;
		
		//добавляем единицы измерения
		ЕдиницаИзмерения = СтрокаТовара.Единица;
		Если СтрокаТовара.Единица <> Неопределено тогда
			
			БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ЕдиницаИзмерения.Код).Ссылка;
			
			Если НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) тогда
				НоваяБазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
				НоваяБазоваяЕдиницаИзмерения.Код 				= ЕдиницаИзмерения.Код;
				НоваяБазоваяЕдиницаИзмерения.Б_Идентификатор 	= ЕдиницаИзмерения.Ид;
				НоваяБазоваяЕдиницаИзмерения.Наименование 		= ?(ЕдиницаИзмерения.НаименованиеКраткое = "", ЕдиницаИзмерения.НаименованиеПолное, ЕдиницаИзмерения.НаименованиеКраткое) ;
				НоваяБазоваяЕдиницаИзмерения.НаименованиеПолное = ЕдиницаИзмерения.НаименованиеПолное;
				
				Попытка
					НоваяБазоваяЕдиницаИзмерения.Записать();
					БазоваяЕдиницаИзмерения = НоваяБазоваяЕдиницаИзмерения.Ссылка;
				Исключение
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать единицу измерения " + ЕдиницаИзмерения.НаименованиеКраткое + " "+ ОписаниеОшибки(), ПараметрыОбмена);
					БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
				КонецПопытки;			
			КонецЕсли;
			
			НоваяНоменклатура.БазоваяЕдиницаИзмерения = БазоваяЕдиницаИзмерения;
			
			Попытка
				НоваяНоменклатура.Записать();
				Номенклатура = НоваяНоменклатура.Ссылка;
				ЭтоНоваяНоменклатура = Истина;
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать номенклатуру " + СтрокаТовара.Наименование + " "+ ОписаниеОшибки(), ПараметрыОбмена);
			КонецПопытки;
		Иначе
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("У номенклатуры с кодом: " + ИдНоменклатуры + "не найдена единица измерения в заказе. Номенклатура не будет создана.", ПараметрыОбмена);

		КонецЕсли;
		
	КонецЕсли;	
		
	ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(Номенклатура.БазоваяЕдиницаИзмерения) тогда
		
		ВыборкаЕдиниц = Справочники.ЕдиницыИзмерения.Выбрать(,Номенклатура);
		Пока ВыборкаЕдиниц.Следующий() Цикл
			
			Если ВыборкаЕдиниц.ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения тогда 
				ЕдиницаИзмерения = ВыборкаЕдиниц.Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) тогда
			
			ЕдиницаХраненияОстатков = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			
			ЕдиницаХраненияОстатков.Наименование            = Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
			ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения;
			ЕдиницаХраненияОстатков.Коэффициент             = СтрокаТовара.Коэффициент;
			ЕдиницаХраненияОстатков.Владелец                = Номенклатура.Ссылка;
			
			Попытка
				ЕдиницаХраненияОстатков.Записать();
				ЕдиницаИзмерения 	= ЕдиницаХраненияОстатков.Ссылка;
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать единицу измерения для товара " + СтрокаТовара.Наименование + " с коэффициентом 1. "+ ОписаниеОшибки(), ПараметрыОбмена);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоНоваяНоменклатура тогда
		
		ОбновленнаяНоменклатура 						= Номенклатура.ПолучитьОбъект();
		ОбновленнаяНоменклатура.ЕдиницаХраненияОстатков = ЕдиницаИзмерения;
		ОбновленнаяНоменклатура.ЕдиницаДляОтчетов 		= ЕдиницаИзмерения;
		
		Попытка
			ОбновленнаяНоменклатура.Записать();
		Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);
		КонецПопытки;
	КонецЕсли;
	
	Если ХарактеристикаНоменклатуры = Неопределено И ЗначениеЗаполнено(ИдХарактеристики) И ЗначениеЗаполнено(Номенклатура) 
		//БВ
		 И ИдХарактеристики <> ИдНоменклатуры
		//
		тогда
		
		Если Номенклатура.ВестиУчетПоХарактеристикам тогда
		
			НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			НоваяХарактеристика.Владелец = Номенклатура;
			НоваяХарактеристика.Б_Идентификатор = ИдХарактеристики;			
			НоваяХарактеристика.Наименование = СтрокаТовара.Наименование;
			
			Попытка
				НоваяХарактеристика.Записать();
				ХарактеристикаНоменклатуры = НоваяХарактеристика.Ссылка;
			Исключение
				
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось создать характеристику " + СтрокаТовара.Наименование + " "+ ОписаниеОшибки(), ПараметрыОбмена);

			КонецПопытки;
		Иначе
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось создать характеристику " + СтрокаТовара.Наименование + " т.к. у номенклатуры не ведется учет по характеристикам.", ПараметрыОбмена);
		КонецЕсли;
		
	КонецЕсли;
	
    Если ЗначениеЗаполнено(Номенклатура) тогда
        Результат.Вставить("Номенклатура"                , Номенклатура);
        Результат.Вставить("ЕдиницаИзмерения"            , ЕдиницаИзмерения);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) тогда
        Результат.Вставить("ХарактеристикаНоменклатуры"    , ХарактеристикаНоменклатуры);
    КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучениеОбъектаПоКоду(Код, ТипОбъекта, ИмяОбъекта = "", ТаблицаКэша = Неопределено) Экспорт
	
	Результат = Неопределено;

	Если ТаблицаКэша <> Неопределено тогда
		
		НайденнаяСтрока = ТаблицаКэша.Найти(Код, "Ид");
		
		Если НайденнаяСтрока <> Неопределено тогда
			Результат = НайденнаяСтрока.Ссылка;	
		КонецЕсли;
		
	КонецЕсли; 	
	
	Если Результат = Неопределено тогда
		Попытка
			Результат = XMLЗначение(Тип(ТипОбъекта), Код);
		Исключение
			Результат = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Если Результат <> Неопределено тогда
		Результат = ?(СокрЛП(Результат.ВерсияДанных) = "", Неопределено, Результат);
	КонецЕсли;
	
	Если Результат = Неопределено и ИмяОбъекта <> "" тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Справочник.Ссылка
		|ИЗ
		|	" + ИмяОбъекта + " КАК Справочник
		|ГДЕ
		|	Справочник.Б_Идентификатор = &Идентификатор";
		запрос.УстановитьПараметр("Идентификатор",Код);
		тзнВрем = запрос.Выполнить().Выгрузить();
		Если тзнВрем.Количество() > 0 тогда
			Результат = тзнВрем[0].Ссылка; 	   
		КонецЕсли;
	КонецЕсли;
	
	Если Результат <> Неопределено тогда
		Результат = ?(СокрЛП(Результат.ВерсияДанных) = "", Неопределено, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучениеКонтрагентаПоКоду(ПараметрыОбмена, Код, НаименованиеКонтрагента) Экспорт
	
	Попытка
		Результат = XMLЗначение(Тип("СправочникСсылка.Контрагенты"), Код);
	Исключение
		Результат = Справочники.Контрагенты.ПустаяСсылка();
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Результат) тогда
		Результат = ?(СокрЛП(Результат.ВерсияДанных) = "", Справочники.Контрагенты.ПустаяСсылка(), Результат);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Справочник.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Справочник
		|ГДЕ
		|	Справочник.Б_Идентификатор = &Идентификатор
		|	И Справочник.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Идентификатор"	, Код);
		Запрос.УстановитьПараметр("Наименование"	, НаименованиеКонтрагента);
		
		тзнВрем = запрос.Выполнить().Выгрузить();
		
		КоличествоНайденных =  тзнВрем.Количество();
		
		Если КоличествоНайденных > 1 тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Найдено несколько контрагентов по идентификатору: " + Код + ". Будет произведен поиск по другим критериям ", ПараметрыОбмена)		
		ИначеЕсли КоличествоНайденных = 1 тогда
			Результат = тзнВрем[0].Ссылка; 	   
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументПоКоду(ИмяДокумента, Номер1С, Дата1С, Идентификатор, ХозОперация, МенеджерВременныхТаблиц)
	
	ВидДокумента 	= Документы[ИмяДокумента];
	
	Документ 		= ВидДокумента.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Номер1С) и ЗначениеЗаполнено(Дата1С) тогда
		Документ = ВидДокумента.НайтиПоНомеру(Номер1С, Дата1С);	
	КонецЕсли;
	
	Если Документ.Пустая() тогда	

		ТипОбъекта = Тип("ДокументСсылка."+ ИмяДокумента);
		
		Попытка
			Результат = XMLЗначение(ТипОбъекта, Идентификатор);
		Исключение
			Результат = Неопределено;
		КонецПопытки;
		
		Если Результат <> Неопределено тогда
			Документ = ?(СокрЛП(Результат.ВерсияДанных) = "", Документ, Результат);
		КонецЕсли;
	
	КонецЕсли;
	
	Если Документ.Пустая() тогда	
		ЗапросЗ = Новый Запрос;
		ЗапросЗ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросЗ.Текст = "ВЫБРАТЬ * 			
		|ИЗ
		|	ВремДокументы КАК ВремДокументы
		|ГДЕ
		|	ВремДокументы.ТипДокумента = &ТипДокумента
		|	И ВремДокументы.Б_Идентификатор = &Идентификатор";
		ЗапросЗ.УстановитьПараметр("Идентификатор"	, Идентификатор);
		ЗапросЗ.УстановитьПараметр("ТипДокумента"	, ХозОперация);
		
		тзнВрем = ЗапросЗ.Выполнить().Выгрузить();
		Если тзнВрем.Количество() > 0 тогда
			Документ = тзнВрем[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Документ;
	
КонецФункции

Функция ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ПроводитьДокумент, ПроводитьОперативно)
	
	Результат = Истина;
	
	Если ПроводитьДокумент тогда
		Если НЕ Документ.ПометкаУдаления тогда
			
			Попытка
				
				Если ПроводитьОперативно тогда
					Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Документ: " + Строка(Документ) + " оперативно проведен.", ПараметрыОбмена);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Документ: " + Строка(Документ) + " проведен неоперативно.", ПараметрыОбмена);
				КонецЕсли; 
				
			Исключение
				
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Документ: " + Строка(Документ) + " не удалось провести. Будет попытка записать документ", ПараметрыОбмена);
				
				Попытка
					Документ.Записать(РежимЗаписиДокумента.Запись);	
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Документ: " + Строка(Документ) + " записан.", ПараметрыОбмена);
				Исключение
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("НЕ УДАЛОСЬ ЗАПИСАТЬ ДОКУМЕНТ: " + Строка(Документ), ПараметрыОбмена);
					
					Результат = Ложь;

				КонецПопытки;
				
			КонецПопытки;
			
		Иначе
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Помеченный на удаление документ: " + Строка(Документ) + " не может быть проведен. документ будет записан.", ПараметрыОбмена);
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	Иначе
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Запись);	
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Документ: " + Строка(Документ) + " записан.", ПараметрыОбмена);
		Исключение
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("НЕ УДАЛОСЬ ЗАПИСАТЬ ДОКУМЕНТ: " + Строка(Документ), ПараметрыОбмена);
					
			Результат = Ложь;

		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен)
	
	Если Документ.Ссылка.Пустая() Тогда
		Возврат
	КонецЕсли;
	
	Если ДокументXML.ХозОперация = "Заказ товара" тогда
		
		лНазначенияСвойствКатегорийОбъектов = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя;
		
		Если НЕ ДокументXML.ЗначенияРеквизитов = Неопределено тогда
			
			НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.установить(Документ.Ссылка); 
			НовСтр = НаборЗаписей.Добавить();
			НовСтр.Объект 		= Документ.Ссылка;
			НовСтр.Категория 	= Справочники.КатегорииОбъектов.ЗаказСWEBСайта;
			
			Для каждого ТекЗначениеРеквизита из ДокументXML.ЗначенияРеквизитов Цикл
				
				Если ТекЗначениеРеквизита.Наименование = "Заказ оплачен" И ТекЗначениеРеквизита.Значение = "true" тогда
					НовСтр = НаборЗаписей.Добавить();
					НовСтр.Объект 		= Документ.Ссылка;
					НовСтр.Категория 	= Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОплачен;
					
				ИначеЕсли ТекЗначениеРеквизита.Наименование = "Доставка разрешена" И ТекЗначениеРеквизита.Значение = "true" тогда
					НовСтр = НаборЗаписей.Добавить();
					НовСтр.Объект 		= Документ.Ссылка;
					НовСтр.Категория 	= Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеДоставкаРазрешена;
				ИначеЕсли ТекЗначениеРеквизита.Наименование = "Отменен" И ТекЗначениеРеквизита.Значение = "true" тогда
					НовСтр = НаборЗаписей.Добавить();
					НовСтр.Объект 		= Документ.Ссылка;
					НовСтр.Категория 	= Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтменен;
				ИначеЕсли ТекЗначениеРеквизита.Наименование = "Финальный статус" И ТекЗначениеРеквизита.Значение = "true" тогда
					НовСтр = НаборЗаписей.Добавить();
					НовСтр.Объект 		= Документ.Ссылка;
					НовСтр.Категория 	= Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеЗавершен;
				КонецЕсли;	
			КонецЦикла;
				
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	Иначе
		
		лНазначенияСвойствКатегорийОбъектов = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы;
		
	КонецЕсли;
	
		МенеджерВременныхТаблицСвойств 	= Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
		Запрос.УстановитьПараметр("НазначенияСвойствКатегорийОбъектов", лНазначенияСвойствКатегорийОбъектов);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвойстваОбъектов.Ссылка,
		|	СвойстваОбъектов.ТипЗначения,
		|	СвойстваОбъектов.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВремДопРеквизиты
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
		|ГДЕ
		|	НЕ СвойстваОбъектов.ПометкаУдаления
		|	И СвойстваОбъектов.НазначениеСвойства = &НазначенияСвойствКатегорийОбъектов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование";
		Запрос.Выполнить();
		
		Для каждого ТекЗначениеРеквизита из ДокументXML.ЗначенияРеквизитов Цикл
			
			СвойствоСтрокой = ТекЗначениеРеквизита.Наименование;
			Значение = ТекЗначениеРеквизита.Значение;
			
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
			Запрос.Текст ="ВЫБРАТЬ *
			|ИЗ
			|	ВремДопРеквизиты КАК ВремДопРеквизиты
			|ГДЕ
			|	ВремДопРеквизиты.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование", СвойствоСтрокой);
			
			Свойство = НеОпределено;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипЗначения = Новый ОписаниеТипов("Строка") Тогда
					Свойство = Выборка.Ссылка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Свойство = НеОпределено Тогда
				
				СвойствоОбъект 	= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
				СвойствоОбъект.Наименование 		= СвойствоСтрокой;
				СвойствоОбъект.ТипЗначения 			= Новый ОписаниеТипов("Строка");
				СвойствоОбъект.Б_Идентификатор 		= "СвойствоЗаказа";
				СвойствоОбъект.НазначениеСвойства 	= лНазначенияСвойствКатегорийОбъектов;
				СвойствоОбъект.Записать();
				Свойство = СвойствоОбъект.Ссылка;
				
			КонецЕсли;
			
			НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			НоваяЗапись.Объект 		= Документ.Ссылка;
			НоваяЗапись.Значение 	= Значение;
			НоваяЗапись.Свойство 	= Свойство;
			НоваяЗапись.Записать();
			
		КонецЦикла;
		
		МенеджерВременныхТаблицСвойств.Закрыть();
	
	
	Если (ОсновныеНастройкиДокумента.Документ = "ЗаказПокупателя" ИЛИ ОсновныеНастройкиДокумента.Документ = "РеализацияТоваровУслуг") И ДокументXML.Товары <> Неопределено тогда
		
		НовыйНабор = РегистрыСведений.Б_СвойстваТоваровДокументов.СоздатьНаборЗаписей();
		НовыйНабор.Отбор.Документ.Установить(Документ.Ссылка); 
		
		Для каждого ТекТовар из ДокументXML.Товары Цикл
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, ТекТовар);
			
			Для каждого Свойство из ТекТовар.ЗначенияРеквизитов Цикл
			
			    Если Свойство.Наименование <> "ВидНоменклатуры" И Свойство.Наименование <> "ТипНоменклатуры" тогда
			
					НоваяЗапись = НовыйНабор.Добавить();
					
					НоваяЗапись.Документ 					= Документ.Ссылка;	
					НоваяЗапись.Номенклатура 				= СтрИнформацииОНоменклатуре.Номенклатура;	
					НоваяЗапись.ХарактеристикаНоменклатуры 	= СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры;	
					НоваяЗапись.КлючСтроки 					= ТекТовар.КлючСтроки;	
					НоваяЗапись.Значение 					= Свойство.Значение;	
					
					Если Лев(Свойство.Наименование, 16) = "СвойствоКорзины#" тогда
						НоваяЗапись.НаименованиеСвойства	= Прав(Свойство.Наименование, СтрДлина(Свойство.Наименование)- 16);
					Иначе
						НоваяЗапись.НаименованиеСвойства 	= Свойство.Наименование;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;  
		КонецЦикла;  
		
		НовыйНабор.Записать();
		
	КонецЕсли;
	
	Если Не НовыйДокумент и ДокументОтменен Тогда
		
		Документ.Б_НомерВерсии = ДокументXML.НомерВерсии;	
		
		Если ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Помечать на удаление" тогда
			ДействияСОтмененнымиДокументами	= 0;
		ИначеЕсли ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Отменять проведение" тогда
			ДействияСОтмененнымиДокументами	= 1;
		ИначеЕсли ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Закрывать" тогда
			ДействияСОтмененнымиДокументами	= 2;
		Иначе
			ДействияСОтмененнымиДокументами	= 3;
		КонецЕсли;
		
		Если ДействияСОтмененнымиДокументами = 3 Тогда // Ничего
			
		ИначеЕсли ДействияСОтмененнымиДокументами = 0 Тогда // Удалять
			Если НЕ Документ.ПометкаУдаления Тогда
				Документ.ПометкаУдаления = Истина;
				Попытка
					Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Помечен на удаление документ: " + Строка(Документ), ПараметрыОбмена);
				Исключение
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка при установке пометки на удаление документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ДействияСОтмененнымиДокументами = 2 Тогда // Отменяем
			Информация = "";
			
			Если ОсновныеНастройкиДокумента.Документ = "ЗаказПокупателя" тогда

				
				Если ЗакрытьЗаказы(ПараметрыОбмена, Документ, Информация) Тогда
					Если НЕ ПустаяСтрока(Информация) Тогда
						Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Сформирован и проведен документ " + Информация, ПараметрыОбмена);
					КонецЕсли;	
				Иначе	
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(Информация + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли ДействияСОтмененнымиДокументами = 1 Тогда // отменять
			Если Документ.Проведен Тогда
				Попытка
					Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отменено проведение у документа: " + Строка(Документ), ПараметрыОбмена);
				Исключение
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Ошибка при отмене проведения документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Б_СерверПовтИсп.ПолучитьМассивУзлов(), Документ.Ссылка);
	
	Если Документ.Проведен Тогда
		
		ТипОбъекта = ТипЗнч(Документ.Ссылка);
		
		Если ТипОбъекта = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда
			Если ЗначениеЗаполнено(Документ.ДокументОснование) тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Б_СерверПовтИсп.ПолучитьМассивУзлов(), Документ.ДокументОснование);
			КонецЕсли;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Если ЗначениеЗаполнено(Документ.Сделка) тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Б_СерверПовтИсп.ПолучитьМассивУзлов(), Документ.Сделка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБанковскийСчетКонтрагента(ПараметрыОбмена, ДокОбъект, БанковскиеСчета)
	
	Результат = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если БанковскиеСчета <> Неопределено тогда
		
		Для каждого ТекБанковскийСчет из БанковскиеСчета Цикл
			
			НомерСчета = СтрЗаменить(ТекБанковскийСчет.НомерСчета, " ", "");
			Если ПустаяСтрока(НомерСчета) Тогда
				Продолжить;
			КонецЕсли;
			
			Банк 		= СоздатьНайтиБанк(ПараметрыОбмена, ТекБанковскийСчет.Банк);    
			//БВ
			//БанкКорр 	= СоздатьНайтиБанк(ПараметрыОбмена, ТекБанковскийСчет.БанкДляРасчетов);    
			//
			Запрос 		= Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	БанковскиеСчета.Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.Владелец = &Владелец
			|	И БанковскиеСчета.НомерСчета = &НомерСчета
			//БВ
			//|	И БанковскиеСчета.Банк = &Банк
			//|	И БанковскиеСчета.БанкДляРасчетов = &БанкКорр");
			|	И БанковскиеСчета.Банк = &Банк");
			//

			Запрос.УстановитьПараметр("Владелец", ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
			Запрос.УстановитьПараметр("Банк", Банк);
			//БВ закомментировал
			//Запрос.УстановитьПараметр("БанкКорр", БанкКорр);
			//
			
			тзнСчетов = запрос.Выполнить().Выгрузить();
			Если тзнСчетов.Количество() > 0 тогда
				Возврат тзнСчетов[0].Ссылка;	
			КонецЕсли;
			
			СчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
			СчетОбъект.Банк 			= Банк;
			//БВ закомментировал
			//СчетОбъект.БанкДляРасчетов 	= БанкКорр;
			//
			СчетОбъект.ВидСчета 		= "Расчетный";
			СчетОбъект.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить();
			СчетОбъект.Владелец 		= ДокОбъект.Контрагент;
			СчетОбъект.Наименование 	= Банк.Наименование + " (" + СчетОбъект.ВидСчета + ")";
			СчетОбъект.НомерСчета 		= НомерСчета;
			
			Попытка
				СчетОбъект.Записать();
				Результат = СчетОбъект.Ссылка;
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);
				Продолжить;
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(ДокОбъект.Контрагент.ОсновнойБанковскийСчет) Тогда
				СчетСсылка 			= СчетОбъект.Ссылка;
				КонтрагентОбъект 	= ДокОбъект.Контрагент.ПолучитьОбъект();
				КонтрагентОбъект.ОсновнойБанковскийСчет = СчетСсылка;
				Попытка
					КонтрагентОбъект.Записать();
				Исключение
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);
					Продолжить;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНайтиБанк(ПараметрыОбмена, Банк)
	
	Результат = Справочники.Банки.ПустаяСсылка();
	Если Банк <> Неопределено тогда
		БИК = СтрЗаменить(Банк.БИК, " ", "");
		Если ПустаяСтрока(БИК) Тогда
			Возврат Результат;
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Банки.Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.Код = &БИК");
		Запрос.УстановитьПараметр("БИК", БИК);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			БанкОбъект = Справочники.Банки.СоздатьЭлемент();
			БанкОбъект.Код = БИК;
			БанкОбъект.КоррСчет = СтрЗаменить(Банк.СчетКорреспондентский, " ", "");
			БанкОбъект.Наименование = СокрЛП(Банк.Наименование);
			БанкОбъект.Адрес = СокрЛП(Банк.Адрес);
			Попытка
				БанкОбъект.Записать();
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);
				Возврат Результат;
			КонецПопытки;
			Результат = БанкОбъект.Ссылка;
		Иначе
			Результат = РезультатЗапроса.Выгрузить()[0][0];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьИнформациюОЧеке(Документ, ДокументXML)
	
	ИнформацияОЧеках = ДокументXML.ИнформацияОЧеках;
	
	Если ИнформацияОЧеках <> Неопределено тогда
		
		Если ИнформацияОЧеках.Количество() > 0 тогда
			
			НужныйЧек 	= ИнформацияОЧеках[0].Чек;
			лНомерЧека 	= НужныйЧек.Ид; 
			
			Оплачено = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оплачено");		
			Оплачено = ?((Оплачено = Неопределено ИЛИ Оплачено = "false"), Ложь, Истина);
				
			Если Константы.Б_ИспользоватьМеханизмПечатиЧеков.Получить() И Документ.Проведен И Оплачено тогда
				
				НайденнаяСтрока = НужныйЧек.ЗначенияСвойств.Найти(Б_СерверПовтИсп.ПолучитьПредопределенныйИдОбъекта("ИдСвойствПечатьЧека"),"Ид"); 
				
				Если НайденнаяСтрока <> Неопределено тогда
					
					НуженЧек = НайденнаяСтрока.Значение;
					НуженЧек = ?((НуженЧек = "true"), Истина, Ложь);
					
					Если НуженЧек тогда
						ДобавлениеОплатыВОчередьПечати(Документ, лНомерЧека);	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавлениеОплатыВОчередьПечати(Документ, ИдЧека)
	
	Выборка = РегистрыСведений.Б_ОчередьПечати.Выбрать(Новый Структура("Документ",Документ));
	
	Если НЕ Выборка.Следующий() тогда
		
		НоваяЗапись = РегистрыСведений.Б_ОчередьПечати.СоздатьМенеджерЗаписи();
		НоваяЗапись.Документ 		= Документ;
		НоваяЗапись.ИдЧекаНаСайте 	= ИдЧека;
		НоваяЗапись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура РаспределитьСуммуПоКолонке(ДокументОбъект, Товары, ИмяТабЧасти, СуммаРаспределения)	
	
	МассивДанныхКолонки = Товары.ВыгрузитьКолонку("Сумма");
	
	МассивРаспределения = ОбщегоНазначения.РаспределитьПропорционально(СуммаРаспределения, МассивДанныхКолонки);
	
	Если МассивРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	Индекс = 0;
	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма + МассивРаспределения[Индекс];
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, мТекущийПользователь ,,истина, ,истина, ИмяТабЧасти);
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗакрытьЗаказы(ПараметрыОбмена, ЗаказПокупателя, Информация)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка,
	|	ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка.Проведен
	|	И ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя = &ЗаказПокупателя");
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.ссылка);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		МассивЗакрытыхЗаказов = Новый Массив;
	Иначе
		МассивЗакрытыхЗаказов = Результат.Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
	КонецЕсли;
	
	Док = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	Док.ВидОперации		= Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	Док.Дата 			= ТекущаяДата();
	Док.Комментарий 	= "Создан автоматически при обмене с сайтом";
	Док.Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Док.Подразделение 	= ЗаказПокупателя.Подразделение;

	
	Если НЕ МассивЗакрытыхЗаказов.Найти(ЗаказПокупателя.Ссылка) = НеОпределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	НовСтрока = Док.Заказы.Добавить();
	
	НовСтрока.ЗаказПокупателя = ЗаказПокупателя.Ссылка;
	
	НовСтрока.ПричинаЗакрытияЗаказа = ПараметрыОбмена.ПричинаОтменыЗаказа;
	
	Если Док.Заказы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Информация = Строка(Док);
	Исключение
		Информация = "Не удалось провести документ " + Док + " по причине: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
