Перем мНачМесяца;
Перем мКонМесяца;
Перем мНачКвартала;
Перем мКонКвартала;
Перем мНачГода;
Перем мНачГраница;
Перем мКонГраница;

Перем мКонКварталаВключая;

Перем мУчетнаяПолитикаУУ;
Перем мУчетнаяПолитикаБУ;
Перем мУчетнаяПолитикаНУ;
Перем мПараметрыНалоговогоУчета;

Перем мОперация;
Перем мПроводкиБУ;

Перем мПоказателиНормальнойМощности;

Перем ПорядокПодразделенийСообщался;
Перем ПорядокПеределовСообщался;

Перем ТаблицаНеЗакрытыхПодразделений;
Перем ТаблицаНеЗакрытыхПодразделенийУпр;

Перем ПорядокПеределов;

Перем мКоэффициентМатериальнойСоставляющей;
Перем мКоэффициентМатериальнойСоставляющейРассчитан;

Перем мВалютаРегламентированногоУчета;

Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	
	// СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей = Новый Структура();

	// Вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выполняет запись в регистры информации параметров расчетов по рег.операциям
// по данным которых будут построены справки - расчеты
Процедура ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента, ТаблицаДвижений, ВспомогательныйРегистр, СтрокаГруппировки,СтрокаСуммирования)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	КонецЕсли; 
	
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Дата, "ПериодРасчета");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.Свернуть(СтрокаГруппировки,СтрокаСуммирования);
	ВспомогательныйРасчет = ВспомогательныйРегистр.СоздатьНаборЗаписей();
	ВспомогательныйРасчет.Отбор.Регистратор.Установить(Ссылка);
	ВспомогательныйРасчет.Прочитать();
	ВспомогательныйРасчет.Загрузить(ТаблицаДвижений);
	ВспомогательныйРасчет.Записать();
	
КонецПроцедуры

Процедура РассчитатьРазницуДляСуммыУпр(ТаблицаОстатков, СтруктураШапкиДокумента)

	СтрокиДляУдаления = Новый Массив;

	Для каждого СтрокаТаблицы из ТаблицаОстатков Цикл

		Если Не СтрокаТаблицы.КурсВалютыДенежныхСредств=NULL Тогда 
		
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВзаиморасчетовОстаток, СтрокаТаблицы.Валюта,
													СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
													СтрокаТаблицы.КурсВалютыДенежныхСредств, 
													СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
													СтрокаТаблицы.КратностьВалютыДенежныхСредств, 
													СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета) - 
													СтрокаТаблицы.СуммаУпрОстаток;
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаУпр = 0 Тогда
			СтрокиДляУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Элемент Из СтрокиДляУдаления Цикл
		ТаблицаОстатков.Удалить(Элемент);
	КонецЦикла;

КонецПроцедуры // РассчитатьРазницуДляСуммыУпр(ТаблицаОстатков)

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО НАЧИСЛЕНИЮ АМОРТИЗАЦИИ ОС, НМА 

// Выполняет начисление амортизации основных средств
//
Процедура НачислениеАмортизацииОСУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.АмортизацияОСУУ Тогда

		СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Истина;
		
		ТабАмортизации  = УправлениеВнеоборотнымиАктивами.РасчетАмортизацииУпр(Дата, , , Отказ);
		
		Если Не Отказ Тогда
			
			УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект,
			                                                   Отказ,
															   Заголовок,
															   ТабАмортизации,
															   СтруктураШапкиДокумента);
		КонецЕсли;

		Если НЕ Отказ Тогда

			НаборДвижений   = Движения.СтоимостьОС;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			Для Каждого СтрокаТЧ из ТабАмортизации Цикл

				Если СтрокаТЧ.Амортизация > 0 Тогда

					СтрокаДвижений = ТаблицаДвижений.Добавить();
					СтрокаДвижений.ОсновноеСредство = СтрокаТЧ.ОбъектУчета;
					СтрокаДвижений.Амортизация      = СтрокаТЧ.Амортизация;

				КонецЕсли;

			КонецЦикла;

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			Движения.СтоимостьОС.ВыполнитьПриход();

		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Выполняет начисление амортизации НМА
//
Процедура НачислениеАмортизацииНМАУпр(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если СтруктураШапкиДокумента.АмортизацияНМАУУ Тогда
		
		СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Истина;
		
		ТабАмортизации  = УправлениеВнеоборотнымиАктивами.РасчетАмортизацииНМАУпр(Дата,,, Отказ);

		Если Не Отказ Тогда
			
			УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект,
			                                                   Отказ,
															   Заголовок,
															   ТабАмортизации,
															   СтруктураШапкиДокумента);
			
		КонецЕсли;

		Если НЕ Отказ Тогда

			НаборДвижений   = Движения.СтоимостьНМА;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			Для Каждого СтрокаТЧ из ТабАмортизации Цикл

				Если СтрокаТЧ.Амортизация > 0 Тогда

					СтрокаДвижений = ТаблицаДвижений.Добавить();
					СтрокаДвижений.НематериальныйАктив 	= СтрокаТЧ.ОбъектУчета;
					СтрокаДвижений.Амортизация 			= СтрокаТЧ.Амортизация;

				КонецЕсли;

			КонецЦикла;

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			Движения.СтоимостьНМА.ВыполнитьПриход();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет начисление амортизации основных средств
//
Процедура НачислениеАмортизацииОСРегл(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если СтруктураШапкиДокумента.АмортизацияОСБУ Тогда
		
		СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Ложь;
		
		ТабАмортизации  = УправлениеВнеоборотнымиАктивами.РасчетАмортизацииРегл(Дата, СтруктураШапкиДокумента.Организация, , , Отказ);
		
		Если Не Отказ Тогда
			
			ТабАмортизации.Колонки.Амортизация.Имя = "Сумма";
			ТабАмортизации.Колонки.АмортизацияНУ.Имя = "СуммаНУ";
				
			УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект,
			                                                   Отказ,
															   Заголовок,
															   ТабАмортизации,
															   СтруктураШапкиДокумента,
															   "ОС",
														       "Начисление амортизации ОС");
			
		КонецЕсли;

		Если Не Отказ Тогда
			
			Если СтруктураШапкиДокумента.Свойство("ВключатьСуммуДооценокОСВСоставНП") И СтруктураШапкиДокумента.ВключатьСуммуДооценокОСВСоставНП Тогда
				
				НаборДвижений   = Движения.ПереоценкаОСБухгалтерскийУчет;
				ТаблицаДвижений = НаборДвижений.Выгрузить();
				ТаблицаДвижений.Очистить();

				Для Каждого СтрокаТЧ Из ТабАмортизации Цикл

					СуммаПереоценкиПропорциональнаяАмортизации = СтрокаТЧ.СуммаПереоценкиПропорциональнаяАмортизации; 
					
					Если СуммаПереоценкиПропорциональнаяАмортизации > 0 Тогда

						// ПереоценкаОСБухгалтерскийУчет
						СтрокаДвижений = ТаблицаДвижений.Добавить();

						СтрокаДвижений.ОсновноеСредство = СтрокаТЧ.ОбъектУчета;
						СтрокаДвижений.Организация      = СтруктураШапкиДокумента.Организация;
						СтрокаДвижений.СуммаПереоценки 	= СуммаПереоценкиПропорциональнаяАмортизации;

						// Хозрасчетный Дт 423 Кт 441
						ПроводкаБУ = мПроводкиБУ.Добавить();
						ПроводкаБУ.Период       = Дата;
						ПроводкаБУ.Организация  = СтруктураШапкиДокумента.Организация;
						
						//ПроводкаБУ.СчетДт       = ПланыСчетов.Хозрасчетный.ДооценкаОсновныхСредств;
						ПроводкаБУ.СчетДт       = СтрокаТЧ.СчетУчетаДооценокОС;
						ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, "ОсновныеСредства", СтрокаТЧ.ОбъектУчета);

						ПроводкаБУ.СчетКт       = ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыль;
						
						ПроводкаБУ.Сумма        = СуммаПереоценкиПропорциональнаяАмортизации;
						ПроводкаБУ.Содержание   = НСтр("ru='Начисление амортизации ОС';uk='Нарахування амортизації ОЗ'",Локализация.КодЯзыкаИнформационнойБазы());
						ПроводкаБУ.НомерЖурнала = НСтр("ru='ОС';uk='ОЗ'",Локализация.КодЯзыкаИнформационнойБазы());
						
					КонецЕсли;

				КонецЦикла;

				НаборДвижений.мПериод          = Дата;
				НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

				НаборДвижений.ВыполнитьРасход();
				
			КонецЕсли;	
			
			мПроводкиБУ.Записать(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Выполняет начисление амортизации НМА
//
Процедура НачислениеАмортизацииНМАРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
 	
	Если СтруктураШапкиДокумента.АмортизацияНМАБУ Тогда
		
		СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Ложь;
		
		ТабАмортизации  = УправлениеВнеоборотнымиАктивами.РасчетАмортизацииНМАРегл(Дата, СтруктураШапкиДокумента.Организация,,, Отказ);

		Если Не Отказ Тогда
			
			ТабАмортизации.Колонки.Амортизация.Имя 		= "Сумма";
			ТабАмортизации.Колонки.АмортизацияНУ.Имя 	= "СуммаНУ";
			УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект,
			                                                   Отказ,
															   Заголовок,
															   ТабАмортизации,
															   СтруктураШапкиДокумента,
															   "НА",
														       "Начисление амортизации НМА");
			
		КонецЕсли;

		Если Не Отказ Тогда
			
			мПроводкиБУ.Записать(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО ПЕРЕОЦЕНКЕ ВАЛЮТНЫХ СРЕДСТВ

// Выполняет переоценку валютных счетов
//
Процедура ПереоценкаВалютныхСредствУпр(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если СтруктураШапкиДокумента.ВзаиморасчетыСПодотчетнымиЛицамиУУ Тогда
		
		ТаблицаПоПодотчетникам     = Новый ТаблицаЗначений;
		
		ЗапросПоДенежнымСредствам = Новый Запрос;
		ЗапросПоДенежнымСредствам.УстановитьПараметр("ДатаДокумента", МоментВремени());
		ЗапросПоДенежнымСредствам.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.Организация,
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.ФизЛицо,
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент,
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК КурсВалютыДенежныхСредств,
		|	КурсыВалютСрезПоследних.Кратность КАК КратностьВалютыДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&ДатаДокумента, ) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
		|		ПО КурсыВалютСрезПоследних.Валюта = ВзаиморасчетыСПодотчетнымиЛицамиОстатки.Валюта
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки";
		
		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ВзаиморасчетыСПодотчетнымиЛицами");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, Дата)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		ТаблицаПоПодотчетникам = ЗапросПоДенежнымСредствам.Выполнить().Выгрузить();

		ТаблицаПоПодотчетникам.Колонки.Добавить("СуммаУпр");

		РассчитатьРазницуДляСуммыУпр(ТаблицаПоПодотчетникам, СтруктураШапкиДокумента);
		
		НаборДвижений   = Движения.ВзаиморасчетыСПодотчетнымиЛицами;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПодотчетникам, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.ВыполнитьПриход();
		КонецЕсли;
		
		
	КонецЕсли;

	Если СтруктураШапкиДокумента.ВзаиморасчетыСКонтрагентамиУУ Тогда

		ТаблицаПоВзаиморасчетам    = Новый ТаблицаЗначений;
		ТаблицаПоРасчетам          = Новый ТаблицаЗначений;
			
		// ВЗАИМОРАСЧЕТЫ С КОНТРАГЕНТАМИ
		ЗапросПоДенежнымСредствам = Новый Запрос;
		ЗапросПоДенежнымСредствам.УстановитьПараметр("ДатаДокумента", МоментВремени());
		ЗапросПоДенежнымСредствам.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетысКонтрагентамиОстатки.Организация,
		|	ВзаиморасчетысКонтрагентамиОстатки.Контрагент,
		|	ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетысКонтрагентамиОстатки.Сделка,
		|	ВзаиморасчетысКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
		|	ВзаиморасчетысКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК КурсВалютыДенежныхСредств,
		|	КурсыВалютСрезПоследних.Кратность КАК КратностьВалютыДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаДокумента, ) КАК ВзаиморасчетысКонтрагентамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
		|		ПО КурсыВалютСрезПоследних.Валюта = ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки";

		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ВзаиморасчетыСКонтрагентами");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, Дата)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		ТаблицаПоВзаиморасчетам = ЗапросПоДенежнымСредствам.Выполнить().Выгрузить();

		ТаблицаПоВзаиморасчетам.Колонки.Добавить("СуммаУпр");

		РассчитатьРазницуДляСуммыУпр(ТаблицаПоВзаиморасчетам, СтруктураШапкиДокумента);
		
		// РАСЧЕТЫ С КОНТРАГЕНТАМИ
		ЗапросПоДенежнымСредствам = Новый Запрос;
		ЗапросПоДенежнымСредствам.УстановитьПараметр("ДатаДокумента", МоментВремени());
		ЗапросПоДенежнымСредствам.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетысКонтрагентамиОстатки.Организация,
		|	ВзаиморасчетысКонтрагентамиОстатки.Контрагент,
		|	ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетысКонтрагентамиОстатки.Сделка,
		|	ВзаиморасчетысКонтрагентамиОстатки.РасчетыВозврат,
		|	ВзаиморасчетысКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
		|	ВзаиморасчетысКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК КурсВалютыДенежныхСредств,
		|	КурсыВалютСрезПоследних.Кратность КАК КратностьВалютыДенежныхСредств
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(&ДатаДокумента, ) КАК ВзаиморасчетысКонтрагентамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
		|		ПО КурсыВалютСрезПоследних.Валюта = ВзаиморасчетысКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.РасчетыСКонтрагентами.Остатки";
		
		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "РасчетыСКонтрагентами");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, Дата)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		ТаблицаПоРасчетам = ЗапросПоДенежнымСредствам.Выполнить().Выгрузить();

		ТаблицаПоРасчетам.Колонки.Добавить("СуммаУпр");

		РассчитатьРазницуДляСуммыУпр(ТаблицаПоРасчетам, СтруктураШапкиДокумента);
		
		НаборДвижений = Движения.ВзаиморасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВзаиморасчетам, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
		КонецЕсли;

		НаборДвижений = Движения.РасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоРасчетам, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.РасчетыСКонтрагентами.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;

	Если СтруктураШапкиДокумента.ДенежныеСредстваВКассахУУ ИЛИ СтруктураШапкиДокумента.ДенежныеСредстваНаБанковскихСчетахУУ Тогда
		
		ТаблицаПоДенежнымСредствам 				= Новый ТаблицаЗначений;
		ТаблицаПоДенежнымСредствамКПолучению	= Новый ТаблицаЗначений;
		

		ЗапросПоДенежнымСредствам = Новый Запрос;
		ЗапросПоДенежнымСредствам.УстановитьПараметр("ДатаДокумента", МоментВремени());
		ЗапросПоДенежнымСредствам.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваОстатки.Организация,
		|	ДенежныеСредстваОстатки.БанковскийСчетКасса,
		|	ДенежныеСредстваОстатки.ВидДенежныхСредств,
		|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ДенежныеСредстваОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ДенежныеСредстваОстатки.БанковскийСчетКасса.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
		|	КурсыВалютСрезПоследних.Курс КАК КурсВалютыДенежныхСредств,
		|	КурсыВалютСрезПоследних.Кратность КАК КратностьВалютыДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаДокумента, ) КАК ДенежныеСредстваОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
		|		ПО КурсыВалютСрезПоследних.Валюта = ДенежныеСредстваОстатки.БанковскийСчетКасса.ВалютаДенежныхСредств
		|ГДЕ";

		Если СтруктураШапкиДокумента.ДенежныеСредстваНаБанковскихСчетахУУ Тогда

			ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
			|	ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета";
			
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ДенежныеСредстваВКассахУУ Тогда

			Если СтруктураШапкиДокумента.ДенежныеСредстваНаБанковскихСчетахУУ Тогда
				ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
				|	ИЛИ";
			КонецЕсли;
			
			ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
			|	ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.Кассы";

		КонецЕсли;
		
		ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ДенежныеСредства.Остатки";

		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ДенежныеСредства");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, Дата)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		ТаблицаПоДенежнымСредствам = ЗапросПоДенежнымСредствам.Выполнить().Выгрузить();

		ТаблицаПоДенежнымСредствам.Колонки.Добавить("СуммаУпр");

		СтрокиДляУдаления = Новый Массив;

		Для каждого СтрокаТаблицы из ТаблицаПоДенежнымСредствам Цикл

			Если Не СтрокаТаблицы.КурсВалютыДенежныхСредств=NULL Тогда 
			
				СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаОстаток, СтрокаТаблицы.ВалютаДенежныхСредств,
														СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
														СтрокаТаблицы.КурсВалютыДенежныхСредств, 
														СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
														СтрокаТаблицы.КратностьВалютыДенежныхСредств, 
														СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета) - 
														СтрокаТаблицы.СуммаУпрОстаток;
			КонецЕсли;
			
			Если СтрокаТаблицы.СуммаУпр = 0 Тогда
				СтрокиДляУдаления.Добавить(СтрокаТаблицы);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Элемент Из СтрокиДляУдаления Цикл
			ТаблицаПоДенежнымСредствам.Удалить(Элемент);
		КонецЦикла;
		
		ЗапросПоДенежнымСредствам = Новый Запрос;
		ЗапросПоДенежнымСредствам.УстановитьПараметр("ДатаДокумента", МоментВремени());
		ЗапросПоДенежнымСредствам.Текст = "
		|ВЫБРАТЬ 
		|	ДенежныеСредстваКПолучениюОстатки.Организация,
		|	ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса,
		|	ДенежныеСредстваКПолучениюОстатки.ВидДенежныхСредств,
		|	ДенежныеСредстваКПолучениюОстатки.ДокументПолучения,
		|	ДенежныеСредстваКПолучениюОстатки.СуммаОстаток    КАК СуммаОстаток,
		|	ДенежныеСредстваКПолучениюОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
		|	КурсыВалютСрезПоследних.Курс            КАК КурсВалютыДенежныхСредств, 
		|	КурсыВалютСрезПоследних.Кратность       КАК КратностьВалютыДенежныхСредств 
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКПолучению.Остатки(&ДатаДокумента,) КАК ДенежныеСредстваКПолучениюОстатки
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента,) КАК КурсыВалютСрезПоследних
		|ПО
		|	КурсыВалютСрезПоследних.Валюта = ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса.ВалютаДенежныхСредств
		|ГДЕ";

		Если СтруктураШапкиДокумента.ДенежныеСредстваНаБанковскихСчетахУУ Тогда

			ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
			| ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета";
			
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ДенежныеСредстваВКассахУУ Тогда

			Если СтруктураШапкиДокумента.ДенежныеСредстваНаБанковскихСчетахУУ Тогда
				ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
				|	ИЛИ";
			КонецЕсли;
			
			ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
			|	ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса ССЫЛКА Справочник.Кассы";

		КонецЕсли;
		
		ЗапросПоДенежнымСредствам.Текст = ЗапросПоДенежнымСредствам.Текст + "
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ДенежныеСредстваКПолучению.Остатки";

		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ДенежныеСредстваКПолучению");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, Дата)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		ТаблицаПоДенежнымСредствамКПолучению = ЗапросПоДенежнымСредствам.Выполнить().Выгрузить();

		ТаблицаПоДенежнымСредствамКПолучению.Колонки.Добавить("СуммаУпр");

		СтрокиДляУдаления = Новый Массив;

		Для каждого СтрокаТаблицы из ТаблицаПоДенежнымСредствамКПолучению Цикл

			Если Не СтрокаТаблицы.КурсВалютыДенежныхСредств=NULL Тогда 
			
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаОстаток, СтрокаТаблицы.ВалютаДенежныхСредств,
														СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
														СтрокаТаблицы.КурсВалютыДенежныхСредств, 
														СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
														СтрокаТаблицы.КратностьВалютыДенежныхСредств, 
														СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета) - 
														СтрокаТаблицы.СуммаУпрОстаток;
			КонецЕсли;
			
			Если СтрокаТаблицы.СуммаУпр = 0 Тогда
				СтрокиДляУдаления.Добавить(СтрокаТаблицы);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Элемент Из СтрокиДляУдаления Цикл
			ТаблицаПоДенежнымСредствамКПолучению.Удалить(Элемент);
		КонецЦикла;
		
		НаборДвижений = Движения.ДенежныеСредства;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДенежнымСредствам, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ДенежныеСредства.ВыполнитьПриход();
		КонецЕсли;

		НаборДвижений = Движения.ДенежныеСредстваКПолучению;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДенежнымСредствамКПолучению, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ДенежныеСредстваКПолучению.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет переоценку валютных счетов
//
Процедура ПереоценкаВалютныхСредствРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ПереоценкаВалютныхСредствБУ Тогда
		
		УчетнаяПолитика	= РегистрыСведений.УчетнаяПолитикаБухгалтерскийУчет.ПолучитьПоследнее(СтруктураШапкиДокумента.Дата, Новый Структура("Организация",СтруктураШапкиДокумента.Организация));
		СтруктураШапкиДокумента.Вставить("СчетаУчетаКР", БухгалтерскийУчет.ПараметрыУчетаКурсовыхРазниц(УчетнаяПолитика.ИспользуемыеКлассыСчетовРасходов));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК СчетПереоценки
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|
		|ГДЕ
		|	Хозрасчетный.Валютный = ИСТИНА";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка   = РезультатЗапроса.Выбрать();
		
		ЗаписьРасчетаПереоценкиВалюты = Движения.РасчетПереоценкиВалютныхСредств.Выгрузить();
		ЗаписьРасчетаПереоценкиВалюты.Очистить();

		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			
			// Блокировка регистра бухгалтерии.
			
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы, ИсточникДанных", 
															"РегистрБухгалтерии", "Хозрасчетный", РезультатЗапроса);
															
			СтруктураЗначенийБлокировки = Новый Структура("Период, Организация", 
														  Новый Диапазон(, КонецМесяца(СтруктураШапкиДокумента.Дата)), СтруктураШапкиДокумента.Организация);
														  
			СтруктураИсточникаДанных = Новый Структура("Счет", "СчетПереоценки");
			
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных);
			
		КонецЕсли;	
		
		Пока Выборка.Следующий() Цикл

			БухгалтерскийУчет.ПереоценкаСчетаРегл(СтруктураШапкиДокумента, мПроводкиБУ, Новый Структура("Счет",Выборка.СчетПереоценки), , Ложь, Истина, , ,ЗаписьРасчетаПереоценкиВалюты);

		КонецЦикла;
		
		мПроводкиБУ.Записать(Ложь);
		ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента,
		ЗаписьРасчетаПереоценкиВалюты, 
		РегистрыСведений.РасчетПереоценкиВалютныхСредств,
		"Организация,ПериодРасчета,Активность,Регистратор,Счет,Валюта,Субконто1,Субконто2,Субконто3,КурсПереоценки,СуммаВВалюте,СуммаВГривнах",
		"Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО КОРРЕКТИРОВКЕ СТОИМОСТИ НОМЕНКЛАТУРЫ

Процедура КорректировкаСтоимостиНоменклатурыРегл(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок)
		
	Если СтруктураШапкиДокумента.КорректировкаСтоимостиНоменклатурыБУ Тогда
		СтруктураДопПараметров.Вставить("Учет", "Бух");
		СтруктураДопПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		СтруктураДопПараметров.Вставить("Период", Дата);
		СтруктураДопПараметров.Вставить("Регистратор", Ссылка);
		СтруктураДопПараметров.Вставить("ТаблицаТоваров", Неопределено);
		Массив = Новый Массив;
		СтруктураДопПараметров.Вставить("СписокНеКорректируемыхСчетов", Массив);
		
		КорректировкаСтоимости.КорректировкаСтоимости(Неопределено, мНачМесяца, мКонМесяца, СтруктураДопПараметров);
		
		мПроводкиБУ.Записать(Ложь);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура КорректировкаСтоимостиНоменклатурыУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
		
	Если СтруктураШапкиДокумента.КорректировкаСтоимостиСписанияТоваровУУ Тогда
		
		// Распределение за месяц
		
		МетаданныеРегистров = Метаданные.РегистрыНакопления;
		
		Если НЕ ПравоДоступа("Изменение", МетаданныеРегистров.ПартииТоваровНаСкладах) Тогда
			// отсутствуют права на всю таблицу регистра
			ОбщегоНазначения.СообщитьОбОшибке("Нарушение прав доступа", Отказ,"ПартииТоваровНаСкладах");
			Возврат;
		КонецЕсли;
		
		Если НЕ ПравоДоступа("Изменение", МетаданныеРегистров.ПартииТоваровПереданные) Тогда
			// отсутствуют права на всю таблицу регистра
			ОбщегоНазначения.СообщитьОбОшибке("Нарушение прав доступа", Отказ, "ПартииТоваровПереданные");
			Возврат;
		КонецЕсли;
		
		УправлениеЗапасамиПартионныйУчет.ВыполнитьРаспределениеДопРасходов(мНачМесяца, мКонМесяца, , Ссылка, Дата);
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", мНачМесяца);
		Запрос.УстановитьПараметр("ДатаКон", мКонМесяца);
		
			
		НазваниеРегистраНаСкладах  = "ПартииТоваровНаСкладах";
		НазваниеРегистраПереданные = "ПартииТоваровПереданные";
		текНоменклатура 		   = Неопределено;
		текДокументОприходования   = Неопределено;
	
		НомерПорции = 0;
		
		Пока Истина Цикл
			НомерПорции = НомерПорции + 1;
			
			Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
			Запрос.УстановитьПараметр("Номенклатура", текНоменклатура);
			Запрос.УстановитьПараметр("ДокументОприходования", текДокументОприходования);
			
			Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
					|	Подзапрос.Номенклатура КАК Номенклатура,
					|	Подзапрос.ДокументОприходования КАК ДокументОприходования
					|ИЗ
					|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
					|		ПодзапросНаСкладах.Номенклатура КАК Номенклатура,
					|		ПодзапросНаСкладах.ДокументОприходования КАК ДокументОприходования
					|	ИЗ
					|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
					|			НаСкладах.Номенклатура КАК Номенклатура,
					|			НаСкладах.ДокументОприходования КАК ДокументОприходования
					|		ИЗ
					|			РегистрНакопления.ПартииТоваровНаСкладах КАК НаСкладах
					|		ГДЕ
					|			НаСкладах.Период МЕЖДУ &ДатаНач И &ДатаКон
					|			И (НаСкладах.Номенклатура > &Номенклатура
					|					ИЛИ НаСкладах.Номенклатура = &Номенклатура
					|						И НаСкладах.ДокументОприходования > &ДокументОприходования)
					|			И ((НаСкладах.ВидДвижения = &ВидДвижения)
					|				ИЛИ (НаСкладах.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийПартииТоваров.Комплектация)))
					|		
					|		УПОРЯДОЧИТЬ ПО
					|			Номенклатура,
					|			ДокументОприходования) КАК ПодзапросНаСкладах
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
					|		ПодзапросПереданные.Номенклатура,
					|		ПодзапросПереданные.ДокументОприходования
					|	ИЗ
					|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
					|			Переданные.Номенклатура КАК Номенклатура,
					|			Переданные.ДокументОприходования КАК ДокументОприходования
					|		ИЗ
					|			РегистрНакопления.ПартииТоваровПереданные КАК Переданные
					|		ГДЕ
					|			Переданные.Период МЕЖДУ &ДатаНач И &ДатаКон
					|			И (Переданные.Номенклатура > &Номенклатура
					|					ИЛИ Переданные.Номенклатура = &Номенклатура
					|						И Переданные.ДокументОприходования > &ДокументОприходования)
					|			И Переданные.ВидДвижения = &ВидДвижения
					|		
					|		УПОРЯДОЧИТЬ ПО
					|			Номенклатура,
					|			ДокументОприходования) КАК ПодзапросПереданные) КАК Подзапрос
					|
					|УПОРЯДОЧИТЬ ПО
					|	Номенклатура,
					|	ДокументОприходования";
			
			Если НазваниеРегистраНаСкладах <> "ПартииТоваровНаСкладах" тогда
				
				Текст = СтрЗаменить(Текст, "ПартииТоваровНаСкладах",НазваниеРегистраНаСкладах);
				Текст = СтрЗаменить(Текст, "ПартииТоваровПереданные",НазваниеРегистраПереданные);
				
			КонецЕсли;

			Запрос.Текст = Текст;
			Таблица = Запрос.Выполнить().Выгрузить();
			
			КоличествоСтрок = Таблица.Количество();
			// Если строки кончились, прерываем цикл
			Если КоличествоСтрок = 0 Тогда
				Прервать;
			КонецЕсли;
			
			текНоменклатура = Таблица[КоличествоСтрок-1].Номенклатура;
			текДокументОприходования = Таблица[КоличествоСтрок-1].ДокументОприходования;
			
			// Корректировка списания по-средней
			КорректировкаСтоимости.КорректировкаСписания(мНачМесяца, мКонМесяца, Таблица, Ссылка,
				Справочники.Организации.ПустаяСсылка(),
				Истина,
				Ложь,
				Ложь,
				Неопределено,,НомерПорции);
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО СПИСАНИЮ РАСХОДОВ БУДУЩИХ ПЕРИОДОВ

Функция РазностьДатВДнях(Дата1, Дата2)

	мДлинаСуток = 86400; // в секундах

	Возврат Окр((НачалоДня(Дата2) - НачалоДня(Дата1)) / мДлинаСуток);

КонецФункции

Функция СуммаСписанияЗаМесяц(Знач ДатаНачалаСписания, Знач ДатаОкончанияСписания, Остаток, МетодРаспределения)

	Если Остаток = 0 Тогда
		Возврат 0;
	КонецЕсли;

	ДатаНачалаСписания    = НачалоДня(ДатаНачалаСписания);
	ДатаОкончанияСписания = КонецДня(ДатаОкончанияСписания);

	Если НЕ ЗначениеЗаполнено(ДатаНачалаСписания) Тогда
		Возврат 0;

	ИначеЕсли ДатаНачалаСписания > мКонМесяца Тогда
		Возврат 0;

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаОкончанияСписания) Тогда
		Возврат 0;

	ИначеЕсли ДатаОкончанияСписания < мНачМесяца Тогда
		Возврат 0;

	ИначеЕсли ДатаОкончанияСписания < ДатаНачалаСписания Тогда
		Возврат 0;

	КонецЕсли;
	
	Если МетодРаспределения = Перечисления.МетодыРаспределенияРБП.ПоМесяцам Тогда
		
		// равными частями на протяжении всего срока распределения
		КоличествоМесяцев =  (Месяц(ДатаОкончанияСписания) + 12*Год(ДатаОкончанияСписания))
							-(Месяц(ДатаНачалаСписания)    + 12*Год(ДатаНачалаСписания))  
							+ 1;
							
		Возврат  Окр(Остаток / КоличествоМесяцев,2);							
		
	Иначе
	
		// остаток суммы списываем пропорционально оставшимся дням (то есть пропорционально)
		
		НачСписанияВМесяце = МАКС(НачалоМесяца(Дата), ДатаНачалаСписания);
		КонСписанияВМесяце = МИН (КонецМесяца(Дата),  ДатаОкончанияСписания);
		
		КоличествоДнейОстаткаСписания = РазностьДатВДнях(НачСписанияВМесяце, ДатаОкончанияСписания)+ 1;
		КоличествоДнейСписанияВМесяце = РазностьДатВДнях(НачСписанияВМесяце, КонСписанияВМесяце)+ 1;

		Если КоличествоДнейСписанияВМесяце = КоличествоДнейОстаткаСписания Тогда
			
			Возврат Остаток;
			
		ИначеЕсли КоличествоДнейОстаткаСписания > 0 Тогда
			
			Возврат Окр(Остаток / КоличествоДнейОстаткаСписания * КоличествоДнейСписанияВМесяце,2);
			
		Иначе 
			
			Возврат 0;
			
		КонецЕсли;  
		
	КонецЕсли;
		
КонецФункции // СуммаСписанияЗаМесяц()

Процедура СписаниеРБП(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.СписаниеРБПБУ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецМесяца", мКонМесяца);
	Запрос.УстановитьПараметр("СчетБУ",      ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяСтатьяРБП", 	Справочники.РасходыБудущихПериодов.ПустаяСсылка());
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОстатки.Субконто1.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ХозрасчетныйОстатки.Субконто1.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ХозрасчетныйОстатки.Субконто1.СчетБУ КАК СчетБУ,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ1 КАК СубконтоБУ1,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ2 КАК СубконтоБУ2,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ3 КАК СубконтоБУ3,
	|	ХозрасчетныйОстатки.Субконто1.МетодРаспределения КАК МетодРаспределения,	
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.СуммаОстатокДт ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
	|		КОНЕЦ) КАК СуммаОстатокДтБУ,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.СуммаНУОстатокДт ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаНУОстатокДт
	|		КОНЕЦ) КАК СуммаОстатокДтНУ,
	|	ХозрасчетныйОстатки.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ХозрасчетныйОстатки.Субконто1.НалоговоеНазначение КАК РБПНалоговоеНазначение,
	|	ХозрасчетныйОстатки.Субконто1.НалоговоеНазначениеДоходовИЗатрат КАК РБПНалоговоеНазначениеДоходовИЗатрат
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецМесяца, Счет = &СчетБУ, , Организация = &Организация) КАК ХозрасчетныйОстатки
	//|ГДЕ
	//|	ХозрасчетныйОстатки.Субконто1 <> &ПустаяСтатьяРБП
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.НалоговоеНазначение,
	|	ХозрасчетныйОстатки.Субконто1.ДатаНачалаСписания,
	|	ХозрасчетныйОстатки.Субконто1.ДатаОкончанияСписания,
	|	ХозрасчетныйОстатки.Субконто1.СчетБУ,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ1,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ2,
	|	ХозрасчетныйОстатки.Субконто1.СубконтоБУ3
	|ИТОГИ ПО
	|	Субконто1,
	|	НалоговоеНазначение";
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрБухгалтерии", "Хозрасчетный");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      	Новый Диапазон(, мКонМесяца)); 
		ЗначенияБлокировки.Вставить("Организация",	СтруктураШапкиДокумента.Организация);
		ЗначенияБлокировки.Вставить("Счет", 		ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ЗаписьРасчетаРБП = Движения.РасчетСписанияРБП.ВыгрузитьКолонки();

	Таблица = Новый ТаблицаЗначений;
	Таблица = Результат.Выгрузить();
	СуммаСписанияБУ = 0;
	
	ВыборкаНН = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НалоговоеНазначение");
    Пока ВыборкаНН.Следующий() Цикл
		
		ВыборкаРБП = ВыборкаНН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Субконто1");
		
		Пока ВыборкаРБП.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаРБП.Субконто1) Тогда
				
				Сообщить(Локализация.СтрШаблон1(Нстр("ru = 'Имеются остатки по счету учета расходов будущих периодов (налоговое назначение ""¤1¤"") по пустой аналитике! Такие расходы не могут быть распределены!'; uk = 'Існуюють залишки на рахунку обліку витрат майбутніх періодів (податкове призначення ""¤1¤"") з незаповненою аналітикою! Такі витрати не можуть бути розподілені!'")
											   , ВыборкаРБП.НалоговоеНазначение)
						 , СтатусСообщения.Важное);
				Продолжить;           
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаРБП.ДатаНачалаСписания) ИЛИ
				   НЕ ЗначениеЗаполнено(ВыборкаРБП.ДатаОкончанияСписания) Тогда
				
				Сообщить(Локализация.СтрШаблон1(Нстр("ru = 'При распределении РБП ""¤1¤"" (налоговое назначение ""¤2¤"") обнаружена проблема:  не заполнена Дата начала или Дата окончания распределения. Такие расходы не будут распределены!'; uk = 'При розподіленні РМП ""¤1¤"" (податкове призначення ""¤2¤"") виявлена проблема: не заповнена Дата початку або Дата закінчення розподілу. Ці витрати не будуть розподілені!'")
											   ,ВыборкаРБП.Субконто1, ВыборкаРБП.НалоговоеНазначение)
						 ,СтатусСообщения.Важное);
				
				Продолжить;           
			КонецЕсли;
			
			// имеются несколько методов распределения
			Если КонецМесяца(мКонМесяца) = КонецМесяца(ВыборкаРБП.ДатаОкончанияСписания) Тогда
				
				// в последнем месяце распределения РБП суммы списания должны быть равны сумме остатка (для исправления ошибок округления)
				СуммаСписанияБУ = ВыборкаРБП.СуммаОстатокДтБУ;	
				СуммаСписанияНУ = ВыборкаРБП.СуммаОстатокДтНУ;	
				
			Иначе	
				
				МетодРаспределения = ВыборкаРБП.МетодРаспределения;
				
				Если НЕ ЗначениеЗаполнено(МетодРаспределения) Тогда
					МетодРаспределения = Перечисления.МетодыРаспределенияРБП.ПоДням;
				КонецЕсли;
				
				Если МетодРаспределения = Перечисления.МетодыРаспределенияРБП.ПоДням Тогда
					
					// распределяем остаток пропорционально календарным дням
					СуммаДляРаспределенияБУ = ВыборкаРБП.СуммаОстатокДтБУ;	
					СуммаДляРаспределенияНУ = ВыборкаРБП.СуммаОстатокДтНУ;	
					
				Иначе	
					
					// используется помесячное распределение 
					// получим сумму РБП, которая была на счете на начало распределения. Именно ее будем пропорционально распределять по месяцам
					Отбор = Новый Структура();
					Отбор.Вставить("Организация", 		  Организация);
					Отбор.Вставить("Счет",      		  ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов);
					Отбор.Вставить("Субконто1", 		  ВыборкаРБП.Субконто1);
					Отбор.Вставить("НалоговоеНазначение", ВыборкаРБП.НалоговоеНазначение);
					
					ОстаткиРБПНаНачало = РегистрыБухгалтерии.Хозрасчетный.Остатки(ВыборкаРБП.ДатаНачалаСписания,
																				 ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов,
																				 Отбор,
																				 "Субконто1");
															 
					СуммаДляРаспределенияБУ = ОстаткиРБПНаНачало.Итог("СуммаОстатокДт");	
					СуммаДляРаспределенияНУ = ОстаткиРБПНаНачало.Итог("СуммаНУОстатокДт");		
					
					Если  СуммаДляРаспределенияБУ <=0 
						И СуммаДляРаспределенияНУ <=0 Тогда
						Сообщить(Локализация.СтрШаблон1(Нстр("ru='При распределении РБП ""¤1¤"" (налоговое назначение ""¤2¤"") обнаружена проблема."
"     Датой начала распределния является дата: ¤3¤, однако, на начало указанной даты отсутствует остаток на счете учета РБП!"
"     Проверьте дату начала распределения в справочнике!';uk='При розподіленні РМП ""¤1¤"" (податкове призначення ""¤2¤"") виявлена проблема. "
"     Датою початку розподілу зазначена дата:  ¤3¤, проте, на початок зазначеної дати відсутній залишок на рахунку обліку ВМП."
"     Перевірте дату початку розподілу у довіднику!'"),ВыборкаРБП.Субконто1, ВыборкаРБП.НалоговоеНазначение, Формат(ВыборкаРБП.ДатаНачалаСписания, "ДФ=dd.MM.yyyy")),СтатусСообщения.Важное);
					КонецЕсли;
					
				КонецЕсли;
				
				СуммаСписанияБУ = СуммаСписанияЗаМесяц(ВыборкаРБП.ДатаНачалаСписания, ВыборкаРБП.ДатаОкончанияСписания, СуммаДляРаспределенияБУ, МетодРаспределения);
				СуммаСписанияНУ = СуммаСписанияЗаМесяц(ВыборкаРБП.ДатаНачалаСписания, ВыборкаРБП.ДатаОкончанияСписания, СуммаДляРаспределенияНУ, МетодРаспределения);			
				
			КонецЕсли;
		
			РБП    = ВыборкаРБП.Субконто1;
			СчетБУ = ВыборкаРБП.СчетБУ;
			
			НалоговоеНазначение 				 = ВыборкаРБП.НалоговоеНазначение;
			РБПНалоговоеНазначение 				 = ВыборкаРБП.РБПНалоговоеНазначение;
			РБПНалоговоеНазначениеДоходовИЗатрат = ВыборкаРБП.РБПНалоговоеНазначениеДоходовИЗатрат;
		
			ОстатокБУ = ВыборкаРБП.СуммаОстатокДтБУ;
			ОстатокНУ = ВыборкаРБП.СуммаОстатокДтНУ;

			//Сформировать проводку БУ
			Если ((ОстатокБУ <= 0) ИЛИ (СуммаСписанияБУ <= 0))
				И 
				 ((ОстатокНУ <= 0) ИЛИ (СуммаСписанияНУ <= 0)) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(РБП) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СуммаСписанияБУ < 0 Тогда
				СуммаСписанияБУ = 0;
			КонецЕсли;
			
			Если СуммаСписанияНУ < 0 Тогда
				СуммаСписанияНУ = 0;
			КонецЕсли;
			
			Если СписаниеРБПБУ И НЕ ЗначениеЗаполнено(СчетБУ) Тогда

				ТекстСообщения = Локализация.СтрШаблон1(НСтр("ru='В справочнике ""Расходы будущих периодов"" для статьи ""¤1¤"" не заполнен реквизит ""Счет"" !';uk='У довіднику ""Витрати майбутніх періодів"" для статті ""¤1¤"" не заповнений реквізит ""Рахунок"" !'"), РБП);
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				Продолжить;
			КонецЕсли;

			ПроводкаБУ = мПроводкиБУ.Добавить();
			ПроводкаБУ.Период       = Дата;
			ПроводкаБУ.Организация  = СтруктураШапкиДокумента.Организация;
			
			ПроводкаБУ.СчетДт       = ВыборкаРБП.СчетБУ;
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, ВыборкаРБП.СубконтоБУ1);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 2, ВыборкаРБП.СубконтоБУ2);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 3, ВыборкаРБП.СубконтоБУ3);

			ПроводкаБУ.СчетКт       = ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов;
			ПроводкаБУ.СубконтоКт.РасходыБудущихПериодов = РБП;
			ПроводкаБУ.Сумма        = СуммаСписанияБУ;
			ПроводкаБУ.Содержание   = НСтр("ru='РБП за ';uk='ВМП за '",Локализация.КодЯзыкаИнформационнойБазы()) + ПредставлениеПериода(мНачМесяца, мКонМесяца, "ФП=Истина");
			ПроводкаБУ.НомерЖурнала = НСтр("ru='ФР';uk='ФР'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетБУ,,Дата) = "Затраты" Тогда
				ПроводкаБУ.НалоговоеНазначениеДт = РБПНалоговоеНазначениеДоходовИЗатрат;
			Иначе
				ПроводкаБУ.НалоговоеНазначениеДт = РБПНалоговоеНазначение;
			КонецЕсли;				
			
			ПроводкаБУ.НалоговоеНазначениеКт = ВыборкаРБП.НалоговоеНазначение;
			
			ПроводкаБУ.СуммаНУДт = СуммаСписанияНУ;
			ПроводкаБУ.СуммаНУКт = СуммаСписанияНУ;
			
			СтрокаЗаписьРасчетаРБП = ЗаписьРасчетаРБП.Добавить();
			СтрокаЗаписьРасчетаРБП.ДатаНачала = РБП.ДатаНачалаСписания;
			СтрокаЗаписьРасчетаРБП.ДатаОкончания = РБП.ДатаОкончанияСписания;
			СтрокаЗаписьРасчетаРБП.НачОстаток = ОстатокБУ;
			СтрокаЗаписьРасчетаРБП.НачОстатокНУ = ОстатокНУ;
			СтрокаЗаписьРасчетаРБП.СчетУчета 	= ПроводкаБУ.СчетКт;
			СтрокаЗаписьРасчетаРБП.СчетСписания = ПроводкаБУ.СчетДт;
			СтрокаЗаписьРасчетаРБП.Сумма   = СуммаСписанияБУ;
			СтрокаЗаписьРасчетаРБП.СуммаНУ = СуммаСписанияБУ;
			СтрокаЗаписьРасчетаРБП.Статья = РБП;
			СтрокаЗаписьРасчетаРБП.КонОстаток   = ОстатокБУ - СуммаСписанияБУ;
			СтрокаЗаписьРасчетаРБП.КонОстатокНУ = ОстатокНУ - СуммаСписанияНУ;
			
		КонецЦикла;	

	КонецЦикла;
	мПроводкиБУ.Записать(Ложь);
	
	ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента,
	ЗаписьРасчетаРБП,
	РегистрыСведений.РасчетСписанияРБП,
	"Организация,ПериодРасчета,Активность,Регистратор,Статья,СчетУчета,СчетСписания,ДатаНачала,ДатаОкончания",
	"Сумма,СуммаНУ,НачОстаток,КонОстаток,НачОстатокНУ,КонОстатокНУ");

КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО ПРОИЗВОДСТВЕННОЙ ЧАСТИ

Функция СчетУчетаПоХарактеруЗатрат()

	Счет = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы; 
	Возврат Счет;

КонецФункции // СчетУчетаПоХарактеруЗатрат()

// Формируется запрос по косвенным затратам в котором собрана
// информация о косвенных затратах их способе их распределения.
//
Процедура СформироватьЗапросПоКосвеннымЗатратам(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",             мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",             мКонМесяца);
	Запрос.УстановитьПараметр("КонГраница",          мКонГраница);	
	Запрос.УстановитьПараметр("СчетЗатрат",          СчетУчетаПоХарактеруЗатрат());
	Запрос.УстановитьПараметр("Организация",         СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат",  Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ТаблицаСпособовРаспределения.БазаРаспределения ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.БазаРаспределения
	|		КОГДА ТаблицаСпособовРаспределения.РаспределениеПоПодразделению ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.РаспределениеПоПодразделению
    |		КОГДА ТаблицаСпособовРаспределения.РаспределениеПоСтатьеЗатрат ЕСТЬ НЕ NULL 
    |			ТОГДА ТаблицаСпособовРаспределения.РаспределениеПоСтатьеЗатрат
	|		КОГДА ТаблицаСпособовРаспределения.РаспределениеПоСчету ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.РаспределениеПоСчету
	|		ИНАЧЕ ТаблицаСпособовРаспределения.РаспределениеПоОрганизации
	|	КОНЕЦ КАК Метод,
	|	ТаблицаСпособовРаспределения.СчетЗатрат,
	|	ТаблицаСпособовРаспределения.Подразделение,
	|	ТаблицаСпособовРаспределения.СтатьяЗатрат,
	|	ТаблицаСпособовРаспределения.НалоговоеНазначение,
	|	ВЫБОР
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатрат ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатрат
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоПодразделению ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоПодразделению
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСтатьеЗатрат ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСтатьеЗатрат
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСчету ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСчету
	|		ИНАЧЕ ТаблицаСпособовРаспределения.СписокСтатейЗатратПоОрганизации
	|	КОНЕЦ КАК СписокСтатейЗатрат,
	|	ЕСТЬNULL(КонОстаткиОПЗ.СуммаОстаток, 0) КАК КонечныйОстатокОПЗПоПодразделению,
	|	ЕСТЬNULL(КонОстаткиОПЗ.СуммаНУОстаток, 0) КАК КонечныйОстатокОПЗПоПодразделениюНУ,
	|   ТаблицаСпособовРаспределения.ПостояннаяЗатрата КАК ПостояннаяЗатрата, 
	|   ЕСТЬNULL(ТаблицаСпособовРаспределения.СуммаПостоянныхЗатрат, 0) КАК СуммаПостоянныхЗатрат,
	|   ЕСТЬNULL(ТаблицаСпособовРаспределения.СуммаПостоянныхЗатратНУ, 0) КАК СуммаПостоянныхЗатратНУ,
	|	ЕСТЬNULL(ТаблицаСпособовРаспределения.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаСпособовРаспределения.СуммаНУ, 0) КАК СуммаНУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОбороты.Счет КАК СчетЗатрат,
	|		ХозрасчетныйОбороты.Субконто1 КАК Подразделение,
	|		ХозрасчетныйОбороты.Субконто2 КАК СтатьяЗатрат,
	|		ХозрасчетныйОбороты.НалоговоеНазначение КАК НалоговоеНазначение,
	|		СпособыРаспределения.СпособРаспределения КАК БазаРаспределения,
	|		СпособыРаспределенияПоПодразделению.СпособРаспределения КАК РаспределениеПоПодразделению,
    |		СпособыРаспределенияПоСтатьеЗатрат.СпособРаспределения КАК РаспределениеПоСтатьеЗатрат,
	|		СпособыРаспределенияПоСчету.СпособРаспределения КАК РаспределениеПоСчету,
	|		СпособыРаспределенияПоОрганизации.СпособРаспределения КАК РаспределениеПоОрганизации,
	|		СпособыРаспределения.СписокСтатейЗатрат КАК СписокСтатейЗатрат,
	|		СпособыРаспределенияПоОрганизации.СписокСтатейЗатрат КАК СписокСтатейЗатратПоОрганизации,
	|		СпособыРаспределенияПоПодразделению.СписокСтатейЗатрат КАК СписокСтатейЗатратПоПодразделению,
	|		СпособыРаспределенияПоСтатьеЗатрат.СписокСтатейЗатрат КАК СписокСтатейЗатратПоСтатьеЗатрат,
	|		СпособыРаспределенияПоСчету.СписокСтатейЗатрат КАК СписокСтатейЗатратПоСчету,
	| 		ЕСТЬNULL(ХозрасчетныйОбороты.Субконто2.ПостояннаяЗатрата, ЛОЖЬ) КАК ПостояннаяЗатрата,
	|       ВЫБОР 
	|			КОГДА ЕСТЬNULL(ХозрасчетныйОбороты.Субконто2.ПостояннаяЗатрата, ЛОЖЬ) 
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборот 
	|			ИНАЧЕ 0 
	|		КОНЕЦ КАК СуммаПостоянныхЗатрат,
	|       ВЫБОР 
	|			КОГДА ЕСТЬNULL(ХозрасчетныйОбороты.Субконто2.ПостояннаяЗатрата, ЛОЖЬ) 
	|				ТОГДА ХозрасчетныйОбороты.СуммаНУОборот 
	|			ИНАЧЕ 0 
	|		КОНЕЦ КАК СуммаПостоянныхЗатратНУ,
	|		ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	|		ХозрасчетныйОбороты.СуммаНУОборот КАК СуммаНУ
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Месяц, Счет В ИЕРАРХИИ (&СчетЗатрат), &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(&КонДата, Организация = &Организация) КАК СпособыРаспределения
	|			ПО ХозрасчетныйОбороты.Счет = СпособыРаспределения.СчетЗатрат
	|				И ХозрасчетныйОбороты.Субконто1 = СпособыРаспределения.Подразделение
	|				И ХозрасчетныйОбороты.Субконто2 = СпособыРаспределения.СтатьяЗатрат
    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(
    |			&КонДата,
    |			Организация = &Организация
    |			    И Подразделение = &ПустоеПодразделение) КАК СпособыРаспределенияПоСтатьеЗатрат
    |			ПО ХозрасчетныйОбороты.Счет = СпособыРаспределенияПоСтатьеЗатрат.СчетЗатрат
    |				И ХозрасчетныйОбороты.Субконто2 = СпособыРаспределенияПоСтатьеЗатрат.СтатьяЗатрат
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(
	|			&КонДата,
	|			Организация = &Организация
	|			    И СтатьяЗатрат = &ПустаяСтатьяЗатрат) КАК СпособыРаспределенияПоПодразделению
	|			ПО ХозрасчетныйОбороты.Счет = СпособыРаспределенияПоПодразделению.СчетЗатрат
	|				И ХозрасчетныйОбороты.Субконто1 = СпособыРаспределенияПоПодразделению.Подразделение
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(
	|			&КонДата,
	|			Организация = &Организация
	|			    И СтатьяЗатрат = &ПустаяСтатьяЗатрат
	|			    И Подразделение = &ПустоеПодразделение) КАК СпособыРаспределенияПоСчету
	|			ПО ХозрасчетныйОбороты.Счет = СпособыРаспределенияПоСчету.СчетЗатрат
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(
	|			&КонДата,
	|			Организация = &Организация
	|			    И СчетЗатрат = &ПустойСчет
	|			    И СтатьяЗатрат = &ПустаяСтатьяЗатрат
	|			    И Подразделение = &ПустоеПодразделение) КАК СпособыРаспределенияПоОрганизации
	|			ПО ХозрасчетныйОбороты.Организация = СпособыРаспределенияПоОрганизации.Организация) КАК ТаблицаСпособовРаспределения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
    |		РегистрБухгалтерии.Хозрасчетный.Остатки(&КонГраница, Счет В ИЕРАРХИИ (&СчетЗатрат), , Организация = &Организация) КАК КонОстаткиОПЗ
    |	ПО 
    |		ТаблицаСпособовРаспределения.Подразделение = КонОстаткиОПЗ.Субконто1  // по подразделению
	|
	|ИТОГИ 
	|	СУММА(СуммаПостоянныхЗатрат),
	|	СУММА(СуммаПостоянныхЗатратНУ)
	|ПО
	|	Подразделение,
	|	Метод,
	|	СписокСтатейЗатрат";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетЗатратБУ", "СчетЗатрат");
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоКосвеннымЗатратам()

// Функция распределения общепроизводственных затрат.
//
//	Параметры:
//
Функция РаспределитьОПР(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров)
	
	РаспределятьВБУ = НЕ СтруктураШапкиДокумента.НеРаспределятьОПЗнаСебестоимостьПродукции;
	РаспределятьВНУ = СтруктураШапкиДокумента.Дата >= глЗначениеПеременной("ДатаНачалаРаспределенияОПЗвНУ");
	
	Если НЕ РаспределятьВБУ И НЕ РаспределятьВНУ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РаспределениеВыполнено = Ложь;
	ЗаписьРасчетаКосвенныхРасходов = СтруктураДопПараметров.ЗаписьРасчетаКосвенныхРасходов;
	
	// Формирование запроса по косвенным расходам
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоКосвеннымЗатратам(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров);
	
	СтруктПоиска = Новый Структура;
	
	ОбходПоПодразделениям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	
	Пока ОбходПоПодразделениям.Следующий() Цикл
		
		СтруктПоиска.Очистить();
		СтруктПоиска.Вставить("Подразделение", ОбходПоПодразделениям.Подразделение);
		
		НаборСтрокНормальнойМощности = мПоказателиНормальнойМощности.НайтиСтроки(СтруктПоиска);
		Если НаборСтрокНормальнойМощности.Количество() <> 0 Тогда
			СтрокаНормальнойМощности = НаборСтрокНормальнойМощности[0];
			// Распределяем только постоянные затраты
			РаспределятьПоНормальнойМощности = ОбходПоПодразделениям.СуммаПостоянныхЗатрат <> 0 ИЛИ ОбходПоПодразделениям.СуммаПостоянныхЗатратНУ <> 0;
			ЗаданаНормальнаяМощность = Истина;
		Иначе
			РаспределятьПоНормальнойМощности = Истина;
			ЗаданаНормальнаяМощность = Ложь;
		КонецЕсли;
		
		Если ЗаданаНормальнаяМощность Тогда
			Если РаспределятьПоНормальнойМощности Тогда
				ИмяРеквБазыНМ = ПолучитьИмяРеквизитаБазыРаспределения(СтрокаНормальнойМощности.СпособРаспределения);
				ИмяКолонкиНМНУ = "База"+ИмяРеквБазыНМ+"НУ";
			КонецЕсли;
			ВсегоБазаНормальнойМощности = 0;
			ВсегоБазаНормальнойМощностиНУ = 0;
			НаборСтрок = мБазаКоэффициентов.НайтиСтроки(СтруктПоиска);
			Для Каждого СтрКоэф Из НаборСтрок Цикл
				Если РаспределятьПоНормальнойМощности Тогда
					ВсегоБазаНормальнойМощности = ВсегоБазаНормальнойМощности + СтрКоэф["База"+ИмяРеквБазыНМ];
					Если мБазаКоэффициентов.Колонки.Найти(ИмяКолонкиНМНУ) <> Неопределено Тогда
						ВсегоБазаНормальнойМощностиНУ = ВсегоБазаНормальнойМощностиНУ + СтрКоэф[ИмяКолонкиНМНУ];
					Иначе
						ВсегоБазаНормальнойМощностиНУ = ВсегоБазаНормальнойМощностиНУ + СтрКоэф["База"+ИмяРеквБазыНМ];
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделению = 0;
		СуммаНераспределенныхПостоянныхЗатрат = 0;
		СуммаЗатратПриНормальнойМощностиПоПодразделению = 0;
		СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделениюНУ = 0;
		СуммаНераспределенныхПостоянныхЗатратНУ = 0;
		СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ = 0;
		Если РаспределятьПоНормальнойМощности Тогда
			Если ЗаданаНормальнаяМощность Тогда
				Если СтрокаНормальнойМощности.БазаРаспределения <> 0 Тогда
					СуммаЗатратПриНормальнойМощностиПоПодразделению = ВсегоБазаНормальнойМощности * СтрокаНормальнойМощности.СуммаПостоянныхЗатрат / СтрокаНормальнойМощности.БазаРаспределения;
					СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ = ВсегоБазаНормальнойМощностиНУ * СтрокаНормальнойМощности.СуммаПостоянныхЗатрат / СтрокаНормальнойМощности.БазаРаспределения;
				Иначе
					СуммаЗатратПриНормальнойМощностиПоПодразделению = 0;
					СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ = 0;
				КонецЕсли;
			Иначе
				СуммаЗатратПриНормальнойМощностиПоПодразделению =ОбходПоПодразделениям.СуммаПостоянныхЗатрат;
				СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ =ОбходПоПодразделениям.СуммаПостоянныхЗатратНУ;
			КонецЕсли;
			СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделению = СуммаЗатратПриНормальнойМощностиПоПодразделению;
			СуммаНераспределенныхПостоянныхЗатрат = ОбходПоПодразделениям.СуммаПостоянныхЗатрат;
			СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделениюНУ = СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ;
			СуммаНераспределенныхПостоянныхЗатратНУ = ОбходПоПодразделениям.СуммаПостоянныхЗатратНУ;
		КонецЕсли;
	
		ОбходПоМетодамРаспределения = ОбходПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Метод"); 
		Пока ОбходПоМетодамРаспределения.Следующий() Цикл
			
			ИмяРеквБазы = ПолучитьИмяРеквизитаБазыРаспределения(ОбходПоМетодамРаспределения.Метод);
			ИмяКолонкиНУ = "База"+ИмяРеквБазы+"НУ";
			
			ОбходПоСпискуСтатейЗатрат = ОбходПоМетодамРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СписокСтатейЗатрат");
			
			Пока ОбходПоСпискуСтатейЗатрат.Следующий() Цикл
				
				Если ИмяРеквБазы = "ПрямыеСписок" Тогда
					ТекущийСписокПрямыхЗатрат = ОбходПоСпискуСтатейЗатрат.СписокСтатейЗатрат;
					СписокПрямыхЗатрат = ТекущийСписокПрямыхЗатрат.СтатьиЗатрат.ВыгрузитьКолонку("СтатьяЗатрат");
					Если Не СписокПрямыхЗатрат = Справочники.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка() Тогда
						мБазаКоэффициентов = РасчетБазыКоэффициентовСпискаЗатрат(СтруктураШапкиДокумента, СписокПрямыхЗатрат);
					КонецЕсли;
				КонецЕсли;
			
				Обход = ОбходПоСпискуСтатейЗатрат.Выбрать();
			
				Пока Обход.Следующий() Цикл
					
					Если ИмяРеквБазы = "" Тогда	
						Сообщить(Локализация.СтрШаблон1("Установлен метод ""Не распределять"" общепроизводственные расходы для:"
	"Подразделение: ¤1¤"
	"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Информация);
					
					
						Продолжить;
						
					ИначеЕсли ИмяРеквБазы = Неопределено Тогда	
						
					Сообщить(Локализация.СтрШаблон1("Не указан способ распределения общепроизводственных расходов для:"
	"Подразделение: ¤1¤"
	"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Важное);
					
				
						Продолжить;
						
					КонецЕсли;
					
					Если НЕ ((РаспределятьВБУ И Обход.КонечныйОстатокОПЗПоПодразделению <> 0) ИЛИ (РаспределятьВНУ И Обход.КонечныйОстатокОПЗПоПодразделениюНУ <> 0)) Тогда
						// если конечный остаток ОПЗ по подразделению уже = 0 - по статьям суммы оборотов не распределяем
						Продолжить;
					КонецЕсли;
					
					Если НЕ ((РаспределятьВБУ И Обход.Сумма <> 0) ИЛИ (РаспределятьВНУ ИЛИ Обход.СуммаНУ = 0)) Тогда
						Продолжить;
					КонецЕсли;
					
					Если Обход.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда	
						
					Сообщить(Локализация.СтрШаблон1("Общепроизводственные расходы с налоговым назначением Необл. НДС, нехоз. не распределяются:"
	"Подразделение: ¤1¤"
	"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Важное);
					
				
						Продолжить;
						
					КонецЕсли;
					
					ПостояннаяЗатрата = Обход.ПостояннаяЗатрата;
					
					СуммаРаспределяемыхЗатрат = Обход.Сумма;
					СуммаНаСебестоимостьПриНормальнойМощности = 0;
					СуммаЗатратПриНормальнойМощностиПоСтатье = 0;
					СуммаРаспределяемыхЗатратНУ = Обход.СуммаНУ;
					СуммаНаСебестоимостьПриНормальнойМощностиНУ = 0;
					СуммаЗатратПриНормальнойМощностиПоСтатьеНУ = 0;
					Если ПостояннаяЗатрата Тогда
						Если Обход.Сумма = СуммаНераспределенныхПостоянныхЗатрат Тогда
							СуммаЗатратПриНормальнойМощностиПоСтатье = СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделению;
						Иначе	
							СуммаЗатратПриНормальнойМощностиПоСтатье = ОКР(СуммаЗатратПриНормальнойМощностиПоПодразделению * Обход.Сумма / ОбходПоПодразделениям.СуммаПостоянныхЗатрат, 2, 1);
						КонецЕсли;
						Если Обход.СуммаНУ = СуммаНераспределенныхПостоянныхЗатратНУ Тогда
							СуммаЗатратПриНормальнойМощностиПоСтатьеНУ = СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделениюНУ;
						Иначе	
							СуммаЗатратПриНормальнойМощностиПоСтатьеНУ = ОКР(СуммаЗатратПриНормальнойМощностиПоПодразделениюНУ * Обход.СуммаНУ / ОбходПоПодразделениям.СуммаПостоянныхЗатратНУ, 2, 1);
						КонецЕсли;
						СуммаНераспределенныхПостоянныхЗатрат = СуммаНераспределенныхПостоянныхЗатрат - Обход.Сумма;
						СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделению = СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделению - СуммаЗатратПриНормальнойМощностиПоСтатье;
						СуммаНераспределенныхПостоянныхЗатратНУ = СуммаНераспределенныхПостоянныхЗатратНУ - Обход.СуммаНУ;
						СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделениюНУ = СуммаНераспределенныхЗатратПриНормальнойМощностиПоПодразделениюНУ - СуммаЗатратПриНормальнойМощностиПоСтатьеНУ;
						Если СуммаЗатратПриНормальнойМощностиПоСтатье < Обход.Сумма Тогда
							СуммаРаспределяемыхЗатрат = СуммаЗатратПриНормальнойМощностиПоСтатье;
							СуммаНаСебестоимостьПриНормальнойМощности = Обход.Сумма - СуммаЗатратПриНормальнойМощностиПоСтатье;
						КонецЕсли;
						Если СуммаЗатратПриНормальнойМощностиПоСтатьеНУ < Обход.СуммаНУ Тогда
							СуммаРаспределяемыхЗатратНУ = СуммаЗатратПриНормальнойМощностиПоСтатьеНУ;
							СуммаНаСебестоимостьПриНормальнойМощностиНУ = Обход.СуммаНУ - СуммаЗатратПриНормальнойМощностиПоСтатьеНУ;
						КонецЕсли;
					КонецЕсли; 
					
					РаспределятьПоНормальнойМощности = СуммаЗатратПриНормальнойМощностиПоСтатье <> 0 ИЛИ СуммаЗатратПриНормальнойМощностиПоСтатьеНУ <> 0;
					
					ВсегоБазаРаспределения = 0;
					ВсегоБазаРаспределенияНУ = 0;
					Если Обход.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая
					 ИЛИ Обход.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность Тогда
						СтруктПоиска.Вставить("НалоговоеНазначение", Обход.НалоговоеНазначение); 
					ИначеЕсли Обход.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
						Если СтруктПоиска.Свойство("НалоговоеНазначение") Тогда
							СтруктПоиска.Удалить("НалоговоеНазначение");
						КонецЕсли;
					КонецЕсли; 
					НаборСтрок = мБазаКоэффициентов.НайтиСтроки(СтруктПоиска);
					Для Каждого СтрКоэф Из НаборСтрок Цикл
						ВсегоБазаРаспределения = ВсегоБазаРаспределения + СтрКоэф["База"+ИмяРеквБазы];
						Если мБазаКоэффициентов.Колонки.Найти(ИмяКолонкиНУ) <> Неопределено Тогда
							ВсегоБазаРаспределенияНУ = ВсегоБазаРаспределенияНУ + СтрКоэф[ИмяКолонкиНУ];
						Иначе
							ВсегоБазаРаспределенияНУ = ВсегоБазаРаспределенияНУ + СтрКоэф["База"+ИмяРеквБазы];
						КонецЕсли;
					КонецЦикла;
					
					Если Обход.Метод = Перечисления.СпособыРаспределенияКосвенныхРасходов.ПрямыеЗатраты И ВсегоБазаРаспределения <> 0 И ВсегоБазаРаспределенияНУ = 0 Тогда	
						
						Сообщить(Локализация.СтрШаблон1("Метод распределения общепроизводственных затрат ""Прямые затраты"", при этом в налоговом учете прямых затрат нет:"
	"Подразделение: ¤1¤"
	"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Важное);
						
					КонецЕсли;
				
					СуммаКРаспр = 0;
					СуммаСписанияНаСебестоимость = Обход.Сумма;
					УчтеноБазаРаспределения = 0;
					СуммаКРаспрНУ = 0;
					СуммаСписанияНаСебестоимостьНУ = Обход.СуммаНУ;
					УчтеноБазаРаспределенияНУ = 0;
					Если РаспределятьПоНормальнойМощности Тогда
						СуммаКРаспрНРЗ = 0;
						СуммаКРаспрНРЗНУ = 0;
					КонецЕсли;
				
					Для Каждого СтрКоэф Из НаборСтрок Цикл
					
						БазаРаспределения = СтрКоэф["База"+ИмяРеквБазы];
						Если мБазаКоэффициентов.Колонки.Найти(ИмяКолонкиНУ) <> Неопределено Тогда
							БазаРаспределенияНУ = СтрКоэф[ИмяКолонкиНУ];
						Иначе
							БазаРаспределенияНУ = СтрКоэф["База"+ИмяРеквБазы];
						КонецЕсли;
						БазаРаспределенияНаВыпуск = БазаРаспределения;
						БазаРаспределенияНаВыпускНУ = БазаРаспределенияНУ;
						
						Если (РаспределятьВБУ И БазаРаспределения = 0) ИЛИ (РаспределятьВНУ И БазаРаспределенияНУ = 0) Тогда
							Продолжить;
						КонецЕсли;
						
						УчтеноБазаРаспределения = УчтеноБазаРаспределения + БазаРаспределения;
						ДолжноБытьСписано = Окр(СуммаРаспределяемыхЗатрат * УчтеноБазаРаспределения / ВсегоБазаРаспределения, 2, 1);
						СуммаСписания = ДолжноБытьСписано - СуммаКРаспр;
						СуммаКРаспр = СуммаКРаспр + СуммаСписания;
						УчтеноБазаРаспределенияНУ = УчтеноБазаРаспределенияНУ + БазаРаспределенияНУ;
						ДолжноБытьСписаноНУ = Окр(СуммаРаспределяемыхЗатратНУ * УчтеноБазаРаспределенияНУ / ВсегоБазаРаспределенияНУ, 2, 1);
						СуммаСписанияНУ = ДолжноБытьСписаноНУ - СуммаКРаспрНУ;
						СуммаКРаспрНУ = СуммаКРаспрНУ + СуммаСписанияНУ;
						
						Если РаспределятьПоНормальнойМощности Тогда
							ДолжноБытьСписаноНРЗ = Окр(СуммаНаСебестоимостьПриНормальнойМощности * УчтеноБазаРаспределения / ВсегоБазаРаспределения, 2, 1);
							СуммаСписанияНРЗ = ДолжноБытьСписаноНРЗ - СуммаКРаспрНРЗ;
							СуммаКРаспрНРЗ = СуммаКРаспрНРЗ + СуммаСписанияНРЗ;
							ДолжноБытьСписаноНРЗНУ = Окр(СуммаНаСебестоимостьПриНормальнойМощностиНУ * УчтеноБазаРаспределенияНУ / ВсегоБазаРаспределенияНУ, 2, 1);
							СуммаСписанияНРЗНУ = ДолжноБытьСписаноНРЗНУ - СуммаКРаспрНРЗНУ;
							СуммаКРаспрНРЗНУ = СуммаКРаспрНРЗНУ + СуммаСписанияНРЗНУ;
						КонецЕсли;
					
						Если (РаспределятьВБУ И СуммаСписания <> 0) ИЛИ (РаспределятьВНУ И СуммаСписанияНУ <> 0) Тогда
						
							НоваяПроводка = мОперация.Добавить();
							НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
							НоваяПроводка.Активность  = Истина;
							НоваяПроводка.Период      = Дата;
							Если РаспределятьПоНормальнойМощности Тогда
								НоваяПроводка.Содержание  = "Распределение ОПЗ с учетом нормальной мощности";
							Иначе	
								НоваяПроводка.Содержание  = "Распределение ОПЗ";
							КонецЕсли;	
							
							Если РаспределятьВБУ Тогда
								НоваяПроводка.Сумма = СуммаСписания;
							КонецЕсли;
							
							НоваяПроводка.СчетДт = СтрКоэф.СчетЗатрат;
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", СтрКоэф.НоменклатурнаяГруппа);
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Подразделения",        СтрКоэф.Подразделение);
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
						
							НоваяПроводка.СчетКт = Обход.СчетЗатрат;
			
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);

							Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
								НоваяПроводка.НалоговоеНазначениеДт = СтрКоэф.НалоговоеНазначение;
								Если РаспределятьВНУ Тогда
									НоваяПроводка.СуммаНУДт = СуммаСписанияНУ;
								КонецЕсли;
							КонецЕсли;
							Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
								НоваяПроводка.НалоговоеНазначениеКт = Обход.НалоговоеНазначение;
								Если РаспределятьВНУ Тогда
									НоваяПроводка.СуммаНУКт = СуммаСписанияНУ;
								КонецЕсли;
							КонецЕсли;
							
							РаспределениеВыполнено = Истина;
						
							СтрокаЗаписьРасчетаКосвенныхРасходов = ЗаписьРасчетаКосвенныхРасходов.Добавить();
							СтрокаЗаписьРасчетаКосвенныхРасходов.СчетУчета = Обход.СчетЗатрат;
							СтрокаЗаписьРасчетаКосвенныхРасходов.ВидОперации = Перечисления.ВидыОперацийРасчетаКосвенныхРасходов.РаспределениеОбщепроизводственныхРасходов;
							СтрокаЗаписьРасчетаКосвенныхРасходов.Подразделение = Обход.Подразделение;
							СтрокаЗаписьРасчетаКосвенныхРасходов.СтатьяЗатрат = Обход.СтатьяЗатрат;
							СтрокаЗаписьРасчетаКосвенныхРасходов.БазаРаспределения = ОбходПоМетодамРаспределения.Метод;
							Если РаспределятьВБУ Тогда
								СтрокаЗаписьРасчетаКосвенныхРасходов.СуммаБазы = БазаРаспределения;
							КонецЕсли;
							Если РаспределятьВНУ Тогда
								СтрокаЗаписьРасчетаКосвенныхРасходов.СуммаБазыНУ = БазаРаспределенияНУ;
							КонецЕсли;
							СтрокаЗаписьРасчетаКосвенныхРасходов.СчетРаспределения = СтрКоэф.СчетЗатрат;
							СтрокаЗаписьРасчетаКосвенныхРасходов.ПодразделениеРаспределения = СтрКоэф.Подразделение;
							СтрокаЗаписьРасчетаКосвенныхРасходов.НоменклатурнаяГруппаРаспределения = СтрКоэф.НоменклатурнаяГруппа;
							СтрокаЗаписьРасчетаКосвенныхРасходов.НалоговоеНазначение = СтрКоэф.НалоговоеНазначение;
							Если РаспределятьВБУ Тогда
								СтрокаЗаписьРасчетаКосвенныхРасходов.Сумма = СуммаСписания;
							КонецЕсли;
							Если РаспределятьВНУ Тогда
								СтрокаЗаписьРасчетаКосвенныхРасходов.СуммаНУ = СуммаСписанияНУ;
							КонецЕсли;
							
							СуммаСписанияНаСебестоимость = СуммаСписанияНаСебестоимость - СуммаСписания;
							СуммаСписанияНаСебестоимостьНУ = СуммаСписанияНаСебестоимостьНУ - СуммаСписанияНУ;
						
						КонецЕсли;
					
						Если РаспределятьПоНормальнойМощности И ((РаспределятьВБУ И СуммаСписанияНРЗ<>0) ИЛИ (РаспределятьВНУ И СуммаСписанияНРЗНУ<>0)) Тогда
								
							НоваяПроводка = мОперация.Добавить();
							НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
							НоваяПроводка.Активность  = Истина;
							НоваяПроводка.Период      = Дата;
							НоваяПроводка.Содержание  = "Списание не распределенных постоянных ОПЗ на себестоимость";
							
							Если РаспределятьВБУ Тогда
								НоваяПроводка.Сумма = СуммаСписанияНРЗ;
							КонецЕсли;
							
							НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойГотовойПродукции;
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", СтрКоэф.НоменклатурнаяГруппа);
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
							
							НоваяПроводка.СчетКт = Обход.СчетЗатрат;
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
							ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
							
							Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
								НоваяПроводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ;
								Если РаспределятьВНУ Тогда
									Если НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
										НоваяПроводка.СуммаНУДт = СуммаСписанияНРЗНУ;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
								НоваяПроводка.НалоговоеНазначениеКт = Обход.НалоговоеНазначение;
								Если РаспределятьВНУ Тогда
									НоваяПроводка.СуммаНУКт = СуммаСписанияНРЗНУ;
								КонецЕсли;
							КонецЕсли;
							
							РаспределениеВыполнено = Истина;
							СуммаСписанияНаСебестоимость = СуммаСписанияНаСебестоимость - СуммаСписанияНРЗ;
							СуммаСписанияНаСебестоимостьНУ = СуммаСписанияНаСебестоимостьНУ - СуммаСписанияНРЗНУ;
							
						КонецЕсли;
					КонецЦикла;
					// Не распределенные ОПЗ списываем на себестоимость продукции (901)
					Если (РаспределятьВБУ И СуммаСписанияНаСебестоимость <> 0) ИЛИ (РаспределятьВБУ И СуммаСписанияНаСебестоимостьНУ <> 0) Тогда
						
						НоваяПроводка = мОперация.Добавить();
						НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
						НоваяПроводка.Активность  = Истина;
						НоваяПроводка.Период      = Дата;
						НоваяПроводка.Содержание  = "Списание не распределенных ОПЗ на себестоимость";
						
						Если РаспределятьВБУ Тогда
							НоваяПроводка.Сумма = СуммаСписанияНаСебестоимость;
						КонецЕсли;
						
						НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойГотовойПродукции;
						ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
						
						НоваяПроводка.СчетКт = Обход.СчетЗатрат;
						ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
						
						Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
							НоваяПроводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ;
							Если РаспределятьВНУ Тогда
								Если НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
									НоваяПроводка.СуммаНУДт = СуммаСписанияНаСебестоимостьНУ;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
							НоваяПроводка.НалоговоеНазначениеКт = Обход.НалоговоеНазначение;
							Если РаспределятьВНУ Тогда
								НоваяПроводка.СуммаНУКт = СуммаСписанияНаСебестоимостьНУ;
							КонецЕсли;
						КонецЕсли;
						
						РаспределениеВыполнено = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если РаспределениеВыполнено Тогда
		мОперация.Записать(Ложь);
	КонецЕсли; 
	
	Возврат РаспределениеВыполнено;
	
КонецФункции // РаспределитьОПР()

// Формируется запрос по затратам на брак
//
Процедура СформироватьЗапросПоЗатратамНаБрак(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",             мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",             мКонМесяца);
	Запрос.УстановитьПараметр("СчетЗатрат",          ПланыСчетов.Хозрасчетный.БракВПроизводстве);
	Запрос.УстановитьПараметр("Организация",         СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат",  Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК СчетЗатрат,
	|	ХозрасчетныйОбороты.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ХозрасчетныйОбороты.Субконто1 КАК Подразделение,
	|	ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппа,
	|	ХозрасчетныйОбороты.Субконто3 КАК СтатьяЗатрат,
	|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОбороты.СуммаОборот КАК СуммаНУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Месяц, Счет В ИЕРАРХИИ (&СчетЗатрат), &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты";
	
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетЗатратБУ", "СчетЗатрат");
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоЗатратамНаБрак()
	
Функция РаспределитьЗатратыНаБрак(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	
	РаспределениеВыполнено = Ложь;
	
	// Формирование запроса по затратам на брак
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоЗатратамНаБрак(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров);
	
	Обход = РезультатЗапроса.Выбрать();
	
	Пока Обход.Следующий() Цикл
		
		Если Обход.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяПроводка = мОперация.Добавить();
		НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
		НоваяПроводка.Активность  = Истина;
		НоваяПроводка.Период      = Дата;
		НоваяПроводка.Содержание  = "Распределение затрат на брак";
		
		НоваяПроводка.Сумма = Обход.Сумма;
		
		НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", Обход.НоменклатурнаяГруппа);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Подразделения",        Обход.Подразделение);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
		
		НоваяПроводка.СчетКт = Обход.СчетЗатрат;
		
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СтатьиЗатрат",         Обход.СтатьяЗатрат);
		Если ЗначениеЗаполнено(Обход.НоменклатурнаяГруппа) Тогда
			ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "НоменклатурныеГруппы",        Обход.НоменклатурнаяГруппа);
		КонецЕсли;
		
		Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
			НоваяПроводка.НалоговоеНазначениеДт = Обход.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве;
			НоваяПроводка.СуммаНУДт = Обход.СуммаНУ;
		КонецЕсли;
		Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
			НоваяПроводка.НалоговоеНазначениеКт = Обход.НалоговоеНазначение;
			НоваяПроводка.СуммаНУКт = Обход.СуммаНУ;
		КонецЕсли;
		
		РаспределениеВыполнено = Истина;
		
		
	КонецЦикла;
	
	Если РаспределениеВыполнено Тогда
		мОперация.Записать(Ложь);
	КонецЕсли; 
	
КонецФункции // РаспределитьЗатратыНаБрак()

// Функция расчета коэф. распределения косвенных затрат по переделам
//
Функция РасчетБазыКоэффициентов(СтруктураШапкиДокумента)
	
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст =  "ВЫБРАТЬ
	 |	ПолнаяБазаРаспределения.СчетЗатрат,
	 |	ПолнаяБазаРаспределения.Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве КАК НалоговоеНазначение,
	 |	СУММА(ПолнаяБазаРаспределения.БазаМат) КАК БазаМат,
	 |	СУММА(ПолнаяБазаРаспределения.БазаМатНУ) КАК БазаМатНУ,
	 |	СУММА(ПолнаяБазаРаспределения.БазаЗП) КАК БазаЗП,
	 |	СУММА(ПолнаяБазаРаспределения.БазаЗПНУ) КАК БазаЗПНУ,
	 |	СУММА(ПолнаяБазаРаспределения.БазаВыпуск) КАК БазаВыпуск,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПлан) КАК БазаПлан,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПрямые) 		КАК БазаПрямые,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПрямыеНУ) 		КАК БазаПрямыеНУ,
	 |	СУММА(ПолнаяБазаРаспределения.БазаСписокЗатрат) КАК БазаПрямыеСписок
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ХозрасчетныйОбороты.Счет КАК СчетЗатрат,
	 |		ХозрасчетныйОбороты.Субконто1 КАК Подразделение,
	 |		ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппа,
	 |		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.Субконто3.ВидЗатрат = &МатЗатраты ТОГДА ХозрасчетныйОбороты.СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК БазаМат,
	 |		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.Субконто3.ВидЗатрат = &МатЗатраты ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт ИНАЧЕ 0 КОНЕЦ) КАК БазаМатНУ,
	 |		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.Субконто3.ВидЗатрат = &ОплатаТруда ТОГДА ХозрасчетныйОбороты.СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК БазаЗП,
	 |		СУММА(ВЫБОР КОГДА ХозрасчетныйОбороты.Субконто3.ВидЗатрат = &ОплатаТруда ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт ИНАЧЕ 0 КОНЕЦ) КАК БазаЗПНУ,
	 |		0 КАК БазаВыпуск,
	 |		0 КАК БазаПлан,
	 |		0 КАК БазаПрямые,
	 |		0 КАК БазаПрямыеНУ,
	 |		0 КАК БазаСписокЗатрат	 
	 |	ИЗ
	 |		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Месяц, Счет В ИЕРАРХИИ (&СчетаЗатрат), &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ХозрасчетныйОбороты.Счет,
	 |		ХозрасчетныйОбороты.Субконто1,
	 |		ХозрасчетныйОбороты.Субконто2
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ВыпускПродукцииУслуг.СчетЗатрат,
	 |		ВыпускПродукцииУслуг.Подразделение,
	 |		ВыпускПродукцииУслуг.НоменклатурнаяГруппа,
	 |		0,
	 |		0,
	 |		0,
	 |		0,
	 |		СУММА(ВыпускПродукцииУслуг.Количество),
	 |		СУММА(ВыпускПродукцииУслуг.ПлановаяСтоимость),
	 |		0,
	 |		0,
	 |		0
	 |	ИЗ
	 |		РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет КАК ВыпускПродукцииУслуг
	 |	
	 |	ГДЕ
	 |		ВыпускПродукцииУслуг.Период МЕЖДУ &НачДата И &КонДата И
	 |		ВыпускПродукцииУслуг.Подразделение.Владелец = &Организация
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ВыпускПродукцииУслуг.СчетЗатрат,
	 |		ВыпускПродукцииУслуг.Подразделение,
	 |		ВыпускПродукцииУслуг.НоменклатурнаяГруппа
	 |
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ПрямыеЗатраты.Счет,
	 |		ПрямыеЗатраты.Субконто1,
	 |		ПрямыеЗатраты.Субконто2,
	 |		0,
	 |		0,
	 |		0,
	 |		0,
	 |		0,
	 |		0,
	 |		ЕСТЬNULL(ПрямыеЗатраты.СуммаОборотДт, 0),
	 |		ЕСТЬNULL(ПрямыеЗатраты.СуммаНУОборотДт, 0),
	 |		0
	 |	ИЗ
	 |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	 |				&НачДата,
	 |				&КонДата,
	 |				Месяц,
	 |				Счет В ИЕРАРХИИ (&СчетаПрямыхЗатрат),
	 |				&ВидыСубконто,
	 |				Организация = &Организация,	 
	 |				(НЕ КорСчет В ИЕРАРХИИ (&СчетЗатратКосвенных)),
	 |				) КАК ПрямыеЗатраты
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ПрямыеЗатраты.Счет,
	 |		ПрямыеЗатраты.Субконто1,
	 |		ПрямыеЗатраты.Субконто2,
	 |		ПрямыеЗатраты.СуммаОборотДт,
	 |		ПрямыеЗатраты.СуммаНУОборотДт
	 |
	 |  ) КАК ПолнаяБазаРаспределения
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПолнаяБазаРаспределения.СчетЗатрат,
	 |	ПолнаяБазаРаспределения.Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа";
	 
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	
	Запрос.УстановитьПараметр("ОплатаТруда", Перечисления.ВидыЗатрат.ОплатаТруда);
	Запрос.УстановитьПараметр("МатЗатраты",  Перечисления.ВидыЗатрат.Материальные);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	Запрос.УстановитьПараметр("СчетаЗатрат", СчетаЗатрат);
	Запрос.УстановитьПараметр("СчетаПрямыхЗатрат", СчетаЗатрат);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);	
	Запрос.УстановитьПараметр("СчетЗатратКосвенных", СчетаЗатрат);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // РасчетБазыКоэффициентов()

Функция РасчетБазыКоэффициентовСпискаЗатрат(СтруктураШапкиДокумента, СписокЗатрат)
		
	 Запрос = Новый Запрос;
	 Запрос.Текст =  "ВЫБРАТЬ
	                 |	ПолнаяБазаРаспределения.СчетЗатрат КАК СчетЗатрат,
	                 |	ПолнаяБазаРаспределения.Подразделение КАК Подразделение,
	                 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
					 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве КАК НалоговоеНазначение,
	                 |	0 КАК БазаМат,
	                 |	0 КАК БазаЗП,
	                 |	0 КАК БазаВыпуск,
	                 |	0 КАК БазаПлан,
	                 |	0 КАК БазаПрямые,
	                 |	СУММА(ПолнаяБазаРаспределения.БазаПрямые) КАК БазаПрямыеСписок,
					 |	СУММА(ПолнаяБазаРаспределения.БазаПрямыеНУ) КАК БазаПрямыеСписокНУ
	                 |ИЗ
	                 |	(ВЫБРАТЬ
	                 |		ПрямыеЗатраты.Счет КАК СчетЗатрат,
	                 |		ПрямыеЗатраты.Субконто1 КАК Подразделение,
	                 |		ПрямыеЗатраты.Субконто2 КАК НоменклатурнаяГруппа,
	                 |		ПрямыеЗатраты.СуммаОборотДт КАК БазаПрямые,
					 |		ПрямыеЗатраты.СуммаНУОборотДт КАК БазаПрямыеНУ
	                 |	ИЗ
	                 |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	                 |			&НачДата,
	                 |			&КонДата,
	                 |			Месяц,
	                 |			Счет В ИЕРАРХИИ (&СчетаПрямыхЗатрат),
	                 |			&ВидыСубконто,
	                 |			Организация = &Организация
	                 |				И Субконто3 В (&СписокЗатрат)
	                 |			,
	                 |			) КАК ПрямыеЗатраты
	                 |	
	                 |	СГРУППИРОВАТЬ ПО
	                 |		ПрямыеЗатраты.Счет,
	                 |		ПрямыеЗатраты.Субконто1,
	                 |		ПрямыеЗатраты.Субконто2,
	                 |		ПрямыеЗатраты.СуммаОборотДт,
					 |		ПрямыеЗатраты.СуммаНУОборотДт) КАК ПолнаяБазаРаспределения
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ПолнаяБазаРаспределения.СчетЗатрат,
	                 |	ПолнаяБазаРаспределения.Подразделение,
	                 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа";
		
	Запрос.УстановитьПараметр("НачДата",      мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",      мКонМесяца);
	Запрос.УстановитьПараметр("Организация",  СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("СписокЗатрат", СписокЗатрат);
	 
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);	
	Запрос.УстановитьПараметр("СчетЗатрат", СчетаЗатрат);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
	Запрос.УстановитьПараметр("СчетаПрямыхЗатрат", СчетаЗатрат);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // РасчетБазыКоэффициентовСпискаЗатрат()

// Общепроизводственные затраты и затраты на брак списываются на счета учета
// прямых расходов основного и вспомогательного производства.
// При списании расходы распределяются по подразделениям и
// номенклатурным группам.
//
Процедура РаспределениеКосвенныхРасходов(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	мБазаКоэффициентов = РасчетБазыКоэффициентов(СтруктураШапкиДокумента);
	мПоказателиНормальнойМощности = ПолучитьПоказателиНормальнойМощности(СтруктураШапкиДокумента);
	
	// Списание общепроизводственных затрат на счета учета затрат
	// основного и вспомогательного производств.
	РаспределениеВыполнено = РаспределитьОПР(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	// Списание затрат на брак на счета учета затрат 
	// основного и вспомогательного производств.
	РаспределитьЗатратыНаБрак(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	// Распределение общепроизводственных затрат и затрат на брак
	// на себестоимость выпущенной продукции (услуг).
	РасчетПрямыхЗатрат(СтруктураШапкиДокумента, Истина, СтруктураДопПараметров);

КонецПроцедуры // РаспределениеКосвенныхРасходов()

// Процедура формирует данные о прямых затратах на переделе по продукции
//
Процедура СформироватьЗапросПоПрямымЗатратам(СтруктураШапкиДокумента, ПеределПодразделение, ПеределНоменклатурнаяГруппа, РезультатЗапроса, СтруктураДопПараметров, ВыполненоРаспределениеОПР)
	
	УсловияВстречногоВыпуска1 = "";
	УсловияВстречногоВыпуска2 = "";
	РасчетПрямыхЗатратНомер = СтруктураДопПараметров.РасчетПрямыхЗатратНомер;
	Если Лев(РасчетПрямыхЗатратНомер, 1) = "3" Тогда
		ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа", ПеределПодразделение, ПеределНоменклатурнаяГруппа));
		Если ВстречныйВыпуск.Количество() = 0 Тогда
			РасчетПрямыхЗатратНомер = "" 
		КонецЕсли;
		
	ИначеЕсли РасчетПрямыхЗатратНомер <> "" Тогда
		ТаблицаВстречногоВыпускаДляОтбора = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.Скопировать();
		ТаблицаВстречногоВыпускаДляОтбора.Свернуть("Продукция, Подразделение, НоменклатурнаяГруппа, ПодразделениеПересчета, НоменклатурнаяГруппаПересчета", );		
		ВстречныйВыпуск = ТаблицаВстречногоВыпускаДляОтбора.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа", ПеределПодразделение, ПеределНоменклатурнаяГруппа));
		Если ВстречныйВыпуск.Количество() > 0  Тогда
			ПродукцияВстречногоВыпуска    = Новый Массив;
			ПодразделениеПересчета        = Новый Массив;
			НоменклатурнаяГруппаПересчета = Новый Массив;
			Для Каждого СтрокаВстречногоВыпуска Из ВстречныйВыпуск Цикл
				ПродукцияВстречногоВыпуска.Добавить(СтрокаВстречногоВыпуска.Продукция);
				ПодразделениеПересчета.Добавить(СтрокаВстречногоВыпуска.ПодразделениеПересчета);
				НоменклатурнаяГруппаПересчета.Добавить(СтрокаВстречногоВыпуска.НоменклатурнаяГруппаПересчета);
			КонецЦикла;
			Если РасчетПрямыхЗатратНомер = "1" Тогда
				УсловияВстречногоВыпуска1 = " И Не (КорСубконто1 В (&ПодразделениеПересчета) И КорСубконто2 В (&НоменклатурнаяГруппаПересчета))";
				УсловияВстречногоВыпуска2 = " И Не (Подразделение В (&ПодразделениеПересчета) И НоменклатурнаяГруппа В (&НоменклатурнаяГруппаПересчета))";
			Иначе
				УсловияВстречногоВыпуска1 = " И КорСубконто1 В (&ПодразделениеПересчета) И КорСубконто2 В (&НоменклатурнаяГруппаПересчета)";
				УсловияВстречногоВыпуска2 = " И Подразделение В (&ПодразделениеПересчета) И НоменклатурнаяГруппа В (&НоменклатурнаяГруппаПересчета)";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииУслуг.СчетЗатрат КАК СчетЗатрат,
	|	ВыпускПродукцииУслуг.Подразделение КАК Подразделение,
	|	ВыпускПродукцииУслуг.НалоговоеНазначениеДоходовИЗатрат КАК НалоговоеНазначениеДоходовИЗатрат,
	|	ВыпускПродукцииУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВыпускПродукцииУслуг.Продукция,
	|	ВыпускПродукцииУслуг.НоменклатурнаяПозиция,
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Заказ,
	|   ВЫБОР КОГДА ВыпускПродукцииУслуг.НоменклатурнаяПозиция.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка) ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	|	ИНАЧЕ ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.Качество, ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КОНЕЦ КАК Качество,
	|	ВыпускПродукцииУслуг.СчетСписания,
	|	ВыпускПродукцииУслуг.СубконтоСписания1,
	|	ВыпускПродукцииУслуг.СубконтоСписания2,
	|	ВыпускПродукцииУслуг.СубконтоСписания3,
	|	ВыпускПродукцииУслуг.СубконтоСписания4,
	|	СУММА(ЕСТЬNULL(ВыпускПродукцииУслуг.КоличествоОборот, 0)) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ВыпускПродукцииУслуг.ПрямыеРасходыРаспределятьПоКоличеству
	|				ТОГДА ЕСТЬNULL(ВыпускПродукцииУслуг.КоличествоОборот, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВыпускПродукцииУслуг.ПлановаяСтоимостьОборот, 0)
	|		КОНЕЦ) КАК ПлановаяСтоимость,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОборотДт, 0)) КАК ВсегоПрямыхРасходов,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаКонечныйОстаток, 0)) КАК ОстатокПрямыхРасходов,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУОборотДт, 0)) КАК ВсегоПрямыхРасходовНУ,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУКонечныйОстаток, 0)) КАК ОстатокПрямыхРасходовНУ,
	|	СУММА(ЕСТЬNULL(ВыпускПродукцииУслуг.ПлановаяСтоимостьОборот, 0)) КАК СписаноРасходов,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаБУ,0)) КАК СуммаНЗП,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаНУ,0)) КАК СуммаНЗПНУ
	|ИЗ
	|	РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(
	|		&НачГраница, 
	|		&КонГраница, 
	|		Месяц, 
	| 		Организация = &Организация И 
	| 		Подразделение = &Подразделение
	|	    И НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК ВыпускПродукцииУслуг
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		&НачГраница,
	|		&КонГраница,
	|		,
	|		, 
	|		Счет В ИЕРАРХИИ (&СчетаЗатрат), 
	|		&ВидыСубконто, 
	|		Организация = &Организация
	|		И Субконто1 = &Подразделение
 	|		И Субконто2 = &НоменклатурнаяГруппа) КАК ХозрасчетныйОстатки
	|		ПО ВыпускПродукцииУслуг.СчетЗатрат = ХозрасчетныйОстатки.Счет 
	|			И ВыпускПродукцииУслуг.Подразделение = ХозрасчетныйОстатки.Субконто1 
	|			И ВыпускПродукцииУслуг.НоменклатурнаяГруппа = ХозрасчетныйОстатки.Субконто2 
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИнвентаризацияНЗП.СчетЗатрат КАК СчетЗатрат,
	|			ИнвентаризацияНЗП.ПодразделениеОрганизации КАК Подразделение,
	|			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			СУММА(ИнвентаризацияНЗПСостав.СуммаБУ) КАК СуммаБУ,
	|			СУММА(ИнвентаризацияНЗПСостав.СуммаНУ) КАК СуммаНУ
	|		ИЗ
	|			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
	|				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
	|		
	|		ГДЕ
	|			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата И
	|			ИнвентаризацияНЗП.Организация = &Организация И
	|			(НЕ(ИнвентаризацияНЗП.ПометкаУдаления))
	|		СГРУППИРОВАТЬ ПО
	|			ИнвентаризацияНЗП.ПодразделениеОрганизации,
	|			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа,
	|			ИнвентаризацияНЗП.СчетЗатрат) КАК ОстаткиНЗП
	|		ПО ХозрасчетныйОстатки.Субконто1 = ОстаткиНЗП.Подразделение 
	|			И ХозрасчетныйОстатки.Субконто2 = ОстаткиНЗП.НоменклатурнаяГруппа 
	|			И ХозрасчетныйОстатки.Счет = ОстаткиНЗП.СчетЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыпускПродукцииУслуг.СчетЗатрат,
	|	ВыпускПродукцииУслуг.Подразделение,
	|	ВыпускПродукцииУслуг.НалоговоеНазначениеДоходовИЗатрат,
	|	ВыпускПродукцииУслуг.НоменклатурнаяГруппа,
	|	ВыпускПродукцииУслуг.Продукция,
	|	ВыпускПродукцииУслуг.НоменклатурнаяПозиция,
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
	|	ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)),
	|   ВЫБОР КОГДА ВыпускПродукцииУслуг.НоменклатурнаяПозиция.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка) ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	|	ИНАЧЕ ЕСТЬNULL(ВыпускПродукцииУслуг.НоменклатурнаяПозиция.Качество, ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КОНЕЦ,
	|	ВыпускПродукцииУслуг.СчетСписания,
	|	ВыпускПродукцииУслуг.СубконтоСписания1,
	|	ВыпускПродукцииУслуг.СубконтоСписания2,
	|	ВыпускПродукцииУслуг.СубконтоСписания3,
	|	ВыпускПродукцииУслуг.СубконтоСписания4,
	|	ОстаткиНЗП.СуммаБУ,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаКонечныйОстаток, 0)
	|
	|ИТОГИ 
	|	СУММА(Количество), 
	|	СУММА(ПлановаяСтоимость), 
	|	МАКСИМУМ(ОстатокПрямыхРасходов), 
	|	СУММА(ВсегоПрямыхРасходов),
	|	СУММА(СписаноРасходов), 
	|	МАКСИМУМ(ОстатокПрямыхРасходовНУ),
	|	СУММА(ВсегоПрямыхРасходовНУ),
	|	МАКСИМУМ(СуммаНЗП), 
	|	МАКСИМУМ(СуммаНЗПНУ) 
	|ПО
	|	СчетЗатрат,
	|	Подразделение,
	|	НоменклатурнаяГруппа";
	
	
	Если ПеределНоменклатурнаяГруппа = "Все" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК ВыпускПродукцииУслуг", ")" + УсловияВстречногоВыпуска2 + "КАК ВыпускПродукцииУслуг");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И Субконто2 = &НоменклатурнаяГруппа) КАК ХозрасчетныйОстатки", ") КАК ХозрасчетныйОстатки");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК ВыпускПродукцииУслуг", "И НоменклатурнаяГруппа = &НоменклатурнаяГруппа" + УсловияВстречногоВыпуска2 + ") КАК ВыпускПродукцииУслуг");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачДата",               мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",               мКонМесяца);
	Запрос.УстановитьПараметр("НачГраница",            мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",            мКонГраница);
	Запрос.УстановитьПараметр("Организация",           СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("Подразделение",         ПеределПодразделение);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа",  ПеределНоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппаПересчета",  НоменклатурнаяГруппаПересчета);
	Запрос.УстановитьПараметр("ПодразделениеПересчета",      ПодразделениеПересчета);
	Запрос.УстановитьПараметр("ПродукцияВстречногоВыпуска",  ПродукцияВстречногоВыпуска);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство); 
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	
	Запрос.УстановитьПараметр("СчетаЗатрат",        СчетаЗатрат);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	Запрос.УстановитьПараметр("ВидыСубконто",  ВидыСубконто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоПрямымЗатратам()

// Процедура формирования движений по прямым затратам по переделу
// Производит распределение прямых расходов, учтенных на счетах 231 и 232,
// на стоимость продукции (услуг).
// Распределяются только те прямые расходы, для которых установлен текущий номер передела.
//
//	Параметры:
//		НомерПередела - Число - номер передела;
//		ВыполненоРаспределениеОПР - Булево - определяет на данный момент выполнено ли
//			распределение общепроизводственных и общехозяйственных расходов.
//
Процедура ДвиженияПоПрямымЗатратам(СтруктураШапкиДокумента, ПеределПодразделение = "", ПеределНоменклатурнаяГруппа = "", ВыполненоРаспределениеОПР = Ложь, МассивНоменклатуры, СтруктураДопПараметров)
	
	Если Не ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента.Дата, Истина, СтруктураШапкиДокумента.Организация, "Бух").ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам Тогда
		ДвиженияПоПрямымЗатратамПоУслугам(СтруктураШапкиДокумента, СтруктураДопПараметров, ВыполненоРаспределениеОПР);
	КонецЕсли;
	
	// Формирование запроса по прямым расходам.
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоПрямымЗатратам(СтруктураШапкиДокумента, ПеределПодразделение, ПеределНоменклатурнаяГруппа, РезультатЗапроса, СтруктураДопПараметров, ВыполненоРаспределениеОПР);
	
	ЗаписьРасчетаСебестоимости = СтруктураДопПараметров.ЗаписьРасчетаСебестоимости;
	
	// Выбираются прямые расходы в разрезе счета учета, подразделения, номенклатурной группы.
	ОбходПоСчетамЗатарт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоСчетамЗатарт.Следующий() Цикл
		ОбходПоПодразделениям = ОбходПоСчетамЗатарт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоПодразделениям.Следующий() Цикл
			ОбходПоНомГруппам = ОбходПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходПоНомГруппам.Следующий() Цикл
				
				// Прямые расходы за минусом НЗП подлежат распределению
				// на стоимость готовой продукции, услуг.
				// Т.к. при оприходовании на склад готовой продукции часть прямых
				// расходов (в размере плановой стоимости этой продукции) была
				// списана, то необходимо к общей сумме прямых расходов прибавить
				// списанную ранее сумму прямых расходов.
				
				СписаноРасходов = ОбходПоНомГруппам.СписаноРасходов;
				ВсегоПрямыхРасходов = ОбходПоНомГруппам.ОстатокПрямыхРасходов + ?(ВыполненоРаспределениеОПР, 0, СписаноРасходов);
				СуммаНЗП = ОбходПоНомГруппам.СуммаНЗП;
				СуммаНЗПНУ = ОбходПоНомГруппам.СуммаНЗПНУ;
				СуммаПрямыхРасходовНаВыпуск = ВсегоПрямыхРасходов - СуммаНЗП;
				ВсегоПрямыхРасходовНУ = ОбходПоНомГруппам.ОстатокПрямыхРасходовНУ + ?(ВыполненоРаспределениеОПР, 0, СписаноРасходов);
				СуммаПрямыхРасходовНаВыпускНУ = ВсегоПрямыхРасходовНУ - СуммаНЗПНУ;
				
				// В качестве базы распределения прямых расходов на выпущенную продукцию
				// используется плановая себестоимость.
				ВсегоБазаРаспределения = ОбходПоНомГруппам.ПлановаяСтоимость;
				РаспределеноБазыРаспределения = 0;
				СписаноПрямыхРасходов = 0;
				СписаноПрямыхРасходовНУ = 0;
				
				ПоследнийПередел = (Лев(СтруктураДопПараметров.РасчетПрямыхЗатратНомер, 1) = "1" Или СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "");
				Если ПоследнийПередел И НЕ ВыполненоРаспределениеОПР И НЕ СуммаНЗП = 0 Тогда
					СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
					СтрокаЗаписиРасчетаСебестоимости.СчетУчета = ОбходПоСчетамЗатарт.СчетЗатрат;
					СтрокаЗаписиРасчетаСебестоимости.Подразделение = ОбходПоПодразделениям.Подразделение;
					СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа = ОбходПоНомГруппам.НоменклатурнаяГруппа;
					СтрокаЗаписиРасчетаСебестоимости.ВидОперации = Перечисления.ВидыОперацийРасчетаСебестоимости.РасходыНаПроизводствоПродукцииИУслуг;
					СтрокаЗаписиРасчетаСебестоимости.СуммаНЗП =  СуммаНЗП;
					СтрокаЗаписиРасчетаСебестоимости.СуммаНЗПНУ =  СуммаНЗПНУ;
					СтрокаЗаписиРасчетаСебестоимости.Сумма    =  0;
					СтрокаЗаписиРасчетаСебестоимости.СуммаНУ  =  0;
					СтрокаЗаписиРасчетаСебестоимости.СуммаПлан=  0;
				КонецЕсли;	
				
				
				// Обход по операциям выпуска продукции (услуг). Обходя все операции выпуска
				// производим распределение по ним прямых расходов.
				ТаблицаКорректируемыхНаправлений = Новый ТаблицаЗначений;
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Продукция");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НоменклатурнаяПозиция");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ХарактеристикаНоменклатуры");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СерияНоменклатуры");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Заказ");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Качество");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Подразделение");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НоменклатурнаяГруппа");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НалоговоеНазначениеДоходовИЗатрат");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СубконтоСписания1");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СубконтоСписания2");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СубконтоСписания3");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СубконтоСписания4");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СчетСписания");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СчетЗатрат");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Количество");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаКорректировкиСписания");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаКорректировкиСписанияНУ");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СписаноРасходов");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ПлановаяСтоимость");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаНЗП");
				ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаНЗПНУ");
				
				СуммаНеКорректируемыхНаправлений = 0;
				СуммаНеКорректируемыхНаправленийНУ = 0;
				
				Обход = ОбходПоНомГруппам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				СуммаКорректировкиСписанияИтог = 0;
				Пока Обход.Следующий() Цикл
					
					РаспределеноБазыРаспределения = РаспределеноБазыРаспределения + Обход.ПлановаяСтоимость;
					
					Если ВсегоБазаРаспределения = 0 Тогда
						СуммаСписания = 0;
						СуммаСписанияНУ = 0;
					Иначе
						СуммаСписания = Окр(СуммаПрямыхРасходовНаВыпуск/ВсегоБазаРаспределения*РаспределеноБазыРаспределения, 2) - СписаноПрямыхРасходов;
						СуммаСписанияНУ = Окр(СуммаПрямыхРасходовНаВыпускНУ/ВсегоБазаРаспределения*РаспределеноБазыРаспределения, 2) - СписаноПрямыхРасходовНУ;
					КонецЕсли;
					СписаноПрямыхРасходов = СписаноПрямыхРасходов + СуммаСписания;
					СписаноПрямыхРасходовНУ = СписаноПрямыхРасходовНУ + СуммаСписанияНУ;
					
					Если ВыполненоРаспределениеОПР Тогда
						СуммаКорректировкиСписания = СуммаСписания;
						СуммаКорректировкиСписанияНУ = СуммаСписанияНУ;
					Иначе
						СуммаКорректировкиСписания = СуммаСписания - Обход.СписаноРасходов;
						СуммаКорректировкиСписанияНУ = СуммаСписанияНУ - Обход.СписаноРасходов;
					КонецЕсли; 
					
					Если Найти("ПоСредней", СтруктураДопПараметров.РасчетПрямыхЗатратНомер) = 0 Тогда
						Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
							УровеньВстречногоВыпуска = (Лев(СтруктураДопПараметров.РасчетПрямыхЗатратНомер, 1) = "3");						
						КонецЕсли;
					Иначе
						УровеньВстречногоВыпуска =  Ложь;
					КонецЕсли;
					
					Если УровеньВстречногоВыпуска И СтруктураДопПараметров.РасчетПрямыхЗатратНомер <> "3ПоCредней" Тогда
						
						ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, Продукция, СубконтоКт2, СубконтоКт3", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.СубконтоСписания1, Обход.СубконтоСписания2, Обход.СубконтоСписания3));
						Если ВстречныйВыпуск.Количество() > 0 Тогда
							СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
							СуммаНеКорректируемыхНаправленийНУ = СуммаНеКорректируемыхНаправленийНУ + СуммаКорректировкиСписанияНУ;
							Продолжить;
						Иначе
							ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, Продукция, СубконтоКт2", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.СубконтоСписания1, Обход.СубконтоСписания2));
							Если ВстречныйВыпуск.Количество() > 0 Тогда
								СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
								СуммаНеКорректируемыхНаправленийНУ = СуммаНеКорректируемыхНаправленийНУ + СуммаКорректировкиСписанияНУ;
								Продолжить;
							КонецЕсли;							
							
							ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, ПодразделениеПересчета", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.СубконтоСписания1));
							Если ВстречныйВыпуск.Количество() > 0 Тогда
								СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
								СуммаНеКорректируемыхНаправленийНУ = СуммаНеКорректируемыхНаправленийНУ + СуммаКорректировкиСписанияНУ;
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					НоваяСтрока = ТаблицаКорректируемыхНаправлений.Добавить();
					НоваяСтрока.Продукция            		= Обход.Продукция;
					НоваяСтрока.НоменклатурнаяПозиция		= Обход.НоменклатурнаяПозиция;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= Обход.ХарактеристикаНоменклатуры;
					НоваяСтрока.СерияНоменклатуры 			= Обход.СерияНоменклатуры;
					НоваяСтрока.Заказ 						= Обход.Заказ;
					НоваяСтрока.Качество 					= Обход.Качество;
					НоваяСтрока.Подразделение        		= Обход.Подразделение;
					НоваяСтрока.НоменклатурнаяГруппа 		= Обход.НоменклатурнаяГруппа;
					НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат = Обход.НалоговоеНазначениеДоходовИЗатрат;
					НоваяСтрока.СубконтоСписания1    		= Обход.СубконтоСписания1;
					НоваяСтрока.СубконтоСписания2    		= Обход.СубконтоСписания2;
					НоваяСтрока.СубконтоСписания3    		= Обход.СубконтоСписания3;
					НоваяСтрока.СубконтоСписания4    		= Обход.СубконтоСписания4;
					НоваяСтрока.СчетСписания         		= Обход.СчетСписания;
					НоваяСтрока.СчетЗатрат           		= Обход.СчетЗатрат;
					НоваяСтрока.Количество           		= Обход.Количество;
					НоваяСтрока.СуммаКорректировкиСписания 	= СуммаКорректировкиСписания;
					НоваяСтрока.СуммаКорректировкиСписанияНУ= СуммаКорректировкиСписанияНУ;
					НоваяСтрока.СписаноРасходов				= ?(ВыполненоРаспределениеОПР, 0, Обход.СписаноРасходов);
					
					НоваяСтрока.ПлановаяСтоимость   		= Обход.ПлановаяСтоимость;
					НоваяСтрока.СуммаНЗП            		= Обход.СуммаНЗП;
					НоваяСтрока.СуммаНЗПНУ                  = Обход.СуммаНЗПНУ;
					
				КонецЦикла; // по направлениям выпуска продукции (услуг)
				
				ВсегоКорректировок = ТаблицаКорректируемыхНаправлений.Итог("СуммаКорректировкиСписания");
				ВсегоКорректировокНУ = ТаблицаКорректируемыхНаправлений.Итог("СуммаКорректировкиСписанияНУ");
				
				КоэффициентРаспределенияНекорректируемойСуммы = ?(ВсегоКорректировок = 0, 0, СуммаНеКорректируемыхНаправлений / ВсегоКорректировок);
				КоэффициентРаспределенияНекорректируемойСуммыНУ = ?(ВсегоКорректировокНУ = 0, 0, СуммаНеКорректируемыхНаправленийНУ / ВсегоКорректировокНУ);
				
				Для Каждого Обход Из ТаблицаКорректируемыхНаправлений Цикл
					СуммаКорректировкиСписания = Обход.СуммаКорректировкиСписания * (1 + КоэффициентРаспределенияНекорректируемойСуммы);
					СуммаКорректировкиСписанияНУ = Обход.СуммаКорректировкиСписанияНУ * (1 + КоэффициентРаспределенияНекорректируемойСуммыНУ);
					СписаноРасходов = Обход.СписаноРасходов * (1 + КоэффициентРаспределенияНекорректируемойСуммы);
					СписаноРасходовНУ = Обход.СписаноРасходов * (1 + КоэффициентРаспределенияНекорректируемойСуммыНУ);
					// Формирование проводок по списанию
					Если СуммаКорректировкиСписания <> 0 ИЛИ СуммаКорректировкиСписанияНУ <> 0 Тогда
						// Проводка Дт 26 Кт 23 на сумму отклонений
						НоваяПроводка = мОперация.Добавить();
						НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
						НоваяПроводка.Активность  = Истина;
						НоваяПроводка.Период      = Дата;
						НоваяПроводка.Содержание  = "Корректировка выпуска продукции (услуг)";
						
						НоваяПроводка.Сумма       = СуммаКорректировкиСписания;
						НоваяПроводка.СуммаНУДт       = СуммаКорректировкиСписанияНУ;
						НоваяПроводка.СуммаНУКт       = СуммаКорректировкиСписанияНУ;
						НоваяПроводка.НалоговоеНазначениеДт = Обход.НалоговоеНазначениеДоходовИЗатрат;
						НоваяПроводка.НалоговоеНазначениеКт = Обход.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве;
						
						НоваяПроводка.СчетДт = Обход.СчетСписания;
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Обход.СубконтоСписания1);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Обход.СубконтоСписания2);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Обход.СубконтоСписания3);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 4, Обход.СубконтоСписания4);
						
						НоваяПроводка.СчетКт = Обход.СчетЗатрат;
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "НоменклатурныеГруппы", Обход.НоменклатурнаяГруппа);
						
						// Добавим в таблицу список номенклатуры, у которой изменилась средневзвешенная
						// стоимость и, следовательно, необходимо выполнить корректировку списаний.
						Для НомерСубконто = 1 По 2 Цикл
							Если ТипЗнч(Обход["СубконтоСписания" + НомерСубконто]) = Тип("СправочникСсылка.Номенклатура") Тогда
								МассивНоменклатуры.Добавить(Обход["СубконтоСписания" + НомерСубконто]);
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
	
					СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
					СтрокаЗаписиРасчетаСебестоимости.СчетУчета = ОбходПоСчетамЗатарт.СчетЗатрат;
					СтрокаЗаписиРасчетаСебестоимости.Подразделение = ОбходПоПодразделениям.Подразделение;
					СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа = ОбходПоНомГруппам.НоменклатурнаяГруппа;
					СтрокаЗаписиРасчетаСебестоимости.Продукция = Обход.СубконтоСписания1;
					СтрокаЗаписиРасчетаСебестоимости.СуммаПлан = Обход.ПлановаяСтоимость;
					СтрокаЗаписиРасчетаСебестоимости.ДокументВыпуска = Строка(Обход.СубконтоСписания2) + " " + Строка(Обход.СубконтоСписания3);
					СтрокаЗаписиРасчетаСебестоимости.ВидОперации = Перечисления.ВидыОперацийРасчетаСебестоимости.ВыпускПродукцииИУслуг;
					СтрокаЗаписиРасчетаСебестоимости.Сумма = СуммаКорректировкиСписания;
					СтрокаЗаписиРасчетаСебестоимости.СуммаНУ = СуммаКорректировкиСписанияНУ;
					
				КонецЦикла
				
			КонецЦикла; // по номенклатурным группам
		КонецЦикла; // по подразделениям
	КонецЦикла; // по счетам учета прямых затрат
			
	мОперация.Записать(Ложь);
	
КонецПроцедуры // ДвиженияПоПрямымЗатратам()

// Процедура списыват затраты по услугам, реализация которых отражена 
// без отражения выпуска в плановых ценах
Процедура ДвиженияПоПрямымЗатратамПоУслугам(СтруктураШапкиДокумента, СтруктураДопПараметров, ВыполненоРаспределениеОПР, Отказ = Ложь)
   
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",               мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",               мКонМесяца);
	
	Запрос.УстановитьПараметр("НачГраница",            мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",            мКонГраница);
	
	Запрос.Текст = 
  "ВЫБРАТЬ
   |	ХозрасчетныйОстатки.Счет КАК Счет,
   |	ХозрасчетныйОстатки.Субконто1 КАК Подразделение,
   |	ХозрасчетныйОстатки.Субконто2 КАК НоменклатурнаяГруппа,
   |	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0)) КАК ОстатокПрямыхРасходов,
   |	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУОстатокДт, 0)) КАК ОстатокПрямыхРасходовНУ,
   |	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаБУ, 0)) КАК СуммаНЗП,
   |	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаНУ, 0)) КАК СуммаНЗПНУ,
   |	РеализацияУслуг.СчетРасходов КАК СчетРасходов,
   |	РеализацияУслуг.НалоговоеНазначениеДоходовИЗатрат КАК НалоговоеНазначениеДоходовИЗатрат,
   |	РеализацияУслуг.СтатьяЗатрат КАК СтатьяЗатрат,
   |	РеализацияУслуг.СуммаОборот КАК Выручка
   |ИЗ
   |	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонГраница, Счет В ИЕРАРХИИ (&Счета), , Организация = &ТекстУсловия) КАК ХозрасчетныйОстатки
   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
   |			РеализацияУслугОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
   |			РеализацияУслугОбороты.СчетРасходов КАК СчетРасходов,
   |			РеализацияУслугОбороты.НалоговоеНазначениеДоходовИЗатрат КАК НалоговоеНазначениеДоходовИЗатрат,
    |			РеализацияУслугОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
   |			СУММА(ЕСТЬNULL(РеализацияУслугОбороты.СуммаОборот, 0)) КАК СуммаОборот
   |		ИЗ
   |			РегистрНакопления.РеализацияУслуг.Обороты(&НачГраница, &КонГраница, , Организация = &Организация) КАК РеализацияУслугОбороты
   |		
   |		СГРУППИРОВАТЬ ПО
   |			РеализацияУслугОбороты.НоменклатурнаяГруппа,
   |			РеализацияУслугОбороты.СчетРасходов,
   |			РеализацияУслугОбороты.НалоговоеНазначениеДоходовИЗатрат,
   |			РеализацияУслугОбороты.СтатьяЗатрат) КАК РеализацияУслуг
   |		ПО ХозрасчетныйОстатки.Субконто2 = РеализацияУслуг.НоменклатурнаяГруппа
   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
   |			ИнвентаризацияНЗП.СчетЗатрат КАК СчетЗатрат,
   |			ИнвентаризацияНЗП.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
   |			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
   |			СУММА(ИнвентаризацияНЗПСостав.СуммаБУ) КАК СуммаБУ,
   |			СУММА(ИнвентаризацияНЗПСостав.СуммаНУ) КАК СуммаНУ
   |		ИЗ
   |			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
   |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
   |				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
   |		ГДЕ
   |			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата
   |			И ИнвентаризацияНЗП.Организация = &Организация
   |			И (НЕ ИнвентаризацияНЗП.ПометкаУдаления)
   |		
   |		СГРУППИРОВАТЬ ПО
   |			ИнвентаризацияНЗП.СчетЗатрат,
   |			ИнвентаризацияНЗП.ПодразделениеОрганизации,
   |			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа) КАК ОстаткиНЗП
   |		ПО ХозрасчетныйОстатки.Субконто2 = ОстаткиНЗП.НоменклатурнаяГруппа
   |			И ХозрасчетныйОстатки.Счет = ОстаткиНЗП.СчетЗатрат
   |			И ХозрасчетныйОстатки.Субконто1 = ОстаткиНЗП.ПодразделениеОрганизации
   |
   |СГРУППИРОВАТЬ ПО
   |	ХозрасчетныйОстатки.Счет,
   |	ХозрасчетныйОстатки.Субконто1,
   |	РеализацияУслуг.СчетРасходов,
   |	РеализацияУслуг.НалоговоеНазначениеДоходовИЗатрат,
   |	РеализацияУслуг.СтатьяЗатрат,
   |	РеализацияУслуг.СуммаОборот,
   |	ХозрасчетныйОстатки.Субконто2
   |ИТОГИ
   |	МАКСИМУМ(ОстатокПрямыхРасходов),
   |	МАКСИМУМ(СуммаНЗП),
   |	СУММА(Выручка),
   |	МАКСИМУМ(ОстатокПрямыхРасходовНУ),
   |	МАКСИМУМ(СуммаНЗПНУ)
   |ПО
   |	Счет,
   |	Подразделение,
   |	НоменклатурнаяГруппа";
   
	Массив = Новый Массив;	
	
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &ТекстУсловия", "Организация = &Организация");
	
	Запрос.УстановитьПараметр("Организация",       СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("Счета", Массив);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаписьРасчетаСебестоимости = СтруктураДопПараметров.ЗаписьРасчетаСебестоимости;
	
	ОбходПоСчетамЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоСчетамЗатрат.Следующий() Цикл
		ОбходПоПодразделениям = ОбходПоСчетамЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоПодразделениям.Следующий() Цикл
			ОбходПоНомГруппам = ОбходПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходПоНомГруппам.Следующий() Цикл
				
				Если ОбходПоНомГруппам.Выручка = NULL Тогда
					Продолжить;
				КонецЕсли;
				
				// Прямые расходы за минусом НЗП подлежат распределению
				// на стоимость готовой продукции, услуг.
				// Т.к. при оприходовании на склад готовой продукции часть прямых
				// расходов (в размере плановой стоимости этой продукции) была
				// списана, то необходимо к общей сумме прямых расходов прибавить
				// списанную ранее сумму прямых расходов.
				
				// В качестве базы распределения прямых расходов на услуги без плановых цен 
				// используется выручка
				ВсегоБазаРаспределения = ОбходПоНомГруппам.Выручка;
				
				Обход = ОбходПоНомГруппам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Обход.Следующий() Цикл
					
					ВсегоПрямыхРасходов = ОбходПоНомГруппам.ОстатокПрямыхРасходов;
					ВсегоПрямыхРасходовНУ = ОбходПоНомГруппам.ОстатокПрямыхРасходовНУ;
					
					СуммаНЗП = ОбходПоНомГруппам.СуммаНЗП;
					СуммаНЗПНУ = ОбходПоНомГруппам.СуммаНЗПНУ;
					
					СуммаПрямыхРасходовНаВыпуск = ВсегоПрямыхРасходов - СуммаНЗП;
					СуммаПрямыхРасходовНаВыпускНУ = ВсегоПрямыхРасходовНУ - СуммаНЗПНУ;
					
					Если ВсегоБазаРаспределения = 0 Тогда
						СуммаСписания = 0;
						СуммаСписанияНУ = 0;
					Иначе
						СуммаСписания = Окр(СуммаПрямыхРасходовНаВыпуск*Обход.Выручка/ВсегоБазаРаспределения, 2);
						СуммаСписанияНУ = Окр(СуммаПрямыхРасходовНаВыпускНУ*Обход.Выручка/ВсегоБазаРаспределения, 2);
					КонецЕсли;
					
					СуммаКорретировкиСписания = СуммаСписания;
					СуммаКорретировкиСписанияНУ = СуммаСписанияНУ;
					
					Если СуммаКорретировкиСписания <> 0 Тогда
						
						// Проводка типа Дт 902 Кт 23 на сумму отклонений
						НоваяПроводка = мОперация.Добавить();
						НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
						НоваяПроводка.Активность  = Истина;
						НоваяПроводка.Период      = Дата;
						НоваяПроводка.Содержание  = НСтр("ru='Корректировка выпуска продукции (услуг)';uk='Коригування випуску продукції (послуг)'",Локализация.КодЯзыкаИнформационнойБазы());
						
						НоваяПроводка.Сумма       = СуммаКорретировкиСписания;
						
						НоваяПроводка.СчетДт = Обход.СчетРасходов;
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", Обход.НоменклатурнаяГруппа);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат", Обход.СтатьяЗатрат);
						
						НоваяПроводка.СчетКт = Обход.Счет;
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
						ОбщегоНазначения.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "НоменклатурныеГруппы", Обход.НоменклатурнаяГруппа);
						
						Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
							НоваяПроводка.СуммаНУДт = СуммаКорретировкиСписанияНУ;
							НоваяПроводка.НалоговоеНазначениеДт = Обход.НалоговоеНазначениеДоходовИЗатрат;
						КонецЕсли;
						Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
							НоваяПроводка.СуммаНУКт = СуммаКорретировкиСписанияНУ;
							НоваяПроводка.НалоговоеНазначениеКт = Обход.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве;
						КонецЕсли;
						
						Если Не СуммаКорретировкиСписания = 0 Тогда
							
							СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
							СтрокаЗаписиРасчетаСебестоимости.СчетУчета = ОбходПоСчетамЗатрат.Счет;
							СтрокаЗаписиРасчетаСебестоимости.Подразделение = ОбходПоПодразделениям.Подразделение;
							СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа = ОбходПоНомГруппам.НоменклатурнаяГруппа;
							СтрокаЗаписиРасчетаСебестоимости.СуммаПлан = 0;
							СтрокаЗаписиРасчетаСебестоимости.ВидОперации = Перечисления.ВидыОперацийРасчетаСебестоимости.УслугиБезИспользованияПлановыхЦен;
							СтрокаЗаписиРасчетаСебестоимости.Сумма = СуммаКорретировкиСписания;
							СтрокаЗаписиРасчетаСебестоимости.СуммаНУ = СуммаКорретировкиСписанияНУ;
							СтрокаЗаписиРасчетаСебестоимости.СуммаНЗП =  СуммаНЗП;
							СтрокаЗаписиРасчетаСебестоимости.СуммаНЗПНУ =  СуммаНЗПНУ;
						КонецЕсли;
						
						
					КонецЕсли;
					
				КонецЦикла; // по направлениям выпуска продукции (услуг)

			КонецЦикла; // по номенклатурным группам
		КонецЦикла; // по подразделениям
	КонецЦикла; // по счетам учета прямых затрат
			
	мОперация.Записать(Ложь);
КонецПроцедуры

// Процедура производит корректировку стоимости списания
// выпущенной в текущем месяце продукции.
Процедура КорректировкаСтоимостиСписанияВыпущеннойПродукции(СтруктураШапкиДокумента, МассивНоменклатуры, ВыполненоРаспределениеОПР, СтруктураДопПараметров)

	// Формирование корректировки стомисти списаний, исходя из среденвзвешенной стоимости номенклатуры
	СтруктураДопПараметров.Вставить("Учет",           ?(СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, "Бух", "Нал"));
	СтруктураДопПараметров.Вставить("Организация",    СтруктураШапкиДокумента.Организация);
	СтруктураДопПараметров.Вставить("Период",         Дата);
	СтруктураДопПараметров.Вставить("Регистратор",    Ссылка);
	СтруктураДопПараметров.Вставить("ТаблицаТоваров", МассивНоменклатуры);
	
	// После закрытия общепроизводственных расходов необходимо,
	// чтобы не корректировалось спиание номенклатуры в дебет
	// счета 91
	Если ВыполненоРаспределениеОПР Тогда
		
		// Массив счетов по которым не надо делать корректировку операций списания
		МассивСчетов = Новый Массив;

		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		
		СтруктураДопПараметров.Вставить("СписокНеКорректируемыхСчетов", МассивСчетов);
		
	Иначе
		СтруктураДопПараметров.Вставить("СписокНеКорректируемыхСчетов", Неопределено);
	КонецЕсли;
	
	КорректировкаСтоимости.КорректировкаСтоимости(МассивНоменклатуры, мНачМесяца, КонецМесяца(мКонМесяца), СтруктураДопПараметров);
	
	мОперация.Записать(Ложь);
	
КонецПроцедуры

Функция РасчетПорядкаПеределов(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	СпособРасчетаСебестоимостиПроизводства = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента.Дата, Ложь, СтруктураШапкиДокумента.Организация, "Бух").СпособРасчетаСебестоимостиПроизводства;
	
	Если СпособРасчетаСебестоимостиПроизводства  = Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам Тогда
		
		СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПеределам";
		ПорядокПеределов = ПолучитьПорядокПеределов(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
	Иначе
		
		СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПодразделениям";
		ПроверкаПорядкаЗакрытияПодразделений(СтруктураШапкиДокумента);
		ПорядокПеределов = ПолучитьПорядокПодразделений(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
	КонецЕсли;
	
КонецФункции 

Функция АнализДанныхПроизводства(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	// Модель производства в виде последовательности цепочек:
	//ГП(готовая продукция),
	//Подразделение,
	//ном.группа,
	//Номенклатура, израсходованная на производство, в этом подразделении и на эту ном.группу, а значит и на эту ГП
	//счет учета затрат производства
	
	СчетаЗатрат = Новый Массив;
	
	ПС = ПланыСчетов.Хозрасчетный;
	
	РазрешитьУчетУслугБезПлановыхЦен = Не ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Ложь, СтруктураШапкиДокумента.Организация, "Бух").ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам;
	
	СчетаЗатрат.Добавить(ПС.ОсновноеПроизводство);
	СчетаЗатрат.Добавить(ПС.ВспомогательныеПроизводства);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗатрат.Источник КАК Источник,
	|	ТаблицаЗатрат.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаЗатрат.Подразделение) КАК ПодразделениеПредставление,
	|	ТаблицаЗатрат.КонечныйОстатокОПЗ КАК КонечныйОстатокОПЗ, 
	|	ЕСТЬNULL(ТаблицаГП.НоменклатурнаяГруппа, ТаблицаЗатрат.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТаблицаГП.НоменклатурнаяГруппа, ТаблицаЗатрат.НоменклатурнаяГруппа)) КАК НоменклатурнаяГруппаПредставление,
	|	ЕСТЬNULL(ТаблицаГП.ГП, ""NULL"") КАК ГП,
	|	ТаблицаЗатрат.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаЗатрат.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаЗатрат.НоменклатураЗатрат) КАК НоменклатураЗатратПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Источник,
	|		0 КАК КонечныйОстатокОПЗ,
	|		ХозрасчетныйОбороты.СубконтоДт1 КАК Подразделение,
	|		ХозрасчетныйОбороты.СубконтоДт2 КАК НоменклатурнаяГруппа,
	|		ХозрасчетныйОбороты.СчетДт КАК СчетЗатрат,
	|		ХозрасчетныйОбороты.СубконтоКт1 КАК НоменклатураЗатрат
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&Счета), , (НЕ СчетКт В ИЕРАРХИИ (&Счета)), , Организация = &Организация) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	
	|	ВЫБРАТЬ
	|		1,
	|		0 КАК КонечныйОстатокОПЗ,
	|		ХозрасчетныйОбороты.СубконтоДт1,
	|		ХозрасчетныйОбороты.СубконтоДт2,
	|		ХозрасчетныйОбороты.СчетДт,
	|		ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Продукция
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			СчетЗатрат В ИЕРАРХИИ (&Счета)
	|			    И Организация = &Организация) КАК ВыпускПродукцииУслугБухгалтерскийУчетОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&Счета), , СчетКт В ИЕРАРХИИ (&Счета), , Организация = &Организация) КАК ХозрасчетныйОбороты
	|			ПО ВыпускПродукцииУслугБухгалтерскийУчетОбороты.СчетЗатрат = ХозрасчетныйОбороты.СчетКт
	|				И ВыпускПродукцииУслугБухгалтерскийУчетОбороты.НоменклатурнаяГруппа = ХозрасчетныйОбороты.СубконтоКт2
	|				И ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Подразделение = ХозрасчетныйОбороты.СубконтоКт1
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		0 КАК КонечныйОстатокОПЗ,
	|		ВложенныйЗапрос.Субконто1,
	|		ВложенныйЗапрос.Субконто2,
	|		ВложенныйЗапрос.Счет,
	|		ХозрасчетныйОбороты.СубконтоКт1
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|			ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	|			ХозрасчетныйОстатки.Счет КАК Счет
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(&НачДата, Счет В ИЕРАРХИИ (&Счета), , Организация = &Организация) КАК ХозрасчетныйОстатки) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&Счета), , , , Организация = &Организация) КАК ХозрасчетныйОбороты
	|			ПО ХозрасчетныйОбороты.СубконтоДт1 = ВложенныйЗапрос.Субконто1
	|				И ХозрасчетныйОбороты.СубконтоДт2 = ВложенныйЗапрос.Субконто2
	|				И ХозрасчетныйОбороты.СчетДт = ВложенныйЗапрос.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		2,
	|		ЕСТЬNULL(КонОстаткиОПЗ.СуммаОстаток, 0) КАК КонечныйОстатокОПЗ,
	|		ХозрасчетныйОборотыДтКт.СубконтоДт1,
	|		NULL,
	|		ХозрасчетныйОборотыДтКт.СчетДт,
	|		&ПустаяСтатьяЗатрат
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&СчетаОбщихЗатрат), , , , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|			ЛЕВОЕ СОЕДИНЕНИЕ 
    |				РегистрБухгалтерии.Хозрасчетный.Остатки(&КонГраница, Счет В ИЕРАРХИИ (&СчетаОбщихЗатрат), , Организация = &Организация) КАК КонОстаткиОПЗ
    |			ПО 
    |				ХозрасчетныйОборотыДтКт.СубконтоДт1 = КонОстаткиОПЗ.Субконто1  // по подразделению
	|	
	| ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		0 КАК КонечныйОстатокОПЗ,
	|		ВыпускПродукцииУслугБухгалтерскийУчетОбороты.СубконтоСписания1,
	|		ВыпускПродукцииУслугБухгалтерскийУчетОбороты.СубконтоСписания2,
	|		ВыпускПродукцииУслугБухгалтерскийУчетОбороты.СчетСписания,
	|		ВыпускПродукцииУслугБухгалтерскийУчетОбороты.НоменклатурнаяГруппа
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			Месяц,
	|			СчетЗатрат В ИЕРАРХИИ (&Счета)
	|				И ПрямыеРасходыРаспределятьПоКоличеству
	|				И Организация = &Организация) КАК ВыпускПродукцииУслугБухгалтерскийУчетОбороты) КАК ТаблицаЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Подразделение КАК Подразделение,
	|			ВыпускПродукцииУслугБухгалтерскийУчетОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ВыпускПродукцииУслугБухгалтерскийУчетОбороты.СчетЗатрат КАК СчетЗатрат,
	|			ВЫБОР
	|				КОГДА ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Продукция.Услуга
	|					ТОГДА ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Подразделение
	|				ИНАЧЕ ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Продукция
	|			КОНЕЦ КАК ГП
	|		ИЗ
	|			РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(
	|				&НачДата,
	|				&КонДата,
	|				,
	|				СчетЗатрат В ИЕРАРХИИ (&Счета)
	|					И Организация = &Организация) КАК ВыпускПродукцииУслугБухгалтерскийУчетОбороты
	|
	|
    |		ОБЪЕДИНИТЬ ВСЕ
    |		
    |		ВЫБРАТЬ
    |			ВложенныйЗапрос.СубконтоДт1,
    |			РеализацияУслугОбороты.НоменклатурнаяГруппа,
    |			ВложенныйЗапрос.СчетДт,
    |			&ПустаяНоменклатура
    |		ИЗ
    |			РегистрНакопления.РеализацияУслуг.Обороты КАК РеализацияУслугОбороты
    |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
    |					ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
    |					ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
    |					ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2
    |				ИЗ
    |					РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&Счета), , , , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт) КАК ВложенныйЗапрос
    |				ПО РеализацияУслугОбороты.НоменклатурнаяГруппа = ВложенныйЗапрос.СубконтоДт2
    |		
    |		ОБЪЕДИНИТЬ ВСЕ
    |		
    |		ВЫБРАТЬ
    |			ИнвентаризацияНЗП.ПодразделениеОрганизации,
    |			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа,
    |			ИнвентаризацияНЗП.СчетЗатрат,
    |			&ПустаяНоменклатура
    |		ИЗ
    |			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
    |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
    |				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
    |		ГДЕ
    |			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата
    |			И ИнвентаризацияНЗП.СчетЗатрат В ИЕРАРХИИ (&Счета)
    |			И ИнвентаризацияНЗП.Организация = &Организация
    |			И (НЕ ИнвентаризацияНЗП.ПометкаУдаления)) КАК ТаблицаГП
	|		ПО ТаблицаГП.Подразделение = ТаблицаЗатрат.Подразделение
	|			И (ВЫБОР
	|				КОГДА ТаблицаЗатрат.Источник = 1
	|					ТОГДА ВЫБОР
	|								КОГДА ТаблицаГП.СчетЗатрат = ТаблицаЗатрат.СчетЗатрат
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|							И ВЫБОР
	|								КОГДА ТаблицаЗатрат.НоменклатурнаяГруппа ССЫЛКА Справочник.НоменклатурныеГруппы
	|									ТОГДА ВЫБОР
	|											КОГДА ТаблицаЗатрат.НоменклатурнаяГруппа = ТаблицаГП.НоменклатурнаяГруппа
	|												ТОГДА ИСТИНА
	|											ИНАЧЕ ЛОЖЬ
	|										КОНЕЦ
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ = ИСТИНА)";
	
	
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("КонГраница",  мКонГраница);
	
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	СчетаЗатрат = Новый Массив;
	ПС = ПланыСчетов.Хозрасчетный;
	СчетаЗатрат.Добавить(ПС.ОсновноеПроизводство);
	СчетаЗатрат.Добавить(ПС.ВспомогательныеПроизводства);
	Запрос.УстановитьПараметр("Счета",       СчетаЗатрат);
	
	СчетаОбщихРасх = Новый Массив;
	СчетаОбщихРасх.Добавить(ПС.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("СчетаОбщихЗатрат", СчетаОбщихРасх);
	
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Результат);
	
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ГП");
	ЭлементОтбора.ВидСравнения = ВидСравнения.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.Значение = "NULL";
	ПостроительЗапроса.Выполнить();
	ТаблицаПроизводства = ПостроительЗапроса.Результат.Выгрузить();
	
	ТаблицаПроизводства.Колонки.Удалить("Источник");

	ПостроительЗапроса.Отбор.Сбросить();
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ГП");
	ЭлементОтбора.Установить("NULL");
	ПостроительЗапроса.Выполнить();
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Источник = 1 Тогда // прямые затраты			
			Если ТаблицаНеЗакрытыхПодразделений.НайтиСтроки(Новый Структура("Подразделение, СчетЗатрат", Выборка.Подразделение, Выборка.СчетЗатрат)).Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;			
			
			Если СчетаЗатрат.Найти(Выборка.СчетЗатрат) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			ТекстСообщения = Локализация.СтрШаблон1("Нет базы распределения на себестоимость продукции (услуг) прямых расходов, учитываемых следующим образом:"
"Счет учета: ¤1¤."
"Подразделение: ¤2¤."
"Номенклатурная группа: ¤3¤."
"База распределения: плановая себестоимость продукции.", Выборка.СчетЗатрат, Выборка.Подразделение, Выборка.НоменклатурнаяГруппа);
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, ,ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект)), СтатусСообщения.Важное);
			
			Строка = ТаблицаНеЗакрытыхПодразделений.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.СчетЗатрат = Выборка.СчетЗатрат;

		
		ИначеЕсли Выборка.Источник = 2 Тогда // общие затраты		
			Если ТаблицаНеЗакрытыхПодразделений.Найти(Выборка.Подразделение, "Подразделение") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			Если Выборка.КонечныйОстатокОПЗ = 0 Тогда
				// Если конечный остаток для ОПЗ = 0, распределять это ОПЗ не будем, сообщение для него не выводим
				Продолжить;
			КонецЕсли; 
			
			ТекстСообщения = Локализация.СтрШаблон1("Общепроизводственные затраты, учитываемые следующим образом:"
"Счет учета: ¤1¤."
"Подразделение: ¤2¤.", Выборка.СчетЗатрат, Выборка.Подразделение);	
			
			ТекстСообщения = ТекстСообщения 
							+ Символы.ПС
							+ "Не могут быть распределены - отсутствует выпуск продукции по подразделению или прямые затраты по подразделению";
							
			Если РазрешитьУчетУслугБезПлановыхЦен Тогда
				ТекстСообщения = ТекстСообщения + " или выручка по услугам по подразделению";
			КонецЕсли;
			
			ТекстСообщения = ТекстСообщения 
							+ Символы.ПС
							+ "ОПЗ будут полностью списаны на себестоимость реализованной продукции (901 счет)";
			
			

			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект)), СтатусСообщения.Важное);			
			
			Строка = ТаблицаНеЗакрытыхПодразделений.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.СчетЗатрат = Выборка.СчетЗатрат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПроизводства;
	
КонецФункции

Функция ПолучитьПорядокПодразделений(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	АнализДанныхПроизводства(СтруктураШапкиДокумента, СтруктураДопПараметров);
	// Определяется диапазон переделов после чего начинается перебор
	// всех переделов из найденного диапазона.	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних.НомерПередела КАК НомерПередела,
	|	ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.СрезПоследних(&КонДата, Организация = &Организация) КАК ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПередела";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("НоменклатурнаяГруппа");
	Результат.ЗаполнитьЗначения("Все", "НоменклатурнаяГруппа");

	Возврат Результат;
	
Конецфункции
	
Функция ПолучитьТаблицуВстречногоВыпуска(СтруктураШапкиДокумента)
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Подразделение,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппа,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета КАК ПодразделениеПересчета,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета КАК НоменклатурнаяГруппаПересчета,
	|	ВложенныйЗапрос.СубконтоКт2,
	|	ВложенныйЗапрос.СубконтоКт3
	|ИЗ
	|	РегистрСведений.ВстречныйВыпускПродукцииУслуг.СрезПоследних(&КонДата, Организация = &Организация) КАК ВстречныйВыпускПродукцииУслугСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|			ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	|			ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	|			ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , (НЕ СчетДт В ИЕРАРХИИ (&СчетаОбщихЗатрат)), , , , &Организация = Организация) КАК ХозрасчетныйОборотыДтКт) КАК ВложенныйЗапрос
	|		ПО ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция = ВложенныйЗапрос.СубконтоКт1
	|			И ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета = ВложенныйЗапрос.СубконтоДт1
	|			И ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета = ВложенныйЗапрос.СубконтоДт2
	|ГДЕ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Учитывается
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Подразделение,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппа,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета,
	|	ВложенныйЗапрос.СубконтоКт2,
	|	ВложенныйЗапрос.СубконтоКт3
	|ИЗ
	|	РегистрСведений.ВстречныйВыпускПродукцииУслуг.СрезПоследних(&КонДата, Организация = &Организация) КАК ВстречныйВыпускПродукцииУслугСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|			ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	|			ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|			ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	|			ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&СчетаОбщихЗатрат), , , , &Организация = Организация) КАК ХозрасчетныйОборотыДтКт) КАК ВложенныйЗапрос
	|		ПО ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция = ВложенныйЗапрос.СубконтоКт1
	|			И ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета = ВложенныйЗапрос.СубконтоДт1
	|ГДЕ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Учитывается
	|";
	 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	СчетаОбщихРасх = Новый Массив;
	СчетаОбщихРасх.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("СчетаОбщихЗатрат", СчетаОбщихРасх);
	
	ТаблицаВстречногоВыпуска = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВстречногоВыпуска;
	
КонецФункции

Функция ПолучитьПорядокПеределов(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ТаблицаПроизводства = АнализДанныхПроизводстваУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
	Иначе	
		ТаблицаПроизводства = АнализДанныхПроизводства(СтруктураШапкиДокумента, СтруктураДопПараметров);	
	КонецЕсли; 
	
	ТаблицаПроизводства.Колонки.Добавить("НомерПередела", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(12, 0));
	
	// Для ускорения выгрузим колонку продукция в ТабСписПрод,
	ТабСписПрод = ТаблицаПроизводства.Скопировать();
	ТабСписПрод.Свернуть("ГП");
	
	ТаблицаПроизводства.Сортировать("ПодразделениеПредставление, НоменклатурнаяГруппаПредставление, НоменклатураЗатратПредставление");
	
	Индекс = 0;
	МаксИндекс = ТаблицаПроизводства.Количество() - 1;
	ТекПередел = 1;
	ПараметрыПоиска = Новый Структура;
 	ПроставленПередел = Истина;
	
	Пока ПроставленПередел Цикл
		
		ПроставленПередел = Ложь;
		
		Пока Индекс <= МаксИндекс Цикл
			ТекСтрока = ТаблицаПроизводства[Индекс];
			
			Если ТабСписПрод.Найти( ТекСтрока.НоменклатураЗатрат, "ГП") = Неопределено Тогда
				ТекСтрока.НомерПередела = ТекПередел;
				ПроставленПередел = Истина;
				Индекс = Индекс + 1;
				Пока Индекс <= МаксИндекс Цикл
					Стр = ТаблицаПроизводства[Индекс];
					Если Стр.НоменклатураЗатрат = ТекСтрока.НоменклатураЗатрат Тогда
						Стр.НомерПередела = ТекПередел;
					Иначе
						Прервать;
					КонецЕсли;
					Индекс = Индекс + 1;
				КонецЦикла;
								
			Иначе
				ПараметрыПоиска.Очистить();
				ПараметрыПоиска.Вставить( "ГП", ТекСтрока.НоменклатураЗатрат);
				НаборСтрок = ТаблицаПроизводства.НайтиСтроки(ПараметрыПоиска);
				Если НаборСтрок.Количество() = 0 Тогда
					ТекСтрока.НомерПередела = ТекПередел;
					ПроставленПередел = Истина;
				Иначе
					СледПередел = Ложь;
					Для Каждого СтрокаПрод Из НаборСтрок Цикл
						Если СтрокаПрод.НомерПередела = 0 ИЛИ СтрокаПрод.НомерПередела = ТекПередел Тогда
							СледПередел = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Не СледПередел Тогда
						ТекСтрока.НомерПередела = ТекПередел;
						ПроставленПередел = Истина;
					КонецЕсли;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПроизводства.Сортировать("НомерПередела Убыв, ПодразделениеПредставление, НоменклатурнаяГруппаПредставление, НоменклатураЗатратПредставление");
		ТекСтрока = ТаблицаПроизводства.Найти(0, "НомерПередела");
		
		Если ТекСтрока = Неопределено Тогда
			Прервать;
		Иначе
			Индекс = ТаблицаПроизводства.Индекс(ТекСтрока);
			
		КонецЕсли;
		
		ТекПередел = ТекПередел + 1;
		
	КонецЦикла;
	
	ТаблицаПроизводства.Сортировать("НомерПередела Убыв, ПодразделениеПредставление, НоменклатурнаяГруппаПредставление, НоменклатураЗатратПредставление");

	// Продукция выпущенная на переделе.
	ТабТемп = ТаблицаПроизводства.Скопировать();
	
	// Рассчитаем максимальный уровень передела для продукции
	ТабТемп.Свернуть("Подразделение, НоменклатурнаяГруппа, ГП, НомерПередела");
	ТабПродукция = ТабТемп.Скопировать();
	ТабПродукция.Свернуть("Подразделение, НоменклатурнаяГруппа, ГП");
	ТабПродукция.Колонки.Добавить("НомерПередела", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(12, 0));
	СтруктПоиска = Новый Структура;
	Для Каждого СтрокаТаб Из ТабПродукция Цикл
		СтруктПоиска.Вставить("Подразделение", СтрокаТаб.Подразделение);
		СтруктПоиска.Вставить("НоменклатурнаяГруппа", СтрокаТаб.НоменклатурнаяГруппа);
		НаборСтрок = ТабТемп.НайтиСтроки(СтруктПоиска);
		МаксНомерПередела = 0;
		Для Каждого Строка Из НаборСтрок Цикл
			МаксНомерПередела = Макс(МаксНомерПередела, Строка.НомерПередела);
		КонецЦикла;
		СтрокаТаб.НомерПередела = МаксНомерПередела;
	КонецЦикла;
	ТабТемп = 0;
	
	ТабПродукция.Свернуть("Подразделение, НоменклатурнаяГруппа, НомерПередела");
	ТабПродукция.Сортировать("НомерПередела Возр");
	
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ТаблицаВстречногоВыпуска = ПолучитьТаблицуВстречногоВыпускаУпр(СтруктураШапкиДокумента);	
	Иначе
		ТаблицаВстречногоВыпуска = ПолучитьТаблицуВстречногоВыпуска(СтруктураШапкиДокумента);
	КонецЕсли;
	
	СтруктураДопПараметров.Вставить("ТаблицаВстречногоВыпуска", ТаблицаВстречногоВыпуска);
	
	// Если в порядке переделов всего один передел, то сообщение не выдается
	ПорядокПодразделенийСообщался = ПорядокПодразделенийСообщался ИЛИ (ТабПродукция.Количество() < 2);
	
	Если Не ПорядокПодразделенийСообщался Тогда
		Сообщить("Порядок переделов");
		
		НомерПередела = 1;
		Для Каждого Передел Из ТабПродукция Цикл
			Сообщить("" + НомерПередела + " - " + Передел.Подразделение + " - " + Передел.НоменклатурнаяГруппа);
			НомерПередела = НомерПередела + 1;
		КонецЦикла;
		
		ПорядокПодразделенийСообщался = Истина;
	
	КонецЕсли;
	
	Возврат ТабПродукция;
		
КонецФункции

Функция РасчетТекущегоПредела(ТаблицаПроизводства, ТаблицаГПТекущегоПередела, ТекущийНомерПередела)
	
	
	ТаблицаГПСледующегоПередела = Новый ТаблицаЗначений ;
	ТаблицаГПСледующегоПередела.Колонки.Добавить("ГП");
	
	ФлагВыхода = 1;
	Для Каждого СтрокаГП ИЗ ТаблицаГПТекущегоПередела Цикл
		Для Каждого Строка Из ТаблицаПроизводства Цикл
			
			//Если Строка.НомерПередела <> 0 Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Если Строка.НоменклатураЗатрат = СтрокаГП.ГП Тогда
				Строка.НомерПередела = ТекущийНомерПередела;
				ФлагВыхода = 0;
				СтрокаГПНовая = ТаблицаГПСледующегоПередела.Добавить();
				СтрокаГПНовая.ГП = Строка.ГП;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаГПСледующегоПередела.Свернуть("ГП");

	Если ФлагВыхода = 0 ТОгда
		РасчетТекущегоПредела(ТаблицаПроизводства, ТаблицаГПСледующегоПередела, ТекущийНомерПередела + 1);
	Иначе
		Возврат ТаблицаПроизводства;
	КонецЕсли;

КонецФункции

// Процедура производит расчет себестоимости по прямым затратам по переделам.
//
Процедура РасчетПрямыхЗатрат(СтруктураШапкиДокумента, ВыполненоРаспределениеОПР = Ложь, СтруктураДопПараметров)
	
	Для Каждого Передел Из ПорядокПеределов Цикл
		Если Передел.НомерПередела = 0 Тогда
			Продолжить;
		КонецЕсли; 
		// Распределение прямых расходов по тем подразделениям, которым присвоен
		// текущий номер передела.
		МассивНоменклатуры = Новый Массив; // массив номенклатуры, у которой, в результате расчета себестоимости, изменилась среденевзвешенная стомиость.
		ДвиженияПоПрямымЗатратам(СтруктураШапкиДокумента, Передел.Подразделение, Передел.НоменклатурнаяГруппа, ВыполненоРаспределениеОПР, МассивНоменклатуры, СтруктураДопПараметров);
		
		Если МассивНоменклатуры.Количество() > 0 Тогда
			КорректировкаСтоимостиСписанияВыпущеннойПродукции(СтруктураШапкиДокумента, МассивНоменклатуры, ВыполненоРаспределениеОПР, СтруктураДопПараметров);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры // РасчетПрямыхЗатрат()

// Проверка все ли подразделения, учавствующие в обороте, указаны в порядке закрытия подразделений
Процедура ПроверкаПорядкаЗакрытияПодразделений(СтруктураШапкиДокумента)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СУММА(ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних.НомерПередела) КАК КонечныйПередел,
	|	ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних.Подразделение КАК Подразделение,
	|	NULL КАК СуммаОборот
	|ИЗ
	|	РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.СрезПоследних(&КонДата, Организация = &Организация) КАК ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорядокЗакрытияПодразделенийОрганизацийСрезПоследних.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ХозрасчетныйОбороты.СубконтоДт1,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот)
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&СчетаЗатрат), , , , Организация = &Организация) КАК ХозрасчетныйОбороты
	|
	|ГДЕ
	|	(ХозрасчетныйОбороты.СубконтоДт1 ССЫЛКА Справочник.ПодразделенияОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.СубконтоДт1
	|
	|ИТОГИ СУММА(КонечныйПередел), СУММА(СуммаОборот) ПО
	|	Подразделение";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	
	СчетаЗатрат = Новый Массив;
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.Производство);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
	Запрос.УстановитьПараметр("СчетаЗатрат", СчетаЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("Подразделение","КонечныйПередел, СуммаОборот");
	Для Каждого Результат Из РезультатЗапроса Цикл
		Если Результат.КонечныйПередел = 0 И Результат.СуммаОборот <> 0 Тогда
			Сообщить(Локализация.СтрШаблон1("Не установлен порядок подразделения ¤1¤"
"для закрытия счетов, используемый"
"при расчете стоимости продукции."
"Порядок устанавливается документом ""Установка порядка"
"подразделений для закрытия счетов""", Результат.Подразделение), СтатусСообщения.ОченьВажное);	
			ПорядокПодразделенийСообщался = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Процедура запускает расчет прямых и косвенных расходов
// если используется простой расчет себестоимости и не используется встречный выпуск
// (производственная цепочка не имеет "закольцованных звеньев"),
// тогда расчет прямых затрат запускается один раз
// в противном случае
// первый расчет прямых затрат производится без учета переделов, задействованных в "кольце"
// второй расчет прямых затрат производится только по пределем, задействованным в "кольце"
// третий расчет прямых затрат проводится для всех переделов, но корректирует выпуск только той,
// готовой продукции, которая не была списана на "кольцо"
//
Процедура РасчетПрямыхИКосвенныхРасходов(СтруктураШапкиДокумента,СтруктураДопПараметров, СпособОценкиМПЗ)
	
	Если СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПеределам"
		И СтруктураДопПараметров.ТаблицаВстречногоВыпуска.Количество() > 0 Тогда
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "1";
		РасчетПрямыхЗатрат(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "2";
		РасчетПрямыхЗатрат(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		// Списание общепроизводственных и общехозяйственных расходов
		// на себестоимость продукции (услуг).
		ТекстСпособОценкиМПЗ = ?(СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней,"ПоСредней","ПоПартиям");
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "3" + ТекстСпособОценкиМПЗ;
		РаспределениеКосвенныхРасходов(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
	Иначе
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "";
		РасчетПрямыхЗатрат(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		РаспределениеКосвенныхРасходов(СтруктураШапкиДокумента, СтруктураДопПараметров);
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура РасчетСебестоимостиПродукции(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок)
	
		
	Если СтруктураШапкиДокумента.РасчетСтоимостиПродукцииБУ Тогда
			
		СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете = Истина;
		СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Ложь;
		мОперация = мПроводкиБУ;
		СтруктураДопПараметров.Вставить("Учет", "БУ");
		
		//Распределение расходов основного и вспомогательного
		// производства на себестоимость выпущенной продукции (услуг).
		
		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			
			МассивСчетов = Новый Массив;

			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
			
			//Определяем все счета, записи с которыми требуется заблокировать
			ЗапросБлокируемыеСчета = Новый Запрос;
			ЗапросБлокируемыеСчета.Текст ="
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Счета.Ссылка КАК Счет
			|ИЗ
			|	ПланСчетов.Хозрасчетный	КАК Счета
			|ГДЕ
			|	Счета.Ссылка В ИЕРАРХИИ (&МассивСчетов)";
			ЗапросБлокируемыеСчета.УстановитьПараметр("МассивСчетов", МассивСчетов);
			
			ИсточникДанныхБлокируемыхСчетов = ЗапросБлокируемыеСчета.Выполнить();
			
			// Блокировка регистра бухгалтерии.
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы, ИсточникДанных", 
															"РегистрБухгалтерии", "Хозрасчетный", ИсточникДанныхБлокируемыхСчетов);
															
			СтруктураЗначенийБлокировки = Новый Структура("Период, Организация", 
														  Новый Диапазон(, мКонМесяца), СтруктураШапкиДокумента.Организация);
														  
			СтруктураИсточникаДанных = Новый Структура("Счет", "Счет");
			
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных);
			
		КонецЕсли;		
		
		РасчетПорядкаПеределов(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
		РасчетПрямыхИКосвенныхРасходов(СтруктураШапкиДокумента,СтруктураДопПараметров, мУчетнаяПолитикаБУ.СпособОценкиМПЗ);
		
		мПроводкиБУ.Записать(Ложь);
		
		СтруктураДопПараметров.ЗаписьРасчетаСебестоимости.Свернуть("Организация,ПериодРасчета,Активность,Регистратор,СчетУчета,Подразделение,НоменклатурнаяГруппа,Продукция,ВидОперации,СуммаПлан,СуммаНЗП,СуммаНЗПНУ,ДокументВыпуска",  
		"Сумма,СуммаНУ");
		ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента, 
		СтруктураДопПараметров.ЗаписьРасчетаСебестоимости,
		РегистрыСведений.РасчетСебестоимостиПродукцици,
		"Организация,ПериодРасчета,Активность,Регистратор,СчетУчета,Подразделение,НоменклатурнаяГруппа,Продукция,ВидОперации",
		"Сумма,СуммаНУ,СуммаНЗП,СуммаНЗПНУ,СуммаПлан");
		ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента,
		СтруктураДопПараметров.ЗаписьРасчетаКосвенныхРасходов,
		РегистрыСведений.РасчетРаспределенияКосвенныхРасходов,
		"Организация,ПериодРасчета,Активность,Регистратор,СчетУчета,Подразделение,СтатьяЗатрат,ПодразделениеРаспределения,НоменклатурнаяГруппаРаспределения,БазаРаспределения,СчетРаспределения,ВидОперации,НалоговоеНазначение",
		"Сумма,СуммаНУ,СуммаБазы,СуммаБазыНУ");
		
	КонецЕсли;
	
КонецПроцедуры

// РАСЧЕТ СЕБЕСТОИМОСТИ ПО УПРАВЛЕНЧЕСКОМУ УЧЕТУ

Процедура РасчетСебестоимостиПродукцииУпр(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.РасчетСтоимостиПродукцииУУ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Истина;
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "Затраты");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, мКонМесяца)); 
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "НезавершенноеПроизводство");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, мКонМесяца)); 
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		
	КонецЕсли;
	
	// Распределение расходов основного и вспомогательного
	// производства на себестоимость выпущенной продукции (услуг).
	
	РасчетПорядкаПеределовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
	
	РасчетПрямыхИКосвенныхРасходовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров, мУчетнаяПолитикаУУ.СпособОценкиМПЗ);
	
	СписатьЗатраты(Перечисления.ХарактерЗатрат.АдминистративныеРасходы);
	СписатьЗатраты(Перечисления.ХарактерЗатрат.РасходыНаСбыт);
	СписатьЗатраты(Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	СписатьЗатраты(Перечисления.ХарактерЗатрат.Прочие);
	Если СтруктураШапкиДокумента.НеРаспределятьОПЗнаСебестоимостьПродукцииВУУ Тогда
		СписатьЗатраты(Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы);
	КонецЕсли;
	
	
	СтруктураДопПараметров.ЗаписьРасчетаСебестоимости.Свернуть("ПериодРасчета,Активность,Регистратор,Подразделение,НоменклатурнаяГруппа,Продукция,ХарактеристикаПродукции,СерияПродукции,Заказ,Качество,ВидОперации,СуммаПлан,НДСПлан,СуммаНЗП,НДСНЗП,ДокументВыпуска",
	"Сумма,НДС");
	
	ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента, 
	СтруктураДопПараметров.ЗаписьРасчетаСебестоимости,
	РегистрыСведений.РасчетСебестоимостиПродукцииУправленческийУчет,
	"ПериодРасчета,Активность,Регистратор,Подразделение,НоменклатурнаяГруппа,Продукция,ХарактеристикаПродукции,СерияПродукции,Заказ,Качество,ВидОперации",
	"Сумма,СуммаНЗП,СуммаПлан,НДС, НДСНЗП, НДСПлан");
	
	ЗаписьВВспомогательныеРегистрыСведений(СтруктураШапкиДокумента,
	СтруктураДопПараметров.ЗаписьРасчетаКосвенныхРасходов,
	РегистрыСведений.РасчетРаспределенияКосвенныхРасходовУправленческийУчет,
	"ПериодРасчета,Активность,Регистратор,Подразделение,СтатьяЗатрат,ПодразделениеРаспределения,НоменклатурнаяГруппаРаспределения,БазаРаспределения,ВидОперации",
	"Сумма, НДС, СуммаБазы");
		
КонецПроцедуры

Функция РасчетПорядкаПеределовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	СпособРасчетаСебестоимостиПроизводства = мУчетнаяПолитикаУУ.СпособРасчетаСебестоимостиПроизводства;
	
	Если СпособРасчетаСебестоимостиПроизводства  = Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам Тогда
		
		СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПеределам";
		ПорядокПеределов = ПолучитьПорядокПеределов(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
	Иначе
		СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПодразделениям";
		ПроверкаПорядкаЗакрытияПодразделенийУпр(СтруктураШапкиДокумента);
		ПорядокПеределов = ПолучитьПорядокПодразделенийУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
	КонецЕсли;
	
КонецФункции 

// Проверка все ли подразделения, учавствующие в обороте, указаны в порядке закрытия подразделений
Процедура ПроверкаПорядкаЗакрытияПодразделенийУпр(СтруктураШапкиДокумента)
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СУММА(ПорядокЗакрытияПодразделенийСрезПоследних.НомерПередела) КАК КонечныйПередел,
	|	ПорядокЗакрытияПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	NULL КАК СуммаОборот, 
	|	NULL КАК НДСОборот 
	|ИЗ
	|	РегистрСведений.ПорядокЗакрытияПодразделений.СрезПоследних(&КонДата) КАК ПорядокЗакрытияПодразделенийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорядокЗакрытияПодразделенийСрезПоследних.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	НезавершенноеПроизводствоОбороты.Подразделение,
	|	СУММА(НезавершенноеПроизводствоОбороты.СтоимостьПриход),
	|	СУММА(НезавершенноеПроизводствоОбороты.НДСПриход)
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство.Обороты(&НачДата, &КонДата, , ) КАК НезавершенноеПроизводствоОбороты
    |
	|СГРУППИРОВАТЬ ПО
	|	НезавершенноеПроизводствоОбороты.Подразделение	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ЗатратыОбороты.Подразделение,
	|	СУММА(ЗатратыОбороты.СуммаПриход),
	|	СУММА(ЗатратыОбороты.НДСПриход)
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(&НачДата, &КонДата, , СтатьяЗатрат.ХарактерЗатрат = &ХарактерЗатратОбщеПроизводственные) КАК ЗатратыОбороты
    |
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыОбороты.Подразделение	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	БракВПроизводствеОбороты.Подразделение,
	|	СУММА(БракВПроизводствеОбороты.СуммаПриход),
	|	СУММА(БракВПроизводствеОбороты.НДСПриход)
	|ИЗ
	|	РегистрНакопления.БракВПроизводстве.Обороты(&НачДата, &КонДата, , ) КАК БракВПроизводствеОбороты
    |
	|СГРУППИРОВАТЬ ПО
	|	БракВПроизводствеОбороты.Подразделение	
	|
	|ИТОГИ СУММА(КонечныйПередел), СУММА(СуммаОборот), СУММА(НДСОборот) ПО
	|	Подразделение";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("ХарактерЗатратОбщеПроизводственные", Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы); 
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("Подразделение","КонечныйПередел, СуммаОборот, НДСОборот");
	Для Каждого Результат Из РезультатЗапроса Цикл
		Если Результат.КонечныйПередел = 0 И (Результат.СуммаОборот <> 0 ИЛИ Результат.НДСОборот <> 0) Тогда	
			Сообщить(Локализация.СтрШаблон1("Не установлен порядок подразделения ¤1¤"
"для закрытия счетов, используемый"
"при расчете стоимости продукции."
"Порядок устанавливается документом ""Установка порядка"
"подразделений для закрытия счетов""", Результат.Подразделение), СтатусСообщения.ОченьВажное);	
			ПорядокПодразделенийСообщался = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПорядокПодразделенийУпр(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	АнализДанныхПроизводстваУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
	// Определяется диапазон переделов после чего начинается перебор
	// всех переделов из найденного диапазона.	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПорядокЗакрытияПодразделенийСрезПоследних.НомерПередела КАК НомерПередела,
	|	ПорядокЗакрытияПодразделенийСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ПорядокЗакрытияПодразделений.СрезПоследних(&КонДата) КАК ПорядокЗакрытияПодразделенийСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПередела";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("НоменклатурнаяГруппа");
	Результат.ЗаполнитьЗначения("Все", "НоменклатурнаяГруппа");

	Возврат Результат;
	
Конецфункции

Функция АнализДанныхПроизводстваУпр(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	// Модель производства в виде последовательности цепочек:
	//ГП(готовая продукция),
	//Подразделение,
	//ном.группа,
	//Номенклатура, израсходованная на производство, в этом подразделении и на эту ном.группу, а значит и на эту ГП
	//счет учета затрат производства
	
	РазрешитьУчетУслугБезПлановыхЦен = Не мУчетнаяПолитикаУУ.ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗатрат.Источник КАК Источник,
	|	ТаблицаЗатрат.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаЗатрат.Подразделение) КАК ПодразделениеПредставление,
	|	ТаблицаЗатрат.КонечныйОстатокОПЗ КАК КонечныйОстатокОПЗ,
	|	ЕСТЬNULL(ТаблицаГП.НоменклатурнаяГруппа, ТаблицаЗатрат.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТаблицаГП.НоменклатурнаяГруппа, ТаблицаЗатрат.НоменклатурнаяГруппа)) КАК НоменклатурнаяГруппаПредставление,
	|	ЕСТЬNULL(ТаблицаГП.ГП, ""NULL"") КАК ГП,
	|	ТаблицаЗатрат.ХарактерЗатрат КАК ХарактерЗатрат,
	|	ТаблицаЗатрат.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаЗатрат.НоменклатураЗатрат) КАК НоменклатураЗатратПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	// Обороты НЗП - какая номенклатура была передана в НЗП на какие подразделения и ном. группы
	|		1 КАК Источник,
	|		0 КАК КонечныйОстатокОПЗ,
	|		НЗПОбороты.Подразделение КАК Подразделение,
	|		НЗПОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		НЗПОбороты.ХарактерЗатрат КАК ХарактерЗатрат,
	|		НЗПОбороты.НоменклатураЗатрат КАК НоменклатураЗатрат
	|	ИЗ
	|      (ВЫБРАТЬ 
	|			НезавершенноеПроизводство.Подразделение,
	|			НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|			&ХарактерЗатратПроизводственные КАК ХарактерЗатрат,
	|			НезавершенноеПроизводство.НоменклатураЗатрат
	|		ИЗ
	|			РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	|		ГДЕ
	|			НезавершенноеПроизводство.Период >= &НачДата
	|			И НезавершенноеПроизводство.Период <= &КонДата
	|			И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
    |
	|		СГРУППИРОВАТЬ ПО
	|			НезавершенноеПроизводство.Подразделение,
	|			НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|			НезавершенноеПроизводство.НоменклатураЗатрат
	|	   ) КАК НЗПОбороты
	|	
	|	ОБЪЕДИНИТЬ
	// на какие подразделения и ном. группы НЗП расходовались выпущенные внутренние производственные услуги
	|	ВЫБРАТЬ
	|		1,
	|		0 КАК КонечныйОстатокОПЗ,
	|		НЗПОбороты.Подразделение,
	|		НЗПОбороты.НоменклатурнаяГруппа,
	|		&ХарактерЗатратПроизводственные,
	|		ВыпускПродукцииУслугОбороты.Продукция
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукцииУслуг.Обороты(
	|			&НачДата,
	|			&КонДата) КАК ВыпускПродукцииУслугОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|            (ВЫБРАТЬ
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|				НезавершенноеПроизводство.ПодразделениеНЗП,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппаНЗП
	|			ИЗ
	|				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	|			ГДЕ
	|				НезавершенноеПроизводство.Период >= &НачДата
	|				И НезавершенноеПроизводство.Период <= &КонДата
	|				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
    |
	|			СГРУППИРОВАТЬ ПО
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|				НезавершенноеПроизводство.ПодразделениеНЗП,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппаНЗП) КАК НЗПОбороты	
	|			ПО  ВыпускПродукцииУслугОбороты.НоменклатурнаяГруппа = НЗПОбороты.НоменклатурнаяГруппаНЗП
	|				И ВыпускПродукцииУслугОбороты.Подразделение = НЗПОбороты.ПодразделениеНЗП
	|	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	// Общепроизводственные затраты
	|	ВЫБРАТЬ
	|		2,
	|		ЕСТЬNULL(КонОстаткиОПЗ.СуммаОстаток, 0) КАК КонечныйОстатокОПЗ,
	|		ЗатратыОбороты.Подразделение,
	|		NULL,
	|		&ХарактерЗатратОбщеПроизводственные,
	|		&ПустаяСтатьяЗатрат
	|	ИЗ  
	|		РегистрНакопления.Затраты.Обороты(&НачДата, &КонДата, , СтатьяЗатрат.ХарактерЗатрат = &ХарактерЗатратОбщеПроизводственные) КАК ЗатратыОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ 
	|				РегистрНакопления.Затраты.Остатки(&КонГраница, СтатьяЗатрат.ХарактерЗатрат = &ХарактерЗатратОбщеПроизводственные) КАК КонОстаткиОПЗ
    |			ПО 
    |				ЗатратыОбороты.Подразделение = КонОстаткиОПЗ.Подразделение
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		0 КАК КонечныйОстатокОПЗ,
	|		ВыпускПродукцииУслугОбороты.ПодразделениеПолучатель,
	|		ВыпускПродукцииУслугОбороты.НоменклатурнаяГруппаПолучатель,
	|		&ХарактерЗатратПроизводственные,
	|		ВыпускПродукцииУслугОбороты.НоменклатурнаяГруппа
	|	ИЗ
	|      (ВЫБРАТЬ
	|			РегВыпускПродукцииУслуг.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|			РегВыпускПродукцииУслуг.НоменклатурнаяГруппаПолучатель КАК НоменклатурнаяГруппаПолучатель,
	|			РегВыпускПродукцииУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|       ИЗ 
	|			РегистрНакопления.ВыпускПродукцииУслуг КАК РегВыпускПродукцииУслуг
	|		ГДЕ
	|			РегВыпускПродукцииУслуг.Период МЕЖДУ &НачДата И &КонДата
	|			И РегВыпускПродукцииУслуг.ПрямыеРасходыРаспределятьПоКоличеству
	|		СГРУППИРОВАТЬ ПО
	|			РегВыпускПродукцииУслуг.ПодразделениеПолучатель,
	|			РегВыпускПродукцииУслуг.НоменклатурнаяГруппаПолучатель,
	|			РегВыпускПродукцииУслуг.НоменклатурнаяГруппа
	|       ) КАК ВыпускПродукцииУслугОбороты
	|
	|   ) КАК ТаблицаЗатрат
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	// выпуск продукции 
	|       (ВЫБРАТЬ
	|			ВыпускПродукцииУслугОбороты.Подразделение КАК Подразделение,
	|			ВыпускПродукцииУслугОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	    	&ХарактерЗатратПроизводственные КАК ХарактерЗатрат,
    |			ВыпускПродукцииУслугОбороты.Продукция КАК ГП
	|		ИЗ
	|			РегистрНакопления.ВыпускПродукцииУслуг.Обороты(
	|				&НачДата,
	|				&КонДата) КАК ВыпускПродукцииУслугОбороты
	|
    |		ОБЪЕДИНИТЬ ВСЕ
    |	
	// Реализация услуг 
	|
    |		ВЫБРАТЬ
    |			ВложенныйЗапрос.Подразделение,
    |			РеализацияУслугОбороты.НоменклатурнаяГруппа,
    |			&ХарактерЗатратПроизводственные,
    |			&ПустаяНоменклатура
    |		ИЗ
    |			РегистрНакопления.РеализацияУслугУправленческийУчет.Обороты КАК РеализацияУслугОбороты
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|      		(ВЫБРАТЬ 
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|				&ХарактерЗатратПроизводственные КАК ХарактерЗатрат
	|			ИЗ
	|				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	|			ГДЕ
	|				НезавершенноеПроизводство.Период >= &НачДата
	|				И НезавершенноеПроизводство.Период <= &КонДата
	|				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
	|
	|			СГРУППИРОВАТЬ ПО
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа
	|	   		) КАК ВложенныйЗапрос
	|
    |			ПО РеализацияУслугОбороты.НоменклатурнаяГруппа = ВложенныйЗапрос.НоменклатурнаяГруппа
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ИнвентаризацияНЗП.Подразделение,
	|			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа,
	|			&ХарактерЗатратПроизводственные,
	|			&ПустаяНоменклатура
	|		ИЗ
	|			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
	|				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
	|		ГДЕ
	|			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата
	|			И (НЕ ИнвентаризацияНЗП.ПометкаУдаления)
	|       ) КАК ТаблицаГП
	|
	|		ПО ТаблицаГП.Подразделение = ТаблицаЗатрат.Подразделение
	|			И (ВЫБОР
	|				КОГДА ТаблицаЗатрат.Источник = 1
	|					ТОГДА ВЫБОР
	|								КОГДА ТаблицаГП.ХарактерЗатрат = ТаблицаЗатрат.ХарактерЗатрат
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|							И ВЫБОР
	|								КОГДА ТаблицаЗатрат.НоменклатурнаяГруппа ССЫЛКА Справочник.НоменклатурныеГруппы
	|									ТОГДА ВЫБОР
	|											КОГДА ТаблицаЗатрат.НоменклатурнаяГруппа = ТаблицаГП.НоменклатурнаяГруппа
	|												ТОГДА ИСТИНА
	|											ИНАЧЕ ЛОЖЬ
	|										КОНЕЦ
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ = ИСТИНА)";
	
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("КонГраница",  мКонГраница);
	
	Запрос.УстановитьПараметр("ХарактерЗатратПроизводственные", 	Перечисления.ХарактерЗатрат.ПроизводственныеРасходы); 
	Запрос.УстановитьПараметр("ХарактерЗатратОбщеПроизводственные", Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы); 
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Результат);
	
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ГП");
	ЭлементОтбора.ВидСравнения = ВидСравнения.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.Значение = "NULL";
	ПостроительЗапроса.Выполнить();
	ТаблицаПроизводства = ПостроительЗапроса.Результат.Выгрузить();
	
	ТаблицаПроизводства.Колонки.Удалить("Источник");

	ПостроительЗапроса.Отбор.Сбросить();
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ГП");
	ЭлементОтбора.Установить("NULL");
	ПостроительЗапроса.Выполнить();
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Источник = 1 Тогда // прямые затраты			
			Если ТаблицаНеЗакрытыхПодразделенийУпр.НайтиСтроки(Новый Структура("Подразделение, ХарактерЗатрат", Выборка.Подразделение, Выборка.ХарактерЗатрат)).Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;			
			ТекстСообщения = Локализация.СтрШаблон1("Нет базы распределения на себестоимость продукции (услуг) прямых расходов, учитываемых следующим образом:"
"Характер затрат: ¤1¤."
"Подразделение: ¤2¤."
"Номенклатурная группа: ¤3¤."
"База распределения: плановая себестоимость продукции.", Выборка.ХарактерЗатрат, Выборка.Подразделение, Выборка.НоменклатурнаяГруппа);
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, ,ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект)), СтатусСообщения.Важное);
			
			Строка = ТаблицаНеЗакрытыхПодразделенийУпр.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.ХарактерЗатрат = Выборка.ХарактерЗатрат;

		
		ИначеЕсли Выборка.Источник = 2 Тогда // общие затраты		
			Если ТаблицаНеЗакрытыхПодразделенийУпр.Найти(Выборка.Подразделение, "Подразделение") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			Если Выборка.КонечныйОстатокОПЗ = 0 Тогда
				// Если конечный остаток для ОПЗ = 0, распределять это ОПЗ не будем, сообщение для него не выводим
				Продолжить;
			КонецЕсли; 
			
			ТекстСообщения = Локализация.СтрШаблон1("Общепроизводственные затраты, учитываемые следующим образом:"
"Характер затрат: ¤1¤."
"Подразделение: ¤2¤.", Выборка.ХарактерЗатрат, Выборка.Подразделение);	
			
			ТекстСообщения = ТекстСообщения 
							+ Символы.ПС
							+ "Не могут быть распределены - отсутствует выпуск продукции по подразделению или прямые затраты по подразделению";
							
			Если РазрешитьУчетУслугБезПлановыхЦен Тогда
				ТекстСообщения = ТекстСообщения + " или выручка по услугам по подразделению";
			КонецЕсли;
			

			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект)), СтатусСообщения.Важное);			
			
			Строка = ТаблицаНеЗакрытыхПодразделенийУпр.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.ХарактерЗатрат = Выборка.ХарактерЗатрат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПроизводства;
	
КонецФункции

Функция ПолучитьТаблицуВстречногоВыпускаУпр(СтруктураШапкиДокумента)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеУпр КАК Подразделение,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппа,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчетаУпр КАК ПодразделениеПересчета,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета КАК НоменклатурнаяГруппаПересчета,
	|	ВложенныйЗапрос.ДокументОприходования,
	|	ВложенныйЗапрос.Склад
	|ИЗ
	|	РегистрСведений.ВстречныйВыпускПродукцииУслуг.СрезПоследних(&КонДата, ) КАК ВстречныйВыпускПродукцииУслугСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НЗПБракОбороты.ДокументОприходования КАК ДокументОприходования,
	|			НЗПБракОбороты.Склад КАК Склад,
	|			НЗПБракОбороты.СуммаОборот КАК СуммаОборот,
	|			НЗПБракОбороты.Подразделение КАК Подразделение,
	|			НЗПБракОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			НЗПБракОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
	|			НЗПБракОбороты.НоменклатураЗатрат КАК НоменклатураЗатрат
	|		ИЗ
	|	      (ВЫБРАТЬ 
	|				СУММА(НезавершенноеПроизводство.Стоимость) КАК СуммаОборот,
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|				НезавершенноеПроизводство.СтатьяЗатрат,
	|				НезавершенноеПроизводство.НоменклатураЗатрат,
	|				НезавершенноеПроизводство.ДокументОприходования, 
	|				НезавершенноеПроизводство.Склад
	|			ИЗ
	|				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	|			ГДЕ
	|				НезавершенноеПроизводство.Период >= &НачДата
	|				И НезавершенноеПроизводство.Период <= &КонДата
	|				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
    |
	|			СГРУППИРОВАТЬ ПО
	|				НезавершенноеПроизводство.Подразделение,
	|				НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|				НезавершенноеПроизводство.СтатьяЗатрат,
	|				НезавершенноеПроизводство.НоменклатураЗатрат,
	|				НезавершенноеПроизводство.ДокументОприходования, 
	|				НезавершенноеПроизводство.Склад
	|	   	  ) КАК НЗПБракОбороты
    |
	|   ) КАК ВложенныйЗапрос
	|		ПО ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция = ВложенныйЗапрос.НоменклатураЗатрат
	|			И ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчетаУпр = ВложенныйЗапрос.Подразделение
	|			И ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета = ВложенныйЗапрос.НоменклатурнаяГруппа
	|ГДЕ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Учитывается
	|";
	
	
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция,
	//|	ВстречныйВыпускПродукцииУслугСрезПоследних.Подразделение,
	//|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппа,
	//|	ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета,
	//|	ВстречныйВыпускПродукцииУслугСрезПоследних.НоменклатурнаяГруппаПересчета,
	//|	ВложенныйЗапрос.СубконтоКт2,
	//|	ВложенныйЗапрос.СубконтоКт3
	//|ИЗ
	//|	РегистрСведений.ВстречныйВыпускПродукцииУслуг.СрезПоследних(&КонДата, ) КАК ВстречныйВыпускПродукцииУслугСрезПоследних
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	//|			ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	//|			ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	//|			ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	//|			ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	//|			ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	//|			ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1
	//|		ИЗ
	//|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачДата, &КонДата, , СчетДт В ИЕРАРХИИ (&СчетаОбщихЗатрат), , , , &Организация = Организация) КАК ХозрасчетныйОборотыДтКт) КАК ВложенныйЗапрос
	//|		ПО ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция = ВложенныйЗапрос.СубконтоКт1
	//|			И ВстречныйВыпускПродукцииУслугСрезПоследних.ПодразделениеПересчета = ВложенныйЗапрос.СубконтоДт1";
	 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	
	ТаблицаВстречногоВыпуска = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВстречногоВыпуска;
	
КонецФункции

// Процедура запускает расчет прямых и косвенных расходов
// если используется простой расчет себестоимости и не используется встречный выпуск
// (производственная цепочка не имеет "закольцованных звеньев"),
// тогда расчет прямых затрат запускается один раз
// в противном случае
// первый расчет прямых затрат производится без учета переделов, задействованных в "кольце"
// второй расчет прямых затрат производится только по переделам, задействованным в "кольце"
// третий расчет прямых затрат проводится для всех переделов, но корректирует выпуск только той,
// готовой продукции, которая не была списана на "кольцо"
//
Процедура РасчетПрямыхИКосвенныхРасходовУпр(СтруктураШапкиДокумента,СтруктураДопПараметров, СпособОценкиМПЗ)
	
	Если СтруктураДопПараметров.СпособРасчетаСебестоимостиПроизводства = "ПоПеределам"
		И СтруктураДопПараметров.ТаблицаВстречногоВыпуска.Количество() > 0 Тогда
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "1";
		РасчетПрямыхЗатратУпр(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "2";
		РасчетПрямыхЗатратУпр(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		// Списание общепроизводственных и общехозяйственных расходов
		// на себестоимость продукции (услуг).
		ТекстСпособОценкиМПЗ = ?(СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней,"ПоСредней","ПоПартиям");
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "3" + ТекстСпособОценкиМПЗ;
		РаспределениеКосвенныхРасходовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
		
	Иначе
		СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "";
		РасчетПрямыхЗатратУпр(СтруктураШапкиДокумента, , СтруктураДопПараметров);
		РаспределениеКосвенныхРасходовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров);
	КонецЕсли;
	

	
КонецПроцедуры

// Процедура производит расчет себестоимости по прямым затратам по переделам.
//
Процедура РасчетПрямыхЗатратУпр(СтруктураШапкиДокумента, ВыполненоРаспределениеОПР = Ложь, СтруктураДопПараметров)
	
	Для Каждого Передел Из ПорядокПеределов Цикл
		// Распределение прямых расходов по тем подразделениям, которым присвоен
		// текущий номер передела.
		Если Передел.НомерПередела = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		// Для досписания по партиям товаров
		ТабТоваров = Новый ТаблицаЗначений;
		ТабТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТабТоваров.Колонки.Добавить("ДокументОприходования");
		
		ДвиженияПоПрямымЗатратамУпр(СтруктураШапкиДокумента, Передел.Подразделение, Передел.НоменклатурнаяГруппа, ВыполненоРаспределениеОПР, ТабТоваров, СтруктураДопПараметров);
		
		Если ТабТоваров.Количество() > 0 Тогда
			КорректировкаСтоимостиСписанияВыпущеннойПродукцииУпр(СтруктураШапкиДокумента, ТабТоваров, ВыполненоРаспределениеОПР, СтруктураДопПараметров);
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры // РасчетПрямыхЗатратУпр()

// Процедура формирует данные о прямых затратах на переделе по продукции
Процедура СформироватьЗапросПоПрямымЗатратамУпр(СтруктураШапкиДокумента, ПеределПодразделение, ПеределНоменклатурнаяГруппа, РезультатЗапроса, СтруктураДопПараметров, ВыполненоРаспределениеОПР)
	
	УсловияВстречногоВыпуска1 = "";
	УсловияВстречногоВыпуска2 = "";
	РасчетПрямыхЗатратНомер = СтруктураДопПараметров.РасчетПрямыхЗатратНомер;
	Если Лев(РасчетПрямыхЗатратНомер, 1) = "3" Тогда
		ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа", ПеределПодразделение, ПеределНоменклатурнаяГруппа));
		Если ВстречныйВыпуск.Количество() = 0 Тогда
			РасчетПрямыхЗатратНомер = "";
		КонецЕсли;
		
	ИначеЕсли РасчетПрямыхЗатратНомер <> "" Тогда
		ТаблицаВстречногоВыпускаДляОтбора = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.Скопировать();
		ТаблицаВстречногоВыпускаДляОтбора.Свернуть("Продукция, Подразделение, НоменклатурнаяГруппа, ПодразделениеПересчета, НоменклатурнаяГруппаПересчета", );		
		ВстречныйВыпуск = ТаблицаВстречногоВыпускаДляОтбора.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа", ПеределПодразделение, ПеределНоменклатурнаяГруппа));
		Если ВстречныйВыпуск.Количество() > 0  Тогда
			ПродукцияВстречногоВыпуска    = Новый Массив;
			ПодразделениеПересчета        = Новый Массив;
			НоменклатурнаяГруппаПересчета = Новый Массив;
			Для Каждого СтрокаВстречногоВыпуска Из ВстречныйВыпуск Цикл
				ПродукцияВстречногоВыпуска.Добавить(СтрокаВстречногоВыпуска.Продукция);
				ПодразделениеПересчета.Добавить(СтрокаВстречногоВыпуска.ПодразделениеПересчета);
				НоменклатурнаяГруппаПересчета.Добавить(СтрокаВстречногоВыпуска.НоменклатурнаяГруппаПересчета);
			КонецЦикла;
			Если РасчетПрямыхЗатратНомер = "1" Тогда
				УсловияВстречногоВыпуска2 = " И Не (РегВыпускПродукцииУслуг.Подразделение В (&ПодразделениеПересчета) И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа В (&НоменклатурнаяГруппаПересчета))";
			Иначе
				УсловияВстречногоВыпуска2 = " И РегВыпускПродукцииУслуг.Подразделение В (&ПодразделениеПересчета) И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа В (&НоменклатурнаяГруппаПересчета)";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегВыпускПродукцииУслуг.Подразделение КАК Подразделение,
	|	РегВыпускПродукцииУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	РегВыпускПродукцииУслуг.Продукция,
	|	РегВыпускПродукцииУслуг.ХарактеристикаПродукции,
	|	РегВыпускПродукцииУслуг.СерияПродукции,
	|	РегВыпускПродукцииУслуг.Заказ,
	|	РегВыпускПродукцииУслуг.Заказ.ВидОперации КАК ВидОперации,
	|	РегВыпускПродукцииУслуг.Качество,
	|	РегВыпускПродукцииУслуг.ДокументВыпуска,
	|	РегВыпускПродукцииУслуг.КодОперации,
	|	РегВыпускПродукцииУслуг.ПодразделениеПолучатель,
	|	РегВыпускПродукцииУслуг.СтатьяЗатратПолучатель,
	|	РегВыпускПродукцииУслуг.НоменклатурнаяГруппаПолучатель,
	|	РегВыпускПродукцииУслуг.СкладПолучатель,
	|
	|	СУММА(ЕСТЬNULL(РегВыпускПродукцииУслуг.Количество, 0)) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА РегВыпускПродукцииУслуг.ПрямыеРасходыРаспределятьПоКоличеству
	|				ТОГДА ЕСТЬNULL(РегВыпускПродукцииУслуг.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(РегВыпускПродукцииУслуг.ПлановаяСтоимость, 0)
	|		КОНЕЦ) КАК ПлановаяСтоимость,
	|	СУММА(ВЫБОР
	|			КОГДА РегВыпускПродукцииУслуг.ПрямыеРасходыРаспределятьПоКоличеству
	|				ТОГДА ЕСТЬNULL(РегВыпускПродукцииУслуг.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(РегВыпускПродукцииУслуг.ПлановыйНДС, 0)
	|		КОНЕЦ) КАК ПлановыйНДС,
	|	СУММА(ЕСТЬNULL(НЗП.СтоимостьОборот, 0)) КАК ВсегоПрямыхРасходов,
	|	СУММА(ЕСТЬNULL(НЗП.НДСОборот, 0)) КАК ВсегоПрямыхРасходовНДС,
	|	СУММА(ЕСТЬNULL(НЗП.СтоимостьКонечныйОстаток, 0)) КАК ОстатокПрямыхРасходов,
	|	СУММА(ЕСТЬNULL(НЗП.НДСКонечныйОстаток, 0)) КАК ОстатокПрямыхРасходовНДС,
	|	СУММА(ЕСТЬNULL(РегВыпускПродукцииУслуг.ПлановаяСтоимость, 0)) КАК СписаноРасходов,
	|	СУММА(ЕСТЬNULL(РегВыпускПродукцииУслуг.ПлановыйНДС, 0)) КАК СписаноРасходовНДС,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаУУ, 0)) КАК СуммаНЗП,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.НДСУУ, 0)) КАК НДСНЗП
	|ИЗ
	|   РегистрНакопления.ВыпускПродукцииУслуг КАК РегВыпускПродукцииУслуг
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрНакопления.НезавершенноеПроизводство.ОстаткиИОбороты(
	|		&НачГраница, 
	|		&КонГраница,
	|		,
	|		, 
	|   	Подразделение = &Подразделение
	|		И НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК НЗП
	|		ПО РегВыпускПродукцииУслуг.Подразделение = НЗП.Подразделение 
	|			И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа = НЗП.НоменклатурнаяГруппа 
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИнвентаризацияНЗП.Подразделение КАК Подразделение,
	|			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			СУММА(ИнвентаризацияНЗПСостав.СуммаУУ) КАК СуммаУУ, 
	|			СУММА(ИнвентаризацияНЗПСостав.НДСУУ) КАК НДСУУ
	|		ИЗ
	|			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
	|				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
	|		
	|		ГДЕ
	|			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата И
	|			ИнвентаризацияНЗП.ОтражатьВУправленческомУчете И
	|			(НЕ(ИнвентаризацияНЗП.ПометкаУдаления))
	|		СГРУППИРОВАТЬ ПО
	|			ИнвентаризацияНЗП.Подразделение,
	|			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа) КАК ОстаткиНЗП
	|		ПО НЗП.Подразделение = ОстаткиНЗП.Подразделение 
	|			И НЗП.НоменклатурнаяГруппа = ОстаткиНЗП.НоменклатурнаяГруппа
	|
	|ГДЕ
	|	РегВыпускПродукцииУслуг.Период МЕЖДУ &НачДата И &КонДата
	|	И РегВыпускПродукцииУслуг.Подразделение = &Подразделение
	|	И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	РегВыпускПродукцииУслуг.Подразделение,
	|	РегВыпускПродукцииУслуг.НоменклатурнаяГруппа,
	|	РегВыпускПродукцииУслуг.Продукция,
	|	РегВыпускПродукцииУслуг.ХарактеристикаПродукции,
	|	РегВыпускПродукцииУслуг.СерияПродукции,
	|	РегВыпускПродукцииУслуг.Заказ,
	|	РегВыпускПродукцииУслуг.Заказ.ВидОперации,
	|	РегВыпускПродукцииУслуг.Качество,
	|	РегВыпускПродукцииУслуг.ДокументВыпуска,
	|	РегВыпускПродукцииУслуг.КодОперации,
	|	РегВыпускПродукцииУслуг.ПодразделениеПолучатель,
	|	РегВыпускПродукцииУслуг.СтатьяЗатратПолучатель,
	|	РегВыпускПродукцииУслуг.НоменклатурнаяГруппаПолучатель,
	|	РегВыпускПродукцииУслуг.СкладПолучатель
	|
	|ИТОГИ 
	|	СУММА(Количество), 
	|	СУММА(ПлановаяСтоимость), 
	|	СУММА(ПлановыйНДС), 
	|	МАКСИМУМ(ОстатокПрямыхРасходов),  
	|	МАКСИМУМ(ОстатокПрямыхРасходовНДС), 
	|	СУММА(ВсегоПрямыхРасходов),
	|	СУММА(ВсегоПрямыхРасходовНДС),
	|	СУММА(СписаноРасходов), 
	|	СУММА(СписаноРасходовНДС), 
	|	МАКСИМУМ(СуммаНЗП), 
	|	МАКСИМУМ(НДСНЗП) 
	|ПО
	|	Подразделение,
	|	НоменклатурнаяГруппа
	|";
	
	Если ПеределНоменклатурнаяГруппа = "Все" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа = &НоменклатурнаяГруппа", УсловияВстречногоВыпуска2);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК НЗП", ") КАК НЗП");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа = &НоменклатурнаяГруппа", "И РегВыпускПродукцииУслуг.НоменклатурнаяГруппа = &НоменклатурнаяГруппа" + УсловияВстречногоВыпуска2);
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачДата",               мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",               мКонМесяца);
	Запрос.УстановитьПараметр("НачГраница",            мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",            мКонГраница);
	Запрос.УстановитьПараметр("Подразделение",         ПеределПодразделение);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа",  ПеределНоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппаПересчета",  НоменклатурнаяГруппаПересчета);
	Запрос.УстановитьПараметр("ПодразделениеПересчета",      ПодразделениеПересчета);
	Запрос.УстановитьПараметр("ПродукцияВстречногоВыпуска",  ПродукцияВстречногоВыпуска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоПрямымЗатратамУпр()

// Процедура формирования движений по прямым затратам по переделу
// Производит распределение прямых расходов, учтенных на регистре НезавершенноеПроизводство
// на стоимость продукции (услуг).
// Распределяются только те прямые расходы, для которых установлен текущий номер передела.
//
//	Параметры:
//		ВыполненоРаспределениеОПР - Булево - определяет на данный момент выполнено ли
//			распределение общепроизводственных и общехозяйственных расходов.
//
Процедура ДвиженияПоПрямымЗатратамУпр(СтруктураШапкиДокумента, ПеределПодразделение = "", ПеределНоменклатурнаяГруппа = "", ВыполненоРаспределениеОПР = Ложь, ТабТоваров, СтруктураДопПараметров)
	
	Если НЕ мУчетнаяПолитикаУУ.ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам Тогда
		ДвиженияПоПрямымЗатратамПоУслугамУпр(СтруктураШапкиДокумента, СтруктураДопПараметров, ВыполненоРаспределениеОПР);
	КонецЕсли;
	
	НаборДвиженийПартии   = Движения["ПартииТоваровНаСкладах"];
	ТаблицаДвиженийПартии = НаборДвиженийПартии.ВыгрузитьКолонки();
	
	НаборДвиженийЗатраты   = Движения["Затраты"];
	ТаблицаДвиженийЗатраты = НаборДвиженийЗатраты.ВыгрузитьКолонки();
	
	НаборДвиженийНЗП   = Движения["НезавершенноеПроизводство"];
	ТаблицаДвиженийНЗП = НаборДвиженийНЗП.ВыгрузитьКолонки();
	ТаблицаДвиженийНЗПРасход = ТаблицаДвиженийНЗП.Скопировать();
	
	НаборДвиженийБракВПроизводстве   = Движения["БракВПроизводстве"];
	ТаблицаДвиженийБракВПроизводстве = НаборДвиженийБракВПроизводстве.ВыгрузитьКолонки();
	
	НаборДвиженийПродажиСебестоимость  = Движения["ПродажиСебестоимость"];
	ТаблицаДвиженийПродажиСебестоимость = НаборДвиженийПродажиСебестоимость.ВыгрузитьКолонки();
	
	// Формирование запроса по прямым расходам.
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоПрямымЗатратамУпр(СтруктураШапкиДокумента, ПеределПодразделение, ПеределНоменклатурнаяГруппа, РезультатЗапроса, СтруктураДопПараметров, ВыполненоРаспределениеОПР);
	
	ЗаписьРасчетаСебестоимости = СтруктураДопПараметров.ЗаписьРасчетаСебестоимости;
	
	// Выбираются прямые расходы в разрезе подразделения, номенклатурной группы.
	ОбходПоПодразделениям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоПодразделениям.Следующий() Цикл
		ОбходПоНомГруппам = ОбходПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоНомГруппам.Следующий() Цикл
			
			// Прямые расходы за минусом НЗП подлежат распределению
			// на стоимость готовой продукции, услуг.
			// Т.к. при оприходовании на склад готовой продукции часть прямых
			// расходов (в размере плановой стоимости этой продукции) была
			// списана, то необходимо к общей сумме прямых расходов прибавить
			// списанную ранее сумму прямых расходов.
			
			СписаноРасходов = ОбходПоНомГруппам.СписаноРасходов;
			ВсегоПрямыхРасходов = ОбходПоНомГруппам.ОстатокПрямыхРасходов + ?(ВыполненоРаспределениеОПР, 0, СписаноРасходов);
			СуммаНЗП = ОбходПоНомГруппам.СуммаНЗП;
			СуммаПрямыхРасходовНаВыпуск = ВсегоПрямыхРасходов - СуммаНЗП;
			
			СписаноРасходовНДС = ОбходПоНомГруппам.СписаноРасходовНДС;
			ВсегоПрямыхРасходовНДС = ОбходПоНомГруппам.ОстатокПрямыхРасходовНДС + ?(ВыполненоРаспределениеОПР, 0, СписаноРасходовНДС);
			НДСНЗП = ОбходПоНомГруппам.НДСНЗП;
			СуммаПрямыхРасходовНДСНаВыпуск = ВсегоПрямыхРасходовНДС - НДСНЗП;
			
			// В качестве базы распределения прямых расходов на выпущенную продукцию
			// используется плановая себестоимость.
			// В качестве базы распределения НДС прямых расходов на выпущенную продукцию
			// используется плановый НДС.
			
			ВсегоБазаРаспределения = ОбходПоНомГруппам.ПлановаяСтоимость;
			ВсегоБазаРаспределенияНДС = ОбходПоНомГруппам.ПлановыйНДС;
			РаспределеноБазыРаспределения = 0;
			РаспределеноБазыРаспределенияНДС = 0;
			СписаноПрямыхРасходов = 0;
			СписаноПрямыхРасходовНДС = 0;
			
			ПоследнийПередел = (Лев(СтруктураДопПараметров.РасчетПрямыхЗатратНомер, 1) = "1" Или  СтруктураДопПараметров.РасчетПрямыхЗатратНомер = "");
			Если ПоследнийПередел И НЕ ВыполненоРаспределениеОПР И (НЕ СуммаНЗП = 0 ИЛИ НЕ НДСНЗП = 0) Тогда
				СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
				СтрокаЗаписиРасчетаСебестоимости.Подразделение 		  = ОбходПоПодразделениям.Подразделение;
				СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа = ОбходПоНомГруппам.НоменклатурнаяГруппа;
				СтрокаЗаписиРасчетаСебестоимости.ВидОперации 		  = Перечисления.ВидыОперацийРасчетаСебестоимости.РасходыНаПроизводствоПродукцииИУслуг;
				СтрокаЗаписиРасчетаСебестоимости.СуммаНЗП 			  = СуммаНЗП;
				СтрокаЗаписиРасчетаСебестоимости.НДСНЗП		 		  = НДСНЗП;
				СтрокаЗаписиРасчетаСебестоимости.Сумма    =  0;
				СтрокаЗаписиРасчетаСебестоимости.НДС      =  0;
				СтрокаЗаписиРасчетаСебестоимости.СуммаПлан=  0;
				СтрокаЗаписиРасчетаСебестоимости.НДСПлан=  0;
				
			КонецЕсли;	
			
			// Обход по операциям выпуска продукции (услуг). Обходя все операции выпуска
			// производим распределение по ним прямых расходов.
			ТаблицаКорректируемыхНаправлений = Новый ТаблицаЗначений;
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Продукция");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Подразделение");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НоменклатурнаяГруппа");
			
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ХарактеристикаПродукции");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СерияПродукции");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Заказ");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ВидОперации");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Качество");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ДокументВыпуска");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("КодОперации");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ПодразделениеПолучатель");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СтатьяЗатратПолучатель");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НоменклатурнаяГруппаПолучатель");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СкладПолучатель");
			
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("Количество");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаКорректировкиСписания");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НДСКорректировкиСписания");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СписаноРасходов");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СписаноРасходовНДС");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ПлановаяСтоимость");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("ПлановыйНДС");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("СуммаНЗП");
			ТаблицаКорректируемыхНаправлений.Колонки.Добавить("НДСНЗП");
			
			
			СуммаНеКорректируемыхНаправлений = 0;
			НДСНеКорректируемыхНаправлений = 0;
			
			Обход = ОбходПоНомГруппам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СуммаКорректировкиСписанияИтог = 0;
			Пока Обход.Следующий() Цикл
				
				РаспределеноБазыРаспределения = РаспределеноБазыРаспределения + Обход.ПлановаяСтоимость;
				РаспределеноБазыРаспределенияНДС = РаспределеноБазыРаспределенияНДС + Обход.ПлановыйНДС;
				
				Если ВсегоБазаРаспределения = 0 Тогда
					СуммаСписания = 0;
				Иначе
					СуммаСписания = Окр(СуммаПрямыхРасходовНаВыпуск/ВсегоБазаРаспределения*РаспределеноБазыРаспределения, 2) - СписаноПрямыхРасходов;
				КонецЕсли;
				
				Если ВсегоБазаРаспределенияНДС = 0 Тогда
					НДССписания = 0;
				Иначе
					НДССписания = Окр(СуммаПрямыхРасходовНДСНаВыпуск/ВсегоБазаРаспределенияНДС*РаспределеноБазыРаспределенияНДС, 2) - СписаноПрямыхРасходовНДС;
				КонецЕсли;
				
				СписаноПрямыхРасходов 		= СписаноПрямыхРасходов    + СуммаСписания;
				СписаноПрямыхРасходовНДС 	= СписаноПрямыхРасходовНДС + НДССписания;
				
				Если ВыполненоРаспределениеОПР Тогда
					СуммаКорректировкиСписания = СуммаСписания;
					НДСКорректировкиСписания   = НДССписания;
				Иначе
					СуммаКорректировкиСписания = СуммаСписания - Обход.СписаноРасходов;
					НДСКорректировкиСписания   = НДССписания   - Обход.СписаноРасходовНДС;
				КонецЕсли; 
				
				Если Найти("ПоСредней", СтруктураДопПараметров.РасчетПрямыхЗатратНомер) = 0 Тогда
					УровеньВстречногоВыпуска = (Лев(СтруктураДопПараметров.РасчетПрямыхЗатратНомер, 1) = "3");
				Иначе
					УровеньВстречногоВыпуска =  Ложь;
				КонецЕсли;
				
				
				Если УровеньВстречногоВыпуска И СтруктураДопПараметров.РасчетПрямыхЗатратНомер <> "3ПоCредней" Тогда
					
					ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, Продукция, ДокументОприходования, Склад", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.Продукция, Обход.ДокументВыпуска, Обход.СкладПолучатель));
					Если ВстречныйВыпуск.Количество() > 0 Тогда
						СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
						НДСНеКорректируемыхНаправлений = НДСНеКорректируемыхНаправлений + НДСКорректировкиСписания;
						Продолжить;
					Иначе
						ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, Продукция, ДокументОприходования", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.Продукция, Обход.ДокументВыпуска));
						Если ВстречныйВыпуск.Количество() > 0 Тогда
							СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
							Продолжить;
						КонецЕсли;							
						
						ВстречныйВыпуск = СтруктураДопПараметров.ТаблицаВстречногоВыпуска.НайтиСтроки(Новый Структура("Подразделение, НоменклатурнаяГруппа, ПодразделениеПересчета", Обход.Подразделение, Обход.НоменклатурнаяГруппа, Обход.ПодразделениеПолучатель));
						Если ВстречныйВыпуск.Количество() > 0 Тогда
							СуммаНеКорректируемыхНаправлений = СуммаНеКорректируемыхНаправлений + СуммаКорректировкиСписания;
							НДСНеКорректируемыхНаправлений = НДСНеКорректируемыхНаправлений + НДСКорректировкиСписания;
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаКорректируемыхНаправлений.Добавить();
				НоваяСтрока.Продукция            			= Обход.Продукция;
				НоваяСтрока.Подразделение        			= Обход.Подразделение;
				НоваяСтрока.НоменклатурнаяГруппа 			= Обход.НоменклатурнаяГруппа;
				
				НоваяСтрока.ХарактеристикаПродукции    		= Обход.ХарактеристикаПродукции;
				НоваяСтрока.СерияПродукции    				= Обход.СерияПродукции;
				НоваяСтрока.Заказ							= Обход.Заказ;
				НоваяСтрока.ВидОперации						= Обход.ВидОперации;
				НоваяСтрока.Качество    					= Обход.Качество;
				НоваяСтрока.ДокументВыпуска    				= Обход.ДокументВыпуска;
				НоваяСтрока.КодОперации    					= Обход.КодОперации;
				НоваяСтрока.ПодразделениеПолучатель    		= Обход.ПодразделениеПолучатель;
				НоваяСтрока.СтатьяЗатратПолучатель    		= Обход.СтатьяЗатратПолучатель;
				НоваяСтрока.НоменклатурнаяГруппаПолучатель	= Обход.НоменклатурнаяГруппаПолучатель;
				НоваяСтрока.СкладПолучатель					= Обход.СкладПолучатель;
				
				НоваяСтрока.Количество           			= Обход.Количество;
				НоваяСтрока.СуммаКорректировкиСписания 		= СуммаКорректировкиСписания;
				НоваяСтрока.НДСКорректировкиСписания 		= НДСКорректировкиСписания;
				НоваяСтрока.СписаноРасходов 				= ?(ВыполненоРаспределениеОПР, 0, Обход.СписаноРасходов);
				НоваяСтрока.СписаноРасходовНДС 				= ?(ВыполненоРаспределениеОПР, 0, Обход.СписаноРасходовНДС);
				
				НоваяСтрока.ПлановаяСтоимость   			= Обход.ПлановаяСтоимость;
				НоваяСтрока.ПлановыйНДС			   			= Обход.ПлановыйНДС;
				НоваяСтрока.СуммаНЗП            			= Обход.СуммаНЗП;
				НоваяСтрока.НДСНЗП            				= Обход.НДСНЗП;
				
			КонецЦикла; // по направлениям выпуска продукции (услуг)
			
			ВсегоКорректировок = ТаблицаКорректируемыхНаправлений.Итог("СуммаКорректировкиСписания");
			ВсегоКорректировокНДС = ТаблицаКорректируемыхНаправлений.Итог("НДСКорректировкиСписания");
			
			КоэффициентРаспределенияНекорректируемойСуммы = ?(ВсегоКорректировок = 0, 0, СуммаНеКорректируемыхНаправлений / ВсегоКорректировок);
			КоэффициентРаспределенияНекорректируемойСуммыНДС = ?(ВсегоКорректировокНДС = 0, 0, НДСНеКорректируемыхНаправлений / ВсегоКорректировокНДС);
			
			Для Каждого Обход Из ТаблицаКорректируемыхНаправлений Цикл
				СуммаКорректировкиСписания = Обход.СуммаКорректировкиСписания * (1 + КоэффициентРаспределенияНекорректируемойСуммы);
				НДСКорректировкиСписания = Обход.НДСКорректировкиСписания * (1 + КоэффициентРаспределенияНекорректируемойСуммыНДС);
				
				СписаноРасходов = Обход.СписаноРасходов * (1 + КоэффициентРаспределенияНекорректируемойСуммы);	
				СписаноРасходовНДС = Обход.СписаноРасходовНДС * (1 + КоэффициентРаспределенияНекорректируемойСуммыНДС);	
				
				// Формирование движений по списанию
				Если СуммаКорректировкиСписания <> 0 ИЛИ НДСКорректировкиСписания <> 0 Тогда
					
					
					// списываем НЗП на сумму отклонений
					НоваяСтрока = ТаблицаДвиженийНЗПРасход.Добавить();
					НоваяСтрока.НоменклатурнаяГруппа = Обход.НоменклатурнаяГруппа;
					НоваяСтрока.Подразделение 		 = Обход.Подразделение;
					
					НоваяСтрока.Стоимость     = СуммаКорректировкиСписания;
					НоваяСтрока.НДС           = НДСКорректировкиСписания;
					
					НоваяСтрока.Продукция            			= Обход.Продукция;
					НоваяСтрока.ХарактеристикаПродукции    		= Обход.ХарактеристикаПродукции;
					НоваяСтрока.СерияПродукции    				= Обход.СерияПродукции;
					НоваяСтрока.Заказ							= Обход.Заказ;
					НоваяСтрока.Качество    					= Обход.Качество;
					
					НоваяСтрока.КодОперации   = Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеНЗПРегламент;
					
					// досписуем по направлениям выпуска на сумму отклонений
					ДосписатьПоНаправлениюВыпускаУпр(Обход, СтруктураШапкиДокумента, СуммаКорректировкиСписания, НДСКорректировкиСписания, ТаблицаДвиженийПартии, ТаблицаДвиженийЗатраты, ТаблицаДвиженийНЗП, ТаблицаДвиженийБракВПроизводстве, ТаблицаДвиженийПродажиСебестоимость);
					
					// Добавим в таблицу список номенклатуры, у которой изменилась средневзвешенная
					// стоимость и, следовательно, необходимо выполнить корректировку списаний.
					НоваяСтрока = ТабТоваров.Добавить();
					НоваяСтрока.Номенклатура          = Обход.Продукция;
					Если Не мУчетнаяПолитикаУУ["СпособОценкиМПЗ"] = Перечисления.СпособыОценки.ПоСредней Тогда
						НоваяСтрока.ДокументОприходования = Обход.ДокументВыпуска;
					КонецЕсли;
					
					СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
					СтрокаЗаписиРасчетаСебестоимости.Подразделение 			= ОбходПоПодразделениям.Подразделение;
					СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа 	= ОбходПоНомГруппам.НоменклатурнаяГруппа;
					СтрокаЗаписиРасчетаСебестоимости.Продукция 				= Обход.Продукция;
					СтрокаЗаписиРасчетаСебестоимости.ХарактеристикаПродукции= Обход.ХарактеристикаПродукции;
					СтрокаЗаписиРасчетаСебестоимости.СерияПродукции    		= Обход.СерияПродукции;
					СтрокаЗаписиРасчетаСебестоимости.Заказ					= Обход.Заказ;
					СтрокаЗаписиРасчетаСебестоимости.Качество				= Обход.Качество;
					СтрокаЗаписиРасчетаСебестоимости.СуммаПлан 				= Обход.ПлановаяСтоимость;
					СтрокаЗаписиРасчетаСебестоимости.НДСПлан 				= Обход.ПлановыйНДС;
					СтрокаЗаписиРасчетаСебестоимости.ДокументВыпуска 		= Строка(Обход.ДокументВыпуска) + " " + Строка(Обход.СкладПолучатель);

					СтрокаЗаписиРасчетаСебестоимости.ВидОперации 			= Перечисления.ВидыОперацийРасчетаСебестоимости.ВыпускПродукцииИУслуг;
					СтрокаЗаписиРасчетаСебестоимости.Сумма 					= СуммаКорректировкиСписания;
					СтрокаЗаписиРасчетаСебестоимости.НДС 					= НДСКорректировкиСписания;
					
				КонецЕсли;
				
			КонецЦикла
			
		КонецЦикла; // по номенклатурным группам
	КонецЦикла; // по подразделениям
	
	
	НаборДвиженийПартии.мПериод = Дата;
	НаборДвиженийПартии.мТаблицаДвижений = ТаблицаДвиженийПартии;
	НаборДвиженийПартии.ВыполнитьПриход();
	НаборДвиженийПартии.Записать(Ложь);
	
	НаборДвиженийНЗП.мПериод = Дата;
	НаборДвиженийНЗП.мТаблицаДвижений = ТаблицаДвиженийНЗП;
	НаборДвиженийНЗП.ВыполнитьПриход();
	НаборДвиженийНЗП.Записать(Ложь);
	
	НаборДвиженийНЗП.мПериод = Дата;
	НаборДвиженийНЗП.мТаблицаДвижений = ТаблицаДвиженийНЗПРасход;
	НаборДвиженийНЗП.ВыполнитьРасход();
	НаборДвиженийНЗП.Записать(Ложь);
	
	НаборДвиженийЗатраты.мПериод = Дата;
	НаборДвиженийЗатраты.мТаблицаДвижений = ТаблицаДвиженийЗатраты;
	НаборДвиженийЗатраты.ВыполнитьПриход();
	НаборДвиженийЗатраты.Записать(Ложь);

	НаборДвиженийБракВПроизводстве.мПериод = Дата;
	НаборДвиженийБракВПроизводстве.мТаблицаДвижений = ТаблицаДвиженийБракВПроизводстве;
	НаборДвиженийБракВПроизводстве.ВыполнитьПриход();
	НаборДвиженийБракВПроизводстве.Записать(Ложь);
	
	НаборДвиженийПродажиСебестоимость.мПериод = Дата;
	НаборДвиженийПродажиСебестоимость.мТаблицаДвижений = ТаблицаДвиженийПродажиСебестоимость;
	НаборДвиженийПродажиСебестоимость.ВыполнитьДвижения();
	НаборДвиженийПродажиСебестоимость.Записать(Ложь);
	
			
КонецПроцедуры // ДвиженияПоПрямымЗатратамУпр()

// Процедура формирует движения по направлениям выпуска
//
Процедура ДосписатьПоНаправлениюВыпускаУпр(СтрокаОбхода, СтруктураШапкиДокумента, Сумма, НДС, ТаблицаДвиженийПартии, ТаблицаДвиженийЗатраты, ТаблицаДвиженийНЗП, ТаблицаДвиженийБракВПроизводстве, ТаблицаДвиженийПродажиСебестоимость)
	
	// Списание продукции на склад
	// Код операции = ВыпускПродукцииФиксНаСклад
	Если СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксНаСклад
	 ИЛИ СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВозвратМатериаловИзПроизводстваРасч Тогда
	 
		ВыпускПродукцииИзДавальческогоСырья = Ложь;
		Если ТипЗнч(СтрокаОбхода.Заказ) = ТипЗнч(Документы.ЗаказПокупателя.ПустаяСсылка()) И СтрокаОбхода.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
			ВыпускПродукцииИзДавальческогоСырья = Истина;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДвиженийПартии.Добавить();
		НоваяСтрока.Номенклатура          = СтрокаОбхода.Продукция;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаОбхода.ХарактеристикаПродукции;
		НоваяСтрока.СерияНоменклатуры     = ?(СтрокаОбхода.Продукция.ВестиПартионныйУчетПоСериям, СтрокаОбхода.СерияПродукции, Неопределено);
		
		Если ВыпускПродукцииИзДавальческогоСырья Тогда
			НоваяСтрока.СтатусПартии      = Перечисления.СтатусыПартийТоваров.ВПереработку;
		Иначе
			НоваяСтрока.СтатусПартии      = Перечисления.СтатусыПартийТоваров.Продукция;
		КонецЕсли;
		
		Если ВыпускПродукцииИзДавальческогоСырья Тогда
			НоваяСтрока.Заказ             = СтрокаОбхода.Заказ;
		КонецЕсли;
		
		Если мУчетнаяПолитикаУУ.ВестиПартионныйУчетПоСкладам И НЕ ВыпускПродукцииИзДавальческогоСырья Тогда
			НоваяСтрока.Склад             = СтрокаОбхода.СкладПолучатель;
		КонецЕсли;
		
		НоваяСтрока.Качество              = СтрокаОбхода.Качество;
		
		Если Не мУчетнаяПолитикаУУ["СпособОценкиМПЗ"] = Перечисления.СпособыОценки.ПоСредней Тогда
			НоваяСтрока.ДокументОприходования = СтрокаОбхода.ДокументВыпуска;
		КонецЕсли;
		
		НоваяСтрока.Стоимость   = Сумма;
		НоваяСтрока.НДС         = НДС;
		НоваяСтрока.Количество  = 0; // Количество уже списано! Только корректируем стоимость
		
		НоваяСтрока.КодОперации = Перечисления.КодыОперацийПартииТоваров.ВыпускПоОперацииСтоимость;
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксВнутрУслугиНаПостЗатраты Тогда
		
		
		// Списание продукции на затраты другого подразделения
		// КодОперации = ВыпускПродукцииФиксВнутрУслугиНаПостЗатраты
		Если СтрокаОбхода.СтатьяЗатратПолучатель.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			НоваяСтрока = ТаблицаДвиженийБракВПроизводстве.Добавить();
			
			НоваяСтрока.НоменклатурнаяГруппа    = СтрокаОбхода.НоменклатурнаяГруппаПолучатель;
			НоваяСтрока.Подразделение           = СтрокаОбхода.ПодразделениеПолучатель;
			НоваяСтрока.СтатьяЗатрат            = СтрокаОбхода.СтатьяЗатратПолучатель;
			
			НоваяСтрока.Сумма                   = Сумма;
			НоваяСтрока.НДС                     = НДС;
			
			НоваяСтрока.КодОперации             = Перечисления.КодыОперацийБракВПроизводстве.ВнутренниеУслугиНаПостоянныеЗатраты;
			
		Иначе
			
			НоваяСтрока = ТаблицаДвиженийЗатраты.Добавить();
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаОбхода.НоменклатурнаяГруппаПолучатель;
			НоваяСтрока.Подразделение = СтрокаОбхода.ПодразделениеПолучатель;
			НоваяСтрока.СтатьяЗатрат  = СтрокаОбхода.СтатьяЗатратПолучатель;
			
			НоваяСтрока.Сумма         = Сумма;
			НоваяСтрока.НДС		      = НДС;
			
			
		КонецЕсли;
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксВнутрУслугиНаПроизводство
		  ИЛИ СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.КорректировкаНЗПРасч Тогда
		  
		  
		НоваяСтрока = ТаблицаДвиженийНЗП.Добавить();
		
		НоваяСтрока.НоменклатурнаяГруппа = СтрокаОбхода.НоменклатурнаяГруппаПолучатель;
		НоваяСтрока.Подразделение = СтрокаОбхода.ПодразделениеПолучатель;
		НоваяСтрока.СтатьяЗатрат  = СтрокаОбхода.СтатьяЗатратПолучатель;
		
		НоваяСтрока.Стоимость     = Сумма;
		НоваяСтрока.НДС 		  = НДС;
		
		НоваяСтрока.КодОперации   = Перечисления.КодыОперацийНезавершенноеПроизводство.ВнутренниеУслугиНаПроизводство;
		  
		НоваяСтрока.НоменклатураЗатрат = СтрокаОбхода.Подразделение;  
		
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.СписаниеНЗП Тогда
		
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ОприходованиеНЗП Тогда
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксВнешниеУслуги Тогда
		
		НоваяСтрока = ТаблицаДвиженийПродажиСебестоимость.Добавить();
		НоваяСтрока.Номенклатура       			= СтрокаОбхода.Продукция;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаОбхода.ХарактеристикаПродукции;
		НоваяСтрока.ЗаказПокупателя         	= СтрокаОбхода.Заказ;
		НоваяСтрока.ДокументОприходования       = СтрокаОбхода.ДокументВыпуска;
		НоваяСтрока.Подразделение       		= СтрокаОбхода.Подразделение;
		
		НоваяСтрока.ДокументДвижения 			= СтрокаОбхода.ДокументВыпуска;
		НоваяСтрока.ДокументДвиженияПериод 		= СтрокаОбхода.ДокументВыпуска.Дата;
		
		НоваяСтрока.Стоимость = Сумма;
		НоваяСтрока.НДС       = НДС;
		
	ИначеЕсли СтрокаОбхода.КодОперации = Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксВнутрУслугиНаСчет Тогда
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Не обработан код операции """ + СтрокаОбхода.КодОперации + """.
				 |Процедура <ДосписатьПоНаправлениюВыпускаУпр>");
	КонецЕсли;
			 
КонецПроцедуры // ДосписатьПоНаправлениюВыпускаУпр()

// Процедура списывает затраты по услугам, реализация которых отражена без отражения выпуска в плановых ценах
Процедура ДвиженияПоПрямымЗатратамПоУслугамУпр(СтруктураШапкиДокумента, СтруктураДопПараметров, ВыполненоРаспределениеОПР, Отказ = Ложь)
	
	НаборДвиженийНЗП   = Движения["НезавершенноеПроизводство"];
	ТаблицаДвиженийНЗП = НаборДвиженийНЗП.ВыгрузитьКолонки();
	
	НаборДвиженийПродажиСебестоимость  = Движения["ПродажиСебестоимость"];
	ТаблицаДвиженийПродажиСебестоимость = НаборДвиженийПродажиСебестоимость.ВыгрузитьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",               мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",               мКонМесяца);
	
	Запрос.УстановитьПараметр("НачГраница",            мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",            мКонГраница);
	
	Запрос.Текст = 
  "ВЫБРАТЬ
   |	НЗПОстатки.Подразделение КАК Подразделение,
   |	НЗПОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
   |	СУММА(ЕСТЬNULL(НЗПОстатки.СтоимостьОстаток, 0)) КАК ОстатокПрямыхРасходов,
   |	СУММА(ЕСТЬNULL(НЗПОстатки.НДСОстаток, 0)) КАК ОстатокПрямыхРасходовНДС,
   |	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.СуммаУУ, 0)) КАК СуммаНЗП,
   |	МАКСИМУМ(ЕСТЬNULL(ОстаткиНЗП.НДСУУ, 0)) КАК НДСНЗП,
   |	РеализацияУслуг.Номенклатура КАК Номенклатура, 
   |	РеализацияУслуг.Подразделение КАК ПодразделениеУслуг, 
   |	РеализацияУслуг.ЗаказПокупателя КАК ЗаказПокупателя,
   |	РеализацияУслуг.ДокументПродажи КАК ДокументПродажи,
   |	РеализацияУслуг.ДокументПродажи.Дата КАК ДокументПродажиДата,
   |	РеализацияУслуг.СуммаОборот КАК Выручка, 
   |	РеализацияУслуг.НДСОборот КАК НДС
   |ИЗ
   |	РегистрНакопления.НезавершенноеПроизводство.Остатки(&КонГраница, ) КАК НЗПОстатки
   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
   |			РеализацияУслугОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
   |	        РеализацияУслугОбороты.Номенклатура КАК Номенклатура, 
   |			РеализацияУслугОбороты.Подразделение КАК Подразделение,
   |			РеализацияУслугОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
   |			РеализацияУслугОбороты.ДокументПродажи КАК ДокументПродажи,
   |			СУММА(ЕСТЬNULL(РеализацияУслугОбороты.СуммаОборот, 0)) КАК СуммаОборот,
   |			СУММА(ЕСТЬNULL(РеализацияУслугОбороты.НДСОборот, 0)) КАК НДСОборот
   |		ИЗ
   |			РегистрНакопления.РеализацияУслугУправленческийУчет.Обороты(&НачГраница, &КонГраница) КАК РеализацияУслугОбороты
   |		
   |		СГРУППИРОВАТЬ ПО
   |			РеализацияУслугОбороты.НоменклатурнаяГруппа,
   |	        РеализацияУслугОбороты.Номенклатура, 
   |			РеализацияУслугОбороты.ЗаказПокупателя,
   |			РеализацияУслугОбороты.ДокументПродажи,
   |            РеализацияУслугОбороты.Подразделение) КАК РеализацияУслуг
   |		ПО НЗПОстатки.НоменклатурнаяГруппа = РеализацияУслуг.НоменклатурнаяГруппа
   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
   |			ИнвентаризацияНЗП.Подразделение КАК Подразделение,
   |			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
   |			СУММА(ИнвентаризацияНЗПСостав.СуммаУУ) КАК СуммаУУ,
   |			СУММА(ИнвентаризацияНЗПСостав.НДСУУ) КАК НДСУУ
   |		ИЗ
   |			Документ.ИнвентаризацияНЗП.Состав КАК ИнвентаризацияНЗПСостав
   |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияНЗП КАК ИнвентаризацияНЗП
   |				ПО ИнвентаризацияНЗПСостав.Ссылка = ИнвентаризацияНЗП.Ссылка
   |		ГДЕ
   |			ИнвентаризацияНЗП.Дата МЕЖДУ &НачДата И &КонДата
   |			И ИнвентаризацияНЗП.ОтражатьВУправленческомУчете
   |			И (НЕ ИнвентаризацияНЗП.ПометкаУдаления)
   |		
   |		СГРУППИРОВАТЬ ПО
   |			ИнвентаризацияНЗП.Подразделение,
   |			ИнвентаризацияНЗПСостав.НоменклатурнаяГруппа) КАК ОстаткиНЗП
   |		ПО НЗПОстатки.НоменклатурнаяГруппа = ОстаткиНЗП.НоменклатурнаяГруппа
   |			И НЗПОстатки.Подразделение = ОстаткиНЗП.Подразделение
   |
   |СГРУППИРОВАТЬ ПО
   |	НЗПОстатки.Подразделение,
   |	НЗПОстатки.НоменклатурнаяГруппа,
   |	РеализацияУслуг.Номенклатура, 
   |	РеализацияУслуг.Подразделение, 
   |	РеализацияУслуг.ЗаказПокупателя,
   |	РеализацияУслуг.ДокументПродажи,
   |	РеализацияУслуг.СуммаОборот, 
   |	РеализацияУслуг.НДСОборот
   |ИТОГИ
   |	МАКСИМУМ(ОстатокПрямыхРасходов),
   |	МАКСИМУМ(ОстатокПрямыхРасходовНДС),
   |	МАКСИМУМ(СуммаНЗП),
   |	МАКСИМУМ(НДСНЗП),
   |	СУММА(Выручка),
   |	СУММА(НДС)
   |ПО
   |	Подразделение,
   |	НоменклатурнаяГруппа";
   
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаписьРасчетаСебестоимости = СтруктураДопПараметров.ЗаписьРасчетаСебестоимости;
	
	ОбходПоПодразделениям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоПодразделениям.Следующий() Цикл
		ОбходПоНомГруппам = ОбходПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоНомГруппам.Следующий() Цикл
			
			Если ОбходПоНомГруппам.Выручка = NULL И ОбходПоНомГруппам.НДС = NULL Тогда
				Продолжить;
			КонецЕсли;
			
			// Прямые расходы за минусом НЗП подлежат распределению
			// на стоимость услуг
			
			// В качестве базы распределения прямых расходов на услуги без плановых цен используется выручка
			// для распределения НДС прямых расходов используется НДС выручки
			
			ВсегоБазаРаспределения = ОбходПоНомГруппам.Выручка;
			ВсегоБазаРаспределенияНДС = ОбходПоНомГруппам.НДС;
			ВсегоПрямыхРасходов = ОбходПоНомГруппам.ОстатокПрямыхРасходов;
			ВсегоПрямыхРасходовНДС = ОбходПоНомГруппам.ОстатокПрямыхРасходовНДС;
			СуммаНЗП = ОбходПоНомГруппам.СуммаНЗП;
			НДСНЗП = ОбходПоНомГруппам.НДСНЗП;
			
			СуммаПрямыхРасходовНаВыпуск = ВсегоПрямыхРасходов - СуммаНЗП;
			НДСПрямыхРасходовНаВыпуск = ВсегоПрямыхРасходовНДС - НДСНЗП;
			
			Обход = ОбходПоНомГруппам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Обход.Следующий() Цикл
				
				Если ВсегоБазаРаспределения = 0 Тогда
					СуммаКорректировкиСписания = 0;
				Иначе
					СуммаКорректировкиСписания = Окр(СуммаПрямыхРасходовНаВыпуск*Обход.Выручка/ВсегоБазаРаспределения, 2);
				КонецЕсли;
				
				Если ВсегоБазаРаспределенияНДС = 0 Тогда
					НДСКорректировкиСписания = 0;
				Иначе
					НДСКорректировкиСписания = Окр(НДСПрямыхРасходовНаВыпуск * Обход.НДС/ВсегоБазаРаспределенияНДС, 2);
				КонецЕсли;
				
									
				Если СуммаКорректировкиСписания <> 0 ИЛИ НДСКорректировкиСписания <> 0 Тогда
					
					// Списуем сумму и НДС из НЗП, добавляем в ПродажиСебестоимость
					
					НоваяСтрока = ТаблицаДвиженийПродажиСебестоимость.Добавить();
					НоваяСтрока.Номенклатура       			= Обход.Номенклатура;
					// НоваяСтрока.ХарактеристикаНоменклатуры 	= ;
					НоваяСтрока.ЗаказПокупателя         	= Обход.ЗаказПокупателя;
					// НоваяСтрока.ДокументОприходования       = СтрокаОбхода.ДокументВыпуска;
					НоваяСтрока.Подразделение       		= Обход.ПодразделениеУслуг;
					
					НоваяСтрока.ДокументДвижения 			= Обход.ДокументПродажи;
					НоваяСтрока.ДокументДвиженияПериод 		= Обход.ДокументПродажиДата;
					
					НоваяСтрока.Стоимость = СуммаКорректировкиСписания;
					НоваяСтрока.НДС       = НДСКорректировкиСписания;
					
					
					НоваяСтрока = ТаблицаДвиженийНЗП.Добавить();
					
					НоваяСтрока.НоменклатурнаяГруппа = Обход.НоменклатурнаяГруппа;
					НоваяСтрока.Подразделение 		 = Обход.Подразделение;
					
					НоваяСтрока.Стоимость     = СуммаКорректировкиСписания;
					НоваяСтрока.НДС           = НДСКорректировкиСписания;
					
					Если СуммаКорректировкиСписания <> 0 ИЛИ НДСКорректировкиСписания <> 0 Тогда
						СтрокаЗаписиРасчетаСебестоимости = ЗаписьРасчетаСебестоимости.Добавить();
						СтрокаЗаписиРасчетаСебестоимости.Подразделение 			= ОбходПоПодразделениям.Подразделение;
						СтрокаЗаписиРасчетаСебестоимости.НоменклатурнаяГруппа 	= ОбходПоНомГруппам.НоменклатурнаяГруппа;
						СтрокаЗаписиРасчетаСебестоимости.СуммаПлан 				= 0;
						СтрокаЗаписиРасчетаСебестоимости.НДСПлан 				= 0;
						СтрокаЗаписиРасчетаСебестоимости.ВидОперации 			= Перечисления.ВидыОперацийРасчетаСебестоимости.УслугиБезИспользованияПлановыхЦен;
						СтрокаЗаписиРасчетаСебестоимости.Сумма 					= СуммаКорректировкиСписания;
						СтрокаЗаписиРасчетаСебестоимости.НДС 					= НДСКорректировкиСписания;
						СтрокаЗаписиРасчетаСебестоимости.СуммаНЗП				= СуммаНЗП;
						СтрокаЗаписиРасчетаСебестоимости.НДСНЗП					= НДСНЗП;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла; // по направлениям выпуска продукции (услуг)
		КонецЦикла; // по номенклатурным группам
	КонецЦикла; // по подразделениям
	
	НаборДвиженийНЗП.мПериод = Дата;
	НаборДвиженийНЗП.мТаблицаДвижений = ТаблицаДвиженийНЗП;
	НаборДвиженийНЗП.ВыполнитьРасход();
	НаборДвиженийНЗП.Записать(Ложь);
	
	НаборДвиженийПродажиСебестоимость.мПериод = Дата;
	НаборДвиженийПродажиСебестоимость.мТаблицаДвижений = ТаблицаДвиженийПродажиСебестоимость;
	НаборДвиженийПродажиСебестоимость.ВыполнитьДвижения();
	НаборДвиженийПродажиСебестоимость.Записать(Ложь);
	
КонецПроцедуры

// Функция расчета коэф. распределения косвенных затрат по переделам
Функция РасчетБазыКоэффициентовУпр(СтруктураШапкиДокумента)
	
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст =  "ВЫБРАТЬ
	 |	ПолнаяБазаРаспределения.Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа,
	 |	СУММА(ПолнаяБазаРаспределения.БазаМат) КАК БазаМат,
	 |	СУММА(ПолнаяБазаРаспределения.БазаЗП) КАК БазаЗП,
	 |	СУММА(ПолнаяБазаРаспределения.БазаВыпуск) КАК БазаВыпуск,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПлан) КАК БазаПлан,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПрямые) 		КАК БазаПрямые,
	 |	СУММА(ПолнаяБазаРаспределения.БазаСписокЗатрат) КАК БазаПрямыеСписок
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		НЗПОбороты.Подразделение КАК Подразделение,
	 |		НЗПОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	 |		СУММА(ВЫБОР КОГДА НЗПОбороты.СтатьяЗатрат.ВидЗатрат = &МатЗатраты ТОГДА НЗПОбороты.СуммаНЗП ИНАЧЕ 0 КОНЕЦ) КАК БазаМат,
	 |		СУММА(ВЫБОР КОГДА НЗПОбороты.СтатьяЗатрат.ВидЗатрат = &ОплатаТруда ТОГДА НЗПОбороты.СуммаНЗП ИНАЧЕ 0 КОНЕЦ) КАК БазаЗП,
	 |		0 КАК БазаВыпуск,
	 |		0 КАК БазаПлан,
	 |		0 КАК БазаПрямые,
	 |		0 КАК БазаСписокЗатрат	 
	 |	ИЗ
	 |      (ВЫБРАТЬ 
	 |			НезавершенноеПроизводство.Подразделение,
	 |			НезавершенноеПроизводство.НоменклатурнаяГруппа,
	 |			НезавершенноеПроизводство.СтатьяЗатрат,
	 |			СУММА(НезавершенноеПроизводство.Стоимость) КАК СуммаНЗП
	 |		ИЗ
	 |			РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	 |		ГДЕ
	 |			НезавершенноеПроизводство.Период >= &НачДата
	 |			И НезавершенноеПроизводство.Период <= &КонДата
	 |			И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
     |
	 |		СГРУППИРОВАТЬ ПО
	 |			НезавершенноеПроизводство.Подразделение,
	 |			НезавершенноеПроизводство.НоменклатурнаяГруппа,
	 |			НезавершенноеПроизводство.СтатьяЗатрат
	 |	   ) КАК НЗПОбороты
	 |
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		НЗПОбороты.Подразделение,
	 |		НЗПОбороты.НоменклатурнаяГруппа
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ВыпускПродукцииУслуг.Подразделение,
	 |		ВыпускПродукцииУслуг.НоменклатурнаяГруппа,
	 |		0,
	 |		0,
	 |		СУММА(ВыпускПродукцииУслуг.Количество),
	 |		СУММА(ВыпускПродукцииУслуг.ПлановаяСтоимость),
	 |		0,
	 |		0
	 |
	 |	ИЗ
	 |		РегистрНакопления.ВыпускПродукцииУслуг КАК ВыпускПродукцииУслуг
	 |	
	 |	ГДЕ
	 |		ВыпускПродукцииУслуг.Период МЕЖДУ &НачДата И &КонДата
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ВыпускПродукцииУслуг.Подразделение,
	 |		ВыпускПродукцииУслуг.НоменклатурнаяГруппа
	 |
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ПрямыеЗатраты.Подразделение,
	 |		ПрямыеЗатраты.НоменклатурнаяГруппа,
	 |		0,
	 |		0,
	 |		0,
	 |		0,
	 |		ЕСТЬNULL(ПрямыеЗатраты.СуммаОборот, 0),	 
	 |		0
	 |	ИЗ
	 |  	(ВЫБРАТЬ 
	 |			НезавершенноеПроизводство.Подразделение,
	 |			НезавершенноеПроизводство.НоменклатурнаяГруппа,
	 |			СУММА(НезавершенноеПроизводство.Стоимость) КАК СуммаОборот
	 |		ИЗ
	 |			РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	 |		ГДЕ
	 |			НезавершенноеПроизводство.Период >= &НачДата
	 |			И НезавершенноеПроизводство.Период <= &КонДата
	 |			И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
	 |			И НЕ НезавершенноеПроизводство.КодОперации В (&КодыОперацийРаспределениеКосвенных)
	 |
     | 		СГРУППИРОВАТЬ ПО
	 |			НезавершенноеПроизводство.Подразделение,
	 |			НезавершенноеПроизводство.НоменклатурнаяГруппа
	 |		) КАК ПрямыеЗатраты
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ПрямыеЗатраты.Подразделение,
	 |		ПрямыеЗатраты.НоменклатурнаяГруппа,
	 |		ПрямыеЗатраты.СуммаОборот	 
	 |
	 |  ) КАК ПолнаяБазаРаспределения
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПолнаяБазаРаспределения.Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа";
	 
	Запрос.УстановитьПараметр("НачДата",     мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",     мКонМесяца);
	
	Запрос.УстановитьПараметр("НачГраница",     мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",     мКонГраница);
	
	Запрос.УстановитьПараметр("ОплатаТруда", Перечисления.ВидыЗатрат.ОплатаТруда);
	Запрос.УстановитьПараметр("МатЗатраты",  Перечисления.ВидыЗатрат.Материальные);
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	МассивКодов = Новый Массив;
	МассивКодов.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеОбщепроизводственныеРасходы_Регламент);
	Запрос.УстановитьПараметр("КодыОперацийРаспределениеКосвенных",     МассивКодов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // РасчетБазыКоэффициентовУпр()

Функция РасчетБазыКоэффициентовСпискаЗатратУпр(СтруктураШапкиДокумента, СписокЗатрат)
	
	 Запрос = Новый Запрос;
	 Запрос.Текст =  
	 "ВЫБРАТЬ
	 |	ПолнаяБазаРаспределения.Подразделение КАК Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	 |	0 КАК БазаМат,
	 |	0 КАК БазаЗП,
	 |	0 КАК БазаВыпуск,
	 |	0 КАК БазаПлан,
	 |	0 КАК БазаПрямые,
	 |	СУММА(ПолнаяБазаРаспределения.БазаПрямые) КАК БазаПрямыеСписок
	 |ИЗ
	 |  (ВЫБРАТЬ 
	 |		НезавершенноеПроизводство.Подразделение,
	 |		НезавершенноеПроизводство.НоменклатурнаяГруппа,
	 |		СУММА(НезавершенноеПроизводство.Стоимость) КАК БазаПрямые
	 |	ИЗ
	 |		РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	 |	ГДЕ
	 |		НезавершенноеПроизводство.Период >= &НачДата
	 |		И НезавершенноеПроизводство.Период <= &КонДата
	 |		И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
	 |		И НезавершенноеПроизводство.СтатьяЗатрат В (&СписокЗатрат)
	 |
     |  СГРУППИРОВАТЬ ПО
	 |		НезавершенноеПроизводство.Подразделение,
	 |		НезавершенноеПроизводство.НоменклатурнаяГруппа
	 |	) КАК ПолнаяБазаРаспределения
	 |	
	 |СГРУППИРОВАТЬ ПО
	 |	ПолнаяБазаРаспределения.Подразделение,
	 |	ПолнаяБазаРаспределения.НоменклатурнаяГруппа";
		
	 
	Запрос.УстановитьПараметр("НачДата",      мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",      мКонМесяца);
	Запрос.УстановитьПараметр("НачГраница",   мНачГраница);
	Запрос.УстановитьПараметр("КонГраница",   мКонГраница);
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	Запрос.УстановитьПараметр("СписокЗатрат", СписокЗатрат);
	 
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // РасчетБазыКоэффициентовСпискаЗатратУпр()

// Общепроизводственные расходы и брак списываются на НЗП
// При списании общепроизводсвенные расходы распределяются по подразделениям и номенклатурным группам согласно 
// РегистрСведений.МетодыРаспределенияКосвенныхРасходов
// Брак списывается 1 в 1
Процедура РаспределениеКосвенныхРасходовУпр(СтруктураШапкиДокумента, СтруктураДопПараметров)
	
	мБазаКоэффициентов = РасчетБазыКоэффициентовУпр(СтруктураШапкиДокумента);
	
	// Распределение общепроизводственных расходов на себестоимость выпущенной продукции (услуг).
	РаспределениеВыполнено = РаспределитьОПРУпр(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	
	// Распределение брака на себестоимость выпущенной продукции (услуг).
	РаспределитьЗатратыНаБракУпр(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	
	// Повторный расчет прямых затрат после распределения ОПР и брака
	РасчетПрямыхЗатратУпр(СтруктураШапкиДокумента, Истина, СтруктураДопПараметров);

КонецПроцедуры // РаспределениеКосвенныхРасходовУпр()

// Формируется запрос по косвенным затратам в котором собрана
// информация о косвенных затратах и их способе их распределения.
//
Процедура СформироватьЗапросПоКосвеннымЗатратамУпр(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",             мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",             мКонМесяца);
	Запрос.УстановитьПараметр("КонГраница",          мКонГраница);

	Запрос.УстановитьПараметр("ХарактерЗатратОПЗ",   Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат",  Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.Подразделения.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ТаблицаСпособовРаспределения.БазаРаспределения ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.БазаРаспределения
	|		КОГДА ТаблицаСпособовРаспределения.РаспределениеПоПодразделению ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.РаспределениеПоПодразделению
	|       КОГДА ТаблицаСпособовРаспределения.РаспределениеПоСтатьеЗатрат ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.РаспределениеПоСтатьеЗатрат
    |		ИНАЧЕ ТаблицаСпособовРаспределения.РаспределениеПоПредприятию
	|	КОНЕЦ КАК Метод,
	|	ТаблицаСпособовРаспределения.Подразделение,
	|	ТаблицаСпособовРаспределения.СтатьяЗатрат,
	|	ТаблицаСпособовРаспределения.НоменклатурнаяГруппа,
	|	ВЫБОР
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатрат ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатрат
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоПодразделению ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоПодразделению
	|		КОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСтатьеЗатрат ЕСТЬ НЕ NULL 
	|			ТОГДА ТаблицаСпособовРаспределения.СписокСтатейЗатратПоСтатьеЗатрат
	|		ИНАЧЕ ТаблицаСпособовРаспределения.СписокСтатейЗатратПоПредприятию
	|	КОНЕЦ КАК СписокСтатейЗатрат,
	|	ТаблицаСпособовРаспределения.СуммаОстаток КАК Сумма,
	|	ТаблицаСпособовРаспределения.НДСОстаток КАК НДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗатратыОстатки.Подразделение КАК Подразделение,
	|		ЗатратыОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|		ЗатратыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		СпособыРаспределения.СпособРаспределения КАК БазаРаспределения,
	|		СпособыРаспределенияПоПодразделению.СпособРаспределения КАК РаспределениеПоПодразделению,
    |		СпособыРаспределенияПоСтатьеЗатрат.СпособРаспределения КАК РаспределениеПоСтатьеЗатрат,
    |		СпособыРаспределенияПоПредприятию.СпособРаспределения КАК РаспределениеПоПредприятию,
	|		СпособыРаспределения.СписокСтатейЗатрат КАК СписокСтатейЗатрат,
	|		СпособыРаспределенияПоПодразделению.СписокСтатейЗатрат КАК СписокСтатейЗатратПоПодразделению,
	|		СпособыРаспределенияПоСтатьеЗатрат.СписокСтатейЗатрат КАК СписокСтатейЗатратПоСтатьеЗатрат,
	|		СпособыРаспределенияПоПредприятию.СписокСтатейЗатрат КАК СписокСтатейЗатратПоПредприятию,
	|		ЗатратыОстатки.СуммаОстаток КАК СуммаОстаток,
	|		ЗатратыОстатки.НДСОстаток КАК НДСОстаток
	|	ИЗ
	|	    РегистрНакопления.Затраты.Остатки(&КонГраница, СтатьяЗатрат.ХарактерЗатрат = &ХарактерЗатратОПЗ) КАК ЗатратыОстатки
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходов.СрезПоследних(&КонДата) КАК СпособыРаспределения
	|			ПО ЗатратыОстатки.Подразделение = СпособыРаспределения.Подразделение
	|				И ЗатратыОстатки.СтатьяЗатрат = СпособыРаспределения.СтатьяЗатрат
    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходов.СрезПоследних(
    |			&КонДата, Подразделение = &ПустоеПодразделение) КАК СпособыРаспределенияПоСтатьеЗатрат
    |			ПО ЗатратыОстатки.СтатьяЗатрат = СпособыРаспределенияПоСтатьеЗатрат.СтатьяЗатрат
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходов.СрезПоследних(
	|			&КонДата, СтатьяЗатрат = &ПустаяСтатьяЗатрат) КАК СпособыРаспределенияПоПодразделению
	|			ПО ЗатратыОстатки.Подразделение = СпособыРаспределенияПоПодразделению.Подразделение 
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МетодыРаспределенияКосвенныхРасходов.СрезПоследних(
	|			&КонДата, Подразделение = &ПустоеПодразделение И СтатьяЗатрат = &ПустаяСтатьяЗатрат) КАК СпособыРаспределенияПоПредприятию
	|			ПО ИСТИНА
	|    ) КАК ТаблицаСпособовРаспределения
	|ИТОГИ ПО
	|	Метод,
	|	СписокСтатейЗатрат";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоКосвеннымЗатратамУпр()

// Функция распределения общепроизводственных затрат по управленческому учету
//
//	Параметры:
//		мБазаКоэффициентов - база коэф-тов распределения
//
Функция РаспределитьОПРУпр(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров)
	
	Если СтруктураШапкиДокумента.НеРаспределятьОПЗнаСебестоимостьПродукцииВУУ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РаспределениеВыполнено = Ложь;
	
	НаборДвиженийЗатраты   = Движения["Затраты"];
	ТаблицаДвиженийЗатраты = НаборДвиженийЗатраты.ВыгрузитьКолонки();
	
	НаборДвиженийНЗП   = Движения["НезавершенноеПроизводство"];
	ТаблицаДвиженийНЗП = НаборДвиженийНЗП.ВыгрузитьКолонки();
	
	ЗаписьРасчетаКосвенныхРасходов = СтруктураДопПараметров.ЗаписьРасчетаКосвенныхРасходов;
	
	// Формирование запроса по косвенным расходам
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоКосвеннымЗатратамУпр(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров);
	
	ОбходПоМетодамРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Метод"); 	
	СтруктПоиска = Новый Структура;
	Пока ОбходПоМетодамРаспределения.Следующий() Цикл
		
		ИмяРеквБазы = ПолучитьИмяРеквизитаБазыРаспределения(ОбходПоМетодамРаспределения.Метод);
		
		ОбходПоСпискуСтатейЗатрат = ОбходПоМетодамРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СписокСтатейЗатрат");
		
		Пока ОбходПоСпискуСтатейЗатрат.Следующий() Цикл
			
			Если ИмяРеквБазы = "ПрямыеСписок" Тогда
				ТекущийСписокПрямыхЗатрат = ОбходПоСпискуСтатейЗатрат.СписокСтатейЗатрат;
				СписокПрямыхЗатрат = ТекущийСписокПрямыхЗатрат.СтатьиЗатрат.ВыгрузитьКолонку("СтатьяЗатрат");
				Если Не СписокПрямыхЗатрат = Справочники.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка() Тогда
					мБазаКоэффициентов = РасчетБазыКоэффициентовСпискаЗатратУпр(СтруктураШапкиДокумента, СписокПрямыхЗатрат);
				КонецЕсли;
			КонецЕсли;
			
			Обход = ОбходПоСпискуСтатейЗатрат.Выбрать();
			Пока Обход.Следующий() Цикл
		
				Если ИмяРеквБазы = "" Тогда	
					
					Сообщить(Локализация.СтрШаблон1("Установлен метод ""Не распределять"" общепроизводственные расходы для:"
		"Подразделение: ¤1¤"
		"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Информация);
					
					Продолжить;
				
				ИначеЕсли ИмяРеквБазы = Неопределено Тогда
				
					Сообщить(Локализация.СтрШаблон1("Не указан способ распределения общепроизводственных расходов для:"
		"Подразделение: ¤1¤"
		"Статья затрат: ¤2¤", Обход.Подразделение, Обход.СтатьяЗатрат), СтатусСообщения.Важное);
						
					Продолжить;
					
				КонецЕсли;
			
				Если Обход.Сумма = 0 Или Обход.Сумма = NULL Тогда
					Продолжить;
				КонецЕсли;
			
				ВсегоБазаРаспределения = 0;
				
			
				СтруктПоиска.Очистить();
				СтруктПоиска.Вставить("Подразделение", Обход.Подразделение);
			
				НаборСтрок = мБазаКоэффициентов.НайтиСтроки(СтруктПоиска);
				Для Каждого СтрКоэф Из НаборСтрок Цикл
					ВсегоБазаРаспределения = ВсегоБазаРаспределения + СтрКоэф["База"+ИмяРеквБазы];
				КонецЦикла;
			
				СуммаРаспределяемыхЗатрат = Обход.Сумма;
				СуммаНеРаспределенныхЗатрат = 0;
				
				НДСРаспределяемыхЗатрат = Обход.НДС;			
				НДСНеРаспределенныхЗатрат = 0;
				
				СуммаКРаспр = 0;
				СуммаСписанияНаСебестоимость = Обход.Сумма;
				НДССписанияНаСебестоимость = Обход.НДС;
				УчтеноБазаРаспределения = 0;
				
				НДСКРаспр = 0;
			
				Для Каждого СтрКоэф Из НаборСтрок Цикл
				
					БазаРаспределения = СтрКоэф["База"+ИмяРеквБазы];
					БазаРаспределенияНаВыпуск = БазаРаспределения;
					
					Если БазаРаспределения = 0 Тогда
						Продолжить;
					КонецЕсли;
				
					УчтеноБазаРаспределения = УчтеноБазаРаспределения + БазаРаспределения;
					ДолжноБытьСписано = Окр(СуммаРаспределяемыхЗатрат * УчтеноБазаРаспределения / ВсегоБазаРаспределения, 2, 1);
					СуммаСписания = ДолжноБытьСписано - СуммаКРаспр;
					СуммаКРаспр = СуммаКРаспр + СуммаСписания;
				
					НДСДолжноБытьСписано = Окр(НДСРаспределяемыхЗатрат * УчтеноБазаРаспределения / ВсегоБазаРаспределения, 2, 1);
					НДССписания = НДСДолжноБытьСписано - НДСКРаспр;
					НДСКРаспр = НДСКРаспр + НДССписания;
				
				
					Если СуммаСписания <> 0 ИЛИ НДССписания <> 0 Тогда
					
						// списуем сумму и НДС из затрат, добавляем в НЗП
					
						НоваяСтрокаЗатраты = ТаблицаДвиженийЗатраты.Добавить();
						
						НоваяСтрокаЗатраты.Подразделение 		= Обход.Подразделение;
						НоваяСтрокаЗатраты.СтатьяЗатрат  		= Обход.СтатьяЗатрат;
						
						НоваяСтрокаЗатраты.Сумма         		= СуммаСписания;
						НоваяСтрокаЗатраты.НДС           		= НДССписания;
					
					
						НоваяСтрокаНЗП = ТаблицаДвиженийНЗП.Добавить();
						
						НоваяСтрокаНЗП.Подразделение 		= СтрКоэф.Подразделение;
						НоваяСтрокаНЗП.НоменклатурнаяГруппа = СтрКоэф.НоменклатурнаяГруппа;
						НоваяСтрокаНЗП.СтатьяЗатрат  		= Обход.СтатьяЗатрат;
						
						НоваяСтрокаЗатраты.НоменклатурнаяГруппа = Обход.НоменклатурнаяГруппа;    

						НоваяСтрокаНЗП.КодОперации 			= Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеОбщепроизводственныеРасходы_Регламент;
					
						НоваяСтрокаНЗП.Стоимость 			= СуммаСписания;
						НоваяСтрокаНЗП.НДС					= НДССписания;
						
						РаспределениеВыполнено = Истина;
					
						СтрокаЗаписьРасчетаКосвенныхРасходов = ЗаписьРасчетаКосвенныхРасходов.Добавить();
						СтрокаЗаписьРасчетаКосвенныхРасходов.ВидОперации 						= Перечисления.ВидыОперацийРасчетаКосвенныхРасходов.РаспределениеОбщепроизводственныхРасходов;
						СтрокаЗаписьРасчетаКосвенныхРасходов.Подразделение 						= Обход.Подразделение;
						СтрокаЗаписьРасчетаКосвенныхРасходов.СтатьяЗатрат 						= Обход.СтатьяЗатрат;
						СтрокаЗаписьРасчетаКосвенныхРасходов.БазаРаспределения 					= ОбходПоМетодамРаспределения.Метод;
						СтрокаЗаписьРасчетаКосвенныхРасходов.СуммаБазы 							= БазаРаспределения;
						СтрокаЗаписьРасчетаКосвенныхРасходов.ПодразделениеРаспределения 		= СтрКоэф.Подразделение;
						СтрокаЗаписьРасчетаКосвенныхРасходов.НоменклатурнаяГруппаРаспределения 	= СтрКоэф.НоменклатурнаяГруппа;
						СтрокаЗаписьРасчетаКосвенныхРасходов.Сумма 								= СуммаСписания;
						СтрокаЗаписьРасчетаКосвенныхРасходов.НДС 								= НДССписания;
						
						СуммаСписанияНаСебестоимость = СуммаСписанияНаСебестоимость - СуммаСписания;
						НДССписанияНаСебестоимость   = НДССписанияНаСебестоимость - НДССписания;
					
					КонецЕсли;
					
				КонецЦикла;	
				
				// Не распределенные ОПЗ списываем 
				Если СуммаСписанияНаСебестоимость <> 0 Тогда
					
					НоваяСтрокаЗатраты = ТаблицаДвиженийЗатраты.Добавить();
					
					НоваяСтрокаЗатраты.Подразделение 		= Обход.Подразделение;
					НоваяСтрокаЗатраты.СтатьяЗатрат  		= Обход.СтатьяЗатрат;
					
					НоваяСтрокаЗатраты.Сумма         		= СуммаСписанияНаСебестоимость;
					НоваяСтрокаЗатраты.НДС           		= НДССписанияНаСебестоимость;
					
					РаспределениеВыполнено = Истина;
					
				КонецЕсли;
				
				
				
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если РаспределениеВыполнено Тогда
		
		НаборДвиженийНЗП.мПериод = Дата;
		НаборДвиженийНЗП.мТаблицаДвижений = ТаблицаДвиженийНЗП;
		НаборДвиженийНЗП.ВыполнитьПриход();
		НаборДвиженийНЗП.Записать(Ложь);
		
		НаборДвиженийЗатраты.мПериод = Дата;
		НаборДвиженийЗатраты.мТаблицаДвижений = ТаблицаДвиженийЗатраты;
		НаборДвиженийЗатраты.ВыполнитьРасход();
		НаборДвиженийЗатраты.Записать(Ложь);
		
	КонецЕсли;
	
	Возврат РаспределениеВыполнено;
	
КонецФункции // РаспределитьОПРУпр()

// Формируется запрос по браку в производстве в управленческом учете 
Процедура СформироватьЗапросПоЗатратамНаБракУпр(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",             мНачМесяца);
	Запрос.УстановитьПараметр("КонДата",             мКонМесяца);
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат",  Справочники.СтатьиЗатрат.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("КонГраница",          мКонГраница);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БракВПроизводствеОстатки.Подразделение КАК Подразделение,
	|	БракВПроизводствеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	БракВПроизводствеОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(БракВПроизводствеОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(БракВПроизводствеОстатки.НДСОстаток) КАК НДС
	|ИЗ
	|	РегистрНакопления.БракВПроизводстве.Остатки(&КонГраница, ) КАК БракВПроизводствеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	БракВПроизводствеОстатки.Подразделение,
	|	БракВПроизводствеОстатки.НоменклатурнаяГруппа,
	|	БракВПроизводствеОстатки.СтатьяЗатрат";
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры // СформироватьЗапросПоЗатратамНаБракУпр()

Функция РаспределитьЗатратыНаБракУпр(СтруктураШапкиДокумента, мБазаКоэффициентов, СтруктураДопПараметров);
	
	
	РаспределениеВыполнено = Ложь;
	
	НаборДвиженийБрак  = Движения["БракВПроизводстве"];
	ТаблицаДвиженийБрак = НаборДвиженийБрак.ВыгрузитьКолонки();
	
	НаборДвиженийНЗП   = Движения["НезавершенноеПроизводство"];
	ТаблицаДвиженийНЗП = НаборДвиженийНЗП.ВыгрузитьКолонки();
	
	// Формирование запроса по косвенным расходам
	РезультатЗапроса = Неопределено;
	СформироватьЗапросПоЗатратамНаБракУпр(СтруктураШапкиДокумента, РезультатЗапроса, СтруктураДопПараметров);
	
	Обход = РезультатЗапроса.Выбрать();
	
	Пока Обход.Следующий() Цикл
		
		Если Обход.Сумма = 0 И Обход.НДС = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		// списываем сумму из брака, добавляем в НЗП
		
		НоваяСтрокаБрак = ТаблицаДвиженийБрак.Добавить();
		
		НоваяСтрокаБрак.Подразделение 			= Обход.Подразделение;
		НоваяСтрокаБрак.НоменклатурнаяГруппа 	= Обход.НоменклатурнаяГруппа;
		НоваяСтрокаБрак.СтатьяЗатрат  			= Обход.СтатьяЗатрат;
		
		НоваяСтрокаБрак.Сумма         			= Обход.Сумма;
		НоваяСтрокаБрак.НДС						= Обход.НДС;
		
		НоваяСтрокаНЗП = ТаблицаДвиженийНЗП.Добавить();
		
		НоваяСтрокаНЗП.Подразделение 		= Обход.Подразделение;
		НоваяСтрокаНЗП.НоменклатурнаяГруппа = Обход.НоменклатурнаяГруппа;
		НоваяСтрокаНЗП.СтатьяЗатрат  		= Обход.СтатьяЗатрат;
		
		НоваяСтрокаНЗП.КодОперации = Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеБракВПроизводстве_Регламент;
		
		НоваяСтрокаНЗП.Стоимость 			= Обход.Сумма;
		НоваяСтрокаНЗП.НДС		 			= Обход.НДС;
		
		РаспределениеВыполнено = Истина;
		
	КонецЦикла;
	
	Если РаспределениеВыполнено Тогда
		
		НаборДвиженийНЗП.мПериод = Дата;
		НаборДвиженийНЗП.мТаблицаДвижений = ТаблицаДвиженийНЗП;
		НаборДвиженийНЗП.ВыполнитьПриход();
		НаборДвиженийНЗП.Записать(Ложь);
		
		НаборДвиженийБрак.мПериод = Дата;
		НаборДвиженийБрак.мТаблицаДвижений = ТаблицаДвиженийБрак;
		НаборДвиженийБрак.ВыполнитьРасход();
		НаборДвиженийБрак.Записать(Ложь);
		
	КонецЕсли; 
	
КонецФункции // РаспределитьЗатратыНаБракУпр()

// Процедура производит корректировку стоимости списания выпущенной в текущем месяце продукции.
Процедура КорректировкаСтоимостиСписанияВыпущеннойПродукцииУпр(СтруктураШапкиДокумента, ТабТоваров, ВыполненоРаспределениеОПР, СтруктураДопПараметров)

	// Формирование корректировки стоимости списаний, исходя из среденвзвешенной стоимости номенклатуры
	СтруктураДопПараметров.Вставить("Учет",           "Упр");
	СтруктураДопПараметров.Вставить("Период",         Дата);
	СтруктураДопПараметров.Вставить("Регистратор",    Ссылка);
	СтруктураДопПараметров.Вставить("ЕстьСтрокиОтражатьВУправленческомУчете", Истина);   	
	СтруктураДопПараметров.Вставить("КодыОпераций",Перечисления.КодыОперацийПартииТоваров);
	
	// После закрытия общепроизводственных расходов необходимо чтобы не корректировалось списание номенклатуры на ОПР
	Если ВыполненоРаспределениеОПР Тогда
		СтруктураДопПараметров.Вставить("НеСписыватьНаПостоянныеЗатраты", Истина);
	Иначе
		СтруктураДопПараметров.Вставить("НеСписыватьНаПостоянныеЗатраты", Ложь);
	КонецЕсли;
	
	КорректировкаСтоимости.СкорректироватьСписание(мНачМесяца, мКонМесяца, ТабТоваров, Ссылка, СтруктураДопПараметров);
	
КонецПроцедуры
 
Процедура СписатьЗатраты(ХарактерЗатрат)
	
	НаборДвиженийЗатраты   = Движения["Затраты"];
	ТаблицаДвиженийЗатраты = НаборДвиженийЗатраты.ВыгрузитьКолонки();
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РегЗатраты.Подразделение,
	|	РегЗатраты.СтатьяЗатрат,
	|	РегЗатраты.СуммаОстаток КАК Сумма,
	|	РегЗатраты.НДСОстаток КАК НДС,
	|	РегЗатраты.НоменклатурнаяГруппа,
	|	РегЗатраты.Заказ
   	|ИЗ
	|	РегистрНакопления.Затраты.Остатки(&КонГраница, СтатьяЗатрат.ХарактерЗатрат = &ХарактерЗатрат) КАК РегЗатраты";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонГраница"    , мКонГраница);
	Запрос.УстановитьПараметр("ХарактерЗатрат", ХарактерЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	Обход = РезультатЗапроса.Выбрать();
	
	Пока Обход.Следующий() Цикл
		НоваяСтрока = ТаблицаДвиженийЗатраты.Добавить();
		НоваяСтрока.Подразделение        = Обход.Подразделение;
		НоваяСтрока.СтатьяЗатрат         = Обход.СтатьяЗатрат;
		НоваяСтрока.НоменклатурнаяГруппа = Обход.НоменклатурнаяГруппа; 
		НоваяСтрока.Заказ                = Обход.Заказ; 
		НоваяСтрока.Сумма                = Обход.Сумма;
		НоваяСтрока.НДС 				 = Обход.НДС;
	КонецЦикла;
	
	НаборДвиженийЗатраты.мПериод = КонецМесяца(Дата);
	НаборДвиженийЗатраты.мТаблицаДвижений = ТаблицаДвиженийЗатраты;
	НаборДвиженийЗатраты.ВыполнитьРасход();
	НаборДвиженийЗатраты.Записать(Ложь);

КонецПроцедуры // СписатьЗатраты()
 

//ТОРГОВЛЯ

Процедура РасчетТорговойНаценкиПоПроданнымТоварамБУ(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.РасчетТорговойНаценкиПоПроданнымТоварамБУ Тогда
		Возврат;
	КонецЕсли;
	
	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	РазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	//СНТТ
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Если РазделятьПоСтавкамНДС Тогда
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС);
	КонецЕсли;
	
	Счет90 = ПланыСчетов.Хозрасчетный.СебестоимостьРеализации;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", 			мНачГраница);
	Запрос.УстановитьПараметр("ДатаКон", 			мКонГраница);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("СчетТН", 			ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
	Запрос.УстановитьПараметр("СчетПС", 			ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	Запрос.УстановитьПараметр("ВидыСубконто", 	ВидыСубконто);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	| 	ЗапросПоНаценке.НалоговоеНазначение,
	| 	ЗапросПоНаценке.Склады,"+?(РазделятьПоСтавкамНДС,"
	|	ЗапросПоНаценке.СтавкиНДС,","")+"
	|	ОборотыДтКт.СчетДт 		КАК СчетДт,
	|	ОборотыДтКт.НалоговоеНазначениеДт	КАК НалоговоеНазначениеДт,
	|	ОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ОборотыДтКт.СубконтоДт2	КАК СубконтоДт2,
	|	ОборотыДтКт.СубконтоДт3	КАК СубконтоДт3,
	|	МАКСИМУМ( ЗапросПоНаценке.ТорговаяНаценкаОстаток ) КАК ТорговаяНаценка,
	|	МАКСИМУМ( ЗапросПоНаценке.ПродажнаяСтоимостьОстаток ) КАК ПродажнаяСтоимость,
	|	СУММА(ЕСТЬNULL(ОборотыДтКт.СуммаОборот,0)) КАК Реализация,
	|	МАКСИМУМ( ЗапросПоНаценке.ТорговаяНаценкаОстатокНУ ) КАК ТорговаяНаценкаНУ,
	|	МАКСИМУМ( ЗапросПоНаценке.ПродажнаяСтоимостьОстатокНУ ) КАК ПродажнаяСтоимостьНУ,
	|	СУММА(ЕСТЬNULL(ОборотыДтКт.СуммаНУОборотКт,0)) КАК РеализацияНУ
	| ИЗ
	|(ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто1 КАК Склады,"+?(РазделятьПоСтавкамНДС,"
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто2 КАК СтавкиНДС,","")+"
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНачальныйОстатокКт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаОборотКт,0)) КАК ТорговаяНаценкаОстаток,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНачальныйОстатокДт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаОборотДт,0)) КАК ПродажнаяСтоимостьОстаток,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНУНачальныйОстатокКт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНУОборотКт,0)) КАК ТорговаяНаценкаОстатокНУ,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНУНачальныйОстатокДт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНУОборотДт,0)) КАК ПродажнаяСтоимостьОстатокНУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач,&ДатаКон, , ,Счет = &СчетТН, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОборотыТН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач,&ДатаКон, , ,Счет = &СчетПС, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОборотыПС
	|		ПО ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение = ХозрасчетныйОстаткиИОборотыПС.НалоговоеНазначение
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто1 = ХозрасчетныйОстаткиИОборотыПС.Субконто1"+?(РазделятьПоСтавкамНДС,"
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто2 = ХозрасчетныйОстаткиИОборотыПС.Субконто2","")+"
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение,
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто1"+?(РазделятьПоСтавкамНДС,",
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто2","")+") КАК ЗапросПоНаценке 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач,&ДатаКон, , , ,СчетКт = &СчетПС, &ВидыСубконто, Организация = &Организация) КАК ОборотыДтКт
	|		ПО ЗапросПоНаценке.НалоговоеНазначение = ОборотыДтКт.НалоговоеНазначениеКт
	|		 И ЗапросПоНаценке.Склады = ОборотыДтКт.СубконтоКт1"+?(РазделятьПоСтавкамНДС,"
	|		 И ЗапросПоНаценке.СтавкиНДС = ОборотыДтКт.СубконтоКт2","")+"
	
	|СГРУППИРОВАТЬ ПО
	|	ЗапросПоНаценке.НалоговоеНазначение,
	| 	ЗапросПоНаценке.Склады,"+?(РазделятьПоСтавкамНДС,"
	|	ЗапросПоНаценке.СтавкиНДС,","")+"
	|	ОборотыДтКт.НалоговоеНазначениеДт,
	|	ОборотыДтКт.СчетДт,
	|	ОборотыДтКт.СубконтоДт1,
	|	ОборотыДтКт.СубконтоДт2,
	|	ОборотыДтКт.СубконтоДт3
	|
	|ИТОГИ ПО
	|	НалоговоеНазначение,
	|	Склады"+?(РазделятьПоСтавкамНДС,",
	|	СтавкиНДС","")+",
	|	СчетДт";
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрБухгалтерии", "Хозрасчетный");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      	Новый Диапазон(, Дата)); 
		ЗначенияБлокировки.Вставить("Организация",	Организация);
		ЗначенияБлокировки.Вставить("Счет",			ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
		
		ЗначенияБлокировки.Вставить("Счет",			ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
		
		ЗначенияБлокировки.Вставить("Счет",			ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
		
		ЗначенияБлокировки.Вставить("Счет",			ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
	КонецЕсли;	
	
	РезультатЗапросаНаценка = Запрос.Выполнить();
	
	ВыборкаПоНалоговымНазначениям = РезультатЗапросаНаценка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НалоговоеНазначение");
	
	Пока ВыборкаПоНалоговымНазначениям.Следующий() Цикл
		
		ВыборкаПоСкладам = ВыборкаПоНалоговымНазначениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склады");
		
		Пока ВыборкаПоСкладам.Следующий() Цикл
			Если РазделятьПоСтавкамНДС Тогда
				ВыборкаПоСтавкамНДС = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтавкиНДС");
				Пока ВыборкаПоСтавкамНДС.Следующий() Цикл
					
					//Расчет торговой наценки
					ТН = ВыборкаПоСтавкамНДС.ТорговаяНаценка;
					ПС = ВыборкаПоСтавкамНДС.ПродажнаяСтоимость;
					//КоэфНаценки = ТН / ПС;
					ТН_НУ = ВыборкаПоСтавкамНДС.ТорговаяНаценкаНУ;
					ПС_НУ = ВыборкаПоСтавкамНДС.ПродажнаяСтоимостьНУ;
					
					Если ПС = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					// Определим суммы, которые ушли не на счет себестоимости (возвраты и пр.)
					СуммаВозвратов = 0;
					СуммаВозвратовНаценки = 0;
					СуммаРеализации90 = 0;
					
					СуммаВозвратовНУ = 0;
					СуммаВозвратовНаценкиНУ = 0;
					СуммаРеализации90НУ = 0;
					
					ВыборкаПоСчетДт	 = ВыборкаПоСтавкамНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
					Пока ВыборкаПоСчетДт.Следующий() Цикл
						Если ВыборкаПоСчетДт.СчетДт = Null Тогда
							Продолжить;
						КонецЕсли; 
						Если НЕ ВыборкаПоСчетДт.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
							СуммаВозвратов = СуммаВозвратов + ВыборкаПоСчетДт.Реализация;
							СуммаВозвратовНУ = СуммаВозвратовНУ + ВыборкаПоСчетДт.РеализацияНУ;
							Если ВыборкаПоСчетДт.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ Тогда
								СуммаВозвратовНаценки = СуммаВозвратовНаценки + ВыборкаПоСчетДт.Реализация;
								СуммаВозвратовНаценкиНУ = СуммаВозвратовНаценкиНУ + ВыборкаПоСчетДт.РеализацияНУ;
							КонецЕсли;
						Иначе
							СуммаРеализации90 = СуммаРеализации90 + ВыборкаПоСчетДт.Реализация;
							СуммаРеализации90НУ = СуммаРеализации90НУ + ВыборкаПоСчетДт.РеализацияНУ;
						КонецЕсли; 
					КонецЦикла;
					НаценкаНаВозвраты = Окр(СуммаВозвратов * ТН/ПС,2);
					КорректировкаНаценки = НаценкаНаВозвраты - СуммаВозвратовНаценки;
					
					Если НЕ ПС_НУ = 0 Тогда
						НаценкаНаВозвратыНУ = Окр(СуммаВозвратовНУ * ТН_НУ/ПС_НУ,2);
						КорректировкаНаценкиНУ = НаценкаНаВозвратыНУ - СуммаВозвратовНаценкиНУ;
					КонецЕсли;
					
					НакопленнаяПогрешность = 0;
					НакопленнаяПогрешностьНУ = 0;
					
					//Теперь произведем расчет наценки для продаж
					// и одновременно разбросаем суммы КорректировкаНаценки на счета себестоимости
					ТекущаяСуммаРеализации90 = 0;
					ТекущаяСуммаРеализации90НУ = 0;
					
					ВыборкаПоСчетДт = ВыборкаПоСтавкамНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
					Пока ВыборкаПоСчетДт.Следующий() Цикл
						Если ВыборкаПоСчетДт.СчетДт = Null Тогда
							Продолжить;
						КонецЕсли; 
						
						ВыборкаДетальныеЗаписи = ВыборкаПоСчетДт.Выбрать(ОбходРезультатаЗапроса.Прямой);
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							Если ВыборкаДетальныеЗаписи.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
								
								СуммаНаценки = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.Реализация * ТН/ПС,2,НакопленнаяПогрешность);
								
								ТекущаяСуммаРеализации90 = ТекущаяСуммаРеализации90 + ВыборкаДетальныеЗаписи.Реализация;
								Если ТекущаяСуммаРеализации90 = СуммаРеализации90 Тогда
									// относим всю корректировку
									ОтносимаяКорректировкаНаценки = КорректировкаНаценки;
								Иначе
									// относим пропорционально сумме
									Если СуммаРеализации90 <> 0 Тогда
										ОтносимаяКорректировкаНаценки = Окр(КорректировкаНаценки * ВыборкаДетальныеЗаписи.Реализация/СуммаРеализации90)
									Иначе
										ОтносимаяКорректировкаНаценки = 0;
									КонецЕсли;
								КонецЕсли; 
								СуммаНаценки = СуммаНаценки + ОтносимаяКорректировкаНаценки;
								КорректировкаНаценки = КорректировкаНаценки - ОтносимаяКорректировкаНаценки;
								
								Если ПС_НУ = 0 Тогда
									СуммаНаценкиНУ = 0;
								Иначе
									СуммаНаценкиНУ = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.РеализацияНУ * ТН_НУ/ПС_НУ,2,НакопленнаяПогрешностьНУ);
									ТекущаяСуммаРеализации90НУ = ТекущаяСуммаРеализации90НУ + ВыборкаДетальныеЗаписи.РеализацияНУ;
									Если ТекущаяСуммаРеализации90НУ = СуммаРеализации90НУ Тогда
										// относим всю корректировку
										ОтносимаяКорректировкаНаценкиНУ = КорректировкаНаценкиНУ;
									Иначе
										// относим пропорционально сумме
										Если СуммаРеализации90НУ <> 0 Тогда
											ОтносимаяКорректировкаНаценкиНУ = Окр(КорректировкаНаценкиНУ * ВыборкаДетальныеЗаписи.РеализацияНУ/СуммаРеализации90НУ)
										Иначе
											ОтносимаяКорректировкаНаценкиНУ = 0;
										КонецЕсли;
									КонецЕсли; 
									СуммаНаценкиНУ = СуммаНаценкиНУ + ОтносимаяКорректировкаНаценкиНУ;
									КорректировкаНаценкиНУ = КорректировкаНаценкиНУ - ОтносимаяКорректировкаНаценкиНУ;
								КонецЕсли;
								
								Если (СуммаНаценки > 0) ИЛИ (СуммаНаценкиНУ > 0) Тогда
									
									//Формируем проводки по списанию торговой наценки
									Проводка = мПроводкиБУ.Добавить();
									Проводка.Период                    = Дата;
									Проводка.Организация               = СтруктураШапкиДокумента.Организация;
									Проводка.СчетДт                    = ВыборкаПоСчетДт.СчетДт;
									Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
									
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1,  ВыборкаДетальныеЗаписи.СубконтоДт1);
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2,  ВыборкаДетальныеЗаписи.СубконтоДт2);
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  ВыборкаДетальныеЗаписи.СубконтоДт3);
									
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ВыборкаПоСтавкамНДС.СтавкиНДС);
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоСтавкамНДС.Склады);
									
									Проводка.Сумма                     = - СуммаНаценки;
									Проводка.Содержание                = "Закрытие месяца: Торговая наценка";
									Проводка.НомерЖурнала              = "ТВ";
									
									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт) Тогда
										Проводка.НалоговоеНазначениеДт = ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт;
										Проводка.СуммаНУДт= - СуммаНаценкиНУ;
									КонецЕсли;
									
									Проводка.НалоговоеНазначениеКт = ВыборкаПоСтавкамНДС.НалоговоеНазначение;
									Проводка.СуммаНУКт= - СуммаНаценкиНУ;
									
									Проводка = мПроводкиБУ.Добавить();
									Проводка.Период                    = Дата;
									Проводка.Организация               = СтруктураШапкиДокумента.Организация;
									Проводка.СчетДт                    = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
									Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
									
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  ВыборкаПоСтавкамНДС.СтавкиНДС);
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  ВыборкаПоСтавкамНДС.Склады);
									
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ВыборкаПоСтавкамНДС.СтавкиНДС);
									ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоСтавкамНДС.Склады);
									
									Проводка.Сумма                     = СуммаНаценки;
									Проводка.Содержание                =  "Закрытие месяца: Торговая наценка";
									Проводка.НомерЖурнала              = "ТВ";
									
									Проводка.НалоговоеНазначениеДт = ВыборкаПоСтавкамНДС.НалоговоеНазначение;
									Проводка.НалоговоеНазначениеКт = ВыборкаПоСтавкамНДС.НалоговоеНазначение;
									Проводка.СуммаНУДт= СуммаНаценкиНУ;
									Проводка.СуммаНУКт= СуммаНаценкиНУ;
									
								КонецЕсли;
							КонецЕсли; 
						КонецЦикла; // ВыборкаДетальныеЗаписи.Следующий()
					КонецЦикла; // ВыборкаПоСчетДт.Следующий()
					
				КонецЦикла;  // ВыборкаПоСтавкамНДС.Следующий()
			Иначе
				//Расчет торговой наценки
				ТН = ВыборкаПоСкладам.ТорговаяНаценка;
				ПС = ВыборкаПоСкладам.ПродажнаяСтоимость;
				//КоэфНаценки = ТН / ПС;
				ТН_НУ = ВыборкаПоСкладам.ТорговаяНаценкаНУ;
				ПС_НУ = ВыборкаПоСкладам.ПродажнаяСтоимостьНУ;
				
				Если ПС = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				// Определим суммы, которые ушли не на счет себестоимости (возвраты и пр.)
				СуммаВозвратов = 0;
				СуммаВозвратовНаценки = 0;
				СуммаРеализации90 = 0;
				
				СуммаВозвратовНУ = 0;
				СуммаВозвратовНаценкиНУ = 0;
				СуммаРеализации90НУ = 0;
				
				ВыборкаПоСчетДт = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
				Пока ВыборкаПоСчетДт.Следующий() Цикл
					Если ВыборкаПоСчетДт.СчетДт = Null Тогда
						Продолжить;
					КонецЕсли; 
					Если НЕ ВыборкаПоСчетДт.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
						СуммаВозвратов = СуммаВозвратов + ВыборкаПоСчетДт.Реализация;
						СуммаВозвратовНУ = СуммаВозвратовНУ + ВыборкаПоСчетДт.РеализацияНУ;
						Если ВыборкаПоСчетДт.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ Тогда
							СуммаВозвратовНаценки = СуммаВозвратовНаценки + ВыборкаПоСчетДт.Реализация;
							СуммаВозвратовНаценкиНУ = СуммаВозвратовНаценкиНУ + ВыборкаПоСчетДт.РеализацияНУ;
						КонецЕсли;
					Иначе
						СуммаРеализации90 = СуммаРеализации90 + ВыборкаПоСчетДт.Реализация;
						СуммаРеализации90НУ = СуммаРеализации90НУ + ВыборкаПоСчетДт.РеализацияНУ;
					КонецЕсли; 
				КонецЦикла;
				НаценкаНаВозвраты = Окр(СуммаВозвратов * ТН/ПС,2);
				КорректировкаНаценки = НаценкаНаВозвраты - СуммаВозвратовНаценки;
				
				Если НЕ ПС_НУ = 0 Тогда
					НаценкаНаВозвратыНУ = Окр(СуммаВозвратовНУ * ТН_НУ/ПС_НУ,2);
					КорректировкаНаценкиНУ = НаценкаНаВозвратыНУ - СуммаВозвратовНаценкиНУ;
				КонецЕсли;
				
				НакопленнаяПогрешность = 0;
				НакопленнаяПогрешностьНУ = 0;
				
				//Теперь произведем расчет наценки для продаж
				// и одновременно разбросаем суммы КорректировкаНаценки на счета себестоимости
				ТекущаяСуммаРеализации90 = 0;
				ТекущаяСуммаРеализации90НУ = 0;
				
				ВыборкаПоСчетДт = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
				Пока ВыборкаПоСчетДт.Следующий() Цикл
					Если ВыборкаПоСчетДт.СчетДт = Null Тогда
						Продолжить;
					КонецЕсли; 
					ВыборкаДетальныеЗаписи = ВыборкаПоСчетДт.Выбрать(ОбходРезультатаЗапроса.Прямой);
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						Если ВыборкаДетальныеЗаписи.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
							СуммаНаценки = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.Реализация * ТН/ПС,2,НакопленнаяПогрешность);
							
							ТекущаяСуммаРеализации90 = ТекущаяСуммаРеализации90 + ВыборкаДетальныеЗаписи.Реализация;
							Если ТекущаяСуммаРеализации90 = СуммаРеализации90 Тогда
								// относим всю корректировку
								ОтносимаяКорректировкаНаценки = КорректировкаНаценки;
							Иначе
								// относим пропорционально сумме
								Если СуммаРеализации90 <> 0 Тогда
									ОтносимаяКорректировкаНаценки = Окр(КорректировкаНаценки * ВыборкаДетальныеЗаписи.Реализация/СуммаРеализации90)
								Иначе
									ОтносимаяКорректировкаНаценки = 0;
								КонецЕсли;
							КонецЕсли; 
							СуммаНаценки = СуммаНаценки + ОтносимаяКорректировкаНаценки;
							КорректировкаНаценки = КорректировкаНаценки - ОтносимаяКорректировкаНаценки;
							
							Если ПС_НУ = 0 Тогда
								СуммаНаценкиНУ = 0;
							Иначе
								СуммаНаценкиНУ = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.РеализацияНУ * ТН_НУ/ПС_НУ,2,НакопленнаяПогрешностьНУ);
								ТекущаяСуммаРеализации90НУ = ТекущаяСуммаРеализации90НУ + ВыборкаДетальныеЗаписи.РеализацияНУ;
								Если ТекущаяСуммаРеализации90НУ = СуммаРеализации90НУ Тогда
									// относим всю корректировку
									ОтносимаяКорректировкаНаценкиНУ = КорректировкаНаценкиНУ;
								Иначе
									// относим пропорционально сумме
									Если СуммаРеализации90НУ <> 0 Тогда
										ОтносимаяКорректировкаНаценкиНУ = Окр(КорректировкаНаценкиНУ * ВыборкаДетальныеЗаписи.РеализацияНУ/СуммаРеализации90НУ)
									Иначе
										ОтносимаяКорректировкаНаценкиНУ = 0;
									КонецЕсли
								КонецЕсли; 
								СуммаНаценкиНУ = СуммаНаценкиНУ + ОтносимаяКорректировкаНаценкиНУ;
								КорректировкаНаценкиНУ = КорректировкаНаценкиНУ - ОтносимаяКорректировкаНаценкиНУ;
							КонецЕсли;
							
							Если (СуммаНаценки > 0) ИЛИ (СуммаНаценкиНУ > 0) Тогда
								
								//Формируем проводки по списанию торговой наценки
								Проводка = мПроводкиБУ.Добавить();
								Проводка.Период                    = Дата;
								Проводка.Организация               = СтруктураШапкиДокумента.Организация;
								Проводка.СчетДт                    = ВыборкаПоСчетДт.СчетДт;
								Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
								
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1,  ВыборкаДетальныеЗаписи.СубконтоДт1);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2,  ВыборкаДетальныеЗаписи.СубконтоДт2);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  ВыборкаДетальныеЗаписи.СубконтоДт3);								
								
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоСкладам.Склады);
								
								Проводка.Сумма                     = - СуммаНаценки;
								Проводка.Содержание                = "Закрытие месяца: Торговая наценка";
								Проводка.НомерЖурнала              = "ТВ";
								
								Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт) Тогда
									Проводка.НалоговоеНазначениеДт = ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт;
									Проводка.СуммаНУДт= - СуммаНаценкиНУ;
								КонецЕсли;
								
								Проводка.НалоговоеНазначениеКт = ВыборкаПоСкладам.НалоговоеНазначение;
								Проводка.СуммаНУКт= - СуммаНаценкиНУ;
								
								Проводка = мПроводкиБУ.Добавить();
								Проводка.Период                    = Дата;
								Проводка.Организация               = СтруктураШапкиДокумента.Организация;
								Проводка.СчетДт                    = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
								Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
								
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  ВыборкаПоСкладам.Склады);
								
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоСкладам.Склады);
								
								Проводка.Сумма                     = СуммаНаценки;
								Проводка.Содержание                =  "Закрытие месяца: Торговая наценка";
								Проводка.НомерЖурнала              = "ТВ";
								
								Проводка.НалоговоеНазначениеДт = ВыборкаПоСкладам.НалоговоеНазначение;
								Проводка.НалоговоеНазначениеКт = ВыборкаПоСкладам.НалоговоеНазначение;
								Проводка.СуммаНУДт = СуммаНаценкиНУ;
								Проводка.СуммаНУКт = СуммаНаценкиНУ;
								
							КонецЕсли;
						КонецЕсли; 
					КонецЦикла;  //ВыборкаДетальныеЗаписи.Следующий()
				КонецЦикла; // ВыборкаПоСчетДт.Следующий()
			КонецЕсли;
		КонецЦикла; // ВыборкаПоСкладам.Следующий()
	КонецЦикла; // ВыборкаПоНалоговымНазначениям.Следующий()
	
	//Розничные склады
	РазделятьПоПартиям = УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
	
	БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
	ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Если РазделятьПоПартиям Тогда
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
		НомерСубконтоНоменклатурнойПозиции = 4;
	Иначе
		НомерСубконтоНоменклатурнойПозиции = 3;
	КонецЕсли;
	
	Если ВестиУчетПоДопРазрезамРегл Тогда
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции);
	КонецЕсли;
	
	Счет90 = ПланыСчетов.Хозрасчетный.СебестоимостьРеализации;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", 			мНачГраница); 
	Запрос.УстановитьПараметр("ДатаКон", 			мКонГраница);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("СчетТН", 			ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
	Запрос.УстановитьПараметр("СчетПС", 			ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
	Запрос.УстановитьПараметр("ВидыСубконто", 		ВидыСубконто);
	Запрос.УстановитьПараметр("ПустаяПартия",    	Документы.Партия.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ 
	| 	ЗапросПоНаценке.НалоговоеНазначение КАК НалоговоеНазначение,
	| 	ЗапросПоНаценке.Номенклатура КАК Номенклатура,
	|	ЗапросПоНаценке.Склады КАК Склады,
	|	ЗапросПоНаценке.Партия КАК Партия,
	| 	ЗапросПоНаценке.НоменклатурнаяПозиция КАК НоменклатурнаяПозиция,
	|	ОборотыДтКт.СчетДт 		КАК СчетДт,
	|	ОборотыДтКт.НалоговоеНазначениеДт	КАК НалоговоеНазначениеДт,
	|	ОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ОборотыДтКт.СубконтоДт2	КАК СубконтоДт2,
	|	ОборотыДтКт.СубконтоДт3	КАК СубконтоДт3,
	|	МАКСИМУМ( ЗапросПоНаценке.ТорговаяНаценкаОстаток ) КАК ТорговаяНаценка,
	|	МАКСИМУМ( ЗапросПоНаценке.ПродажнаяСтоимостьОстаток ) КАК ПродажнаяСтоимость,
	|	СУММА(ЕСТЬNULL(ОборотыДтКт.СуммаОборот,0)) КАК Реализация,
	|	МАКСИМУМ( ЗапросПоНаценке.ТорговаяНаценкаОстатокНУ ) КАК ТорговаяНаценкаНУ,
	|	МАКСИМУМ( ЗапросПоНаценке.ПродажнаяСтоимостьОстатокНУ ) КАК ПродажнаяСтоимостьНУ,
	|	СУММА(ЕСТЬNULL(ОборотыДтКт.СуммаНУОборотКт,0)) КАК РеализацияНУ
	| ИЗ
	|(ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение КАК НалоговоеНазначение,
	| 	ХозрасчетныйОстаткиИОборотыТН.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто2 КАК Склады,
	|"+?(РазделятьПоПартиям,"
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто3 КАК Партия,", "
	|	&ПустаяПартия КАК Партия,")+"
	|"+?(ВестиУчетПоДопРазрезамРегл,"
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто"+НомерСубконтоНоменклатурнойПозиции+" КАК НоменклатурнаяПозиция,", "
	|	ЗНАЧЕНИЕ(Справочник.НоменклатурныеПозиции.ПустаяСсылка) КАК НоменклатурнаяПозиция,")+"
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНачальныйОстатокКт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаОборотКт,0)) КАК ТорговаяНаценкаОстаток,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНачальныйОстатокДт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаОборотДт,0)) КАК ПродажнаяСтоимостьОстаток,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНУНачальныйОстатокКт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыТН.СуммаНУОборотКт,0)) КАК ТорговаяНаценкаОстатокНУ,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНУНачальныйОстатокДт,0) + 
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОборотыПС.СуммаНУОборотДт,0)) КАК ПродажнаяСтоимостьОстатокНУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач,&ДатаКон, , ,Счет = &СчетТН, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОборотыТН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач,&ДатаКон, , ,Счет = &СчетПС, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОборотыПС
	|		ПО ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение = ХозрасчетныйОстаткиИОборотыПС.НалоговоеНазначение
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто1 = ХозрасчетныйОстаткиИОборотыПС.Субконто1
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто2 = ХозрасчетныйОстаткиИОборотыПС.Субконто2 
	|"+?(РазделятьПоПартиям,"
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто3 = ХозрасчетныйОстаткиИОборотыПС.Субконто3","")+"
	|"+?(ВестиУчетПоДопРазрезамРегл,"
	|			И ХозрасчетныйОстаткиИОборотыТН.Субконто"+НомерСубконтоНоменклатурнойПозиции+" = ХозрасчетныйОстаткиИОборотыПС.Субконто"+НомерСубконтоНоменклатурнойПозиции,"")+"
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстаткиИОборотыТН.НалоговоеНазначение,
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто1,
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто2
	|" +?(РазделятьПоПартиям,",
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто3","")+"
	|" +?(ВестиУчетПоДопРазрезамРегл,",
	|	ХозрасчетныйОстаткиИОборотыТН.Субконто"+НомерСубконтоНоменклатурнойПозиции,"")+"
	|
	|) КАК ЗапросПоНаценке 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач,&ДатаКон, , , ,СчетКт = &СчетПС, &ВидыСубконто, Организация = &Организация) КАК ОборотыДтКт
	|		ПО ЗапросПоНаценке.Номенклатура = ОборотыДтКт.СубконтоКт1 
	|			И ЗапросПоНаценке.НалоговоеНазначение = ОборотыДтКт.НалоговоеНазначениеКт 
	|		    И ЗапросПоНаценке.Склады = ОборотыДтКт.СубконтоКт2 
	|"+?(РазделятьПоПартиям,"
	|		    И ЗапросПоНаценке.Партия = ОборотыДтКт.СубконтоКт3","")+"
	|"+?(ВестиУчетПоДопРазрезамРегл,"
	|		    И ЗапросПоНаценке.НоменклатурнаяПозиция = ОборотыДтКт.СубконтоКт"+НомерСубконтоНоменклатурнойПозиции,"")+"
	|
	|СГРУППИРОВАТЬ ПО
	| 	ЗапросПоНаценке.НалоговоеНазначение,
	| 	ЗапросПоНаценке.Номенклатура,
	| 	ЗапросПоНаценке.Склады,
	|	ЗапросПоНаценке.Партия,
	|	ЗапросПоНаценке.НоменклатурнаяПозиция,
	|	ОборотыДтКт.СчетДт,
	|	ОборотыДтКт.НалоговоеНазначениеДт,
	|	ОборотыДтКт.СубконтоДт1,
	|	ОборотыДтКт.СубконтоДт2,
	|	ОборотыДтКт.СубконтоДт3
	|
	|ИТОГИ ПО
	| 	НалоговоеНазначение,
	|	Номенклатура,
	|	Склады,
	|	НоменклатурнаяПозиция,
	|	Партия,
	|	СчетДт";
	
	ВыборкаПоНалоговымНазначениям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НалоговоеНазначение");
	Пока ВыборкаПоНалоговымНазначениям.Следующий() Цикл
		ВыборкаПоНоменклатуре = ВыборкаПоНалоговымНазначениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл
			ВыборкаПоСкладам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склады");
			Пока ВыборкаПоСкладам.Следующий() Цикл
				ВыборкаПоНомПозиции = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяПозиция");
				Пока ВыборкаПоНомПозиции.Следующий() Цикл
					ВыборкаПоПартиям = ВыборкаПоНомПозиции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Партия");
					Пока ВыборкаПоПартиям.Следующий() Цикл
						
						ТН = ВыборкаПоПартиям.ТорговаяНаценка;
						ПС = ВыборкаПоПартиям.ПродажнаяСтоимость;
						
						ТН_НУ = ВыборкаПоПартиям.ТорговаяНаценкаНУ;
						ПС_НУ = ВыборкаПоПартиям.ПродажнаяСтоимостьНУ;
						
	 					Если ПС = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						// Определим суммы, которые ушли не на счет себестоимости (возвраты и пр.)
						СуммаВозвратов = 0;
						СуммаВозвратовНаценки = 0;
						СуммаРеализации90 = 0;
						
						СуммаВозвратовНУ = 0;
						СуммаВозвратовНаценкиНУ = 0;
						СуммаРеализации90НУ = 0;
						
						ВыборкаПоСчетДт = ВыборкаПоПартиям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
						Пока ВыборкаПоСчетДт.Следующий() Цикл
							Если ВыборкаПоСчетДт.СчетДт = Null Тогда
								Продолжить;
							КонецЕсли; 
							Если НЕ ВыборкаПоСчетДт.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
								СуммаВозвратов = СуммаВозвратов + ВыборкаПоСчетДт.Реализация;
								СуммаВозвратовНУ = СуммаВозвратовНУ + ВыборкаПоСчетДт.РеализацияНУ;
								Если ВыборкаПоСчетДт.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ Тогда
									СуммаВозвратовНаценки = СуммаВозвратовНаценки + ВыборкаПоСчетДт.Реализация;
									СуммаВозвратовНаценкиНУ = СуммаВозвратовНаценкиНУ + ВыборкаПоСчетДт.РеализацияНУ;
								КонецЕсли;
							Иначе
								СуммаРеализации90 = СуммаРеализации90 + ВыборкаПоСчетДт.Реализация;
								СуммаРеализации90НУ = СуммаРеализации90НУ + ВыборкаПоСчетДт.РеализацияНУ;
							КонецЕсли; 
						КонецЦикла;
						НаценкаНаВозвраты = Окр(СуммаВозвратов * ТН/ПС,2);
						КорректировкаНаценки = НаценкаНаВозвраты - СуммаВозвратовНаценки;
						
						Если НЕ ПС_НУ = 0 Тогда
							НаценкаНаВозвратыНУ = Окр(СуммаВозвратовНУ * ТН_НУ/ПС_НУ,2);
							КорректировкаНаценкиНУ = НаценкаНаВозвратыНУ - СуммаВозвратовНаценкиНУ;
						КонецЕсли;
						
						НакопленнаяПогрешность = 0;
						НакопленнаяПогрешностьНУ = 0;
						
						//Теперь произведем расчет наценки для продаж
						// и одновременно разбросаем суммы КорректировкаНаценки на счета себестоимости
						ТекущаяСуммаРеализации90 = 0;
						ТекущаяСуммаРеализации90НУ = 0;
						
						ВыборкаПоСчетДт = ВыборкаПоПартиям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетДт");
						Пока ВыборкаПоСчетДт.Следующий() Цикл
							Если ВыборкаПоСчетДт.СчетДт = Null Тогда
								Продолжить;
							КонецЕсли; 
							
							ВыборкаДетальныеЗаписи = ВыборкаПоСчетДт.Выбрать(ОбходРезультатаЗапроса.Прямой);
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								
								Если ВыборкаДетальныеЗаписи.СчетДт.ПринадлежитЭлементу(Счет90) Тогда
									СуммаНаценки = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.Реализация * ТН/ПС,2,НакопленнаяПогрешность);
									
									ТекущаяСуммаРеализации90 = ТекущаяСуммаРеализации90 + ВыборкаДетальныеЗаписи.Реализация;
									Если ТекущаяСуммаРеализации90 = СуммаРеализации90 Тогда
										// относим всю корректировку
										ОтносимаяКорректировкаНаценки = КорректировкаНаценки;
									Иначе
										// относим пропорционально сумме
										Если СуммаРеализации90 <> 0 Тогда
											ОтносимаяКорректировкаНаценки = Окр(КорректировкаНаценки * ВыборкаДетальныеЗаписи.Реализация/СуммаРеализации90);
										Иначе
											ОтносимаяКорректировкаНаценки = 0;
										КонецЕсли;
									КонецЕсли; 
									СуммаНаценки = СуммаНаценки + ОтносимаяКорректировкаНаценки;
									КорректировкаНаценки = КорректировкаНаценки - ОтносимаяКорректировкаНаценки;
									
									Если ПС_НУ = 0 Тогда
										СуммаНаценкиНУ = 0;
									Иначе
										СуммаНаценкиНУ = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаДетальныеЗаписи.РеализацияНУ * ТН_НУ/ПС_НУ,2,НакопленнаяПогрешностьНУ);
										ТекущаяСуммаРеализации90НУ = ТекущаяСуммаРеализации90НУ + ВыборкаДетальныеЗаписи.РеализацияНУ;
										Если ТекущаяСуммаРеализации90НУ = СуммаРеализации90НУ Тогда
											// относим всю корректировку
											ОтносимаяКорректировкаНаценкиНУ = КорректировкаНаценкиНУ;
										Иначе
											// относим пропорционально сумме
											Если СуммаРеализации90НУ <> 0 Тогда
												ОтносимаяКорректировкаНаценкиНУ = Окр(КорректировкаНаценкиНУ * ВыборкаДетальныеЗаписи.РеализацияНУ/СуммаРеализации90НУ);
											Иначе
												ОтносимаяКорректировкаНаценкиНУ = 0;
											КонецЕсли;
										КонецЕсли; 
										СуммаНаценкиНУ = СуммаНаценкиНУ + ОтносимаяКорректировкаНаценкиНУ;
										КорректировкаНаценкиНУ = КорректировкаНаценкиНУ - ОтносимаяКорректировкаНаценкиНУ;
									КонецЕсли;
									
									Если (СуммаНаценки <> 0) ИЛИ (СуммаНаценкиНУ <> 0) Тогда
										
										//Формируем проводки по списанию торговой наценки
										Проводка = мПроводкиБУ.Добавить();
										Проводка.Период                    = Дата;
										Проводка.Организация               = СтруктураШапкиДокумента.Организация;
										Проводка.СчетДт                    = ВыборкаПоСчетДт.СчетДт;
										Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
										
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1,  ВыборкаДетальныеЗаписи.СубконтоДт1);
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2,  ВыборкаДетальныеЗаписи.СубконтоДт2);
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  ВыборкаДетальныеЗаписи.СубконтоДт3);
										
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  ВыборкаПоПартиям.Номенклатура);
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоПартиям.Склады);
										Если РазделятьПоПартиям Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  ВыборкаПоПартиям.Партия);
										КонецЕсли;
										
										Если ВестиУчетПоДопРазрезамРегл Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  ВыборкаПоПартиям.НоменклатурнаяПозиция);
										КонецЕсли;
										
										Проводка.Сумма                     = - СуммаНаценки;
										Проводка.Содержание                = "Закрытие месяца: Торговая наценка";
										Проводка.НомерЖурнала              = "ТВ";
										
										Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт) Тогда
											Проводка.НалоговоеНазначениеДт = ВыборкаДетальныеЗаписи.НалоговоеНазначениеДт;
											Проводка.СуммаНУДт= - СуммаНаценкиНУ;
										КонецЕсли;
										
										Проводка.НалоговоеНазначениеКт = ВыборкаПоПартиям.НалоговоеНазначение;
										Проводка.СуммаНУКт= - СуммаНаценкиНУ;
										
										Проводка = мПроводкиБУ.Добавить();
										Проводка.Период                    = Дата;
										Проводка.Организация               = СтруктураШапкиДокумента.Организация;
										Проводка.СчетДт                    = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
										Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
										
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  ВыборкаПоПартиям.Номенклатура);
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  ВыборкаПоПартиям.Склады);
										Если РазделятьПоПартиям Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  ВыборкаПоПартиям.Партия);
										КонецЕсли;
										
										Если ВестиУчетПоДопРазрезамРегл Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  ВыборкаПоПартиям.НоменклатурнаяПозиция);
										КонецЕсли;
										
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  ВыборкаПоПартиям.Номенклатура);
										ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  ВыборкаПоПартиям.Склады);
										Если РазделятьПоПартиям Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  ВыборкаПоПартиям.Партия);
										КонецЕсли;
										
										Если ВестиУчетПоДопРазрезамРегл Тогда
											ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  ВыборкаПоПартиям.НоменклатурнаяПозиция);
										КонецЕсли;
										
										Проводка.Сумма                     = СуммаНаценки;
										Проводка.Содержание                =  "Закрытие месяца: Торговая наценка";
										Проводка.НомерЖурнала              = "ТВ";
										
										Проводка.НалоговоеНазначениеДт = ВыборкаПоПартиям.НалоговоеНазначение;
										Проводка.НалоговоеНазначениеКт = ВыборкаПоПартиям.НалоговоеНазначение;
										Проводка.СуммаНУДт= СуммаНаценкиНУ;
										Проводка.СуммаНУКт= СуммаНаценкиНУ;
										
									КонецЕсли;
								КонецЕсли; 
							КонецЦикла; // ВыборкаДетальныеЗаписи.Следующий()
						КонецЦикла; // ВыборкаПоСчетДт.Следующий()
						
					КонецЦикла; // ВыборкаПоПартиям.Следующий() 
				КонецЦикла; // ВыборкаПоНомПозиции.Следующий() 
			КонецЦикла; // ВыборкаПоСкладам.Следующий() Цикл
		КонецЦикла; // ВыборкаПоНоменклатуре.Следующий()
	КонецЦикла;// ВыборкаПоНалоговымНазначениям.Следующий()
	
	мПроводкиБУ.Записать(Ложь);
	
КонецПроцедуры

Процедура РасчетТорговойНаценкиПоПроданнымТоварамУУ(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.РасчетТорговойНаценкиПоПроданнымТоварамУУ Тогда
		Возврат;
	КонецЕсли;
	
	// разделять ли по ставкам определяем по бухгалтерскому учету
	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	РазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ТоварыВНТТВПродажныхЦенах");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, мКонМесяца)); 
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
	КонецЕсли;
	
	// получим документы приема розничной выручки, к которым будем приписывать себестоимость продаж
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", 			мНачГраница);
	Запрос.УстановитьПараметр("ДатаКон", 			мКонГраница);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВНТТВПродажныхЦенахОбороты.Регистратор,
	|	ТоварыВНТТВПродажныхЦенахОбороты.СуммаРасход КАК СуммаПродаж,
	|	ТоварыВНТТВПродажныхЦенахОбороты.Склад,
	|	ТоварыВНТТВПродажныхЦенахОбороты.СтавкаНДС
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТВПродажныхЦенах.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ТоварыВНТТВПродажныхЦенахОбороты
	|ГДЕ
	|	ТоварыВНТТВПродажныхЦенахОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер";
	
	ТаблицаРегистраторовПродаж =  Запрос.Выполнить().Выгрузить();
	Если НЕ РазделятьПоСтавкамНДС Тогда
		ТаблицаРегистраторовПродаж.Свернуть("Регистратор, Склад","СуммаПродаж");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", 			мНачГраница);
	Запрос.УстановитьПараметр("ДатаКон", 			мКонГраница);
	Запрос.УстановитьПараметр("ДатаНачПериода",		мНачМесяца); // Даты
	Запрос.УстановитьПараметр("ДатаКонПериода",		мКонМесяца);
	Запрос.УстановитьПараметр("ВидДвижения", 		ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Возврат", 			Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВНТТОстаткиИОбороты.Склад.Подразделение КАК Подразделение,
	|	ТоварыВНТТОстаткиИОбороты.Склад КАК Склад,"+?(РазделятьПоСтавкамНДС,"
	|	ТоварыВНТТОстаткиИОбороты.СтавкаНДС КАК СтавкаНДС,","")+"
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыВНТТОстаткиИОбороты.СуммаНачальныйОстаток,0) + ЕСТЬNULL(ТоварыВНТТОстаткиИОбороты.СуммаПриход,0)) КАК ПродажнаяСтоимость,
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыВНТТОстаткиИОбороты.СуммаНаценкиНачальныйОстаток,0) + ЕСТЬNULL(ТоварыВНТТОстаткиИОбороты.СуммаНаценкиПриход,0)) КАК ТорговаяНаценка,
	|	СУММА(ЕСТЬNULL(ТоварыВНТТРеализация.Возвраты,0)) КАК Возвраты,
	|	СУММА(ЕСТЬNULL(ТоварыВНТТРеализация.Сумма,0)) КАК Реализация,
	|	СУММА(ЕСТЬNULL(ТоварыВНТТРеализация.СуммаНаценки,0)) КАК НаценкаРеализации
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТВПродажныхЦенах.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ТоварыВНТТОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТоварыВНТТВПродажныхЦенах.Склад КАК Склад,"+?(РазделятьПоСтавкамНДС,"
	|			ТоварыВНТТВПродажныхЦенах.СтавкаНДС КАК СтавкаНДС,","")+"
	|			СУММА(ВЫБОР КОГДА КодОперации = &Возврат ТОГДА ТоварыВНТТВПродажныхЦенах.Сумма ИНАЧЕ 0 КОНЕЦ) КАК Возвраты,
	|			СУММА(ТоварыВНТТВПродажныхЦенах.Сумма) КАК Сумма,
	|			СУММА(ТоварыВНТТВПродажныхЦенах.СуммаНаценки) КАК СуммаНаценки
	|		ИЗ
	|			РегистрНакопления.ТоварыВНТТВПродажныхЦенах КАК ТоварыВНТТВПродажныхЦенах
	|		ГДЕ
	|			  ТоварыВНТТВПродажныхЦенах.Активность = Истина
	|			И ТоварыВНТТВПродажныхЦенах.ВидДвижения = &ВидДвижения
	|			И ТоварыВНТТВПродажныхЦенах.Период >= &ДатаНачПериода
	|			И ТоварыВНТТВПродажныхЦенах.Период <= &ДатаКонПериода
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТоварыВНТТВПродажныхЦенах.Склад"+?(РазделятьПоСтавкамНДС,"
	|			,ТоварыВНТТВПродажныхЦенах.СтавкаНДС","")+"
	|			) КАК ТоварыВНТТРеализация
	|
	|		ПО    ТоварыВНТТОстаткиИОбороты.Склад = ТоварыВНТТРеализация.Склад"+?(РазделятьПоСтавкамНДС,"
	|			И ТоварыВНТТОстаткиИОбороты.СтавкаНДС = ТоварыВНТТРеализация.СтавкаНДС","")+"
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВНТТОстаткиИОбороты.Склад"+?(РазделятьПоСтавкамНДС,"
	|	,ТоварыВНТТОстаткиИОбороты.СтавкаНДС","")+"
	|	
	|ИТОГИ ПО
	|	Склад"+?(РазделятьПоСтавкамНДС,"
	|	,СтавкаНДС","");
	
	
	ВыборкаПоСкладам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");
	
	Пока ВыборкаПоСкладам.Следующий() Цикл
		Если РазделятьПоСтавкамНДС Тогда
			
			ВыборкаПоСтавкамНДС = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтавкаНДС");
				
			НакопленнаяПогрешность = 0;
			
			Пока ВыборкаПоСтавкамНДС.Следующий() Цикл
				
				//Расчет торговой наценки
				ТН = ВыборкаПоСтавкамНДС.ТорговаяНаценка;
				ПС = ВыборкаПоСтавкамНДС.ПродажнаяСтоимость;
				//КоэфНаценки = ТН / ПС;
				
				Если ПС = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаНаценки = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаПоСтавкамНДС.Реализация * ТН/ПС,2,НакопленнаяПогрешность);
				// вычтем уже показанную наценку
				СуммаКорректировки = СуммаНаценки - ВыборкаПоСтавкамНДС.НаценкаРеализации; 
						
				Если СуммаКорректировки > 0 Тогда
									
					//Формируем проводки по списанию торговой наценки
					// Спишем из регистра
					НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();
							
					НовоеДвижение.Период 			= Дата;
					НовоеДвижение.Склад 			= ВыборкаПоСтавкамНДС.Склад;
					НовоеДвижение.СтавкаНДС 		= ВыборкаПоСтавкамНДС.СтавкаНДС;
							
					НовоеДвижение.Сумма				= 0;
					НовоеДвижение.СуммаНаценки 		= СуммаКорректировки;
					НовоеДвижение.КодОперации		= Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;
					НовоеДвижение.ВидДвижения		= ВидДвиженияНакопления.Расход;
					
				КонецЕсли;
				
				// добавим движения в регистр ПродажиСебестоимость:
				НаценкаПриПродаже 	= СуммаКорректировки;
				СуммаПродаж 		= ВыборкаПоСтавкамНДС.Реализация - ВыборкаПоСтавкамНДС.Возвраты;
				Себестоимость 		= СуммаПродаж - НаценкаПриПродаже;
				Если НЕ Себестоимость = 0 Тогда
					// пропорционально распределим себестоимость по регистраторам
					Отбор = Новый Структура("СтавкаНДС, Склад", ВыборкаПоСтавкамНДС.СтавкаНДС, ВыборкаПоСтавкамНДС.Склад);
					СтрокиРегистраторов = ТаблицаРегистраторовПродаж.НайтиСтроки(Отбор);
					СуммаПродаж = 0;
					Для каждого СтрокаРегистраторов Из СтрокиРегистраторов Цикл
						СуммаПродаж	 = СуммаПродаж + СтрокаРегистраторов.СуммаПродаж;
					КонецЦикла;
					
					ОшибкаРаспределения = 0;
					
					Если СуммаПродаж <> 0 Тогда
						
						Для каждого СтрокаРегистраторов Из СтрокиРегистраторов Цикл
							
							ТекСебестоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаРегистраторов.СуммаПродаж / СуммаПродаж *  Себестоимость, 2, ОшибкаРаспределения);
							
							НовоеДвижение = Движения.ПродажиСебестоимость.Добавить();
										
							НовоеДвижение.Период 		  = Дата;
							НовоеДвижение.Подразделение	  = ВыборкаПоСкладам.Подразделение;
							
							НовоеДвижение.ДокументДвижения = СтрокаРегистраторов.Регистратор;
							
							НовоеДвижение.Стоимость       = ТекСебестоимость;
							
						КонецЦикла;
					
					КонецЕсли;
					
				КонецЕсли;					
				
			КонецЦикла;  // ВыборкаПоСтавкамНДС.Следующий()
			
		Иначе
			
			//Расчет торговой наценки
			ТН = ВыборкаПоСкладам.ТорговаяНаценка;
			ПС = ВыборкаПоСкладам.ПродажнаяСтоимость;
			//КоэфНаценки = ТН / ПС;
				
			Если ПС = 0 Тогда
				Продолжить;
			КонецЕсли;
				
			НакопленнаяПогрешность = 0;
						
			СуммаНаценки = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ВыборкаПоСкладам.Реализация * ТН/ПС,2,НакопленнаяПогрешность);
			// вычтем уже показанную наценку
			СуммаКорректировки = СуммаНаценки - ВыборкаПоСкладам.НаценкаРеализации; 
						
			Если СуммаКорректировки > 0 Тогда
									
				//Формируем проводки по списанию торговой наценки
				
				// Спишем из регистра
				НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();
							
				НовоеДвижение.Период 			= Дата;
				НовоеДвижение.Склад 			= ВыборкаПоСкладам.Склад;
							
				НовоеДвижение.Сумма				= 0;
				НовоеДвижение.СуммаНаценки 		= СуммаКорректировки;
				НовоеДвижение.КодОперации		= Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;
				НовоеДвижение.ВидДвижения		= ВидДвиженияНакопления.Расход;
				
			КонецЕсли;
			
			// добавим движения в регистр ПродажиСебестоимость:
			НаценкаПриПродаже 	= СуммаКорректировки;
			СуммаПродаж 		= ВыборкаПоСкладам.Реализация - ВыборкаПоСкладам.Возвраты;
			Себестоимость 		= СуммаПродаж - НаценкаПриПродаже;
			Если НЕ Себестоимость = 0 Тогда
				// пропорционально распределим себестоимость по регистраторам
				Отбор = Новый Структура("Склад", ВыборкаПоСкладам.Склад);
				СтрокиРегистраторов = ТаблицаРегистраторовПродаж.НайтиСтроки(Отбор);
				СуммаПродаж = 0;
				Для каждого СтрокаРегистраторов Из СтрокиРегистраторов Цикл
					СуммаПродаж	 = СуммаПродаж + СтрокаРегистраторов.СуммаПродаж;
				КонецЦикла;
				
				ОшибкаРаспределения = 0;
				
				Если СуммаПродаж <> 0 Тогда
					
					Для каждого СтрокаРегистраторов Из СтрокиРегистраторов Цикл
						
						ТекСебестоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаРегистраторов.СуммаПродаж / СуммаПродаж *  Себестоимость, 2, ОшибкаРаспределения);
						
						НовоеДвижение = Движения.ПродажиСебестоимость.Добавить();
									
						НовоеДвижение.Период 		  = Дата;
						НовоеДвижение.Подразделение	  = ВыборкаПоСкладам.Подразделение;
						
						НовоеДвижение.ДокументДвижения = СтрокаРегистраторов.Регистратор;
						
						НовоеДвижение.Стоимость       = ТекСебестоимость;
						
					КонецЦикла;
				
				КонецЕсли;
				
			КонецЕсли;					

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО ПЕРЕОЦЕНКЕ ЗАПАСОВ БУ

Процедура ПереоценкаСтоимостиЗапасовБУ(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ПереоценкаСтоимостиЗапасовБУ Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.ТипЦен,
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.СчетЗатрат,
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.Субконто1,
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.Субконто2,
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.Субконто3,
	|	ПараметрыОценкиЗапасовНаДатуБаланса.СчетДоходов,
	|	ПараметрыОценкиЗапасовНаДатуБаланса.СубконтоДоходов1,
	|	ПараметрыОценкиЗапасовНаДатуБаланса.СубконтоДоходов2,
	|	ПараметрыОценкиЗапасовНаДатуБаланса.СубконтоДоходов3
	 |ИЗ
	 |	РегистрСведений.ПараметрыОценкиЗапасовНаДатуБаланса КАК ПараметрыОценкиЗапасовНаДатуБаланса
	 |ГДЕ
	 |	ПараметрыОценкиЗапасовНаДатуБаланса.Организация = &Организация";
			 
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		
		ТекстСообщения = Заголовок + Локализация.СтрШаблон1(" Для организации ""¤1¤"" не установлены параметры оценки запасов на дату баланса !", Организация);
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		Возврат;
	КонецЕсли;
	ПараметрыОценки = Таблица[0];
	УказанСчетДоходов = ЗначениеЗаполнено(ПараметрыОценки.СчетДоходов);
		 
	// Достанем нужные цены запросом
	ЗапросЦены = Новый Запрос;
	ЗапросЦены.УстановитьПараметр("Дата",   мКонМесяца);
	ЗапросЦены.УстановитьПараметр("ТипЦен", ПараметрыОценки.ТипЦен);
	ЗапросЦены.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен       КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Валюта       КАК ВалютаЦены,
	|	ЦеныНоменклатурыСрезПоследних.Цена         КАК Цена,
	|	КурсыВалютСрезПоследних.Курс               КАК КурсВалютыЦены,
	|	КурсыВалютСрезПоследних.Кратность          КАК КратностьВалютыЦены,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ЦенаВключаетНДС          КАК ЦенаВключаетНДС,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ПорядокОкругления        КАК ПорядокОкругления,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|ГДЕ 
	|	ЦеныНоменклатурыСрезПоследних.Цена > 0";
	
	// Предполагается, что переоценка производтся для тех номенклатруных позиций, 
	// для которых установлена цена-ЧСР
	РезультатЗапросаПоЦенам = ЗапросЦены.Выполнить();
	
	ТаблицаЦены = РезультатЗапросаПоЦенам.Выгрузить();
	МассивНоменклатура = ТаблицаЦены.ВыгрузитьКолонку("Номенклатура");
	
	Если МассивНоменклатура.Количество()=0 Тогда
		// нечего переоценивать;
		Возврат;
	КонецЕсли;
	
	ТаблицаЦены = Неопределено;
	
	ВыборкаЦены = РезультатЗапросаПоЦенам.Выбрать();
	
	СчетТовары = ПланыСчетов.Хозрасчетный.Товары;
	РазделятьПоПартиям = ?(СчетТовары.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии, "ВидСубконто") = Неопределено, Ложь, Истина);
	ВедетсяСкладскойУчет  = ?(СчетТовары.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
	Если ВедетсяСкладскойУчет Тогда
		РазделятьПоСкладам = СчетТовары.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто").Суммовой;
	Иначе
		РазделятьПоСкладам = Ложь;
	КонецЕсли;
	
	СчетаНеПодлежатПереоценке = Новый Массив;
	СчетаНеПодлежатПереоценке.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВТорговле);
	СчетаНеПодлежатПереоценке.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценка);
	
	// Получим список счетов на которых ведется учет запасов
	СчетаЗапасов = Новый Массив;
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОсновныхСредств);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ПродукцияСельскохозяйственногоПроизводства);
	СчетаЗапасов.Добавить(ПланыСчетов.Хозрасчетный.Товары);
	Для каждого Счет Из СчетаЗапасов Цикл
		ВыборкаСчетов = ПланыСчетов.Хозрасчетный.ВыбратьИерархически(Счет);
		Пока ВыборкаСчетов.Следующий() Цикл
			// счета исключения
			Если (НЕ (ВыборкаСчетов.Ссылка.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТоварыВТорговле))) И  
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВТорговле)) И
				(НЕ (ВыборкаСчетов.Ссылка.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТорговаяНаценка))) И 
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТорговаяНаценка))
				 Тогда
				СчетаЗапасов.Добавить(ВыборкаСчетов.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	ВидыСубконтоУценка = Новый Массив;
	ВидыСубконтоУценка.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если РазделятьПоПартиям Тогда
		ВидыСубконтоУценка.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);	
	КонецЕсли; 
	
	ЗапросУценка = Новый Запрос;
	ЗапросУценка.УстановитьПараметр("ДатаНач",   			мНачГраница);
	ЗапросУценка.УстановитьПараметр("ДатаКон",   			мКонГраница);
	ЗапросУценка.УстановитьПараметр("Организация",			Организация);
	ЗапросУценка.УстановитьПараметр("МассивНоменклатура", 	МассивНоменклатура);
	ЗапросУценка.УстановитьПараметр("СчетаЗапасов", 		СчетаЗапасов);
	ЗапросУценка.УстановитьПараметр("СчетУценки", 			ПланыСчетов.Хозрасчетный.УценкиЗапасов);
	ЗапросУценка.УстановитьПараметр("ВидыСубконто",			ВидыСубконтоУценка);
	ЗапросУценка.УстановитьПараметр("ПустаяПартия",			Документы.Партия.ПустаяСсылка());
	
	ЗапросУценка.Текст = "
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Номенклатура,"+?(РазделятьПоПартиям,"
	|	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Партия,", "
	|	&ПустаяПартия КАК Партия,")+"
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт КАК КоличествоОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотКт КАК КоличествоОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ВЫБОР КОГДА ХозрасчетныйОборотыДтКт.КоличествоОборотКт ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ХозрасчетныйОборотыДтКт.КоличествоОборотКт КОНЕЦ КАК КоличествоПеремещения,
	|	ВЫБОР КОГДА ХозрасчетныйОстаткиУценка.СуммаОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ХозрасчетныйОстаткиУценка.СуммаОстаток КОНЕЦ КАК СуммаУценки
	|ИЗ
 	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В (&СчетаЗапасов), &ВидыСубконто, Организация = &Организация И Субконто1 В (&МассивНоменклатура)) КАК ХозрасчетныйОстаткиИОбороты
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, , СчетДт В (&СчетаЗапасов), &ВидыСубконто, СчетКт В (&СчетаЗапасов), &ВидыСубконто, Организация = &Организация И СубконтоКт1 В (&МассивНоменклатура)) КАК ХозрасчетныйОборотыДтКт
	|		 ПО ХозрасчетныйОстаткиИОбороты.Субконто1 = ХозрасчетныйОборотыДтКт.СубконтоКт1"+?(РазделятьПоПартиям,"
	|			И ХозрасчетныйОстаткиИОбороты.Субконто2 = ХозрасчетныйОборотыДтКт.СубконтоКт2","")+"
	|		     
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, Счет = &СчетУценки, &ВидыСубконто, Организация = &Организация И Субконто1 В (&МассивНоменклатура)) КАК ХозрасчетныйОстаткиУценка
	|		 ПО ХозрасчетныйОстаткиИОбороты.Субконто1 = ХозрасчетныйОстаткиУценка.Субконто1"+?(РазделятьПоПартиям,"
	|			И ХозрасчетныйОстаткиИОбороты.Субконто2 = ХозрасчетныйОстаткиУценка.Субконто2","")+"";
	
	РезультатУценка = ЗапросУценка.Выполнить();
	ТаблицаУценка = РезультатУценка.Выгрузить();
	// Спишем уценку по методу "средней"
	Для каждого СтрокаУценки Из ТаблицаУценка Цикл
		Если СтрокаУценки.СуммаУценки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУценки.КоличествоКонечныйОстаток = 0 Тогда
			// списвывается вся уценка
			СписываемаяУценка = СтрокаУценки.СуммаУценки;
		Иначе
			КоличествоБылоИПрибыло = СтрокаУценки.КоличествоНачальныйОстаток + (СтрокаУценки.КоличествоОборотДт - СтрокаУценки.КоличествоПеремещения);
			КоличествоВыбыло  = СтрокаУценки.КоличествоОборотКт - СтрокаУценки.КоличествоПеремещения;
			
			СписываемаяУценка = Окр(СтрокаУценки.СуммаУценки * КоличествоВыбыло/КоличествоБылоИПрибыло,2);
		КонецЕсли;
		
		Если СписываемаяУценка<>0 Тогда
			СтрокаУценки.СуммаУценки = СтрокаУценки.СуммаУценки - СписываемаяУценка;
		
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = Дата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			
			Проводка.Сумма					   = СписываемаяУценка;
			
			Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.УценкиЗапасов;
									
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаУценки.Номенклатура);
			Если РазделятьПоПартиям Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  СтрокаУценки.Партия);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если РазделятьПоСкладам Тогда
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	КонецЕсли;
	Если РазделятьПоПартиям Тогда
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКон",   			мКонГраница);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("МассивНоменклатура", МассивНоменклатура);
	Запрос.УстановитьПараметр("СчетаЗапасов", 		СчетаЗапасов);
	Запрос.УстановитьПараметр("ВидыСубконто",		ВидыСубконто);
	Запрос.УстановитьПараметр("ПустаяПартия",    	Документы.Партия.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСклад",    	Справочники.Склады.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.НалоговоеНазначение,
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,"+?(РазделятьПоСкладам,"
	|	ХозрасчетныйОстатки.Субконто2 КАК Склад,", "
	|	&ПустойСклад КАК Склад,")+?(РазделятьПоПартиям,"
	|	ХозрасчетныйОстатки."+?(РазделятьПоСкладам,"Субконто3","Субконто2")+" КАК Партия,", "
	|	&ПустаяПартия КАК Партия,")+"
	|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество
	|ИЗ
 	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, Счет В (&СчетаЗапасов), &ВидыСубконто, 
	|			Организация = &Организация И Субконто1 В (&МассивНоменклатура)) КАК ХозрасчетныйОстатки
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1"+?(РазделятьПоСкладам,",
	|	ХозрасчетныйОстатки.Субконто2", "")+?(РазделятьПоПартиям,",
	|	ХозрасчетныйОстатки."+?(РазделятьПоСкладам,"Субконто3","Субконто2"), "")+"
	|	АВТОУПОРЯДОЧИВАНИЕ
	| ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ВыборкаЦены.Номенклатура = Выборка.Номенклатура Тогда
			
			ВыборкаЦены.Сбросить();
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",Выборка.Номенклатура);
			Если НЕ ВыборкаЦены.НайтиСледующий(СтруктураПоиска,"Номенклатура") Тогда
				// почему то нет цены :(
				Продолжить;
			КонецЕсли;
		КонецЕсли; 
		
		ЦенаРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ВыборкаЦены.Цена, ВыборкаЦены.ВалютаЦены, ВалютаРегламентированногоУчета, 
												ВыборкаЦены.КурсВалютыЦены, 1, ВыборкаЦены.КратностьВалютыЦены, 1);
		
		СуммаЧСР = ЦенаРегл * Выборка.Количество;
		
		СуммаУценки = Выборка.Сумма - СуммаЧСР;
		
		Если СуммаУценки > 0 Тогда
			// уценку можно делать всегда
		ИначеЕсли СуммаУценки < 0 Тогда
			// дооценку только в пределах ранее проведенных уценок
			СуммаПрежнихУценок = 0;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",Выборка.Номенклатура);
			СтруктураПоиска.Вставить("Партия",Выборка.Партия);
			НайденныеСтроки = ТаблицаУценка.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СуммаПрежнихУценок = 0;
			Иначе
				СуммаПрежнихУценок = НайденныеСтроки[0].СуммаУценки;
			КонецЕсли;
		
			СуммаУценки = - Мин(-СуммаУценки, СуммаПрежнихУценок);
		КонецЕсли;  
		
		Если СуммаУценки<>0 Тогда
			
			Проводка = мПроводкиБУ.Добавить();
			Проводка.Период                    = Дата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			
			Если СуммаУценки<0 И УказанСчетДоходов Тогда 
				// в корреспонденции со счетом доходов 
				Проводка.СчетКт                    = ПараметрыОценки.СчетДоходов;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1,  ПараметрыОценки.СубконтоДоходов1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2,  ПараметрыОценки.СубконтоДоходов2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3,  ПараметрыОценки.СубконтоДоходов3);
				
				Проводка.СчетДт                    = Выборка.Счет;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Выборка.Номенклатура);
				Если РазделятьПоСкладам Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  Выборка.Склад);
				КонецЕсли;
				Если РазделятьПоПартиям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Выборка.Партия);
				КонецЕсли;
										
				Проводка.Сумма                     = -СуммаУценки;
			
				// Определение налоговой аналитики
				Проводка.НалоговоеНазначениеДт	   = Выборка.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Если  Выборка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
					Иначе
						Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					КонецЕсли;
				КонецЕсли;
				
	        Иначе
	
				Проводка.СчетДт                    = ПараметрыОценки.СчетЗатрат;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1,  ПараметрыОценки.Субконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2,  ПараметрыОценки.Субконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  ПараметрыОценки.Субконто3);
				
				Проводка.СчетКт                    = Выборка.Счет;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Выборка.Номенклатура);
				Если РазделятьПоСкладам Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Выборка.Склад);
				КонецЕсли;
				Если РазделятьПоПартиям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Выборка.Партия);
				КонецЕсли;
										
				Проводка.Сумма                     = СуммаУценки;
			
				// Определение налоговой аналитики
				Проводка.НалоговоеНазначениеКт	   = Выборка.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Если  Выборка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
					Иначе
						Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СуммаУценки>0 Тогда 
				Проводка.Содержание            = "Оценка запасов на дату баланса: уценка";
			Иначе	
				Проводка.Содержание            = "Оценка запасов на дату баланса: дооценка";
			КонецЕсли;	
			
			Если СуммаУценки<0 Тогда
				Проводка = мПроводкиБУ.Добавить();
				Проводка.Период                    = Дата;
				Проводка.Организация               = СтруктураШапкиДокумента.Организация;
				
				Проводка.Сумма					   = - СуммаУценки;
				
				Проводка.СчетКт                    = ПланыСчетов.Хозрасчетный.УценкиЗапасов;
										
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", Выборка.Номенклатура);
				Если РазделятьПоПартиям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Выборка.Партия);
				КонецЕсли;
			Иначе
				Проводка = мПроводкиБУ.Добавить();
				Проводка.Период                    = Дата;
				Проводка.Организация               = СтруктураШапкиДокумента.Организация;
				
				Проводка.Сумма					   = СуммаУценки;
				
				Проводка.СчетДт                    = ПланыСчетов.Хозрасчетный.УценкиЗапасов;
										
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", Выборка.Номенклатура);
				Если РазделятьПоПартиям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Выборка.Партия);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла; 
	
	мПроводкиБУ.Записать(Ложь);
	
КонецПроцедуры

Процедура ЗакрытиеРегистровНалоговогоУчета(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ЗакрытиеНалоговыхРегистровНУ Тогда
		Возврат;
	КонецЕсли;
	
	НаборДвиженийПродажи 	 = Движения.ПродажиНалоговыйУчет;
	НаборДвиженийПриобртение = Движения.ПриобретенияНалоговыйУчет;
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ПродажиНалоговыйУчет");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, СтруктураШапкиДокумента.Дата)); 
		ЗначенияБлокировки.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ПриобретенияНалоговыйУчет");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, СтруктураШапкиДокумента.Дата)); 
		ЗначенияБлокировки.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		
	КонецЕсли;
	
	ТаблицаДвиженийПродажи = НаборДвиженийПродажи.Выгрузить();
	ТаблицаДвиженийПродажи.Очистить();
	
	ТаблицаДвиженийПриобретение = НаборДвиженийПриобртение.Выгрузить();
	ТаблицаДвиженийПриобретение.Очистить();
	
	ЗапросПоЗакрытию = Новый Запрос();
	
	ЗапросПоЗакрытию.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Данные.ДоговорКонтрагента			  КАК ДоговорКонтрагента,
			|	Данные.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
			
			|	Данные.Сделка 						КАК Сделка,
			|	Данные.СтавкаНДС					КАК СтавкаНДС,
			|	Данные.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
			|	Данные.ВидДеятельностиНДС 	  		КАК ВидДеятельностиНДС,
			|	Данные.Амортизируется 	  			КАК Амортизируется,
			
			
			|	Данные.ВозвратнаяТара 				  КАК ВозвратнаяТара,
			
			|	ВЫБОР
			|		КОГДА Данные.ПродажиРасчетыОтгрузка > Данные.ПродажиРасчетыОплата
			|			ТОГДА Данные.ПродажиРасчетыОплата
			|		ИНАЧЕ Данные.ПродажиРасчетыОтгрузка
			|	КОНЕЦ КАК ПродажиРасчеты,
			|	ВЫБОР
			|		КОГДА Данные.ПродажиРасчетыОтгрузкаНДС > Данные.ПродажиРасчетыОплатаНДС
			|			ТОГДА Данные.ПродажиРасчетыОплатаНДС
			|		ИНАЧЕ Данные.ПродажиРасчетыОтгрузкаНДС
			|	КОНЕЦ КАК ПродажиРасчетыНДС,
			
			|	Данные.ПродажиРасчетыОплатаВДВР,
			|	Данные.ПродажиРасчетыОтгрузкаВДВР,
			
			|	ВЫБОР
			|		КОГДА Данные.ПродажиВозвратОтгрузка > Данные.ПродажиВозвратОплата
			|			ТОГДА Данные.ПродажиВозвратОплата
			|		ИНАЧЕ Данные.ПродажиВозвратОтгрузка
			|	КОНЕЦ КАК ПродажиВозврат,
			|	ВЫБОР
			|		КОГДА Данные.ПродажиВозвратОтгрузкаНДС > Данные.ПродажиВозвратОплатаНДС
			|			ТОГДА Данные.ПродажиВозвратОплатаНДС
			|		ИНАЧЕ Данные.ПродажиВозвратОтгрузкаНДС
			|	КОНЕЦ КАК ПродажиВозвратНДС,

			|	Данные.ПродажиВозвратОплатаВДВР,
			|	Данные.ПродажиВозвратОтгрузкаВДВР,
			
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияРасчетыОтгрузка > Данные.ПриобретенияРасчетыОплата
			|			ТОГДА Данные.ПриобретенияРасчетыОплата
			|		ИНАЧЕ Данные.ПриобретенияРасчетыОтгрузка
			|	КОНЕЦ КАК ПриобретенияРасчеты,
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияРасчетыОтгрузкаНДС > Данные.ПриобретенияРасчетыОплатаНДС
			|			ТОГДА Данные.ПриобретенияРасчетыОплатаНДС
			|		ИНАЧЕ Данные.ПриобретенияРасчетыОтгрузкаНДС
			|	КОНЕЦ КАК ПриобретенияРасчетыНДС,
			
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияРасчетыОтгрузкаНДСПропорционально > Данные.ПриобретенияРасчетыОплатаНДСПропорционально
			|			ТОГДА Данные.ПриобретенияРасчетыОплатаНДСПропорционально
			|		ИНАЧЕ Данные.ПриобретенияРасчетыОтгрузкаНДСПропорционально
			|	КОНЕЦ КАК ПриобретенияРасчетыНДСПропорционально,
			
			
			|	Данные.ПриобретенияРасчетыОплатаВДВР,
			|	Данные.ПриобретенияРасчетыОтгрузкаВДВР,
			
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияВозвратОтгрузка > Данные.ПриобретенияВозвратОплата
			|			ТОГДА Данные.ПриобретенияВозвратОплата
			|		ИНАЧЕ Данные.ПриобретенияВозвратОтгрузка
			|	КОНЕЦ КАК ПриобретенияВозврат,
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияВозвратОтгрузкаНДС > Данные.ПриобретенияВозвратОплатаНДС
			|			ТОГДА Данные.ПриобретенияВозвратОплатаНДС
			|		ИНАЧЕ Данные.ПриобретенияВозвратОтгрузкаНДС
			|	КОНЕЦ КАК ПриобретенияВозвратНДС,
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияВозвратОтгрузкаНДСПропорционально > Данные.ПриобретенияВозвратОплатаНДСПропорционально
			|			ТОГДА Данные.ПриобретенияВозвратОплатаНДСПропорционально
			|		ИНАЧЕ Данные.ПриобретенияВозвратОтгрузкаНДСПропорционально
			|	КОНЕЦ КАК ПриобретенияВозвратНДСПропорционально,

			|	Данные.ПриобретенияВозвратОплатаВДВР,
			|	Данные.ПриобретенияВозвратОтгрузкаВДВР,
			
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияРасчетыОтгрузка > Данные.ПродажиРасчетыОтгрузка
			|			ТОГДА Данные.ПродажиРасчетыОтгрузка
			|		ИНАЧЕ Данные.ПриобретенияРасчетыОтгрузка
			|	КОНЕЦ КАК БартерРасчеты,
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияРасчетыОтгрузкаНДС > Данные.ПродажиРасчетыОтгрузкаНДС
			|			ТОГДА Данные.ПродажиРасчетыОтгрузкаНДС
			|		ИНАЧЕ Данные.ПриобретенияРасчетыОтгрузкаНДС
			|	КОНЕЦ КАК БартерРасчетыНДС,
			
			|   Данные.ПриобретенияРасчетыОтгрузкаНДСПропорционально КАК БартерРасчетыНДСПропорционально,
			
			|	Данные.ПродажиРасчетыОтгрузкаВДВР КАК БартерПродажиРасчетыОтгрузкаВДВР,
			|	Данные.ПриобретенияРасчетыОтгрузкаВДВР КАК БартерПриобретенияРасчетыОтгрузкаВДВР,
			
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияВозвратОтгрузка > Данные.ПродажиВозвратОтгрузка
			|			ТОГДА Данные.ПродажиВозвратОтгрузка
			|		ИНАЧЕ Данные.ПриобретенияВозвратОтгрузка
			|	КОНЕЦ КАК БартерВозврат,
			|	ВЫБОР
			|		КОГДА Данные.ПриобретенияВозвратОтгрузкаНДС > Данные.ПродажиВозвратОтгрузкаНДС
			|			ТОГДА Данные.ПродажиВозвратОтгрузкаНДС
			|		ИНАЧЕ Данные.ПриобретенияВозвратОтгрузкаНДС
			|	КОНЕЦ КАК БартерВозвратНДС,
			
			|   Данные.ПриобретенияВозвратОтгрузкаНДСПропорционально КАК БартерВозвратНДСПропорционально,
			
			|	Данные.ПродажиВозвратОтгрузкаВДВР КАК БартерПродажиВозвратОтгрузкаВДВР,
			|	Данные.ПриобретенияВозвратОтгрузкаВДВР КАК БартерПриобретенияВозвратОтгрузкаВДВР
			
			|ИЗ
			|	(ВЫБРАТЬ
			|		Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
			
			|		Данные.Сделка 						КАК Сделка,
			|		Данные.СтавкаНДС					КАК СтавкаНДС,
			|		Данные.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
			|		Данные.ВидДеятельностиНДС 	  		КАК ВидДеятельностиНДС,
			|		Данные.Амортизируется 	  			КАК Амортизируется,
			
			|		Данные.ВозвратнаяТара КАК ВозвратнаяТара,
			
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОтгрузка) 		, 0)	КАК ПродажиРасчетыОтгрузка,
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОплата) 		, 0)	КАК ПродажиРасчетыОплата,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОтгрузка) 		, 0)	КАК ПродажиВозвратОтгрузка,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОплата) 		, 0)	КАК ПродажиВозвратОплата,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОтгрузка)	, 0) 	КАК ПриобретенияРасчетыОтгрузка,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОплата) 	, 0)	КАК ПриобретенияРасчетыОплата,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОтгрузка)	, 0) 	КАК ПриобретенияВозвратОтгрузка,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОплата) 	, 0)	КАК ПриобретенияВозвратОплата,
			
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОтгрузкаНДС) 	, 0)	КАК ПродажиРасчетыОтгрузкаНДС,
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОплатаНДС) 		, 0)	КАК ПродажиРасчетыОплатаНДС,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОтгрузкаНДС) 	, 0)	КАК ПродажиВозвратОтгрузкаНДС,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОплатаНДС) 		, 0)	КАК ПродажиВозвратОплатаНДС,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОтгрузкаНДС), 0) 	КАК ПриобретенияРасчетыОтгрузкаНДС,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОплатаНДС) , 0)	КАК ПриобретенияРасчетыОплатаНДС,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОтгрузкаНДС), 0) 	КАК ПриобретенияВозвратОтгрузкаНДС,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОплатаНДС) , 0)	КАК ПриобретенияВозвратОплатаНДС,
			
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОтгрузкаНДСПропорционально), 0) 	КАК ПриобретенияРасчетыОтгрузкаНДСПропорционально,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОплатаНДСПропорционально) , 0)		КАК ПриобретенияРасчетыОплатаНДСПропорционально,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОтгрузкаНДСПропорционально), 0) 	КАК ПриобретенияВозвратОтгрузкаНДСПропорционально,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОплатаНДСПропорционально) , 0)		КАК ПриобретенияВозвратОплатаНДСПропорционально,
			
			
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОтгрузкаВДВР) 		, 0)	КАК ПродажиРасчетыОтгрузкаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПродажиРасчетыОплатаВДВР) 		, 0)	КАК ПродажиРасчетыОплатаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОтгрузкаВДВР) 		, 0)	КАК ПродажиВозвратОтгрузкаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПродажиВозвратОплатаВДВР) 		, 0)	КАК ПродажиВозвратОплатаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОтгрузкаВДВР)	, 0) 	КАК ПриобретенияРасчетыОтгрузкаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияРасчетыОплатаВДВР) 	, 0)	КАК ПриобретенияРасчетыОплатаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОтгрузкаВДВР)	, 0) 	КАК ПриобретенияВозвратОтгрузкаВДВР,
			|		ЕстьNULL(СУММА(Данные.ПриобретенияВозвратОплатаВДВР) 	, 0)	КАК ПриобретенияВозвратОплатаВДВР
			
			|	ИЗ
			|		(ВЫБРАТЬ
			|			Продажи.ДоговорКонтрагента КАК ДоговорКонтрагента,
			
			|			Продажи.Сделка 		КАК Сделка,
			|			Продажи.СтавкаНДС	КАК СтавкаНДС,
			|			ИСТИНА 				КАК ДляХозяйственнойДеятельности,
			|			ИСТИНА 				КАК ВидДеятельностиНДС,
			|			ИСТИНА				КАК Амортизируется,
			
			|			Продажи.ВозвратнаяТара КАК ВозвратнаяТара,
			
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОтгрузка
			|					ТОГДА Продажи.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОтгрузка,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОплата
			|					ТОГДА Продажи.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОплата,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОтгрузка
			|					ТОГДА Продажи.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ КАК ПродажиВозвратОтгрузка,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОплата
			|					ТОГДА Продажи.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ КАК ПродажиВозвратОплата,
			|			0 КАК ПриобретенияРасчетыОтгрузка,
			|			0 КАК ПриобретенияРасчетыОплата,
			|			0 КАК ПриобретенияВозвратОтгрузка,
			|			0 КАК ПриобретенияВозвратОплата,
			
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОтгрузка
			|					ТОГДА Продажи.СуммаНДСОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОтгрузкаНДС,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОплата
			|					ТОГДА Продажи.СуммаНДСОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОплатаНДС,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОтгрузка
			|					ТОГДА Продажи.СуммаНДСОстаток
			|			КОНЕЦ КАК ПродажиВозвратОтгрузкаНДС,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОплата
			|					ТОГДА Продажи.СуммаНДСОстаток
			|			КОНЕЦ КАК ПродажиВозвратОплатаНДС,
			|			0 КАК ПриобретенияРасчетыОтгрузкаНДС,
			|			0 КАК ПриобретенияРасчетыОплатаНДС,
			|			0 КАК ПриобретенияВозвратОтгрузкаНДС,
			|			0 КАК ПриобретенияВозвратОплатаНДС,
			
			|			0 КАК ПриобретенияРасчетыОтгрузкаНДСПропорционально,
			|			0 КАК ПриобретенияРасчетыОплатаНДСПропорционально,
			|			0 КАК ПриобретенияВозвратОтгрузкаНДСПропорционально,
			|			0 КАК ПриобретенияВозвратОплатаНДСПропорционально,
			
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОтгрузка
			|					ТОГДА Продажи.СуммаВДОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОтгрузкаВДВР,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиРасчетыОплата
			|					ТОГДА Продажи.СуммаВДОстаток
			|			КОНЕЦ КАК ПродажиРасчетыОплатаВДВР,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОтгрузка
			|					ТОГДА Продажи.СуммаВДОстаток
			|			КОНЕЦ КАК ПродажиВозвратОтгрузкаВДВР,
			|			ВЫБОР
			|				КОГДА Продажи.Событие = &ПродажиВозвратОплата
			|					ТОГДА Продажи.СуммаВДОстаток
			|			КОНЕЦ КАК ПродажиВозвратОплатаВДВР,
			|			0 КАК ПриобретенияРасчетыОтгрузкаВДВР,
			|			0 КАК ПриобретенияРасчетыОплатаВДВР,
			|			0 КАК ПриобретенияВозвратОтгрузкаВДВР,
			|			0 КАК ПриобретенияВозвратОплатаВДВР
			
			|		ИЗ
			|			РегистрНакопления.ПродажиНалоговыйУчет.Остатки(&МоментВремени, Организация = &Организация) КАК Продажи
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			Приобретения.ДоговорКонтрагента,
			
			|			Приобретения.Сделка 						КАК Сделка,
			|			Приобретения.СтавкаНДС						КАК СтавкаНДС,
			|			Приобретения.ДляХозяйственнойДеятельности 	КАК ДляХозяйственнойДеятельности,
			|			Приобретения.ВидДеятельностиНДС 			КАК ВидДеятельностиНДС,
			|			Приобретения.Амортизируется 	  			КАК Амортизируется,
			
			|			Приобретения.ВозвратнаяТара,
			
			|			0,
			|			0,
			|			0,
			|			0,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОтгрузка
			|					ТОГДА Приобретения.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОплата
			|					ТОГДА Приобретения.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОтгрузка
			|					ТОГДА Приобретения.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОплата
			|					ТОГДА Приобретения.СуммаВзаиморасчетовОстаток
			|			КОНЕЦ,
			
			|			0,
			|			0,
			|			0,
			|			0,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОтгрузка
			|					ТОГДА Приобретения.СуммаНДСОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОплата
			|					ТОГДА Приобретения.СуммаНДСОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОтгрузка
			|					ТОГДА Приобретения.СуммаНДСОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОплата
			|					ТОГДА Приобретения.СуммаНДСОстаток
			|			КОНЕЦ,
			
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОтгрузка
			|					ТОГДА Приобретения.СуммаНДСПропорциональноОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОплата
			|					ТОГДА Приобретения.СуммаНДСПропорциональноОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОтгрузка
			|					ТОГДА Приобретения.СуммаНДСПропорциональноОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОплата
			|					ТОГДА Приобретения.СуммаНДСПропорциональноОстаток
			|			КОНЕЦ,
			
			
			|			0,
			|			0,
			|			0,
			|			0,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОтгрузка
			|					ТОГДА Приобретения.СуммаВРОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияРасчетыОплата
			|					ТОГДА Приобретения.СуммаВРОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОтгрузка
			|					ТОГДА Приобретения.СуммаВРОстаток
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Приобретения.Событие = &ПриобретенияВозвратОплата
			|					ТОГДА Приобретения.СуммаВРОстаток
			|			КОНЕЦ
				
			|		ИЗ
			|			РегистрНакопления.ПриобретенияНалоговыйУчет.Остатки(&МоментВремени, Организация = &Организация) КАК Приобретения) КАК Данные
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Данные.ДоговорКонтрагента,
			
			|		Данные.Сделка,
			|		Данные.СтавкаНДС,
			|		Данные.ДляХозяйственнойДеятельности,
			|		Данные.ВидДеятельностиНДС,
			|		Данные.Амортизируется,
			
			|		Данные.ВозвратнаяТара) КАК Данные
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДоговорКонтрагента,
			|	ВозвратнаяТара";
							 
	ЗапросПоЗакрытию.УстановитьПараметр("МоментВремени",МоментВремени());
	ЗапросПоЗакрытию.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	
	ЗапросПоЗакрытию.УстановитьПараметр("ПродажиРасчетыОтгрузка", 	Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю);
	ЗапросПоЗакрытию.УстановитьПараметр("ПродажиРасчетыОплата", 	Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем);
	ЗапросПоЗакрытию.УстановитьПараметр("ПродажиВозвратОтгрузка", 	Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя);
	ЗапросПоЗакрытию.УстановитьПараметр("ПродажиВозвратОплата", 	Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю);
	ЗапросПоЗакрытию.УстановитьПараметр("ПриобретенияРасчетыОтгрузка",	Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика);
	ЗапросПоЗакрытию.УстановитьПараметр("ПриобретенияРасчетыОплата",	Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
	ЗапросПоЗакрытию.УстановитьПараметр("ПриобретенияВозвратОтгрузка",	Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
	ЗапросПоЗакрытию.УстановитьПараметр("ПриобретенияВозвратОплата", 	Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
	
	Выборка = ЗапросПоЗакрытию.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			
			Если Выборка.ПродажиРасчеты 	<> 0 
			 ИЛИ Выборка.ПродажиРасчетыНДС  <> 0 
			 ИЛИ Выборка.ПродажиРасчетыОплатаВДВР <> 0 
			 ИЛИ Выборка.ПродажиРасчетыОтгрузкаВДВР <> 0 Тогда
			 
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка					= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 				= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 		= Выборка.ПродажиРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПродажиРасчетыНДС;
				СтрокаДвижений.СуммаВД 					= Выборка.ПродажиРасчетыОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
				
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка					= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 				= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;

				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПродажиРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПродажиРасчетыНДС;
				СтрокаДвижений.СуммаВД 					= Выборка.ПродажиРасчетыОплатаВДВР;

				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем;
			
			КонецЕсли; 
			
			Если Выборка.ПродажиВозврат 	<> 0 
			 ИЛИ Выборка.ПродажиВозвратНДС  <> 0 
			 ИЛИ Выборка.ПродажиВозвратОплатаВДВР <> 0 
			 ИЛИ Выборка.ПродажиВозвратОтгрузкаВДВР <> 0 Тогда
				
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка					= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 				= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПродажиВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПродажиВозвратНДС;
				СтрокаДвижений.СуммаВД 					= Выборка.ПродажиВозвратОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя;
				
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка					= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 				= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;

				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПродажиВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПродажиВозвратНДС;
				СтрокаДвижений.СуммаВД 					= Выборка.ПродажиВозвратОплатаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю;
			
			КонецЕсли;
			
			Если Выборка.ПриобретенияРасчеты 	 <> 0 
			 ИЛИ Выборка.ПриобретенияРасчетыНДС  <> 0 
			 ИЛИ Выборка.ПриобретенияРасчетыОплатаВДВР <> 0 
			 ИЛИ Выборка.ПриобретенияРасчетыОтгрузкаВДВР <> 0 
			 Тогда
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПриобретенияРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПриобретенияРасчетыНДС;
				СтрокаДвижений.СуммаНДСПропорционально 			    = Выборка.ПриобретенияРасчетыНДСПропорционально;
				СтрокаДвижений.СуммаВР 					= Выборка.ПриобретенияРасчетыОтгрузкаВДВР;
				
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПриобретенияРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПриобретенияРасчетыНДС;
				СтрокаДвижений.СуммаНДСПропорционально 			    = Выборка.ПриобретенияРасчетыНДСПропорционально;
				СтрокаДвижений.СуммаВР 					= Выборка.ПриобретенияРасчетыОплатаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
			
			КонецЕсли;
			
			Если Выборка.ПриобретенияВозврат 	 <> 0 
			 ИЛИ Выборка.ПриобретенияВозвратНДС  <> 0 
			 ИЛИ Выборка.ПриобретенияВозвратОплатаВДВР <> 0 
			 ИЛИ Выборка.ПриобретенияВозвратОтгрузкаВДВР <> 0 Тогда
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПриобретенияВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПриобретенияВозвратНДС;
				СтрокаДвижений.СуммаНДСПропорционально 			    = Выборка.ПриобретенияВозвратНДСПропорционально;
				СтрокаДвижений.СуммаВР 					= Выборка.ПриобретенияВозвратОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику;
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.ПриобретенияВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.ПриобретенияВозвратНДС;
				СтрокаДвижений.СуммаНДСПропорционально 			    = Выборка.ПриобретенияВозвратНДСПропорционально;
				СтрокаДвижений.СуммаВР 					= Выборка.ПриобретенияВозвратОплатаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком;
			
			КонецЕсли;
			
		Иначе
			
			// бартер
			Если Выборка.БартерРасчеты 	 <> 0 
			 ИЛИ Выборка.БартерРасчетыНДС  <> 0 
			 ИЛИ Выборка.БартерПродажиРасчетыОтгрузкаВДВР <> 0 
			 ИЛИ Выборка.БартерПриобретенияРасчетыОтгрузкаВДВР <> 0 Тогда
				  
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.БартерРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.БартерРасчетыНДС;
				СтрокаДвижений.СуммаВД 			= Выборка.БартерПродажиРасчетыОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.БартерРасчеты;
				СтрокаДвижений.СуммаНДС 			    = Выборка.БартерРасчетыНДС;
				СтрокаДвижений.СуммаНДСПропорционально 			    = Выборка.БартерРасчетыНДСПропорционально;
				СтрокаДвижений.СуммаВР 					= Выборка.БартерПриобретенияРасчетыОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;

			КонецЕсли;
			
			Если Выборка.БартерВозврат 	 <> 0 
			 ИЛИ Выборка.БартерВозвратНДС  <> 0 
			 ИЛИ Выборка.БартерПродажиВозвратОтгрузкаВДВР <> 0
			 ИЛИ Выборка.БартерПриобретенияВозвратОтгрузкаВДВР <> 0 Тогда
				  
				СтрокаДвижений = ТаблицаДвиженийПродажи.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 	= Выборка.БартерВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.БартерВозвратНДС;
				СтрокаДвижений.СуммаВД					= Выборка.БартерПродажиВозвратОтгрузкаВДВР;
				
				СтрокаДвижений.Событие 					= Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя;
				
				СтрокаДвижений = ТаблицаДвиженийПриобретение.Добавить();
				СтрокаДвижений.ДоговорКонтрагента 		= Выборка.ДоговорКонтрагента;
				
				СтрокаДвижений.Сделка						= Выборка.Сделка;
				СтрокаДвижений.СтавкаНДС 					= Выборка.СтавкаНДС;
				СтрокаДвижений.ДляХозяйственнойДеятельности	= Выборка.ДляХозяйственнойДеятельности;
				СтрокаДвижений.ВидДеятельностиНДС			= Выборка.ВидДеятельностиНДС;
				СтрокаДвижений.Амортизируется				= Выборка.Амортизируется;
				
				СтрокаДвижений.ВозвратнаяТара	  		= Выборка.ВозвратнаяТара;
				
				СтрокаДвижений.СуммаВзаиморасчетов 		= Выборка.БартерВозврат;
				СтрокаДвижений.СуммаНДС 			    = Выборка.БартерВозвратНДС;
				СтрокаДвижений.СуммаНДСПропорционально  = Выборка.БартерВозвратНДСПропорционально;
				СтрокаДвижений.СуммаВР 			= Выборка.БартерПриобретенияВозвратОтгрузкаВДВР;

				СтрокаДвижений.Событие 					= Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику;

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаДвиженийПродажи.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
	Если ТаблицаДвиженийПродажи.Количество() > 0 Тогда
		
		НаборДвиженийПродажи.мПериод            = СтруктураШапкиДокумента.Дата;
		НаборДвиженийПродажи.мТаблицаДвижений   = ТаблицаДвиженийПродажи;

		Если Не Отказ Тогда
			Движения.ПродажиНалоговыйУчет.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаДвиженийПриобретение.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
	Если ТаблицаДвиженийПриобретение.Количество() > 0 Тогда
		
		НаборДвиженийПриобртение.мПериод            = СтруктураШапкиДокумента.Дата;
		НаборДвиженийПриобртение.мТаблицаДвижений   = ТаблицаДвиженийПриобретение;

		Если Не Отказ Тогда
			Движения.ПриобретенияНалоговыйУчет.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
	
		ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок);	
		
	Иначе	
		
		ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураДопПараметров = Новый Структура;
	СтруктураДопПараметров.Вставить("СпособРасчетаСебестоимостиПроизводства", "");
	СтруктураДопПараметров.Вставить("РасчетПрямыхЗатратНомер", "");
	
	ЗаписьРасчетаСебестоимости = Движения.РасчетСебестоимостиПродукцииУправленческийУчет.ВыгрузитьКолонки();
	ЗаписьРасчетаСебестоимости.Колонки.Добавить("ДокументВыпуска"); 
	СтруктураДопПараметров.Вставить("ЗаписьРасчетаСебестоимости", ЗаписьРасчетаСебестоимости);
	ЗаписьРасчетаРаспределенияКосвенныхРасходов = Движения.РасчетРаспределенияКосвенныхРасходовУправленческийУчет.ВыгрузитьКолонки();
	СтруктураДопПараметров.Вставить("ЗаписьРасчетаКосвенныхРасходов", ЗаписьРасчетаРаспределенияКосвенныхРасходов);
	
	//РАСПРЕДЕЛЕНИЕ ТЗР УУ
	РаспределениеТЗРУпр(СтруктураШапкиДокумента);   
	
	// КОРРЕКТИРОВКА СТОИМОСТИ НОМЕНКЛАТУРЫ
	КорректировкаСтоимостиНоменклатурыУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// АМОРТИЗАЦИЯ
	// Начисление амортизации ОС
	НачислениеАмортизацииОСУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Начисление амортизации НМА
	НачислениеАмортизацииНМАУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// ПЕРЕОЦЕНКА
	ПереоценкаВалютныхСредствУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// ПРОИЗВОДСТВО УУ
	РасчетСебестоимостиПродукцииУпр(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок);

	// Списание торговой наценки из СНТТ
	РасчетТорговойНаценкиПоПроданнымТоварамУУ(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураДопПараметров = Новый Структура;
	СтруктураДопПараметров.Вставить("СпособРасчетаСебестоимостиПроизводства", "");
	СтруктураДопПараметров.Вставить("РасчетПрямыхЗатратНомер", "");
	
	ЗаписьРасчетаСебестоимости = Движения.РасчетСебестоимостиПродукцици.ВыгрузитьКолонки();
	ЗаписьРасчетаСебестоимости.Колонки.Добавить("ДокументВыпуска"); 
	СтруктураДопПараметров.Вставить("ЗаписьРасчетаСебестоимости", ЗаписьРасчетаСебестоимости);
	ЗаписьРасчетаРаспределенияКосвенныхРасходов = Движения.РасчетРаспределенияКосвенныхРасходов.ВыгрузитьКолонки();
	СтруктураДопПараметров.Вставить("ЗаписьРасчетаКосвенныхРасходов", ЗаписьРасчетаРаспределенияКосвенныхРасходов);
	
	РаспределениеТЗР(СтруктураШапкиДокумента, Отказ, Заголовок); 
	
	// АМОРТИЗАЦИЯ
	// Начисление амортизации ОС
	НачислениеАмортизацииОСРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	// Начисление амортизации НМА
	НачислениеАмортизацииНМАРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// ПЕРЕОЦЕНКА
	ПереоценкаВалютныхСредствРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	//// КОРРЕКТИРОВКА СТОИМОСТИ НОМЕНКЛАТУРЫ
	КорректировкаСтоимостиНоменклатурыРегл(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок);
	
	// СПИСАНИЕ РАСХОДОВ БУДУЩИХ ПЕРИОДОВ
	СписаниеРБП(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// ПРОИЗВОДСТВО БУ
	РасчетСебестоимостиПродукции(СтруктураШапкиДокумента, СтруктураДопПараметров, Отказ, Заголовок);
	
	// ПЕРЕОЦЕНКА ЗАПАСОВ БУ
	ПереоценкаСтоимостиЗапасовБУ(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// ТОРГОВЛЯ
	РасчетТорговойНаценкиПоПроданнымТоварамБУ(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Закрытие регистров налогового учета (Продажи/ПриобретенияНалоговыйУчет)
	ЗакрытиеРегистровНалоговогоУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАСПРЕДЕЛЕНИЮ ТЗР 

// Распределение ТЗР Управленческий учет

Процедура ДосписатьТЗРПоНаправлениюИспользования(СтруктураШапкиДокумента, НаправлениеИспользования, СтрокаВыборкиЗатраты, СтрокаВыборкиПартии, Сумма, Сумма_НДС)    	
	
	Если НаправлениеИспользования = "" Тогда
		Возврат;
	КонецЕсли; 
	
	НаборЗаписейЗатраты = Движения.Затраты;
	
	НоваяСтрока = НаборЗаписейЗатраты.Добавить();
	НоваяСтрока.Активность = Истина;
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	НоваяСтрока.Период = Дата;
	
	НоваяСтрока.Подразделение = СтрокаВыборкиЗатраты.Подразделение;
	НоваяСтрока.СтатьяЗатрат = СтрокаВыборкиЗатраты.СтатьяЗатрат;
    НоваяСтрока.НоменклатурнаяГруппа = СтрокаВыборкиЗатраты.НоменклатурнаяГруппа; 	 		
		
	НоваяСтрока.Сумма = Сумма;  
	НоваяСтрока.НДС = Сумма_НДС;
		
	// Если в наборе записей 1000 строк, запишем набор.
	Если НаборЗаписейЗатраты.Количество() = 1000 Тогда
		НаборЗаписейЗатраты.Записать(Ложь);
	КонецЕсли;   	
	
	// движения по регистрам в зависимости от направления использования
	Если НаправлениеИспользования = "НЗП" Тогда 		
		НаборЗаписейНезавершенноеПроизводство = Движения.НезавершенноеПроизводство;
		
		НоваяСтрока = НаборЗаписейНезавершенноеПроизводство.Добавить();
		НоваяСтрока.Активность = Истина;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период = Дата;   	
		
		НоваяСтрока.Подразделение        = СтрокаВыборкиПартии.Подразделение;
		НоваяСтрока.НоменклатурнаяГруппа = СтрокаВыборкиПартии.НоменклатурнаяГруппаЗатрат;
		
		НоваяСтрока.Стоимость = Сумма;
		НоваяСтрока.НДС = Сумма_НДС;
		
		НоваяСтрока.КодОперации = Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеПартийВПроизводствоОперативно; 
		НоваяСтрока.СтатьяЗатрат         = СтрокаВыборкиПартии.СтатьяЗатрат;
		НоваяСтрока.Заказ                = СтрокаВыборкиПартии.Заказ;
		
		НоваяСтрока.НоменклатураЗатрат   = СтрокаВыборкиПартии.Номенклатура;
		НоваяСтрока.НоменклатураЗатратКоличество = 0;
				
		// Если в наборе записей 1000 строк, запишем набор.
		Если НаборЗаписейНезавершенноеПроизводство.Количество() = 1000 Тогда
			НаборЗаписейНезавершенноеПроизводство.Записать(Ложь);
		КонецЕсли; 
		
	ИначеЕсли НаправлениеИспользования = "Затраты" Тогда
		
		НоваяСтрока = НаборЗаписейЗатраты.Добавить();
		НоваяСтрока.Активность = Истина;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период = Дата;
		
		НоваяСтрока.Подразделение        = СтрокаВыборкиПартии.Подразделение;
		НоваяСтрока.НоменклатурнаяГруппа = СтрокаВыборкиПартии.НоменклатурнаяГруппаЗатрат;
		НоваяСтрока.СтатьяЗатрат         = СтрокаВыборкиПартии.СтатьяЗатрат;   
		
		НоваяСтрока.Сумма = Сумма;
		НоваяСтрока.НДС = Сумма_НДС;
		
		//Если в наборе записей 1000 строк, запишем набор.
		Если НаборЗаписейЗатраты.Количество() = 1000 Тогда
			НаборЗаписейЗатраты.Записать(Ложь);
		КонецЕсли;     	
		
	ИначеЕсли НаправлениеИспользования = "ЗатратыОС" Тогда 	
		
		НоваяСтрока = Движения.СтроительствоОбъектовОсновныхСредств.Добавить();
		НоваяСтрока.Активность = Истина;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период = Дата;
		
		НоваяСтрока.ОбъектСтроительства = СтрокаВыборкиПартии.ОбъектСтроительства;
		НоваяСтрока.Сумма = Сумма;				
			
		// Если в наборе записей 1000 строк, запишем набор.
		Если Движения.СтроительствоОбъектовОсновныхСредств.Количество() = 1000 Тогда
			Движения.СтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;		
			
	ИначеЕсли НаправлениеИспользования = "Брак" Тогда
		
		НаборЗаписейБракВПроизводстве = Движения.БракВПроизводстве;
		
		НоваяСтрока = НаборЗаписейБракВПроизводстве.Добавить();
		НоваяСтрока.Активность = Истина;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период = Дата;
		
		НоваяСтрока.Подразделение        = СтрокаВыборкиПартии.Подразделение;
		НоваяСтрока.НоменклатурнаяГруппа = СтрокаВыборкиПартии.НоменклатурнаяГруппаЗатрат;
		НоваяСтрока.СтатьяЗатрат         = СтрокаВыборкиПартии.СтатьяЗатрат;
			
		НоваяСтрока.КодОперации = Перечисления.КодыОперацийБракВПроизводстве.СписаниеПартийВПроизводствоОперативно;
		
		НоваяСтрока.Сумма = Сумма;
		НоваяСтрока.НДС   = Сумма_НДС;

		
		// Если в наборе записей 1000 строк, запишем набор.
		Если Движения.БракВПроизводстве.Количество() = 1000 Тогда
			Движения.БракВПроизводстве.Записать(Ложь);
		КонецЕсли;
		
	ИначеЕсли НаправлениеИспользования = "Себестоимость" Тогда  					
		
		НоваяСтрока = Движения.ПродажиСебестоимость.Добавить();
		НоваяСтрока.Активность = Истина;
		НоваяСтрока.Период = Дата;
		
		НоваяСтрока.Номенклатура = СтрокаВыборкиПартии.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаВыборкиПартии.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЗаказПокупателя = СтрокаВыборкиПартии.Заказ;
		НоваяСтрока.ДокументОприходования = СтрокаВыборкиПартии.ДокументОприходования;
		НоваяСтрока.Подразделение = СтрокаВыборкиПартии.Подразделение;
		
		НоваяСтрока.Стоимость = Сумма;
		НоваяСтрока.НДС = Сумма_НДС; 
		
	 	НоваяСтрока.ДокументДвижения = СтрокаВыборкиПартии.Регистратор;
		НоваяСтрока.ДокументДвиженияПериод = СтрокаВыборкиПартии.РегистраторДата;
		НоваяСтрока.СписаниеПартий = Истина;
						
		// Если в наборе записей 1000 строк, запишем набор.
		Если Движения.ПродажиСебестоимость.Количество() = 1000 Тогда
			Движения.ПродажиСебестоимость.Записать(Ложь);
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры // ДосписатьТЗРПоНаправлениюИспользования()
 
// Процедура распределения транспортно-заготовительных расходов 
//
//  СтруктураШапкиДокумента – Структура – Реквизиты документа "Закрытие месяца"
Процедура РаспределениеТЗРУпр(СтруктураШапкиДокумента) 
	
	Если СтруктураШапкиДокумента.РаспределениеТЗРУУ Тогда
		
		ЗапросПоЗатратам = СформироватьЗапросПоТЗР(СтруктураШапкиДокумента);
			
		ЗапросПоПартиям = СформироватьЗапросПоПартиямТоваров(СтруктураШапкиДокумента);
			
		ЗапросПоНачальнымОстаткам = СформироватьЗапросПоНачальнымОстаткамПартийТоваров(СтруктураШапкиДокумента);
			
		
		Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
			СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "Затраты");
			
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, мКонМесяца)); 
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки);
		КонецЕсли;
		
		РезультатЗапросаПоЗатратам = ЗапросПоЗатратам.Выполнить();
		
		// ограничиваем запросы по партиям и нач. остаткам теми группами, для которых существуют ТЗР к распределению
		МассивНоменклатурныеГруппы = РезультатЗапросаПоЗатратам.Выгрузить().ВыгрузитьКолонку("НоменклатурнаяГруппа");
		ЗапросПоПартиям.УстановитьПараметр("НоменклатурныеГруппыЗатрат", МассивНоменклатурныеГруппы);
		ЗапросПоНачальнымОстаткам.УстановитьПараметр("НоменклатурныеГруппыЗатрат", МассивНоменклатурныеГруппы);

		РезультатЗапросаПоПартиям = ЗапросПоПартиям.Выполнить();
		
		РезультатЗапросаПоНачальнымОстаткам = ЗапросПоНачальнымОстаткам.Выполнить();
		
		
		Если РезультатЗапросаПоЗатратам.Пустой() // ТЗР не было
			ИЛИ РезультатЗапросаПоПартиям.Пустой() Тогда // списания партий не было
			Возврат;  
		КонецЕсли;     	
			
		// Получим построитель запроса по партиям товаров
		ПостроительЗапроса = ПолучитьПостроительЗапроса(СтруктураШапкиДокумента, РезультатЗапросаПоПартиям);
			
		// Получим построитель запроса по начальным остаткам 
		ПостроительЗапросаНачОст = ПолучитьПостроительЗапроса(СтруктураШапкиДокумента, РезультатЗапросаПоНачальнымОстаткам);
			
				
		МассивКоэфСуммаНЗП        = Новый Массив;	
		МассивКоэфСуммаЗатраты    = Новый Массив;	
		МассивКоэфСуммаБрак       = Новый Массив;	
		МассивКоэфСуммаЗатратыОС  = Новый Массив;	
		МассивКоэфСуммаРеализация = Новый Массив;  
		
		МассивКоэфСуммаНЗП_НДС        = Новый Массив;	
		МассивКоэфСуммаЗатраты_НДС    = Новый Массив;	
		МассивКоэфСуммаБрак_НДС       = Новый Массив;	
		МассивКоэфСуммаЗатратыОС_НДС  = Новый Массив;	
		МассивКоэфСуммаРеализация_НДС = Новый Массив;  
		
		ВыборкаПоЗатратам = РезультатЗапросаПоЗатратам.Выбрать();
		Пока ВыборкаПоЗатратам.Следующий() Цикл
			// Отберем строки партий товаров 
			УстановленНовыйОтбор = ПроверитьИУстановитьОтборПостроителяЗапроса(
				ВыборкаПоЗатратам.НоменклатурнаяГруппа, 	
				ПостроительЗапроса); 

			Если УстановленНовыйОтбор Тогда	
				ПостроительЗапроса.Выполнить();
			КонецЕсли;	
			
			РезультатЗапросаПоПартиямТоваров = ПостроительЗапроса.Результат;
						
			МассивКоэфСуммаНЗП.Очистить();
			МассивКоэфСуммаЗатраты.Очистить();
			МассивКоэфСуммаЗатратыОС.Очистить();
			МассивКоэфСуммаБрак.Очистить();
			МассивКоэфСуммаРеализация.Очистить(); 	
			
			МассивКоэфСуммаНЗП_НДС.Очистить();
			МассивКоэфСуммаЗатраты_НДС.Очистить();
			МассивКоэфСуммаЗатратыОС_НДС.Очистить();
			МассивКоэфСуммаБрак_НДС.Очистить();
			МассивКоэфСуммаРеализация_НДС.Очистить(); 
			
			ОбщаяСуммаПоступление = 0;
			ОбщаяСуммаНЗП = 0;
			ОбщаяСуммаЗатраты = 0;
			ОбщаяСуммаБрак = 0;
			ОбщаяСуммаЗатратыОС = 0;
			ОбщаяСуммаРеализация = 0;
			СуммаНачальныйОстаток = 0; 		
			
			ОбщаяСуммаПоступление_НДС = 0;
			ОбщаяСуммаНЗП_НДС = 0;
			ОбщаяСуммаЗатраты_НДС = 0;
			ОбщаяСуммаБрак_НДС = 0;
			ОбщаяСуммаЗатратыОС_НДС = 0;
			ОбщаяСуммаРеализация_НДС = 0;
			СуммаНачальныйОстаток_НДС = 0;   
			
			ВыборкаПартии = РезультатЗапросаПоПартиямТоваров.Выбрать();
			Пока ВыборкаПартии.Следующий() Цикл
				
				МассивКоэфСуммаНЗП.Добавить(ВыборкаПартии.СуммаНЗП);
				МассивКоэфСуммаЗатраты.Добавить(ВыборкаПартии.СуммаЗатраты);
				МассивКоэфСуммаБрак.Добавить(ВыборкаПартии.СуммаБрак);
				МассивКоэфСуммаЗатратыОС.Добавить(ВыборкаПартии.СуммаЗатратыОС);
				МассивКоэфСуммаРеализация.Добавить(ВыборкаПартии.СуммаРеализация - ВыборкаПартии.СуммаВозвратЭтогоМесяца);
				
				МассивКоэфСуммаНЗП_НДС.Добавить(ВыборкаПартии.СуммаНЗП_НДС);
				МассивКоэфСуммаЗатраты_НДС.Добавить(ВыборкаПартии.СуммаЗатраты_НДС);
				МассивКоэфСуммаБрак_НДС.Добавить(ВыборкаПартии.СуммаБрак_НДС);
				МассивКоэфСуммаЗатратыОС_НДС.Добавить(ВыборкаПартии.СуммаЗатратыОС_НДС);
				МассивКоэфСуммаРеализация_НДС.Добавить(ВыборкаПартии.СуммаРеализация_НДС - ВыборкаПартии.СуммаВозвратЭтогоМесяца_НДС);
				
				ОбщаяСуммаНЗП        = ОбщаяСуммаНЗП + ВыборкаПартии.СуммаНЗП;
				ОбщаяСуммаЗатраты    = ОбщаяСуммаЗатраты + ВыборкаПартии.СуммаЗатраты;
				ОбщаяСуммаБрак       = ОбщаяСуммаБрак + ВыборкаПартии.СуммаБрак;
				ОбщаяСуммаЗатратыОС  = ОбщаяСуммаЗатратыОС + ВыборкаПартии.СуммаЗатратыОС;
				ОбщаяСуммаРеализация = ОбщаяСуммаРеализация + ВыборкаПартии.СуммаРеализация - ВыборкаПартии.СуммаВозвратЭтогоМесяца;
				
	            ОбщаяСуммаПоступление = ОбщаяСуммаПоступление + ВыборкаПартии.СуммаПоступление - ВыборкаПартии.СуммаВозвратЭтогоМесяца - ВыборкаПартии.СуммаВозвратПоставщику;
				
				ОбщаяСуммаНЗП_НДС        = ОбщаяСуммаНЗП_НДС + ВыборкаПартии.СуммаНЗП_НДС;
				ОбщаяСуммаЗатраты_НДС    = ОбщаяСуммаЗатраты_НДС + ВыборкаПартии.СуммаЗатраты_НДС;
				ОбщаяСуммаБрак_НДС       = ОбщаяСуммаБрак_НДС + ВыборкаПартии.СуммаБрак_НДС;
				ОбщаяСуммаЗатратыОС_НДС  = ОбщаяСуммаЗатратыОС_НДС + ВыборкаПартии.СуммаЗатратыОС_НДС;
				ОбщаяСуммаРеализация_НДС = ОбщаяСуммаРеализация_НДС + ВыборкаПартии.СуммаРеализация_НДС - ВыборкаПартии.СуммаВозвратЭтогоМесяца_НДС;
				
				ОбщаяСуммаПоступление_НДС = ОбщаяСуммаПоступление_НДС + ВыборкаПартии.СуммаПоступление_НДС - ВыборкаПартии.СуммаВозвратЭтогоМесяца_НДС  - ВыборкаПартии.СуммаВозвратПоставщику_НДС;
				
			КонецЦикла;
			
			// Отберем строку начальных остатков
	   		УстановленНовыйОтбор = ПроверитьИУстановитьОтборПостроителяЗапроса(ВыборкаПоЗатратам.НоменклатурнаяГруппа, ПостроительЗапросаНачОст);

			Если УстановленНовыйОтбор Тогда	
				ПостроительЗапросаНачОст.Выполнить();
			КонецЕсли;	
			
			РезультатЗапросаПоНачальнымОстаткам = ПостроительЗапросаНачОст.Результат;
			
			СуммаНачальныйОстаток  = 0;
			СуммаНачальныйОстаток_НДС  = 0;
		
			ВыборкаНачОст = РезультатЗапросаПоНачальнымОстаткам.Выбрать();
			Если ВыборкаНачОст.Следующий() Тогда // может быть только одна или 0 строк для ном. группы
				СуммаНачальныйОстаток  = ?(ВыборкаНачОст.СуммаНачальныйОстаток = NULL, 0, ВыборкаНачОст.СуммаНачальныйОстаток);
				СуммаНачальныйОстаток_НДС  = ?(ВыборкаНачОст.СуммаНачальныйОстаток_НДС = NULL, 0, ВыборкаНачОст.СуммаНачальныйОстаток_НДС);
	      	КонецЕсли;		
					
			СписаноВсегоСумма = ОбщаяСуммаНЗП + ОбщаяСуммаЗатраты + ОбщаяСуммаБрак + ОбщаяСуммаЗатратыОС + ОбщаяСуммаРеализация;
			СписаноВсегоСумма_НДС = ОбщаяСуммаНЗП_НДС + ОбщаяСуммаЗатраты_НДС + ОбщаяСуммаБрак_НДС + ОбщаяСуммаЗатратыОС_НДС + ОбщаяСуммаРеализация_НДС;
			
			КоэфТЗРСумма = ?(ОбщаяСуммаПоступление + СуммаНачальныйОстаток = 0, 0, СписаноВсегоСумма/(ОбщаяСуммаПоступление + СуммаНачальныйОстаток));
			КоэфТЗРСумма_НДС = ?(ОбщаяСуммаПоступление_НДС + СуммаНачальныйОстаток_НДС = 0, 0, СписаноВсегоСумма_НДС/(ОбщаяСуммаПоступление_НДС + СуммаНачальныйОстаток_НДС));
	        					
			СуммаТЗР = Окр(ВыборкаПоЗатратам.СуммаОстаток * КоэфТЗРСумма, 2);
			СуммаТЗР_НДС = Окр(ВыборкаПоЗатратам.СуммаОстаток_НДС * КоэфТЗРСумма_НДС, 2);
			
			Если СуммаТЗР = 0 И СуммаТЗР_НДС = 0 Тогда
				// нечего распределять
				Продолжить;
			КонецЕсли; 
			
			СуммаНЗП = ?(СписаноВсегоСумма = 0, 0, Окр(СуммаТЗР * ОбщаяСуммаНЗП / СписаноВсегоСумма, 2));
			СуммаЗатраты = ?(СписаноВсегоСумма = 0, 0, Окр(СуммаТЗР * ОбщаяСуммаЗатраты / СписаноВсегоСумма, 2));
			СуммаБрак = ?(СписаноВсегоСумма = 0, 0, Окр(СуммаТЗР * ОбщаяСуммаБрак / СписаноВсегоСумма, 2));
			СуммаЗатратыОС = ?(СписаноВсегоСумма = 0, 0, Окр(СуммаТЗР * ОбщаяСуммаЗатратыОС / СписаноВсегоСумма, 2));
			СуммаРеализация = СуммаТЗР - СуммаНЗП - СуммаЗатраты - СуммаБрак - СуммаЗатратыОС;
			
			СуммаНЗП_НДС = ?(СписаноВсегоСумма_НДС = 0, 0, Окр(СуммаТЗР_НДС * ОбщаяСуммаНЗП_НДС / СписаноВсегоСумма_НДС, 2));
			СуммаЗатраты_НДС = ?(СписаноВсегоСумма_НДС = 0, 0, Окр(СуммаТЗР_НДС * ОбщаяСуммаЗатраты_НДС / СписаноВсегоСумма_НДС, 2));
			СуммаБрак_НДС = ?(СписаноВсегоСумма_НДС = 0, 0, Окр(СуммаТЗР_НДС * ОбщаяСуммаБрак_НДС / СписаноВсегоСумма_НДС, 2));
			СуммаЗатратыОС_НДС = ?(СписаноВсегоСумма_НДС = 0, 0, Окр(СуммаТЗР_НДС * ОбщаяСуммаЗатратыОС_НДС / СписаноВсегоСумма_НДС, 2));
			СуммаРеализация_НДС = СуммаТЗР_НДС - СуммаНЗП_НДС - СуммаЗатраты_НДС - СуммаБрак_НДС - СуммаЗатратыОС_НДС;
	        		
			МассивСуммаНЗП         = ПолучитьМассивРаспределеннойСуммы(СуммаНЗП, МассивКоэфСуммаНЗП, 2);
			МассивСуммаЗатраты     = ПолучитьМассивРаспределеннойСуммы(СуммаЗатраты, МассивКоэфСуммаЗатраты, 2);
			МассивСуммаБрак        = ПолучитьМассивРаспределеннойСуммы(СуммаБрак, МассивКоэфСуммаБрак, 2);
			МассивСуммаЗатратыОС   = ПолучитьМассивРаспределеннойСуммы(СуммаЗатратыОС, МассивКоэфСуммаЗатратыОС, 2);
			МассивСуммаРеализация  = ПолучитьМассивРаспределеннойСуммы(СуммаРеализация, МассивКоэфСуммаРеализация, 2);
			
			МассивСуммаНЗП_НДС         = ПолучитьМассивРаспределеннойСуммы(СуммаНЗП_НДС, МассивКоэфСуммаНЗП_НДС, 2);
			МассивСуммаЗатраты_НДС     = ПолучитьМассивРаспределеннойСуммы(СуммаЗатраты_НДС, МассивКоэфСуммаЗатраты_НДС, 2);
			МассивСуммаБрак_НДС        = ПолучитьМассивРаспределеннойСуммы(СуммаБрак_НДС, МассивКоэфСуммаБрак_НДС, 2);
			МассивСуммаЗатратыОС_НДС   = ПолучитьМассивРаспределеннойСуммы(СуммаЗатратыОС_НДС, МассивКоэфСуммаЗатратыОС_НДС, 2);
			МассивСуммаРеализация_НДС  = ПолучитьМассивРаспределеннойСуммы(СуммаРеализация_НДС, МассивКоэфСуммаРеализация_НДС, 2);
							
			Индекс = 0;
			ВыборкаПартии.Сбросить();
			Пока ВыборкаПартии.Следующий() Цикл
				
				ДосписаниеСуммаНЗП = МассивСуммаНЗП[Индекс];
				ДосписаниеСуммаЗатраты = МассивСуммаЗатраты[Индекс];
				ДосписаниеСуммаБрак = МассивСуммаБрак[Индекс];
				ДосписаниеСуммаЗатратыОС = МассивСуммаЗатратыОС[Индекс];
				ДосписаниеСуммаРеализация = МассивСуммаРеализация[Индекс];
				
				ДосписаниеСуммаНЗП_НДС = МассивСуммаНЗП_НДС[Индекс];
				ДосписаниеСуммаЗатраты_НДС = МассивСуммаЗатраты_НДС[Индекс];
				ДосписаниеСуммаБрак_НДС = МассивСуммаБрак_НДС[Индекс];
				ДосписаниеСуммаЗатратыОС_НДС = МассивСуммаЗатратыОС_НДС[Индекс];
				ДосписаниеСуммаРеализация_НДС = МассивСуммаРеализация_НДС[Индекс]; 
				
				НаправлениеИспользования = "";
				Сумма = 0;
				Сумма_НДС = 0;
				
				Если ДосписаниеСуммаНЗП <> 0 Тогда
					НаправлениеИспользования = "НЗП";
					Сумма = ДосписаниеСуммаНЗП;
					Сумма_НДС = ДосписаниеСуммаНЗП_НДС; 
				ИначеЕсли ДосписаниеСуммаЗатраты <> 0 Тогда
					НаправлениеИспользования = "Затраты";
					Сумма = ДосписаниеСуммаЗатраты;
					Сумма_НДС = ДосписаниеСуммаЗатраты_НДС;
				ИначеЕсли ДосписаниеСуммаБрак <> 0 Тогда
					НаправлениеИспользования = "Брак";
					Сумма = ДосписаниеСуммаБрак;
					Сумма_НДС = ДосписаниеСуммаБрак_НДС;
				ИначеЕсли ДосписаниеСуммаЗатратыОС <> 0 Тогда
					НаправлениеИспользования = "ЗатратыОС";
					Сумма = ДосписаниеСуммаЗатратыОС;
					Сумма_НДС = ДосписаниеСуммаЗатратыОС_НДС;
				ИначеЕсли ДосписаниеСуммаРеализация <> 0 Тогда
					НаправлениеИспользования = "Себестоимость";
					Сумма = ДосписаниеСуммаРеализация;
					Сумма_НДС = ДосписаниеСуммаРеализация_НДС;
				КонецЕсли; 
				
				ДосписатьТЗРПоНаправлениюИспользования(
					СтруктураШапкиДокумента,
					НаправлениеИспользования,
					ВыборкаПоЗатратам,
					ВыборкаПартии,
					Сумма, 
					Сумма_НДС);
				
				Индекс = Индекс + 1;        			
			КонецЦикла; 		
		КонецЦикла;	
		
		Если Движения.Затраты.Модифицированность() Тогда
			Движения.Затраты.Записать(Ложь);
		КонецЕсли;
		
		Если Движения.НезавершенноеПроизводство.Модифицированность() Тогда
			Движения.НезавершенноеПроизводство.Записать(Ложь);
		КонецЕсли;
		
		Если Движения.БракВПроизводстве.Модифицированность() Тогда
			Движения.БракВПроизводстве.Записать(Ложь);
		КонецЕсли;     
		
		Если Движения.ПродажиСебестоимость.Модифицированность() Тогда
			Движения.ПродажиСебестоимость.Записать(Ложь);
		КонецЕсли;
		
		Если Движения.СтроительствоОбъектовОсновныхСредств.Модифицированность() Тогда
			Движения.СтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры // РаспределениеТранспортноЗаготовительныхРасходов()

// Функция выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения
//
// Параметры:
//		ИсхСумма - распределяемая сумма
//		МассивКоэф - массив коэффициентов распределения
//		Точность - точность округления при распределении. Необязателен.
//
//	Возврат:
//		МассивСумм - массив размерностью равный массиву коэффициентов, содержит
//			суммы в соответствии с весом коэффициента (из массива коэффициентов)
//          В случае если распределить не удалось (сумма = 0, кол-во коэф. = 0,
//          или суммарный вес коэф. = 0), тогда возвращается значение Неопределено
//
Функция ПолучитьМассивРаспределеннойСуммы(Сумма, МассивКоэф, Знач Точность = 2)
	
	ИсходнаяСумма = Сумма;

	СуммаКоэф = 0;
	Для Каждого Коэффициент Из МассивКоэф Цикл
		СуммаКоэф = СуммаКоэф + Коэффициент;
	КонецЦикла;
	
	МассивСумм = Новый Массив();
	
	Для Каждого Коэффициент Из МассивКоэф Цикл
		СуммаПоКоэффициенту = ?(СуммаКоэф <> 0, Окр(ИсходнаяСумма * Коэффициент / СуммаКоэф, Точность, 1), 0);
		МассивСумм.Добавить(СуммаПоКоэффициенту);
		
		ИсходнаяСумма = ИсходнаяСумма - СуммаПоКоэффициенту;
		СуммаКоэф = СуммаКоэф - Коэффициент;
	КонецЦикла;

	Возврат МассивСумм;

КонецФункции // ПолучитьМассивРаспределеннойСуммы()

Функция ПолучитьПостроительЗапроса(СтруктураШапкиДокумента,	РезультатЗапроса)
	
	ПостроительЗапроса = Новый ПостроительЗапроса();
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(РезультатЗапроса);
	ПостроительЗапроса.Отбор.Добавить("НоменклатурнаяГруппа");
	
	ПостроительЗапроса.Отбор.НоменклатурнаяГруппа.Использование = Истина;
	ПостроительЗапроса.Отбор.НоменклатурнаяГруппа.ВидСравнения = ВидСравнения.Равно;  
	
	Возврат ПостроительЗапроса;   
	
КонецФункции // ПолучитьПостроительЗапросаПоПартиямТоваров()

Функция ПроверитьИУстановитьОтборПостроителяЗапроса(НоменклатурнаяГруппа, ПостроительЗапроса)
	
	ОтборСоответствуетАналитике = Ложь;
	Если ПостроительЗапроса.Отбор.НоменклатурнаяГруппа.Значение = НоменклатурнаяГруппа
	Тогда
		ОтборСоответствуетАналитике = Истина;
	КонецЕсли;
			
	Если Не ОтборСоответствуетАналитике Тогда
		ПостроительЗапроса.Отбор.НоменклатурнаяГруппа.Значение = НоменклатурнаяГруппа;
	КонецЕсли;
	
	Возврат Не ОтборСоответствуетАналитике;

КонецФункции // ПроверитьИУстановитьОтборПостроителяЗапросаПоНачальнымОстаткам()

Функция СформироватьЗапросПоТЗР(СтруктураШапкиДокумента)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Затраты.Подразделение КАК Подразделение,
	|	Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Затраты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(Затраты.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(Затраты.НДСОстаток) КАК СуммаОстаток_НДС
	|ИЗ
	|	РегистрНакопления.Затраты.Остатки(&КонГраница, СтатьяЗатрат.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы)) КАК Затраты
	|
	|СГРУППИРОВАТЬ ПО
	|	Затраты.НоменклатурнаяГруппа,
	|	Затраты.Подразделение,
	|	Затраты.СтатьяЗатрат
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатурнаяГруппа,
	|	Подразделение,
	|	СтатьяЗатрат"; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КонГраница", мКонГраница);  			
	Возврат Запрос;

КонецФункции // СформироватьЗапросПоТЗР()

Функция СформироватьЗапросПоПартиямТоваров(СтруктураШапкиДокумента)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПартииТоваровНаСкладах.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСкладах.КодОперации КАК КодОперации,
	|	ПартииТоваровНаСкладах.ДокументОприходования КАК ДокументОприходования,
	|	ПартииТоваровНаСкладах.ДокументДвижения КАК ДокументДвижения,
	|	ПартииТоваровНаСкладах.ДокументДвиженияПериод КАК ДокументДвиженияПериод,
	|	ПартииТоваровНаСкладах.Качество КАК Качество,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|				ИЛИ ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|			ТОГДА ПартииТоваровНаСкладах.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|				ИЛИ ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|			ТОГДА ПартииТоваровНаСкладах.Регистратор.Дата
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК РегистраторДата,
	|	СписанныеТовары.СкладПолучатель КАК СкладПолучатель,
	|	СписанныеТовары.Подразделение КАК Подразделение,
	|	СписанныеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СписанныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СписанныеТовары.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СписанныеТовары.ОбъектСтроительства КАК ОбъектСтроительства,
	|	СписанныеТовары.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаЗатрат,
	|	СписанныеТовары.ЗаказСписания КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыПоступление)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПоступление,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыПоступление)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПоступление_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыНЗП)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНЗП,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыНЗП)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНЗП_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыЗатраты)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗатраты,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыЗатраты)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗатраты_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыБрак)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБрак,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыБрак)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБрак_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыЗатратыОС)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗатратыОС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыЗатратыОС)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗатратыОС_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРеализация,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРеализация_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозвратЭтогоМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозвратЭтогоМесяца_НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийПартииТоваров.ВозвратПоставщику)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозвратПоставщику,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладах.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийПартииТоваров.ВозвратПоставщику)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
	|				ТОГДА ПартииТоваровНаСкладах.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозвратПоставщику_НДС
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СписанныеТовары КАК СписанныеТовары
	|		ПО ПартииТоваровНаСкладах.Регистратор = СписанныеТовары.Регистратор
	|			И ПартииТоваровНаСкладах.НомерСтрокиСписанныхТоваров = СписанныеТовары.НомерСтроки
	|ГДЕ
	|	ПартииТоваровНаСкладах.Период МЕЖДУ &НачМесяца И &КонМесяца
	|	И ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа В(&НоменклатурныеГруппыЗатрат)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа,
	|	ПартииТоваровНаСкладах.Номенклатура,
	|	ПартииТоваровНаСкладах.КодОперации,
	|	ПартииТоваровНаСкладах.ДокументОприходования,
	|	ПартииТоваровНаСкладах.ДокументДвижения,
	|	ПартииТоваровНаСкладах.ДокументДвиженияПериод,
	|	ПартииТоваровНаСкладах.Качество,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|				ИЛИ ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|			ТОГДА ПартииТоваровНаСкладах.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладах.КодОперации В (&КодыРеализация)
	|				ИЛИ ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					И (СписанныеТовары.ДокументПартии.Дата МЕЖДУ &НачМесяца И &КонМесяца)
	|					И ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияПриход
	|			ТОГДА ПартииТоваровНаСкладах.Регистратор.Дата
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	СписанныеТовары.СкладПолучатель,
	|	СписанныеТовары.Подразделение,
	|	СписанныеТовары.ХарактеристикаНоменклатуры,
	|	СписанныеТовары.СерияНоменклатуры,
	|	СписанныеТовары.СтатьяЗатрат,
	|	СписанныеТовары.ОбъектСтроительства,
	|	СписанныеТовары.НоменклатурнаяГруппа,
	|	СписанныеТовары.ЗаказСписания
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатурнаяГруппа,
	|	Номенклатура,
	|	ДокументОприходования,
	|	ДокументДвижения,
	|	ДокументДвиженияПериод,
	|	Качество,
	|	РегистраторДата,
	|	КодОперации,
	|	СкладПолучатель,
	|	Подразделение,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	СтатьяЗатрат,
	|	ОбъектСтроительства,
	|	НоменклатурнаяГруппаЗатрат,
	|	Заказ";    				   
	
	Запрос = Новый Запрос;  	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачМесяца",    мНачМесяца);
	Запрос.УстановитьПараметр("КонМесяца",    мКонМесяца);

	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	КодыПоступление = Новый Массив;
	КодыПоступление.Добавить(Перечисления.КодыОперацийПартииТоваров.Поступление);
	КодыПоступление.Добавить(Перечисления.КодыОперацийПартииТоваров.ПоступлениеДопРасходов);
    КодыПоступление.Добавить(Перечисления.КодыОперацийПартииТоваров.Оприходование);
    КодыПоступление.Добавить(Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя); 
	Запрос.УстановитьПараметр("КодыПоступление", КодыПоступление);
	
	КодыПеремещение = Новый Массив;
	КодыПеремещение.Добавить(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами);
	Запрос.УстановитьПараметр("КодыПеремещение", КодыПеремещение);
	
	КодыРеализация = Новый Массив;
	КодыРеализация.Добавить(Перечисления.КодыОперацийПартииТоваров.Реализация);
	КодыРеализация.Добавить(Перечисления.КодыОперацийПартииТоваров.РеализацияРозница);
	Запрос.УстановитьПараметр("КодыРеализация", КодыРеализация);
	
	КодыНЗП = Новый Массив;
	КодыНЗП.Добавить(Перечисления.КодыОперацийПартииТоваров.СписаниеПартийВПроизводствоОперативно);
	Запрос.УстановитьПараметр("КодыНЗП", КодыНЗП);
	
	КодыЗатраты = Новый Массив;
	КодыЗатраты.Добавить(Перечисления.КодыОперацийПартииТоваров.СписаниеНаЗатраты);
	Запрос.УстановитьПараметр("КодыЗатраты", КодыЗатраты);
	
	КодыБрак = Новый Массив;
	КодыБрак.Добавить(Перечисления.КодыОперацийПартииТоваров.СписаниеНаБрак);
	Запрос.УстановитьПараметр("КодыБрак", КодыБрак);
	
	КодыЗатратыОС = Новый Массив;
	КодыЗатратыОС.Добавить(Перечисления.КодыОперацийПартииТоваров.СписаниеНаСтроительствоОбъектовОС);
	КодыЗатратыОС.Добавить(Перечисления.КодыОперацийПартииТоваров.СписаниеНаВложенияВоВнеоборотныеАктивы);
	Запрос.УстановитьПараметр("КодыЗатратыОС", КодыЗатратыОС); 														 
															 
	Возврат Запрос;
															   
КонецФункции // СформироватьЗапросПоПартиямТоваров()

Функция СформироватьЗапросПоНачальнымОстаткамПартийТоваров(СтруктураШапкиДокумента)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ПартииТоваровНаСкладах.СтоимостьОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(ПартииТоваровНаСкладах.НДСОстаток) КАК СуммаНачальныйОстаток_НДС
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&НачМесяца, Номенклатура.НоменклатурнаяГруппа В (&НоменклатурныеГруппыЗатрат)) КАК ПартииТоваровНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатурнаяГруппа"; 
	
	Запрос = Новый Запрос;  	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачМесяца", мНачМесяца);
	
	Возврат Запрос;
	
КонецФункции // СформироватьЗапросПоНачальнымОстаткамПартийТоваров()

// Распределение ТЗР Регламентированный учет  

Процедура РаспределениеТЗР(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.РаспределениеТЗРБУ Тогда 
		РаспределениеТЗРБУ("Товары",    СтруктураШапкиДокумента);
		РаспределениеТЗРБУ("Материалы", СтруктураШапкиДокумента);
		РаспределениеТЗРБУ("РозницаСуммовойУчет", СтруктураШапкиДокумента);
	КонецЕсли;
		
КонецПроцедуры  

Процедура РаспределениеТЗРБУ(ВидТЗР, СтруктураШапкиДокумента)
	
	СуммовойУчет                    = Истина;

	МассивСчетовЗатратТЗР           = Новый Массив;
	МассивСчетовЗапасов             = Новый Массив;
	МассивСчетовЗапасовТаЖеГруппа   = Новый Массив; 
	МассивСчетовЗапасовДругаяГруппа = Новый Массив;  	
	
	Если ВидТЗР = "Материалы" Тогда
		
		МассивСчетовЗатратТЗР.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы);
		МассивСчетовЗапасов             = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
		
		СчетТЗРМатериалы = МассивСчетовЗапасов.Найти(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы);
		Если СчетТЗРМатериалы <> Неопределено Тогда  
			 МассивСчетовЗапасов.Удалить(СчетТЗРМатериалы);		
		 КонецЕсли; 
		МассивСчетовЗапасовТаЖеГруппа   = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
       	МассивСчетовЗапасовДругаяГруппа = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.Товары);
		
	ИначеЕсли ВидТЗР = "Товары" Тогда
		
		МассивСчетовЗатратТЗР.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары);
		МассивСчетовЗапасов            = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.Товары);
		МассивСчетовЗапасовТаЖеГруппа  = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.Товары);
		
		СчетТЗРТовары = МассивСчетовЗапасов.Найти(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары);
		Если СчетТЗРТовары <> Неопределено Тогда  
			 МассивСчетовЗапасов.Удалить(СчетТЗРТовары);		
		КонецЕсли;
		
    	МассивСчетовЗапасовДругаяГруппа = СформироватьМассивСчетовВИерархии(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
		
		Если СуммовойУчет Тогда
			СчетТорговаяНаценка = МассивСчетовЗапасов.Найти(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
			Если СчетТорговаяНаценка <> Неопределено Тогда 	
				МассивСчетовЗапасов.Удалить(СчетТорговаяНаценка);				
			КонецЕсли;
			
			СчетТорговаяНаценкаТажеГруппа = МассивСчетовЗапасовТаЖеГруппа.Найти(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
            Если СчетТорговаяНаценкаТажеГруппа <> Неопределено Тогда 	
				МассивСчетовЗапасовТаЖеГруппа.Удалить(СчетТорговаяНаценкаТажеГруппа);
			КонецЕсли;   			

			СчетНТТ = МассивСчетовЗапасов.Найти(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
			Если СчетНТТ <> Неопределено Тогда 			
				МассивСчетовЗапасов.Удалить(СчетНТТ);
          		МассивСчетовЗапасовТаЖеГруппа.Удалить(МассивСчетовЗапасовТаЖеГруппа.Найти(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ));
			КонецЕсли;
			
			СчетНТТтажеГруппа = МассивСчетовЗапасовТаЖеГруппа.Найти(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
			Если СчетНТТтажеГруппа <> Неопределено Тогда 			
				МассивСчетовЗапасовТаЖеГруппа.Удалить(СчетНТТтажеГруппа);
			КонецЕсли;
			
			СчетТорговаяНаценкаАТТ = МассивСчетовЗапасов.Найти(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
			Если СчетТорговаяНаценкаАТТ <> Неопределено Тогда 	
				МассивСчетовЗапасов.Удалить(СчетТорговаяНаценкаАТТ);				
			КонецЕсли;
			
			СчетТорговаяНаценкаАТТТажеГруппа = МассивСчетовЗапасовТаЖеГруппа.Найти(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
            Если СчетТорговаяНаценкаАТТТажеГруппа <> Неопределено Тогда 	
				МассивСчетовЗапасовТаЖеГруппа.Удалить(СчетТорговаяНаценкаАТТТажеГруппа);
			КонецЕсли;			
			
			МассивСчетовЗапасовДругаяГруппа.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		КонецЕсли;  
		
	ИначеЕсли ВидТЗР = "РозницаСуммовойУчет" Тогда
		 МассивСчетовЗатратТЗР.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет);
         МассивСчетовЗапасов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		 МассивСчетовЗапасовТаЖеГруппа.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		 МассивСчетовЗапасовТаЖеГруппа.Добавить(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет);
        		 
		 МассивДругаяГруппа = Новый Массив;
		 МассивДругаяГруппа.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
		 МассивДругаяГруппа.Добавить(ПланыСчетов.Хозрасчетный.Товары);
		 МассивСчетовЗапасовДругаяГруппа = СформироватьМассивСчетовВИерархии(МассивДругаяГруппа);
		 
		 СчетНТТ = МассивСчетовЗапасовДругаяГруппа.Найти(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		 Если СчетНТТ <> Неопределено Тогда 			
			 МассивСчетовЗапасовДругаяГруппа.Удалить(СчетНТТ);
		 КонецЕсли;
		 
		 СчетТорговаяНаценка = МассивСчетовЗапасовДругаяГруппа.Найти(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		 Если СчетТорговаяНаценка <> Неопределено Тогда 	
			 МассивСчетовЗапасовДругаяГруппа.Удалить(СчетТорговаяНаценка);
		 КонецЕсли; 
		 
		 СчетТЗРТовары = МассивСчетовЗапасовДругаяГруппа.Найти(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары);
		 Если СчетТЗРТовары <> Неопределено Тогда 	
			 МассивСчетовЗапасовДругаяГруппа.Удалить(СчетТЗРТовары);
		 КонецЕсли; 
		 
		 СчетТЗРМатериалы = МассивСчетовЗапасовДругаяГруппа.Найти(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы);
		 Если СчетТЗРМатериалы <> Неопределено Тогда 	
			 МассивСчетовЗапасовДругаяГруппа.Удалить(СчетТЗРМатериалы);
		 КонецЕсли; 
	КонецЕсли; 		
	
	ИспользуемыеКлассыСчетовРасходов = БухгалтерскийУчет.ПолучитьИспользуемыеКлассыСчетовРасходов(Дата, Организация);
	Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс9 Тогда
		Использовать8Класс = Ложь;
	Иначе
		Использовать8Класс = Истина;
	КонецЕсли; 	
	
	
	ЗапросПоЗатратам = Новый Запрос;
	ЗапросПоЗатратам.Текст = 
	"ВЫБРАТЬ 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", " ""Розница""", " ХозрасчетныйОстатки.Субконто1") + " КАК НоменклатурнаяГруппаЗатрат,
	
	|	ХозрасчетныйОстатки.НалоговоеНазначение КАК НалоговоеНазначениеТЗР,
	|	Реализация.НалоговоеНазначениеЗапаса КАК НалоговоеНазначениеЗапаса,
	|	Реализация.НалоговоеНазначениеЗатрат КАК НалоговоеНазначениеЗатрат,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУОстаток, 0) КАК СуммаЗатратНУ,
	|	ЕСТЬNULL(Поступление.СуммаПоступленияНУ, 0) КАК СуммаПоступлениеНУ,
	|	ЕСТЬNULL(Поступление.ВРамкахГруппыНУ, 0) КАК ПоступлениеВРамкахГруппыНУ,
	|	ЭтоВозвратПоставщику КАК ЭтоВозвратПоставщику,
	
	|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК СуммаЗатрат,
	|	ЕСТЬNULL(Поступление.СуммаПоступления, 0) КАК СуммаПоступление,
	|	ЕСТЬNULL(Поступление.ВРамкахГруппы, 0) КАК ПоступлениеВРамкахГруппы,
	|	Реализация.СчетДт КАК РеализацияСчетДт,
	|	Реализация.СубконтоДт1 КАК РеализацияСубконтоДт1,
	|	Реализация.СубконтоДт2 КАК РеализацияСубконтоДт2,
	|	Реализация.СубконтоДт3 КАК РеализацияСубконтоДт3,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Реализация.ПеремещениеВРамкахГруппы < 0
	|				ТОГДА 0
	|			ИНАЧЕ Реализация.ПеремещениеВРамкахГруппы
	|		КОНЕЦ, 0) КАК РеализацияВРамкахГруппы,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Реализация.СуммаРеализации < 0
	|				ТОГДА 0
	|			ИНАЧЕ Реализация.СуммаРеализации
	|		КОНЕЦ, 0) КАК СуммаРеализации,
	|	ЕСТЬNULL(НачОстатки.СуммаОстаток, 0) КАК НачОстаток,
	
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Реализация.ПеремещениеВРамкахГруппыНУ < 0
	|				ТОГДА 0
	|			ИНАЧЕ Реализация.ПеремещениеВРамкахГруппыНУ
	|		КОНЕЦ, 0) КАК РеализацияВРамкахГруппыНУ,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Реализация.СуммаРеализацииНУ < 0
	|				ТОГДА 0
	|			ИНАЧЕ Реализация.СуммаРеализацииНУ
	|		КОНЕЦ, 0) КАК СуммаРеализацииНУ,
	|	ЕСТЬNULL(НачОстатки.СуммаНУОстаток, 0) КАК НачОстатокНУ
	
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонГраница, Счет В (&МассивСчетовЗатрат),&ПорядокСубконтоТЗР, Организация = &Организация) КАК ХозрасчетныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", """Розница""", " ХозрасчетныйОборотыДтКт.СубконтоДт1.НоменклатурнаяГруппа") + " КАК НоменклатурнаяГруппа,
	|			СУММА(ВЫБОР
	|					КОГДА ХозрасчетныйОборотыДтКт.СчетКт В (&МассивСчетовЗапасовТаЖеГруппа)
	|						ТОГДА ХозрасчетныйОборотыДтКт.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВРамкахГруппы,
	|			СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот) КАК СуммаПоступления,
	|			СУММА(ВЫБОР
	|					КОГДА ХозрасчетныйОборотыДтКт.СчетКт В (&МассивСчетовЗапасовТаЖеГруппа)
	|						ТОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотДт
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВРамкахГруппыНУ,
	|			СУММА(ХозрасчетныйОборотыДтКт.СуммаНУОборотДт) КАК СуммаПоступленияНУ	
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачМесяца, &КонМесяца, , СчетДт В (&МассивСчетовЗапасов)," + ?(ВидТЗР = "РозницаСуммовойУчет", "", "&Номенклатура")+ ", , , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		
	|		СГРУППИРОВАТЬ ПО 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", """Розница""", " ХозрасчетныйОборотыДтКт.СубконтоДт1.НоменклатурнаяГруппа") + ") КАК Поступление
    |		ПО " + ?(ВидТЗР = "РозницаСуммовойУчет", "ИСТИНА","ХозрасчетныйОстатки.Субконто1 = Поступление.НоменклатурнаяГруппа") +
	"		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", """Розница""", " ХозрасчетныйОстатки.Субконто1.НоменклатурнаяГруппа") + " КАК НоменклатурнаяГруппа, 
    |			СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
	|			СУММА(ХозрасчетныйОстатки.СуммаНУОстаток) КАК СуммаНУОстаток	
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(&НачМесяца, Счет В (&МассивСчетовЗапасов)," + ?(ВидТЗР = "РозницаСуммовойУчет", "", "&Номенклатура")+ ", Организация = &Организация) КАК ХозрасчетныйОстатки
	|		
	|		СГРУППИРОВАТЬ ПО 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", " ""Розница""", " ХозрасчетныйОстатки.Субконто1.НоменклатурнаяГруппа") + ") КАК НачОстатки 
	|		ПО " + ?(ВидТЗР = "РозницаСуммовойУчет", "ИСТИНА","ХозрасчетныйОстатки.Субконто1 = НачОстатки.НоменклатурнаяГруппа") +
	"		ЛЕВОЕ СОЕДИНЕНИЕ " +
	?(Использовать8Класс, "(ВЫБРАТЬ  
	
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ХозрасчетныйДвиженияССубконто1.НалоговоеНазначениеДт
	|		    ИНАЧЕ ДвиженияССубконто.НалоговоеНазначениеДт
	|	КОНЕЦ КАК НалоговоеНазначениеЗатрат,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ХозрасчетныйДвиженияССубконто1.НалоговоеНазначениеКт
	|		    ИНАЧЕ ДвиженияССубконто.НалоговоеНазначениеКт
	|	КОНЕЦ КАК НалоговоеНазначениеЗапаса,
	|ВЫБОР                         
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА Истина
	|	ИНАЧЕ Ложь
	|КОНЕЦ КАК ЭтоВозвратПоставщику,
	
	|ВЫБОР                         
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА ДвиженияССубконто.Регистратор.СчетУчетаРасходовБУ
	|	ИНАЧЕ ДвиженияССубконто.СчетДт
	|КОНЕЦ КАК СчетДт,
	|ВЫБОР
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов1
	|	ИНАЧЕ ДвиженияССубконто.СубконтоДт1
	|КОНЕЦ КАК СубконтоДт1,
	|ВЫБОР
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов2
	|	ИНАЧЕ ДвиженияССубконто.СубконтоДт2
	|КОНЕЦ КАК СубконтоДт2,
	|ВЫБОР
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов3
	|		ИНАЧЕ ДвиженияССубконто.СубконтоДт3
	|	КОНЕЦ КАК СубконтоДт3, " + 
	?(ВидТЗР = "РозницаСуммовойУчет", """Розница""", 
	"   ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ВЫБОР
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт1.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт2.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт3.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт1.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОГДА ДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт2.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОГДА ДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт3.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|			КОНЕЦ
	|	КОНЕЦ ") + " КАК НоменклатурнаяГруппа,
	|	СУММА(ДвиженияССубконто.Сумма) КАК СуммаРеализации,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетДт В (&МассивСчетовЗапасовТаЖеГруппа)
	|				ТОГДА ДвиженияССубконто.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПеремещениеВРамкахГруппы,
	
	|	СУММА(ДвиженияССубконто.СуммаНУКт) КАК СуммаРеализацииНУ,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетДт В (&МассивСчетовЗапасовТаЖеГруппа)
	|				ТОГДА ДвиженияССубконто.СуммаНУКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПеремещениеВРамкахГруппыНУ
	
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|			&НачМесяца,
	|			&КонМесяца,
	|			(СчетДополнительный В (&МассивСчетовЗапасов)
	|				ИЛИ СчетКт В (&МассивСчетовЗапасов)
	|					И СчетДополнительный = &ПустойСчет) И Организация = &Организация) КАК ДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|				&НачМесяца,
	|				&КонМесяца,
	|				(СчетДополнительный В (&МассивСчетовЗапасов)
	|					ИЛИ СчетКт В (&МассивСчетовЗапасов)
	|						И СчетДополнительный = &ПустойСчет) И Организация = &Организация) КАК ХозрасчетныйДвиженияССубконто1
	|		ПО ДвиженияССубконто.Регистратор = ХозрасчетныйДвиженияССубконто1.Регистратор
	|			И (ВЫБОР
	|				КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|					ТОГДА ДвиженияССубконто.СчетДополнительный = ХозрасчетныйДвиженияССубконто1.СчетКт
	|				ИНАЧЕ ДвиженияССубконто.СчетКт = ХозрасчетныйДвиженияССубконто1.СчетДополнительный
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|					ТОГДА ДвиженияССубконто.НомерИсходнойПроводки + 1 = ХозрасчетныйДвиженияССубконто1.НомерСтроки
	|				ИНАЧЕ ДвиженияССубконто.НомерСтроки = ХозрасчетныйДвиженияССубконто1.НомерИсходнойПроводки + 1
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ХозрасчетныйДвиженияССубконто1.СчетДт ЕСТЬ NULL 
	|		КОНЕЦ  	
	|СГРУППИРОВАТЬ ПО
	
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ХозрасчетныйДвиженияССубконто1.НалоговоеНазначениеДт
	|		    ИНАЧЕ ДвиженияССубконто.НалоговоеНазначениеДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ХозрасчетныйДвиженияССубконто1.НалоговоеНазначениеКт
	|		    ИНАЧЕ ДвиженияССубконто.НалоговоеНазначениеКт
	|	КОНЕЦ,
	|ВЫБОР                         
	|	КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА Истина
	|	ИНАЧЕ Ложь
	|КОНЕЦ,
	
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ДвиженияССубконто.Регистратор.СчетУчетаРасходовБУ
	|		ИНАЧЕ ДвиженияССубконто.СчетДт
	|	КОНЕЦ, " + 
	?(ВидТЗР = "РозницаСуммовойУчет", """Розница"",", 
	"	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетДополнительный В (&МассивСчетовЗапасов)
	|			ТОГДА ВЫБОР
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт1.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт2.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|					КОГДА ХозрасчетныйДвиженияССубконто1.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЕСТЬNULL(ХозрасчетныйДвиженияССубконто1.СубконтоКт3.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт1.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОГДА ДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт2.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|				КОГДА ДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ЕСТЬNULL(ДвиженияССубконто.СубконтоКт3.НоменклатурнаяГруппа, &ПустаяНомГруппа)
	|			КОНЕЦ
	|	КОНЕЦ,") +  
	"	ВЫБОР
	|		КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов1
	|		ИНАЧЕ ДвиженияССубконто.СубконтоДт1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов2
	|		ИНАЧЕ ДвиженияССубконто.СубконтоДт2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ДвиженияССубконто.Регистратор.СубконтоРасходов3
	|		ИНАЧЕ ДвиженияССубконто.СубконтоДт3
	|	КОНЕЦ ", 	
	"(ВЫБРАТЬ 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", " ""Розница""", " ХозрасчетныйОборотыДтКт.СубконтоКт1.НоменклатурнаяГруппа") + " КАК НоменклатурнаяГруппа,
	|			СУММА(ВЫБОР
	|					КОГДА ХозрасчетныйОборотыДтКт.СчетДт В (&МассивСчетовЗапасовТаЖеГруппа)
	|						ТОГДА ХозрасчетныйОборотыДтКт.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ПеремещениеВРамкахГруппы,
	|			СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот) КАК СуммаРеализации,
	|			СУММА(ВЫБОР
	|					КОГДА ХозрасчетныйОборотыДтКт.СчетДт В (&МассивСчетовЗапасовТаЖеГруппа)
	|						ТОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотКт
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ПеремещениеВРамкахГруппыНУ,
	|			СУММА(ХозрасчетныйОборотыДтКт.СуммаНУОборотКт) КАК СуммаРеализацииНУ,
	|			ХозрасчетныйОборотыДтКт.НалоговоеНазначениеДт КАК НалоговоеНазначениеЗатрат,
	|			ХозрасчетныйОборотыДтКт.НалоговоеНазначениеКт КАК НалоговоеНазначениеЗапаса,
	|ВЫБОР                         
	|	КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА Истина
	|	ИНАЧЕ Ложь
	|КОНЕЦ КАК ЭтоВозвратПоставщику,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СчетУчетаРасходовБУ
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СчетДт
	|			КОНЕЦ КАК СчетДт,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов1
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт1
	|			КОНЕЦ КАК СубконтоДт1,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов2
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт2
	|			КОНЕЦ КАК СубконтоДт2,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов3
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт3
	|			КОНЕЦ КАК СубконтоДт3 	
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачМесяца, &КонМесяца, Регистратор , , , СчетКт В (&МассивСчетовЗапасов)," + ?(ВидТЗР = "РозницаСуммовойУчет", "", "&Номенклатура") + ", Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ХозрасчетныйОборотыДтКт.НалоговоеНазначениеДт, 
	|			ХозрасчетныйОборотыДтКт.НалоговоеНазначениеКт, 
	|ВЫБОР                         
	|	КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		ТОГДА Истина
	|	ИНАЧЕ Ложь
	|КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СчетУчетаРасходовБУ
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СчетДт
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов1
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт1
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов2
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт2
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ТОГДА ХозрасчетныйОборотыДтКт.Регистратор.СубконтоРасходов3
	|				ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоДт3
	|			КОНЕЦ, 
	|" + ?(ВидТЗР = "РозницаСуммовойУчет", " ""Розница""", " ХозрасчетныйОборотыДтКт.СубконтоКт1.НоменклатурнаяГруппа")) + ") КАК Реализация
	|		ПО " + ?(ВидТЗР = "РозницаСуммовойУчет", "ИСТИНА","ХозрасчетныйОстатки.Субконто1 = Реализация.НоменклатурнаяГруппа") +
	" ИТОГИ
	|	МИНИМУМ(СуммаЗатрат),
	|	МИНИМУМ(СуммаПоступление),
	|	МИНИМУМ(ПоступлениеВРамкахГруппы),
	|	СУММА(РеализацияВРамкахГруппы),
	|	СУММА(СуммаРеализации),
	|	МИНИМУМ(НачОстаток),
	|	МИНИМУМ(СуммаЗатратНУ),
	|	МИНИМУМ(СуммаЗатратНУ),
	|	МИНИМУМ(СуммаПоступлениеНУ),
	|	МИНИМУМ(ПоступлениеВРамкахГруппыНУ),
	|	СУММА(РеализацияВРамкахГруппыНУ),
	|	СУММА(СуммаРеализацииНУ),
	|	МИНИМУМ(НачОстатокНУ),
	|	МИНИМУМ(ЭтоВозвратПоставщику)
	|ПО
	|	НалоговоеНазначениеТЗР,
	|	НоменклатурнаяГруппаЗатрат"; 
	  	
	
	ЗапросПоЗатратам.УстановитьПараметр("НачМесяца",                       мНачМесяца);  	
	ЗапросПоЗатратам.УстановитьПараметр("КонМесяца",                       мКонМесяца);
	ЗапросПоЗатратам.УстановитьПараметр("КонГраница",                      мКонГраница); 
	
	ЗапросПоЗатратам.УстановитьПараметр("МассивСчетовЗатрат",              МассивСчетовЗатратТЗР);
	ЗапросПоЗатратам.УстановитьПараметр("Организация",                     СтруктураШапкиДокумента.Организация);
    ЗапросПоЗатратам.УстановитьПараметр("МассивСчетовЗапасов",             МассивСчетовЗапасов);
	ЗапросПоЗатратам.УстановитьПараметр("МассивСчетовЗапасовТаЖеГруппа",   МассивСчетовЗапасовТаЖеГруппа);   
	ЗапросПоЗатратам.УстановитьПараметр("МассивСчетовЗапасовДругаяГруппа", МассивСчетовЗапасовДругаяГруппа);
	ЗапросПоЗатратам.УстановитьПараметр("Номенклатура",                    ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
   	
	ПорядокСубконтоТЗР = Новый Массив; 

	Если ВидТЗР <> "РозницаСуммовойУчет" Тогда
	    ПорядокСубконтоТЗР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
    КонецЕсли;
		
	ЗапросПоЗатратам.УстановитьПараметр("ПорядокСубконтоТЗР", ПорядокСубконтоТЗР); 	
	ЗапросПоЗатратам.УстановитьПараметр("ПустаяНомГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	ЗапросПоЗатратам.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка()); 
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		//Определяем все счета, записи с которыми требуется заблокировать
		ЗапросБлокируемыеСчета = Новый Запрос;
		ЗапросБлокируемыеСчета.Текст ="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Счета.Счет КАК Счет
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	СчетаЗатратТЗР.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный	КАК СчетаЗатратТЗР
		|ГДЕ
		|	СчетаЗатратТЗР.Ссылка В (&МассивСчетовЗатрат)
        |ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	СчетаЗапасов.Ссылка	КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК СчетаЗапасов
		|ГДЕ
		|	СчетаЗапасов.Ссылка В (&МассивСчетовЗапасов)
		|ОБЪЕДИНИТЬ ВСЕ 
		|ВЫБРАТЬ
		|	СчетаЗапасовТаЖеГруппа.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК СчетаЗапасовТаЖеГруппа
		|ГДЕ
		|	СчетаЗапасовТаЖеГруппа.Ссылка В (&МассивСчетовЗапасовТаЖеГруппа)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	СчетаЗапасовДругаяГруппа.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный	КАК СчетаЗапасовДругаяГруппа
		|ГДЕ
		|	СчетаЗапасовДругаяГруппа.Ссылка В (&МассивСчетовЗапасовДругаяГруппа)		
		|) КАК Счета
		|";
		ЗапросБлокируемыеСчета.УстановитьПараметр("МассивСчетовЗатрат",              МассивСчетовЗатратТЗР);
	    ЗапросБлокируемыеСчета.УстановитьПараметр("МассивСчетовЗапасов",             МассивСчетовЗапасов);
		ЗапросБлокируемыеСчета.УстановитьПараметр("МассивСчетовЗапасовТаЖеГруппа",   МассивСчетовЗапасовТаЖеГруппа);   
		ЗапросБлокируемыеСчета.УстановитьПараметр("МассивСчетовЗапасовДругаяГруппа", МассивСчетовЗапасовДругаяГруппа);
		
		ИсточникДанныхБлокируемыхСчетов = ЗапросБлокируемыеСчета.Выполнить();
		
		
		ПериодБлокировки = ?(мКонГраница.Значение > мКонМесяца, мКонГраница.Значение, мКонМесяца);
		
		// Блокировка регистра бухгалтерии.
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы, ИсточникДанных", 
														"РегистрБухгалтерии", "Хозрасчетный", ИсточникДанныхБлокируемыхСчетов);
														
		СтруктураЗначенийБлокировки = Новый Структура("Период, Организация", 
													  Новый Диапазон(, ПериодБлокировки), СтруктураШапкиДокумента.Организация);
													  
		СтруктураИсточникаДанных = Новый Структура("Счет", "Счет");
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных);
		
	КонецЕсли;
		
	Если ВидТЗР = "Товары" Тогда   
		СчетДтТЗР = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы;
	ИначеЕсли ВидТЗР = "Материалы" Тогда   
		СчетДтТЗР = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары;	
	КонецЕсли;
	
	ВыборкаНН = ЗапросПоЗатратам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НалоговоеНазначениеТЗР");
	
	КорректировкиНН_ТЗР = Движения.КорректировкиНалоговыхНазначенийТЗР.ВыгрузитьКолонки();
	
	Пока ВыборкаНН.Следующий() Цикл
	
		ВыборкаНГ = ВыборкаНН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяГруппаЗатрат");
		
		Пока ВыборкаНГ.Следующий() Цикл  

	        СуммаПоступление     = ВыборкаНГ.СуммаПоступление - ВыборкаНГ.ПоступлениеВРамкахГруппы;
			Знаменатель          = СуммаПоступление + ВыборкаНГ.НачОстаток;
			СуммаРеализации      = ВыборкаНГ.СуммаРеализации - ВыборкаНГ.РеализацияВРамкахГруппы;
			
	        СуммаПоступлениеНУ     = ВыборкаНГ.СуммаПоступлениеНУ - ВыборкаНГ.ПоступлениеВРамкахГруппыНУ;
			ЗнаменательНУ          = СуммаПоступлениеНУ + ВыборкаНГ.НачОстатокНУ;
			СуммаРеализацииНУ      = ВыборкаНГ.СуммаРеализацииНУ - ВыборкаНГ.РеализацияВРамкахГруппыНУ;
			
			Если Знаменатель <= 0 или СуммаРеализации <= 0 Тогда  			
				ИсходнаяСуммаТЗР = 0;
			Иначе
				КоэфТЗР              = СуммаРеализации/Знаменатель; 			
		       	СуммаТЗР   = Мин(Окр(ВыборкаНГ.СуммаЗатрат * КоэфТЗР, 2),     ВыборкаНГ.СуммаЗатрат);
				ИсходнаяСуммаТЗР     = СуммаТЗР;
			КонецЕсли;	
			
			Если ЗнаменательНУ <= 0 или СуммаРеализацииНУ <= 0 Тогда  			
				ИсходнаяСуммаТЗРНУ = 0;
			Иначе
				КоэфТЗРНУ            = СуммаРеализацииНУ/ЗнаменательНУ; 			
				СуммаТЗРНУ = Мин(Окр(ВыборкаНГ.СуммаЗатратНУ * КоэфТЗРНУ, 2), ВыборкаНГ.СуммаЗатратНУ);
				ИсходнаяСуммаТЗРНУ   = СуммаТЗРНУ;
			КонецЕсли;	
			
			Если    ИсходнаяСуммаТЗР   <= 0
				ИЛИ ИсходнаяСуммаТЗРНУ <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Выборка = ВыборкаНГ.Выбрать(); 
			      		
			Пока Выборка.Следующий() Цикл  
				
				Если МассивСчетовЗапасовТаЖеГруппа.Найти(Выборка.РеализацияСчетДт) <> Неопределено  Тогда
					Продолжить;
				КонецЕсли; 
				
				Сумма   = РассчитатьСумму(СуммаРеализации,   ИсходнаяСуммаТЗР,   Выборка.СуммаРеализации);
				СуммаНУ = РассчитатьСумму(СуммаРеализацииНУ, ИсходнаяСуммаТЗРНУ, Выборка.СуммаРеализацииНУ);
				
				Если  (Сумма   <= 0)
					И (СуммаНУ <= 0) Тогда  							
					Продолжить;
				КонецЕсли;
				
				Если Сумма < 0 Тогда
					Сумма = 0
				КонецЕсли;
				
				Если СуммаНУ < 0 Тогда
					СуммаНУ = 0
				КонецЕсли;
				
				Если Выборка.РеализацияСчетДт <> ПланыСчетов.Хозрасчетный.КорректировкиНалоговогоКредита Тогда
					
					ПроводкаБУ                                 = мПроводкиБУ.Добавить();
					ПроводкаБУ.Период                          = Дата;
					ПроводкаБУ.Организация                     = СтруктураШапкиДокумента.Организация;
					
					ПроводкаБУ.СчетКт                          = МассивСчетовЗатратТЗР[0];
					Если ВидТЗР <> "РозницаСуммовойУчет" Тогда   				
						ПроводкаБУ.СубконтоКт.НоменклатурныеГруппы = Выборка.НоменклатурнаяГруппаЗатрат;
					КонецЕсли; 
					
					ПроводкаБУ.НомерЖурнала                    = "";
					ПроводкаБУ.Сумма                           = Сумма;
					
					ПроводкаБУ.НалоговоеНазначениеКт = Выборка.НалоговоеНазначениеТЗР;
					ПроводкаБУ.СуммаНУКт 			 = СуммаНУ;
					
					Если МассивСчетовЗапасовДругаяГруппа.Найти(Выборка.РеализацияСчетДт) = Неопределено  Тогда
						СчетДт                                 = Выборка.РеализацияСчетДт;   
						ПроводкаБУ.СчетДт                      = СчетДт; 
						КоличествоСубконто                     = СчетДт.ВидыСубконто.Количество();
						
						ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, Выборка.РеализацияСубконтоДт1);
						ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 2, Выборка.РеализацияСубконтоДт2);
						ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 3, Выборка.РеализацияСубконтоДт3);
						
						ПроводкаБУ.Содержание                  = НСтр("ru='Распределение ТЗР ';uk='Розподіл ТЗВ '",Локализация.КодЯзыкаИнформационнойБазы()) + ПредставлениеПериода(мНачМесяца, мКонМесяца, "ФП=Истина");
						
						Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
							
							Если Выборка.ЭтоВозвратПоставщику = Истина Тогда
								ПроводкаБУ.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
							ИНаче	
								ПроводкаБУ.НалоговоеНазначениеДт = Выборка.НалоговоеНазначениеЗатрат;
							КонецЕсли;
							
							Если НЕ ПроводкаБУ.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
								ПроводкаБУ.СуммаНУДт = СуммаНУ;
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						Если Выборка.РеализацияСчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ  Тогда
							ПроводкаБУ.СчетДт = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет;
						Иначе
							ПроводкаБУ.СчетДт = СчетДтТЗР;
						КонецЕсли;
						
						Если Выборка.РеализацияСчетДт <> ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ Тогда
							НомерСубконтоНоменклатура = Выборка.РеализацияСчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
							Если НомерСубконтоНоменклатура = Неопределено Тогда 					
								ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, Выборка.НоменклатурнаяГруппаЗатрат);
							Иначе
								НомерСубконто              = НомерСубконтоНоменклатура.НомерСтроки;
								ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, ?(НомерСубконто = 1, Выборка.РеализацияСубконтоДт1.НоменклатурнаяГруппа,?(НомерСубконто = 2, Выборка.РеализацияСубконтоДт2.НоменклатурнаяГруппа, ?(НомерСубконто = 3, Выборка.РеализацияСубконтоДт3.НоменклатурнаяГруппа, Неопределено))));
							КонецЕсли;  				
						КонецЕсли; 					
						
						ПроводкаБУ.НалоговоеНазначениеДт = Выборка.НалоговоеНазначениеТЗР;
						ПроводкаБУ.СуммаНУДт 			 = СуммаНУ;
						
						ПроводкаБУ.Содержание = НСтр("ru='Перемещение ТЗР ';uk='Переміщення ТЗВ '",Локализация.КодЯзыкаИнформационнойБазы()) + ПредставлениеПериода(мНачМесяца, мКонМесяца, "ФП=Истина");
					КонецЕсли;
					
				КонецЕсли;
				
				// Запишем в регистр корректировки по нал. назначению НДС
				// которые необходимов в дальнейшем подтвердить документов
				// ИЗменение налогового назначения ТЗР
				Если  МассивСчетовЗапасовДругаяГруппа.Найти(Выборка.РеализацияСчетДт) = Неопределено
					И СтруктураШапкиДокумента.ЕстьНДС
					И НЕ Выборка.НалоговоеНазначениеТЗР = Выборка.НалоговоеНазначениеЗапаса Тогда
					
					НужнаЗапись = Истина;
					Если     Выборка.НалоговоеНазначениеТЗР    = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально
						И НЕ Выборка.НалоговоеНазначениеЗапаса = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						// пропорциональный НДС может использоваться для любой ХОЗ деятельности
						НужнаЗапись = Ложь;
					ИначеЕсли  Выборка.НалоговоеНазначениеТЗР    = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность
						     И Выборка.НалоговоеНазначениеЗапаса = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность ТОгда
						// формально, корректировка нужна, но она не вызывает изменение налогового кредита (он и раньше был = 0)	 
						НужнаЗапись = Ложь;	 
					ИначеЕсли  Выборка.НалоговоеНазначениеЗапаса = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность
						     И Выборка.НалоговоеНазначениеТЗР    = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность ТОгда
						// формально, корректировка нужна, но она не вызывает изменение налогового кредита (он и раньше был = 0)	 
						НужнаЗапись = Ложь;	 
					КонецЕсли;	
					
					Если НужнаЗапись Тогда
						
						ЗаписьКорректировки = КорректировкиНН_ТЗР.Добавить();
						
						ЗаписьКорректировки.СчетТЗР 	 		 = МассивСчетовЗатратТЗР[0];
						Если ВидТЗР <> "РозницаСуммовойУчет" Тогда
							ЗаписьКорректировки.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппаЗатрат;
						КонецЕсли;
						
						ЗаписьКорректировки.СчетЗатрат 	 		  = Выборка.РеализацияСчетДт;
						ЗаписьКорректировки.Субконто1 	 		  = Выборка.РеализацияСубконтоДт1;
						ЗаписьКорректировки.Субконто2 	 		  = Выборка.РеализацияСубконтоДт2;
						ЗаписьКорректировки.Субконто3 	 		  = Выборка.РеализацияСубконтоДт3;
						
						Если мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
							Если Выборка.ЭтоВозвратПоставщику = Истина Тогда
								ЗаписьКорректировки.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
							ИНаче	
								ЗаписьКорректировки.НалоговоеНазначениеДоходовИЗатрат = Выборка.НалоговоеНазначениеЗатрат;
							КонецЕсли;
						КонецЕсли;
						
						ЗаписьКорректировки.НалоговоеНазначение 	 		  = Выборка.НалоговоеНазначениеТЗР;
						ЗаписьКорректировки.НалоговоеНазначениеНовое 		  = Выборка.НалоговоеНазначениеЗапаса;
						
						ЗаписьКорректировки.Сумма = Сумма;  
					
					КонецЕсли;
				КонецЕсли;	
				
			КонецЦикла;  
		КонецЦикла; 	
		
	КонецЦикла;		
	
	Если мПроводкиБУ.Количество() > 0 Тогда
		мПроводкиБУ.Записать(Ложь); 	
	КонецЕсли; 
	
	Если КорректировкиНН_ТЗР.Количество() > 0 Тогда
		
		КорректировкиНН_ТЗР.Свернуть("Период, Организация, 
									|СчетТЗР, НоменклатурнаяГруппа,
									|СчетЗатрат, Субконто1, Субконто2, Субконто3, НалоговоеНазначениеДоходовИЗатрат,
									|НалоговоеНазначение, НалоговоеНазначениеНовое "
									, "Сумма");
		
		КорректировкиНН_ТЗР.ЗаполнитьЗначения(Дата, "Период");		
        КорректировкиНН_ТЗР.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");		
		
		ДвиженияКорректировкиНН_ТЗР = Движения.КорректировкиНалоговыхНазначенийТЗР;
		ДвиженияКорректировкиНН_ТЗР.мТаблицаДвижений = КорректировкиНН_ТЗР;
		ДвиженияКорректировкиНН_ТЗР.ВыполнитьДвижения();
		ДвиженияКорректировкиНН_ТЗР.Записать(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры       
		
Функция РассчитатьСумму(СуммаРеализацииИтого,ИсходнаяСуммаТЗР, СуммаРеализации)
	
	СуммаТЗР             = ?(СуммаРеализацииИтого <> 0, Окр(ИсходнаяСуммаТЗР * СуммаРеализации / СуммаРеализацииИтого, 2), 0);
	ИсходнаяСуммаТЗР     = ИсходнаяСуммаТЗР - СуммаТЗР;
	СуммаРеализацииИтого = СуммаРеализацииИтого - СуммаРеализации; 
	
	Возврат СуммаТЗР;
КонецФункции   

Функция СформироватьМассивСчетовВИерархии(МассивСчетов, НУ = Ложь) 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Счет
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Ссылка В ИЕРАРХИИ(&МассивСчетов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Хозрасчетный.Ссылка";    
				   
   	Запрос           = Новый Запрос;
	Запрос.Текст     = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
		
	Рез              = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез.Добавить(Выборка.Счет);
	КонецЦикла;	     	
	
	Возврат Рез;
	
КонецФункции // СформироватьМассивСчетовПоИерархии()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
 	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШапкиДокумента.Вставить("ОтражатьВУправленческомУчете",   Ложь);
	СтруктураШапкиДокумента.Вставить("ОтражатьВБухгалтерскомУчете",    Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль",    ОбщегоНазначения.ПолучитьСхемуНалогообложения(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Организация).НалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС",    			  ОбщегоНазначения.ПолучитьСхемуНалогообложения(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Организация).НДС);
	
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета",     "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// определим тип документа - закрытие периода по Упр. или Регл. учетам
	СтруктураШапкиДокумента.Вставить("ЭтоДокументЗакрытияМесяцаУпр", НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация));
	
	мНачМесяца    = НачалоМесяца(Дата);
	мКонМесяца    = Дата;
	мНачКвартала 	= НачалоКвартала(Дата);
	мКонКвартала 	= КонецКвартала(Дата);
	мНачГода    	= НачалоГода(Дата);
	мНачГраница = Новый Граница(мНачМесяца, ВидГраницы.Включая);
	мКонГраница = Новый Граница(мКонМесяца, ВидГраницы.Включая);
	
	мКонКварталаВключая = Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая);
		
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект));
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Отказ Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
		мУчетнаяПолитикаБУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, СтруктураШапкиДокумента.Организация, "Бух");
		мУчетнаяПолитикаНУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, СтруктураШапкиДокумента.Организация, "Нал");
		мПараметрыНалоговогоУчета	= УчетНДС.ПолучитьПараметрыНалоговогоУчета(мКонМесяца);
		СтруктураШапкиДокумента.Вставить("НеРаспределятьОПЗнаСебестоимостьПродукции", мУчетнаяПолитикаБУ.НеРаспределятьОПЗнаСебестоимостьПродукции);
		Если ЗначениеЗаполнено(мУчетнаяПолитикаНУ.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ) Тогда
			СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеНераспределенныхПостоянныхОПЗ", мУчетнаяПолитикаНУ.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ);
		Иначе
			СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеНераспределенныхПостоянныхОПЗ", Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
		КонецЕсли;
		
		СтруктураШапкиДокумента.Вставить("ВключатьСуммуДооценокОСВСоставНП", мУчетнаяПолитикаБУ.ВключатьСуммуДооценокОСВСоставНП);
		
	Иначе
		мУчетнаяПолитикаУУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, , "Упр");
		СтруктураШапкиДокумента.Вставить("НеРаспределятьОПЗнаСебестоимостьПродукцииВУУ", мУчетнаяПолитикаУУ.НеРаспределятьОПЗнаСебестоимостьПродукции);
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
	    СообщенияОповторахВидовОпераций = ПроверкаПовторовВидовОперацийУпр(СтруктураШапкиДокумента);
	Иначе	
		СообщенияОповторахВидовОпераций = ПроверкаПовторовВидовОперацийРегл(СтруктураШапкиДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщенияОповторахВидовОпераций) Тогда
		Сообщить(СообщенияОповторахВидовОпераций);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	мПроводкиБУ = Движения.Хозрасчетный;
		
	ПорядокПодразделенийСообщался = Ложь;
	ПорядокПеределовСообщался = Ложь;
	ТаблицаНеЗакрытыхПодразделений = Новый ТаблицаЗначений;
	ТаблицаНеЗакрытыхПодразделений.Колонки.Добавить("Подразделение");
	ТаблицаНеЗакрытыхПодразделений.Колонки.Добавить("СчетЗатрат");
	
	ТаблицаНеЗакрытыхПодразделенийУпр = Новый ТаблицаЗначений;
	ТаблицаНеЗакрытыхПодразделенийУпр.Колонки.Добавить("Подразделение");
	ТаблицаНеЗакрытыхПодразделенийУпр.Колонки.Добавить("ХарактерЗатрат");
	
	мКоэффициентМатериальнойСоставляющейРассчитан = Ложь; 
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

Функция ПроверкаПовторовВидовОперацийРегл(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца", мНачМесяца);
	Запрос.УстановитьПараметр("КонецМесяца",  мКонМесяца);
	Запрос.УстановитьПараметр("НачалоКвартала", мНачКвартала);
	Запрос.УстановитьПараметр("КонецКвартала",  мКонКвартала);
	Запрос.УстановитьПараметр("Организация",  СтруктураШапкиДокумента.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.АмортизацияОСБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК АмортизацияОСБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.АмортизацияНМАБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК АмортизацияНМАБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.ПереоценкаВалютныхСредствБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереоценкаВалютныхСредствБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.КорректировкаСтоимостиНоменклатурыБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КорректировкаСтоимостиНоменклатурыБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.СписаниеРБПБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СписаниеРБПБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.РасчетСтоимостиПродукцииБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РасчетСтоимостиПродукцииБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.ПереоценкаСтоимостиЗапасовБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереоценкаСтоимостиЗапасовБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.РасчетТорговойНаценкиПоПроданнымТоварамБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РасчетТорговойНаценкиПоПроданнымТоварамБУ,
				   |	СУММА(ВЫБОР
				   |			КОГДА ЗакрытиеМесяца.РаспределениеТЗРБУ = ИСТИНА
				   |				ТОГДА 1
				   |			ИНАЧЕ 0
				   |		КОНЕЦ) КАК РаспределениеТЗРБУ
	               |ИЗ
	               |	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	               |ГДЕ
	               |	ЗакрытиеМесяца.Организация = &Организация
	               |	И ЗакрытиеМесяца.Дата >= &НачалоМесяца
	               |	И ЗакрытиеМесяца.Дата <= &КонецМесяца
	               |	И ЗакрытиеМесяца.Проведен
	               |	И (НЕ ЗакрытиеМесяца.ПометкаУдаления)";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТекстСообщения = "";
	
	Для Каждого Выборка Из Результат Цикл

		Если Выборка.АмортизацияОСБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Начисление амортизации ОС (БУ)"
"";
		КонецЕсли;
		  

	    Если Выборка.АмортизацияНМАБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Начисление амортизации НМА (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.ПереоценкаВалютныхСредствБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Переоценка валютных средств (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.КорректировкаСтоимостиНоменклатурыБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Корректировка фактической стоимости номенклатуры (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.СписаниеРБПБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Списание расходов будущих периодов (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.РасчетСтоимостиПродукцииБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Расчет и корректировка себестоимости продукции (услуг) (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.ПереоценкаСтоимостиЗапасовБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Переоценка стоимости запасов (БУ)"
"";
		КонецЕсли;
		
		Если Выборка.РасчетТорговойНаценкиПоПроданнымТоварамБУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Расчет торговой наценки по проданным товарам (БУ)"
"";
		КонецЕсли;

        Если (Выборка.РаспределениеТЗРБУ > 1) И РаспределениеТЗРБУ Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Распределение ТЗР (БУ)"
"";     			
		КонецЕсли;

	КонецЦикла;

	Возврат ТекстСообщения;
	
Конецфункции

Функция ПроверкаПовторовВидовОперацийУпр(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца", мНачМесяца);
	Запрос.УстановитьПараметр("КонецМесяца",  мКонМесяца);
	Запрос.УстановитьПараметр("НачалоКвартала", мНачКвартала);
	Запрос.УстановитьПараметр("КонецКвартала",  мКонКвартала);
	Запрос.УстановитьПараметр("Организация",  Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.АмортизацияОСУУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК АмортизацияОСУУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.АмортизацияНМАУУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК АмортизацияНМАУУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.КорректировкаСтоимостиСписанияТоваровУУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КорректировкаСтоимостиСписанияТоваровУУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.РасчетСтоимостиПродукцииУУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РасчетСтоимостиПродукцииУУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца.РасчетТорговойНаценкиПоПроданнымТоварамУУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РасчетТорговойНаценкиПоПроданнымТоварамУУ
				   |ИЗ
	               |	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	               |ГДЕ
	               |	ЗакрытиеМесяца.Организация = &Организация
	               |	И ЗакрытиеМесяца.Дата >= &НачалоМесяца
	               |	И ЗакрытиеМесяца.Дата <= &КонецМесяца
	               |	И ЗакрытиеМесяца.Проведен
	               |	И (НЕ ЗакрытиеМесяца.ПометкаУдаления)
	           	   |";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТекстСообщения = "";
	
	Для Каждого Выборка Из Результат Цикл

		Если Выборка.АмортизацияОСУУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Начисление амортизации ОС (УУ)";
		КонецЕсли;
		  
		Если Выборка.АмортизацияНМАУУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Начисление амортизации НМА (УУ)";
		КонецЕсли;
		
		Если Выборка.КорректировкаСтоимостиСписанияТоваровУУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Корректировка стоимости списания товаров (УУ)";
		КонецЕсли;
		
		Если Выборка.РасчетСтоимостиПродукцииУУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Расчет и корректировка себестоимости продукции (услуг) (УУ)";
		КонецЕсли;
		
		
		Если Выборка.РасчетТорговойНаценкиПоПроданнымТоварамУУ > 1 Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Расчет торговой наценки по проданным товарам из НТТ с суммовым учетом";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
Конецфункции

Функция ПолучитьПоказателиНормальнойМощности(СтруктураПараметров)
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоказателиПриНормальнойМощностиСрезПоследних.Подразделение,
	               |	ПоказателиПриНормальнойМощностиСрезПоследних.СпособРаспределения,
	               |	ПоказателиПриНормальнойМощностиСрезПоследних.БазаРаспределения,
	               |	ПоказателиПриНормальнойМощностиСрезПоследних.СуммаПостоянныхЗатрат
	               |ИЗ
	               |	РегистрСведений.ПоказателиПриНормальнойМощности.СрезПоследних(&Дата, Организация = &Организация) КАК ПоказателиПриНормальнойМощностиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата" , СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Организация" , СтруктураПараметров.Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ПолучитьИмяРеквизитаБазыРаспределения(МетодРаспределения)
	
	Если МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.МатериальныеЗатраты Тогда
		ИмяРеквБазы = "Мат";
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.ОплатаТруда Тогда
		ИмяРеквБазы = "ЗП";
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.ПлановаяСебестоимость Тогда
		ИмяРеквБазы = "План";
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.ОбъемВыпуска Тогда
		ИмяРеквБазы = "Выпуск";
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.ПрямыеЗатраты Тогда
		ИмяРеквБазы = "Прямые";
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда
		ИмяРеквБазы = "ПрямыеСписок";	
	ИначеЕсли МетодРаспределения = Перечисления.СпособыРаспределенияКосвенныхРасходов.НеРаспределяется Тогда	
		ИмяРеквБазы = "";
	Иначе
		ИмяРеквБазы = Неопределено;
	КонецЕсли;
	
	Возврат ИмяРеквБазы;
КонецФункции


// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Все,Валюта,РБП,Себестоимость,Калькуляция,РаспределениеКосвенныхРасходов","Все операции","Переоценка валютных средств","Списание расходов будущих периодов","Себестоимость продукции","Калькуляция","Распределение косвенных расходов");
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
