Перем мУдалятьДвижения;
Перем мДлинаСуток;
Перем СоответствиеВалютныеСпособыРасчета;


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати09101995(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
    Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные 
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	ПриемНаРаботуВОрганизацию.Номер КАК НомерДок,
		|	ПриемНаРаботуВОрганизацию.Дата КАК ДатаДок,
		|	ПриемНаРаботуВОрганизацию.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель) И ПриемНаРаботуВОрганизацию.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|
		|ГДЕ
		|	ПриемНаРаботуВОрганизацию.Ссылка = &ДокументСсылка";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтрокиДокумента.НомерСтроки,
		|	СтрокиДокумента.ДатаПриема,
		|	СтрокиДокумента.Работник КАК Работник,
		|	СтрокиДокумента.Сотрудник.Код КАК ТабельныйНомер,
		|	СтрокиДокумента.ПодразделениеОрганизации.Наименование КАК Подразделение,
		|	СтрокиДокумента.Должность.Категория КАК Категория,
		|	СтрокиДокумента.Должность.Наименование КАК Должность,
		|	СтрокиДокумента.ВидРасчета	КАК ОкладСпособРасчета,
		|	ВЫБОР КОГДА СтрокиДокумента.Сотрудник.ДатаДоговора <> ДАТАВРЕМЯ(1,1,1)
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагКонтракт,
		|	СтрокиДокумента.Сотрудник.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР КОГДА СтрокиДокумента.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагОсновная,
		|	ЕСТЬNULL(СтрокиДокумента.ОкладТарифнаяСтавка, 0) КАК ОкладТарифнаяСтавка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриемНаРаботуВОрганизациюРаботники.НомерСтроки КАК НомерСтроки,
		|		ПриемНаРаботуВОрганизациюРаботники.ДатаПриема КАК ДатаПриема,
		|		ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL 
		|				ТОГДА ПриемНаРаботуВОрганизациюРаботники.ФизЛицо.Наименование
		|			ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
		|		КОНЕЦ КАК Работник,
		|		ПриемНаРаботуВОрганизациюРаботники.Сотрудник	КАК Сотрудник,
		|		ПриемНаРаботуВОрганизациюРаботники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ПриемНаРаботуВОрганизациюРаботники.Должность КАК Должность,
		|		Начисления.Показатель1 КАК ОкладТарифнаяСтавка,
		|		Начисления.ВидРасчета
		|	ИЗ
		|		Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ПриемНаРаботуВОрганизациюРаботники.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|			ПО ПриемНаРаботуВОрганизациюРаботники.Ссылка = Начисления.Регистратор
		|				И ПриемНаРаботуВОрганизациюРаботники.Сотрудник = Начисления.Сотрудник
		|				И Начисления.ВидРасчета <> Начисления.ВидРасчетаИзмерение
		|	ГДЕ
		|		ПриемНаРаботуВОрганизациюРаботники.Ссылка = &ДокументСсылка) КАК СтрокиДокумента
		|ИТОГИ ПО
		|	Работник";
		

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати09101995()

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
    Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные 
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	ПриемНаРаботуВОрганизацию.Номер КАК НомерДок,
		|	ПриемНаРаботуВОрганизацию.Дата КАК ДатаДок,
		|	ПриемНаРаботуВОрганизацию.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель) И ПриемНаРаботуВОрганизацию.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|
		|ГДЕ
		|	ПриемНаРаботуВОрганизацию.Ссылка = &ДокументСсылка";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтрокиДокумента.НомерСтроки,
		|	СтрокиДокумента.ДатаПриема,
		|	СтрокиДокумента.Работник КАК Работник,
		|	СтрокиДокумента.Сотрудник КАК Сотрудник,
		|	ВЫБОР КОГДА СтрокиДокумента.Сотрудник.ДатаДоговора <> ДАТАВРЕМЯ(1,1,1)
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагКонтракт,
		|	СтрокиДокумента.Сотрудник.ДатаОкончания КАК ДатаОкончания,
		|	СтрокиДокумента.Сотрудник.ИспытательныйСрок КАК ИспытательныйСрок,
		|	ВЫБОР КОГДА СтрокиДокумента.Сотрудник.ИспытательныйСрок <> 0
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагИспытательныйСрок,
		|	СтрокиДокумента.Сотрудник.Код КАК ТабельныйНомер,
		|	ВЫБОР КОГДА СтрокиДокумента.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагОсновная,
		|	СтрокиДокумента.ПодразделениеОрганизации.Наименование КАК Подразделение,
		|	СтрокиДокумента.ПодразделениеОрганизации КАК ПодразделениеСотрудника,
		|	СтрокиДокумента.Должность.Категория КАК Категория,
		|	СтрокиДокумента.Должность.Наименование КАК Должность,
		|	СтрокиДокумента.Должность КАК ДолжностьСотрудника,
		|	СтрокиДокумента.ГрафикРаботы КАК ГрафикРаботы,
		|	СтрокиДокумента.ВидРасчета	КАК ОкладСпособРасчета,
		|	ЕСТЬNULL(СтрокиДокумента.ОкладТарифнаяСтавка, 0) КАК ОкладТарифнаяСтавка,
		|	СтрокиДокумента.ВалютаТарифнойСтавки	КАК ВалютаТарифнойСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриемНаРаботуВОрганизациюРаботники.НомерСтроки КАК НомерСтроки,
		|		ПриемНаРаботуВОрганизациюРаботники.ДатаПриема КАК ДатаПриема,
		|		ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL 
		|				ТОГДА ПриемНаРаботуВОрганизациюРаботники.ФизЛицо.Наименование
		|			ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
		|		КОНЕЦ КАК Работник,
		|		ПриемНаРаботуВОрганизациюРаботники.Сотрудник	КАК Сотрудник,
		|		ПриемНаРаботуВОрганизациюРаботники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ПриемНаРаботуВОрганизациюРаботники.Должность КАК Должность,
		|		ПриемНаРаботуВОрганизациюРаботники.ГрафикРаботы КАК ГрафикРаботы,
		|		Начисления.Показатель1 КАК ОкладТарифнаяСтавка,
		|		Начисления.Валюта1 КАК ВалютаТарифнойСтавки,
		|		Начисления.ВидРасчета
		|	ИЗ
		|		Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ПриемНаРаботуВОрганизациюРаботники.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|			ПО ПриемНаРаботуВОрганизациюРаботники.Ссылка = Начисления.Регистратор
		|				И ПриемНаРаботуВОрганизациюРаботники.Сотрудник = Начисления.Сотрудник
		|				И Начисления.ВидРасчета <> Начисления.ВидРасчетаИзмерение
		|	ГДЕ
		|		ПриемНаРаботуВОрганизациюРаботники.Ссылка = &ДокументСсылка) КАК СтрокиДокумента
		|ИТОГИ ПО
		|	Работник";
		

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати()

Функция СформироватьЗапросДоплаты(Сотрудник, Подразделение, Должность)
	
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
    Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);
	Запрос.УстановитьПараметр("Сотрудник",	 Сотрудник);
	Запрос.УстановитьПараметр("Подразделение",	 Подразделение);
	Запрос.УстановитьПараметр("Должность",	 Должность);
	СписокСпособов = Новый СписокЗначений;
    СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
	Запрос.УстановитьПараметр("СписокСпособов",	 СписокСпособов);
	

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Надбавки.ВидРасчета КАК ВидРасчета,
		|	Надбавки.Показатель1 КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки КАК ВидРасчета,
		|		НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель1 КАК Показатель1
		|	ИЗ
		|		РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СрезПоследних(&ДатаДокумента, ПодразделениеОрганизации = &Подразделение И Должность = &Должность) КАК НадбавкиПоШтатномуРасписаниюОрганизаций
		|   ГДЕ
		|       НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки.СпособРасчета В(&СписокСпособов)
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1
		|	ИЗ
		|		Документ.ПриемНаРаботуВОрганизацию.Начисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
		|   ГДЕ
		|       ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка =  &ДокументСсылка
		|       И ПриемНаРаботуВОрганизациюОсновныеНачисления.Сотрудник = &Сотрудник
		|       И ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.СпособРасчета В(&СписокСпособов)
		|	) КАК Надбавки";

	Возврат Запрос.Выполнить();
	
КонецФункции //СформироватьЗапросДоплаты	

Функция СформироватьЗапросНадбавки(Сотрудник, Подразделение, Должность)
	
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
    Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);
	Запрос.УстановитьПараметр("Сотрудник",	 Сотрудник);
	Запрос.УстановитьПараметр("Подразделение",	 Подразделение);
	Запрос.УстановитьПараметр("Должность",	 Должность);
	СписокСпособов = Новый СписокЗначений;
    СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы);
	Запрос.УстановитьПараметр("СписокСпособов",	 СписокСпособов);
	

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Надбавки.ВидРасчета КАК ВидРасчета,
		|	Надбавки.Показатель1 КАК Показатель1,
		|	Надбавки.Показатель2 КАК Показатель2
		|ИЗ
		|	(ВЫБРАТЬ
		|		НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки КАК ВидРасчета,
		|		НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель1 КАК Показатель1,
		|		НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель2 КАК Показатель2
		|	ИЗ
		|		РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СрезПоследних(&ДатаДокумента, ПодразделениеОрганизации = &Подразделение И Должность = &Должность) КАК НадбавкиПоШтатномуРасписаниюОрганизаций
		|   ГДЕ
		|       НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки.СпособРасчета В(&СписокСпособов)
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель2
		|	ИЗ
		|		Документ.ПриемНаРаботуВОрганизацию.Начисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
		|   ГДЕ
		|       ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка =  &ДокументСсылка
		|       И ПриемНаРаботуВОрганизациюОсновныеНачисления.Сотрудник = &Сотрудник
		|       И ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.СпособРасчета В(&СписокСпособов)
		|	) КАК Надбавки";

	Возврат Запрос.Выполнить();
	
КонецФункции //СформироватьЗапросНадбавки	

#Если Клиент Тогда
	
Функция ПечатьП109101995()
ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаРаботуВОрганизацию_П1_от_09_10_1995";
	
	// получаем данные для печати
	ВыборкаДляШапки = СформироватьЗапросДляПечати09101995("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати09101995("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	
	// запоминаем области макета
	Макет = ПолучитьМакет("П1_от_09_10_1995");
	Область = Макет.ПолучитьОбласть("Форма"); 
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		ВложеннаяВыборка = ВыборкаРаботники.Выбрать(); 
		ВложеннаяВыборка.Следующий();
		
		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// выводим данные из шапки
		Область.Параметры.Заполнить(ВыборкаДляШапки);
		
		Область.Параметры.НазваниеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		Область.Параметры.ЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
		
		// Данные по работнику.
		Область.Параметры.Заполнить(ВложеннаяВыборка);
		
		// Выводим оклад работника
		Область.Параметры.ОкладТарифнаяСтавка = "" + ВложеннаяВыборка.ОкладТарифнаяСтавка; 		
		
		Область.Параметры.ИспытательныйСрок = "Без строку випробування";
		Область.Параметры.ИспытательныйСрокОкончание = "";

		// В документе отсутствует поле "дата увольнения"
		Область.Параметры.ТипТрудовогоДоговора = "безстроковий";
		
		Область.Параметры.ТрудовойДоговор = "";

		Область.Параметры.ВидНадбавки = "";
		Область.Параметры.РазмерНадбавки = "";
		
		ТабДокумент.Вывести(Область);

		
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции // ПечатьП109101995()

Функция ПечатьП1()
ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаРаботуВОрганизацию_П1";
	
	// получаем данные для печати
	ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	
	РеглВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// запоминаем области макета
	Макет = ПолучитьМакет("П1_от_05_12_2008");
	Область = Макет.ПолучитьОбласть("Форма"); 
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		ВложеннаяВыборка = ВыборкаРаботники.Выбрать(); 
		ВложеннаяВыборка.Следующий();
		
		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// выводим данные из шапки
		Область.Параметры.Заполнить(ВыборкаДляШапки);
		
		Область.Параметры.НазваниеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		
		// Данные по работнику.
		Область.Параметры.Заполнить(ВложеннаяВыборка);
		
		// Выводим оклад работника
		Оклад = ВложеннаяВыборка.ОкладТарифнаяСтавка;
		Если  ЗначениеЗаполнено(ВложеннаяВыборка.ВалютаТарифнойСтавки) И ВложеннаяВыборка.ВалютаТарифнойСтавки <> РеглВалюта Тогда
			Структура = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВложеннаяВыборка.ВалютаТарифнойСтавки));
			Оклад = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Оклад,ВложеннаяВыборка.ВалютаТарифнойСтавки, РеглВалюта,
								Структура.Курс, 1, Структура.Кратность, 1);
		КонецЕсли;						
		Гривны = Цел(Оклад);
		Копейки = Цел((Оклад-Гривны)*100);
		Гривны = ОбщегоНазначения.РазложитьЧислоВСтроку(Гривны,6);
		Копейки = ОбщегоНазначения.РазложитьЧислоВСтроку(Копейки,2,Истина);
		Для Сч = 1 По 6 Цикл
			Область.Параметры["Гривны" + Сч] = Сред(Строка(Гривны), Сч, 1);
		КонецЦикла;
		Для Сч = 1 По 2 Цикл
			Область.Параметры["Копейки" + Сч] = Сред(Строка(Копейки), Сч, 1);
		КонецЦикла;
		
		Если ВложеннаяВыборка.ГрафикРаботы.ДлительностьРабочейНедели <> 0 Тогда
			Область.Параметры.ФлагДлительность = Истина;
			Область.Параметры.ДлительностьЧасы = Цел(ВложеннаяВыборка.ГрафикРаботы.ДлительностьРабочейНедели);
			Минуты = (ВложеннаяВыборка.ГрафикРаботы.ДлительностьРабочейНедели - Цел(ВложеннаяВыборка.ГрафикРаботы.ДлительностьРабочейНедели))*60;
			Область.Параметры.ДлительностьМинуты = Формат(Минуты,"ЧЦ=2; ЧН=00; ЧВН=");
		КонецЕсли;	
		
		ВыборкаДоплаты = СформироватьЗапросДоплаты(ВложеннаяВыборка.Сотрудник,ВложеннаяВыборка.ПодразделениеСотрудника,ВложеннаяВыборка.ДолжностьСотрудника).Выбрать();
		Если ВыборкаДоплаты.Следующий() Тогда
			Гривны = Цел(ВыборкаДоплаты.Сумма);
			Копейки = Цел((ВыборкаДоплаты.Сумма-Гривны)*100);
			
			Гривны = ОбщегоНазначения.РазложитьЧислоВСтроку(Гривны,5);
			Копейки = ОбщегоНазначения.РазложитьЧислоВСтроку(Копейки,2,Истина);
			
			Для Сч = 1 По 5 Цикл
				Область.Параметры["ДоплатаГривны" + Сч] = Сред(Строка(Гривны), Сч, 1);
			КонецЦикла;
			Для Сч = 1 По 2 Цикл
				Область.Параметры["ДоплатаКопейки" + Сч] = Сред(Строка(Копейки), Сч, 1);
			КонецЦикла;
		КонецЕсли;
		
		ВыборкаНадбавки = СформироватьЗапросНадбавки(ВложеннаяВыборка.Сотрудник,ВложеннаяВыборка.ПодразделениеСотрудника,ВложеннаяВыборка.ДолжностьСотрудника).Выбрать();
		СчНадбавок = 1;
		Пока ВыборкаНадбавки.Следующий() Цикл
			Если ВыборкаНадбавки.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
				Процент = Цел(ВыборкаНадбавки.Показатель1);
			Иначе
				Процент = Цел(ВыборкаНадбавки.Показатель2);
			КонецЕсли;	
			
			Процент = ОбщегоНазначения.РазложитьЧислоВСтроку(Процент,3);
			
			Для Сч = 1 По 3 Цикл
				Область.Параметры["Надбавка"+СчНадбавок+ Сч] = Сред(Строка(Процент), Сч, 1);
			КонецЦикла;
			
			Если ВыборкаНадбавки.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
				Область.Параметры["Надбавка"+СчНадбавок] = "вечірні години";
			ИначеЕсли ВыборкаНадбавки.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
				Область.Параметры["Надбавка"+СчНадбавок] = "нічні години";
			Иначе
				Вид = ВыборкаНадбавки.ВидРасчета.Наименование;
				Позиция = Найти(Вид," за"); 
				Если Позиция > 0 Тогда
					Вид = Сред(Вид,Позиция+4);
				КонецЕсли;	
				Область.Параметры["Надбавка"+СчНадбавок] = Вид;
			КонецЕсли;	
				
			
			СчНадбавок = СчНадбавок+1;
			Если СчНадбавок >4 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		ТабДокумент.Вывести(Область);

		
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции // ПечатьП109101995()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "П1_от_09_10_1995" Тогда
		ТабДокумент = ПечатьП109101995();
	ИначеЕсли ИмяМакета = "П1_от_05_12_2008" Тогда
		ТабДокумент = ПечатьП1();	
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Прием на работу в организацию "), Ссылка);	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("П1_от_05_12_2008","Форма П-1");
	СтруктураПечатныхФорм.Вставить("П1_от_09_10_1995","Форма П-1 (от 09.10.1995)");
	
	Возврат СтруктураПечатныхФорм;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботуВОрганизацию.ОтражатьВУпрУчете,
	|	ПриемНаРаботуВОрганизацию.ОтражатьВРеглУчете,
	|	ПриемНаРаботуВОрганизацию.Дата,
	|	ПриемНаРаботуВОрганизацию.Организация,
	|	ПриемНаРаботуВОрганизацию.Организация КАК ГоловнаяОрганизация,
	|	ПриемНаРаботуВОрганизацию.Ссылка
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
	|
	|ГДЕ
	|	ПриемНаРаботуВОрганизацию.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизаций(Режим)

	Запрос = Новый Запрос;

	//Определим список организаций - структурных подразделений
	//ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;

	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	Если НЕ ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
		СписокСтруктурныхПодразделений.Добавить(Организация);
	Иначе
		СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
		СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	КонецЕсли;                      
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений", СписокСтруктурныхПодразделений);

	// Описание текста запроса:

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизаций.Сотрудник,
	|	ТЧРаботникиОрганизаций.Сотрудник.ФизЛицо,
	|	ТЧРаботникиОрганизаций.Сотрудник.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ТЧРаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
	|	ТЧРаботникиОрганизаций.ДатаПриема,
	|	ТЧРаботникиОрганизаций.БазовыйПериодИндексацииЗарплаты,
	|	ТЧРаботникиОрганизаций.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизаций.Должность,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизаций.ПодразделениеОрганизации.Владелец <> &Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ТЧРаботникиОрганизаций.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизаций.ГрафикРаботы,
	|	ТЧРаботникиОрганизаций.СпособОтраженияВБухучете,
	|	ТЧРаботникиОрганизаций.УжеРаботаетУпр,
	|	ТЧРаботникиОрганизаций.СпособОтраженияВУпрУчете,
	|	ТЧРаботникиОрганизаций.ПодразделениеУпр,
	|	ТЧРаботникиОрганизаций.ДолжностьУпр,
	|	ТЧРаботникиОрганизаций.ЗанимаемыхСтавокУпр,
	|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаСотрудникРаботалВОрганизации
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧРаботникиОрганизаций2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизаций2
	|				ПО (ТЧРаботникиОрганизаций2.Ссылка = &ДокументСсылка)
	|					И ТЧРаботникиОрганизаций.Сотрудник = ТЧРаботникиОрганизаций2.Сотрудник
	|					И ТЧРаботникиОрганизаций.НомерСтроки > ТЧРаботникиОрганизаций2.НомерСтроки
	|		ГДЕ
	|			ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизаций.НомерСтроки) КАК ПересекающиесяСтроки
	|		ПО ТЧРаботникиОрганизаций.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ТЧРаботникиОрганизаций.Сотрудник = РаботникиОрганизаций.Сотрудник
	|		И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
	|ГДЕ
	|	ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизаций()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления()

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка",Ссылка);
	
	//ВТПоказатели
	Если Истина Тогда
		// получим временную таблицу с расчетом показателей
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
		|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
		|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
		|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
		|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
		|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
		|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
		|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
		|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
		|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
		|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
		|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
		|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
		|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
		|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
		|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
		|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
		|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
		|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
		|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
		|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
		|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный,
		|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
		|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
		|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
		|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.Начисления КАК ТЧОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели1.Ссылка
		|			И (Показатели1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели2.Ссылка
		|			И (Показатели2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели3.Ссылка
		|			И (Показатели3.НомерСтроки = 3)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели4.Ссылка
		|			И (Показатели4.НомерСтроки = 4)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели5.Ссылка
		|			И (Показатели5.НомерСтроки = 5)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели6.Ссылка
		|			И (Показатели6.НомерСтроки = 6)
		|ГДЕ
		|	ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧОсновныеНачисления.ВидРасчета,
		|	Показатели1.Показатель,
		|	Показатели2.Показатель,
		|	Показатели3.Показатель,
		|	Показатели4.Показатель,
		|	Показатели5.Показатель,
		|	Показатели6.Показатель,
		|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели1.Показатель.Предопределенный,
		|	Показатели1.Показатель.Наименование,
		|	Показатели1.Показатель.ТипПоказателя,
		|	Показатели1.Показатель.ВозможностьИзменения,
		|	Показатели2.Показатель.Предопределенный,
		|	Показатели2.Показатель.Наименование,
		|	Показатели2.Показатель.ТипПоказателя,
		|	Показатели2.Показатель.ВозможностьИзменения,
		|	Показатели3.Показатель.Предопределенный,
		|	Показатели3.Показатель.Наименование,
		|	Показатели3.Показатель.ТипПоказателя,
		|	Показатели3.Показатель.ВозможностьИзменения,
		|	Показатели4.Показатель.Предопределенный,
		|	Показатели4.Показатель.Наименование,
		|	Показатели4.Показатель.ТипПоказателя,
		|	Показатели4.Показатель.ВозможностьИзменения,
		|	Показатели5.Показатель.Предопределенный,
		|	Показатели5.Показатель.Наименование,
		|	Показатели5.Показатель.ТипПоказателя,
		|	Показатели5.Показатель.ВозможностьИзменения,
		|	Показатели6.Показатель.Предопределенный,
		|	Показатели6.Показатель.Наименование,
		|	Показатели6.Показатель.ТипПоказателя,
		|	Показатели6.Показатель.ВозможностьИзменения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета";		
		
		Запрос.Выполнить();	
		
		ВТПоказатели = "ВТПоказатели";
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Основное",Перечисления.ВидыНачисленийРаботникаОрганизации.Основное);

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)		КАК Действие,
	|	ТЧРаботникиОрганизации.ДатаПриема		КАК Период,
	|	ТЧНачисления.Ссылка.ОтражатьВУпрУчете	КАК ОтражатьВУпрУчете,
	|	ТЧНачисления.Ссылка.ОтражатьВРеглУчете	КАК ОтражатьВРеглУчете,
	|	ТЧНачисления.Ссылка						КАК Ссылка,
	|	ТЧНачисления.НомерСтроки				КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник					КАК Сотрудник,
	|	ТЧНачисления.Сотрудник.ФизЛицо			КАК ФизЛицо,
	|	ВЫБОР КОГДА ТЧНачисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Основное) ТОГДА NULL ИНАЧЕ ТЧНачисления.ВидРасчета КОНЕЦ	КАК ВидРасчетаИзмерение,
	|	ТЧНачисления.ВидРасчета					КАК ВидРасчета,
	|	ТЧНачисления.ВидРасчета.СпособРасчета	КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1				КАК Показатель1,
	|	ТЧНачисления.Валюта1					КАК Валюта1,
	|	ТЧНачисления.Показатель2				КАК Показатель2,
	|	ТЧНачисления.Валюта2					КАК Валюта2,
	|	ТЧНачисления.Показатель3				КАК Показатель3,
	|	ТЧНачисления.Валюта3					КАК Валюта3,
	|	ТЧНачисления.Показатель4				КАК Показатель4,
	|	ТЧНачисления.Валюта4					КАК Валюта4,
	|	ТЧНачисления.Показатель5				КАК Показатель5,
	|	ТЧНачисления.Валюта5					КАК Валюта5,
	|	ТЧНачисления.Показатель6				КАК Показатель6,
	|	ТЧНачисления.Валюта6					КАК Валюта6,
	|	ТЧНачисления.ВидНачисления				КАК ВидНачисления,
	|	ТЧРаботникиОрганизации.ДатаПриема		КАК ДатаПриема,
	|	ТЧНачисления2.ВсегоОсновных				КАК ВсегоОсновных,
	|	ТЧНачисления.СпособОтраженияВБухучете	КАК СпособОтраженияВБухучете,
	|	ТЧНачисления.СпособОтраженияВУпручете	КАК СпособОтраженияВУпручете,
	|	ЕСТЬNULL(Показатели.КоличествоПоказателей,0) КоличествоПоказателей,
	|	Показатели.Показатель1Предопределенный,
	|	Показатели.Показатель1Наименование,
	|	Показатели.Показатель1ТипПоказателя,
	|	Показатели.Показатель1ВозможностьИзменения,
	|	Показатели.Показатель2Предопределенный,
	|	Показатели.Показатель2Наименование,
	|	Показатели.Показатель2ТипПоказателя,
	|	Показатели.Показатель2ВозможностьИзменения,
	|	Показатели.Показатель3Предопределенный,
	|	Показатели.Показатель3Наименование,
	|	Показатели.Показатель3ТипПоказателя,
	|	Показатели.Показатель3ВозможностьИзменения,
	|	Показатели.Показатель4Предопределенный,
	|	Показатели.Показатель4Наименование,
	|	Показатели.Показатель4ТипПоказателя,
	|	Показатели.Показатель4ВозможностьИзменения,
	|	Показатели.Показатель5Предопределенный,
	|	Показатели.Показатель5Наименование,
	|	Показатели.Показатель5ТипПоказателя,
	|	Показатели.Показатель5ВозможностьИзменения,
	|	Показатели.Показатель6Предопределенный,
	|	Показатели.Показатель6Наименование,
	|	Показатели.Показатель6ТипПоказателя,
	|	Показатели.Показатель6ВозможностьИзменения,
	|	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях
	|ИЗ	Документ.ПриемНаРаботуВОрганизацию.Начисления КАК ТЧНачисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
	|ПО ТЧНачисления.ВидРасчета = Показатели.ВидРасчета
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ПО		ТЧРаботникиОрганизации.Сотрудник = ТЧНачисления.Сотрудник 
	|	И	ТЧРаботникиОрганизации.Ссылка = ТЧНачисления.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	| (ВЫБРАТЬ
	|    ТЧНачисления.Сотрудник,
	|    ТЧНачисления.ВидНачисления,
	|    Количество(ТЧНачисления.НомерСтроки) КАК ВсегоОсновных
	|  ИЗ Документ.ПриемНаРаботуВОрганизацию.Начисления КАК ТЧНачисления
	|  ГДЕ ТЧНачисления.ВидНачисления = &Основное
	|    И ТЧНачисления.Ссылка = &ДокументСсылка
	|  СГРУППИРОВАТЬ ПО ТЧНачисления.Сотрудник,ТЧНачисления.ВидНачисления
	|) КАК ТЧНачисления2
	|ПО		ТЧНачисления2.Сотрудник = ТЧНачисления.Сотрудник 
	|
	|ГДЕ	ТЧНачисления.Ссылка = &ДокументСсылка
	|";

	Запрос.Текст = ТекстЗапроса;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачисления()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоУдержания()

	Запрос = Новый Запрос;

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка.Организация			КАК Организация,
	|	ТЧ.Ссылка						КАК Ссылка,
	|	ТЧ.НомерСтроки					КАК НомерСтроки,
	|	ТЧ.Сотрудник					КАК Сотрудник,
	|	ТЧ.Сотрудник.ФизЛицо			КАК ФизЛицо,
	|	ТЧ.ВидРасчета,
	|	ТЧ.Показатель1,
	|	ТЧ.Показатель2,
	|	ТЧ.Показатель3,
	|	ТЧ.Показатель4,
	|	ТЧ.Показатель5,
	|	ТЧ.Показатель6,
	|	ТЧ.Валюта1,
	|	ТЧ.Валюта2,
	|	ТЧ.Валюта3,
	|	ТЧ.Валюта4,
	|	ТЧ.Валюта5,
	|	ТЧ.Валюта6,
	|	ТЧ.СпособОтраженияВБухучете,
	|	ТЧ.СпособОтраженияВУпручете,
	|	ТЧРаботникиОрганизации.ДатаПриема		КАК Период
	|
	|	ИЗ	Документ.ПриемНаРаботуВОрганизацию.Удержания КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ПО ТЧРаботникиОрганизации.Сотрудник = ТЧ.Сотрудник И ТЧРаботникиОрганизации.Ссылка = ТЧ.Ссылка
	|
	|ГДЕ  ТЧ.Ссылка = &ДокументСсылка
	|";

	Запрос.Текст = ТекстЗапроса;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачисления()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация, в которую принимается работник!", Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табл. части ""Работники организации"": ", СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	// ФизЛицо
	ЕстьСотрудник = ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если Не ЕстьСотрудник Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано физическое лицо!", Отказ);
	КонецЕсли;
	
	// График работы
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указан график работника!", Отказ);
	КонецЕсли;
	
	// ДатаПриема
	ЕстьДатаПриема = ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаПриема);
	Если Не ЕстьДатаПриема Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана дата приема на работу!", Отказ);
	Иначе
		#Если Клиент Тогда
			Если ВыборкаПоСтрокамДокумента.ДатаПриема > РабочаяДата Тогда
				Сообщить(СтрокаНачалаСообщенияОбОшибке + "дата приема на работу превышает рабочую дату!", СтатусСообщения.Важное);
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	Если ЕстьСотрудник и ЕстьДатаПриема Тогда

		// Физлицо указан дважды
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			СтрокаСообщениеОбОшибке = "работник не может быть указан в документе дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;
		
	КонецЕсли;	

	
	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда

		// Подразделение
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение (регл), в которое принимается работник!", Отказ);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "указано подразделение (регл), принадлежащее другой организации!", Отказ);
		КонецЕсли;
		
		// Способ отражения в бухучете
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не заполнен ""Способ отражения в бух.учете""!", Отказ);
		КонецЕсли;

		// Должность
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана должность (регл) работника!", Отказ);
		КонецЕсли;
		
		// Сотрудник раньше работал в организации
		Если ВыборкаПоСтрокамДокумента.ОшибкаСотрудникРаботалВОрганизации Тогда
			СтрокаСообщениеОбОшибке = "Работник уже работал в организации, для повторного приема на работу необходимо создать нового сотрудника!"; 
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;
		
		// Количество ставок
		Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = 0 Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок!", Отказ);
		КонецЕсли;
		
		//Конфликты
		Если ЕстьСотрудник и ЕстьДатаприема и (ВыборкаПоСтрокамДокумента.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы или ВыборкаПоСтрокамДокумента.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство) Тогда
			УжеРаботает = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаПриема, Новый Структура("Сотрудник, Организация",ВыборкаПоСтрокамДокумента.Сотрудник,ВыборкаПоШапкеДокумента.Организация));
			Для каждого Место из УжеРаботает Цикл
				Если Место.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы И Место.ЗанимаемыхСтавок > 0 Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "работник уже принят по основному месту работы!", Отказ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
	КонецЕсли;	

	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете и НЕ ВыборкаПоСтрокамДокумента.УжеРаботаетУпр Тогда
		// Подразделение
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеУпр) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение (упр), в которое принимается работник!", Отказ);
		КонецЕсли;

		// Должность
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДолжностьУпр) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана должность (упр) работника!", Отказ);
		КонецЕсли;
		
		// Количество ставок
		Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавокУпр = 0 Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок (упр)!", Отказ);
		КонецЕсли;
    		
		//Конфликты
		Если ЕстьСотрудник и ЕстьДатаприема и НЕ ВыборкаПоСтрокамДокумента.УжеРаботаетУпр Тогда
			УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаПриема, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.Сотрудник.ФизЛицо));
			Для каждого Место из УжеРаботает Цикл
				Если Место.ЗанимаемыхСтавок > 0 Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "работник уже принят на работу на предприятие!",Отказ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Способ отражения в упручете
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не заполнен ""Способ отражения в упр.учете""!", Отказ);
		КонецЕсли;
		
	КонецЕсли;	
	


КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = "ТЧ ""Начисления"" в строке """ + ВыборкаПоСтрокамДокумента.Номерстроки+""": ";

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано назначение сотрудника!", Отказ);
	КонецЕсли;
		
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ);
	КонецЕсли;
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидНачисления) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указан вид начисления!", Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	ИспользуютсяНачисленияВВалюте = Истина;
	ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
	
	Если ВыборкаПоСтрокамДокумента.ВидНачисления = Перечисления.ВидыНачисленийРаботникаОрганизации.Основное и
		ВыборкаПоСтрокамДокумента.ВсегоОсновных > 1 тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "у работника может быть только одно основное начисление!", Отказ);
	КонецЕсли;	 
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.ДатаПриема = NULL Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ);
	КонецЕсли;
	
КонецПроцедуры		

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиУдержания(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табл. части ""Удержания"": ", СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано назначение сотрудника!", Отказ);
	КонецЕсли;
		
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) и ВыборкаПоСтрокамДокумента.ВидРасчета <> "*" Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ);
	КонецЕсли;
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.Период = NULL Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ);
	КонецЕсли;
	
КонецПроцедуры		

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРаботникиОрганизаций(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизаций)
	
	// Движения на дату приёма
	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		
		//---------------------------------------------------
		// Движения по регистру "РаботникиОрганизаций"
		Движение = Движения.РаботникиОрганизаций.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоРаботникиОрганизаций);
		Движение.Период                     = ВыборкаПоРаботникиОрганизаций.ДатаПриема;
		Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу;
		
		//---------------------------------------------------
		// Движения по регистру "КоэффициентыПовышенияОкладов" - для правильного расчета индексации заработка
		Движение = Движения.КоэффициентыПовышенияОкладов.Добавить();
		Движение.Период			= ?( ВыборкаПоРаботникиОрганизаций.БазовыйПериодИндексацииЗарплаты < ВыборкаПоРаботникиОрганизаций.ДатаПриема, ВыборкаПоРаботникиОрганизаций.ДатаПриема, ВыборкаПоРаботникиОрганизаций.БазовыйПериодИндексацииЗарплаты);
		Движение.Сотрудник		= ВыборкаПоРаботникиОрганизаций.Сотрудник;
		Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.Коэффициент	= 1;
		
	КонецЕсли;	
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете И НЕ ВыборкаПоРаботникиОрганизаций.УжеРаботаетУпр Тогда
		
		// Движения на дату приёма
		//---------------------------------------------------
		// Движения по регистру "Работники"
		Движение = Движения.Работники.Добавить();
		// Свойства
		Движение.Период                     = ВыборкаПоРаботникиОрганизаций.ДатаПриема;
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизаций.Сотрудник.ФизЛицо;
		
		// Ресурсы
		Движение.ЗанимаемыхСтавок   		= ВыборкаПоРаботникиОрганизаций.ЗанимаемыхСтавокУпр;
		Движение.Подразделение				= ВыборкаПоРаботникиОрганизаций.ПодразделениеУпр;
		Движение.Должность   		    	= ВыборкаПоРаботникиОрганизаций.ДолжностьУпр;
		Движение.ГрафикРаботы   		    = ВыборкаПоРаботникиОрганизаций.ГрафикРаботы;
		Движение.СпособОтраженияВУпрУчете	= ВыборкаПоРаботникиОрганизаций.СпособОтраженияВУпрУчете;
		
		// Реквизиты
		Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу;
		
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоВзносыВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизаций)

	Если НЕ ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВыборкаПоРаботникиОрганизаций.Налог.Актуальность и ВыборкаПоРаботникиОрганизаций.ДатаДействия < ПроведениеРасчетов.ДатаВводаЕСВ() Тогда
	
		Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
		Движение.Период       = ВыборкаПоРаботникиОрганизаций.ДатаДействия;
		Движение.Регистратор  = ВыборкаПоШапкеДокумента.Ссылка;
		
		// Измерения
		Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник		= ВыборкаПоРаботникиОрганизаций.Сотрудник;
		Движение.Налог			= ВыборкаПоРаботникиОрганизаций.Налог;
		
		// Ресурсы
		Движение.Актуальность	= Истина;
		
		Если ПроведениеРасчетов.ИспользуетсяЕСВ() И НЕ ВыборкаПоРаботникиОрганизаций.Конфликт Тогда
			//Сразу прекратим
			Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
			// Свойства
			Движение.Период       = Дата(2010,12,31);
			Движение.Регистратор  = ВыборкаПоШапкеДокумента.Ссылка;
			
			// Измерения
			Движение.Организация  = ВыборкаПоШапкеДокумента.Организация;
 	        Движение.Сотрудник    = ВыборкаПоРаботникиОрганизаций.Сотрудник;
			Движение.Налог	      = ВыборкаПоРаботникиОрганизаций.Налог;
			
			// Ресурсы
			Движение.Актуальность	= Ложь;
		КонецЕсли;

	ИначеЕсли ВыборкаПоРаботникиОрганизаций.Налог.Актуальность Тогда
		//Это ЕСВ
		Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
		
		// Свойства
		Если ВыборкаПоРаботникиОрганизаций.ДатаДействия < ПроведениеРасчетов.ДатаВводаЕСВ() Тогда
			Движение.Период       = ПроведениеРасчетов.ДатаВводаЕСВ();
		Иначе
			Движение.Период       = ВыборкаПоРаботникиОрганизаций.ДатаДействия;
		КонецЕсли;	
		Движение.Регистратор  = ВыборкаПоШапкеДокумента.Ссылка;
		
		// Измерения
		Движение.Организация  = ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник      = ВыборкаПоРаботникиОрганизаций.Сотрудник;
		Движение.Налог		  = ВыборкаПоРаботникиОрганизаций.Налог;
		
		// Ресурсы
		Движение.Актуальность	= Истина;
		
	КонецЕсли;	
	


	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

Функция СформироватьЗапросПоВзносамСотрудники(Режим)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
    Запрос.УстановитьПараметр("ДатаПроверки", ПроведениеРасчетов.ДатаВводаЕСВ()-1);
	
    // Описание текста запроса:
	//
    // 1. Выборка "Начисления": 
	//		Объединяются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  

	ТекстЗапроса = "ВЫБРАТЬ Разрешенные
	               |	ТЧВзносы.НомерСтроки,
	               |	ТЧВзносы.Сотрудник,
	               |	ТЧВзносы.Налог,
				   |	ВЫБОР КОГДА ДвиженияЗакрытия.Период ЕСТЬ NULL 
				   |	 ТОГДА ЛОЖЬ
				   |	 ИНАЧЕ ИСТИНА
				   |	КОНЕЦ КАК Конфликт,
				   |	ТЧРаботники.ДатаПриема КАК ДатаДействия
	               |
	               |ИЗ	Документ.ПриемНаРаботуВОрганизацию.Взносы КАК ТЧВзносы
	               |	
	               |ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботники
	               |ПО		ТЧВзносы.Сотрудник = ТЧРаботники.Сотрудник
				   |   И	ТЧРаботники.Ссылка = &ДокументСсылка
				   |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ДвиженияЗакрытия
				   |   ПО ДвиженияЗакрытия.Период = &ДатаПроверки
				   |    И ДвиженияЗакрытия.Регистратор <> &ДокументСсылка 
				   |    И ДвиженияЗакрытия.Налог = ТЧВзносы.Налог
				   |    И ДвиженияЗакрытия.Сотрудник = ТЧВзносы.Сотрудник
				   |
	               |ГДЕ	ТЧВзносы.Ссылка = &ДокументСсылка
	               |	
	               |ОБЪЕДИНИТЬ	
	               |ВЫБРАТЬ	
	               |	ТЧВзносыФОТ.НомерСтроки,
	               |	ТЧВзносыФОТ.Сотрудник,
	               |	ТЧВзносыФОТ.Налог,
				   |	ВЫБОР КОГДА ДвиженияЗакрытия.Период ЕСТЬ NULL 
				   |	 ТОГДА ЛОЖЬ
				   |	 ИНАЧЕ ИСТИНА
				   |	КОНЕЦ КАК Конфликт,
				   |	ТЧРаботники.ДатаПриема КАК ДатаДействия
	               |ИЗ Документ.ПриемНаРаботуВОрганизацию.ВзносыФОТ КАК ТЧВзносыФОТ
	               |	
	               |ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботники
	               |ПО		ТЧВзносыФОТ.Сотрудник = ТЧРаботники.Сотрудник
  			       |   И	ТЧРаботники.Ссылка = &ДокументСсылка
				   |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ДвиженияЗакрытия
				   |   ПО ДвиженияЗакрытия.Период = &ДатаПроверки
				   |    И ДвиженияЗакрытия.Регистратор <> &ДокументСсылка 
				   |    И ДвиженияЗакрытия.Налог = ТЧВзносыФОТ.Налог
				   |    И ДвиженияЗакрытия.Сотрудник = ТЧВзносыФОТ.Сотрудник
				   |
	               |ГДЕ	ТЧВзносыФОТ.Ссылка = &ДокументСсылка
 	               |";
			   
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции

Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса)
	// плановые начисления
	//Если ВыборкаСтрокЗапроса.ВидРасчета = "*"
	//	И ВыборкаСтрокЗапроса.СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка() Тогда
	//	Возврат;		
	//КонецЕсли;   
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаСтрокЗапроса);
	Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.Актуальность	= Истина; 
		     
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса)
	
	// плановые удержания
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаСтрокЗапроса);
	Движение.Актуальность = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			// получим соответствие для проверок
			СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту("Начисления");

			// выполним выборку по табличной части документа
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизаций(Режим);
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать();

			// обходим строки документа
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 
				
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента , Отказ);
				Если НЕ Отказ Тогда
					ДобавитьСтрокуВДвиженияПоРаботникиОрганизаций(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				КонецЕсли; 
				
			КонецЦикла;
			
			// выполним выборку по табличной части основных начислений
			ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления().Выбрать();
 			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ);
				Если не Отказ Тогда
					ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				КонецЕсли;
			КонецЦикла;
			
			
			// выполним выборку по табличной части удержаний
			ВыборкаПоСтрокамДокумента = СформироватьЗапросПоУдержания().Выбрать();
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				ПроверитьЗаполнениеСтрокиУдержания(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ);
				Если не Отказ Тогда
					ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				КонецЕсли;
			КонецЦикла;
			
			// выполним выборку по табличной части взносов
			// получим реквизиты табличной части для взносов и взносов на ФОТ
			
			РезультатЗапросаПоВзносам = СформироватьЗапросПоВзносамСотрудники(Режим);
			ВыборкаПоВзносам = РезультатЗапросаПоВзносам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоВзносам.Следующий() Цикл 
				
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоВзносыВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоВзносам);
				
			КонецЦикла;
			
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Основание.ОбособленноеПодразделение.Пустая() Тогда
			Организация = Основание.ОбособленноеПодразделение;
		Иначе
			Организация = Основание.Организация;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",	Основание);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизаций.Организация
		|		ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|	КОНЕЦ КАК Организация,
		|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
		|	СотрудникиОрганизаций.Физлицо КАК Физлицо,
		|	СотрудникиОрганизаций.Должность,
		|	СотрудникиОрганизаций.ПодразделениеОрганизации,
		|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|	СотрудникиОрганизаций.ДатаНачала КАК ДатаПриема,
		|	СотрудникиОрганизаций.ДатаОкончания КАК ДатаУвольнения,
		|	СотрудникиОрганизаций.ИспытательныйСрок,
		|	СотрудникиОрганизаций.ГрафикРаботы,
		|	СотрудникиОрганизаций.ВидРасчета КАК ВидРасчета,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Основное) КАК ВидНачисления,
		|	СотрудникиОрганизаций.ТарифнаяСтавка КАК Показатель1,
		|	NULL КАК Показатель2,
		|	NULL КАК Показатель3,
		|	NULL КАК Показатель4,
		|	СотрудникиОрганизаций.ВалютаТарифнойСтавки КАК Валюта1,
		|	NULL КАК Валюта2,
		|	NULL КАК Валюта3,
		|	NULL КАК Валюта4
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизаций.Организация
		|		ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|	КОНЕЦ,
		|	СотрудникиОрганизаций.Ссылка,
		|	СотрудникиОрганизаций.Физлицо,
		|	СотрудникиОрганизаций.Должность,
		|	СотрудникиОрганизаций.ПодразделениеОрганизации,
		|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|	СотрудникиОрганизаций.ДатаНачала,
		|	СотрудникиОрганизаций.ДатаОкончания,
		|	СотрудникиОрганизаций.ИспытательныйСрок,
		|	СотрудникиОрганизаций.ГрафикРаботы,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ

		|	СотрудникиОрганизаций.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Организация
		|		ИНАЧЕ СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение
		|	КОНЕЦ,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Должность,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ПодразделениеОрганизации,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ЗанимаемыхСтавок,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаНачала,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаОкончания,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ИспытательныйСрок,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ГрафикРаботы,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Индивидуальное) КАК ВидНачисления,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта4
		|ИЗ
		|	Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
		|ГДЕ
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка = &Ссылка
		|	И СотрудникиОрганизацийПерсональныеНадбавки.Надбавка <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ВидРасчета";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Организация");
			СтрокаРаботник = РаботникиОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРаботник, Выборка);
			
			Если НЕ ЗначениеЗаполнено(СтрокаРаботник.ЗанимаемыхСтавок) Тогда
				СтрокаРаботник.ЗанимаемыхСтавок  = 1;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаРаботник.ГрафикРаботы) Тогда
				СтрокаРаботник.ГрафикРаботы = ПроцедурыУправленияПерсоналом.ПолучитьГрафикРаботы(Ответственный);
			КонецЕсли;

			
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.ВидРасчета) Тогда
					ЗаполнитьЗначенияСвойств(Начисления.Добавить(), Выборка);
				КонецЕсли;	
			КонецЦикла;
			
			Если НЕ ПроведениеРасчетов.ИспользуетсяЕСВ() Тогда
				Строка = Взносы.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.Безработица;
				
				Строка = Взносы.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.Пенсионный;
				
				Строка = Взносы.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.Соцстрах;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.БезработицаФОТ;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.ПенсионныйФОТ;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник  	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.СоцстрахФОТ;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник  	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.СоцстрахНесчФОТ;
			Иначе
				Строка = Взносы.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.ЕСВРаботники;
				
				Строка = Взносы.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.ЕСВБольничные;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.ЕСВФОТРаботники;
				
				Строка = ВзносыФОТ.Добавить();
				Строка.Сотрудник	= Выборка.Сотрудник;
				Строка.Налог		= Справочники.Налоги.ЕСВФОТБольничные;

			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мДлинаСуток = 86400;
