Функция ПолучитьГородаПоВхождениюНачал(Текст) Экспорт 

    // Удаляем пробелы в начале и конце текста
    Текст = СокрЛП(Текст);

    // Подготовка текста для поиска
    ТекстПоискаНачало = Текст + "%"; // Строки, начинающиеся с текста
    ТекстПоискаВхождение = "%" + Текст + "%"; // Строки, где текст встречается в любом месте

    // Формируем запрос для поиска городов
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 49
        |   ЛМ_Города.Ссылка КАК Ссылка,
        |   ЛМ_Города.Наименование КАК Наименование,
        |   ЕСТЬNULL(ЛМ_Города.НаименованиеРусское ПОДОБНО &ТекстПоискаНачало, ЛОЖЬ) КАК ПриоритетРусское,
        |   ЕСТЬNULL(ЛМ_Города.Наименование ПОДОБНО &ТекстПоискаНачало, ЛОЖЬ) КАК ПриоритетНаименование
        |ИЗ
        |   Справочник.ЛМ_Города КАК ЛМ_Города
        |ГДЕ
        |   ЛМ_Города.НаименованиеРусское ПОДОБНО &ТекстПоискаВхождение
        |   ИЛИ ЛМ_Города.Наименование ПОДОБНО &ТекстПоискаВхождение
        |УПОРЯДОЧИТЬ ПО
        |   ПриоритетРусское УБЫВ,
        |   ПриоритетНаименование УБЫВ,
        |   ЛМ_Города.Наименование";

    // Передаем текст поиска в параметры
    Запрос.УстановитьПараметр("ТекстПоискаНачало", ТекстПоискаНачало);
    Запрос.УстановитьПараметр("ТекстПоискаВхождение", ТекстПоискаВхождение);

    // Выполняем запрос
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции


Функция ПолучитьГород(Название) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |	ЛМ_Города.Ссылка КАК Ссылка
                   |ИЗ
                   |	Справочник.ЛМ_Города КАК ЛМ_Города
                   |ГДЕ
                   |	(ЛМ_Города.НаименованиеРусское = &Наименование
                   |			ИЛИ ЛМ_Города.Наименование = &Наименование)";

    // Передаем текст поиска в параметры
    Запрос.УстановитьПараметр("НаименованиеРусское", Название);
	Запрос.УстановитьПараметр("Наименование", Название);
	
	Результат = Запрос.Выполнить().Выбрать();

    Если Результат.Следующий() Тогда
        Возврат Результат.Ссылка;
	КонецЕсли;
	
    Возврат Неопределено;

КонецФункции
