// #Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ

Функция ВесаЗначимыхСобытий(РегистрируемоеСобытие = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мвРегистрируемыеСобытия.Ссылка,
		|	мвРегистрируемыеСобытия.Вес
		|ИЗ
		|	Справочник.МИКО_мвРегистрируемыеСобытия КАК мвРегистрируемыеСобытия
		|ГДЕ
		|	мвРегистрируемыеСобытия.ПометкаУдаления = ЛОЖЬ
		|	И (мвРегистрируемыеСобытия.Ссылка = &РегистрируемоеСобытие
		|		ИЛИ &РегистрируемоеСобытие = НЕОПРЕДЕЛЕНО)";
		
	Запрос.УстановитьПараметр("РегистрируемоеСобытие", РегистрируемоеСобытие);
	РезультатЗапроса = Запрос.Выполнить();
	ОбходЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ОбходЗапроса.Следующий() Цикл
		Результат.Вставить(ОбходЗапроса.Ссылка, ОбходЗапроса.Вес);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВесаЗначимыхСобытий()

Функция ТипыРегистрируемыхОбъектов() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА мвРегистрируемыеСобытия.Ссылка = ЗНАЧЕНИЕ(Справочник.МИКО_мвРегистрируемыеСобытия.ВходящийЗвонок)
		|			ТОГДА ""МИКО_стЗаписьИсторииЗвонков""
		|		КОГДА мвРегистрируемыеСобытия.Ссылка = ЗНАЧЕНИЕ(Справочник.МИКО_мвРегистрируемыеСобытия.ИсходящийЗвонок)
		|			ТОГДА ""МИКО_стЗаписьИсторииЗвонков""
		|		ИНАЧЕ мвРегистрируемыеСобытия.ВидОбъекта
		|	КОНЕЦ КАК ВидОбъекта,
		|	мвРегистрируемыеСобытия.ВидСобытия
		|ИЗ
		|	Справочник.МИКО_мвРегистрируемыеСобытия КАК мвРегистрируемыеСобытия
		|ГДЕ
		|	мвРегистрируемыеСобытия.ПометкаУдаления = ЛОЖЬ";
		
	РезультатЗапроса = Запрос.Выполнить();
	ОбходЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ОбходЗапроса.Следующий() Цикл
		
		Если ОбходЗапроса.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Справочник Тогда
			Результат.Добавить(Тип("СправочникОбъект." + ОбходЗапроса.ВидОбъекта));
		Иначе
			Результат.Добавить(Тип("ДокументОбъект." + ОбходЗапроса.ВидОбъекта));
			Результат.Добавить(Тип("ДокументСсылка." + ОбходЗапроса.ВидОбъекта));
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВесаЗначимыхСобытий()

Функция ПараметрыОтбораСобытий(ВидОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мвРегистрируемыеСобытия.Ссылка,
		|	мвРегистрируемыеСобытия.ПараметрыОтбора
		|ИЗ
		|	Справочник.МИКО_мвРегистрируемыеСобытия КАК мвРегистрируемыеСобытия
		|ГДЕ
		|	мвРегистрируемыеСобытия.ПометкаУдаления = ЛОЖЬ
		|	И мвРегистрируемыеСобытия.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.МИКО_мвВидыЗначимыхСобытий.Документ)
		|	И мвРегистрируемыеСобытия.ВидОбъекта = &ВидОбъекта";
		
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // ПараметрыОтбораСобытий()

Функция СоответствиеРеквизитов(РегистрируемоеСобытие) Экспорт
	
	Результат = Новый Соответствие;
	
	Если РегистрируемоеСобытие = Справочники.МИКО_мвРегистрируемыеСобытия.ВходящийЗвонок
	 Или РегистрируемоеСобытие.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок Тогда
	 
	 	Результат.Вставить("Дата",           "Дата");
		Результат.Вставить("Клиент",         "ВЫБОР КОГДА Src_Владелец_Ссылка = Неопределено ТОГДА Src_Ссылка ИНАЧЕ Src_Владелец_Ссылка КОНЕЦ");
		//Результат.Вставить("Клиент",         "Src_Владелец_Ссылка");
		Результат.Вставить("КонтактноеЛицо", "Src_Ссылка");
		Результат.Вставить("НомерТелефона",  "Src");
		Результат.Вставить("Сотрудник",      "ДетализацияCEL.Dst_Ссылка");
		Результат.Вставить("Вовлеченность",  "ДетализацияCEL.Длительность");
		
	ИначеЕсли РегистрируемоеСобытие = Справочники.МИКО_мвРегистрируемыеСобытия.ИсходящийЗвонок
		  Или РегистрируемоеСобытие.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок Тогда
		  
		Результат.Вставить("Дата",           "Дата");
		Результат.Вставить("Клиент",         "ВЫБОР КОГДА Dst_Владелец_Ссылка = Неопределено ТОГДА Dst_Ссылка ИНАЧЕ Dst_Владелец_Ссылка КОНЕЦ");
		//Результат.Вставить("Клиент",         "Dst_Владелец_Ссылка");
		Результат.Вставить("КонтактноеЛицо", "Dst_Ссылка");
		Результат.Вставить("НомерТелефона",  "Dst");
		Результат.Вставить("Сотрудник",      "ДетализацияCEL.Src_Ссылка");
		Результат.Вставить("Вовлеченность",  "ДетализацияCEL.Длительность");
		
	Иначе
	 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СоответствиеРеквизитов.НаименованиеПоля,
			|	СоответствиеРеквизитов.НаименованиеПоляОбъекта
			|ИЗ
			|	Справочник.МИКО_мвРегистрируемыеСобытия.СоответствиеРеквизитов КАК СоответствиеРеквизитов
			|ГДЕ
			|	СоответствиеРеквизитов.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И СоответствиеРеквизитов.Ссылка.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.МИКО_мвВидыЗначимыхСобытий.Документ)
			|	И СоответствиеРеквизитов.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", РегистрируемоеСобытие);
		
		РезультатЗапроса = Запрос.Выполнить();
		ОбходЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ОбходЗапроса.Следующий() Цикл
			Результат.Вставить(ОбходЗапроса.НаименованиеПоля, ОбходЗапроса.НаименованиеПоляОбъекта);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СоответствиеРеквизитов()

// Возвращает список полей важных для расчета таблицы маршрутизации.
//
Функция АнализируемыеПоля() Экспорт
	
	АнализируемыеПоля = Новый Соответствие;
	АнализируемыеПоля.Вставить("Дата",           Новый ОписаниеТипов("Дата"));
	АнализируемыеПоля.Вставить("НомерТелефона",  Новый ОписаниеТипов("Строка"));
	
	СправочныеТипы = Новый Структура;
	СправочныеТипы.Вставить("Клиент",         "Партнеры,Контрагенты");
	СправочныеТипы.Вставить("КонтактноеЛицо", "КонтактныеЛица,КонтактныеЛицаПартнеров,КонтактныеЛицаКонтрагентов");
	СправочныеТипы.Вставить("Сотрудник",      "Пользователи,ФизическиеЛица");
	
	Для Каждого Элемент Из СправочныеТипы Цикл
		
		ИменаСправочников = Элемент.Значение;
		СписокСправочников = МИКО_стОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ИменаСправочников, ",");
		
		МассивТипов = Новый Массив;
		
		Для Каждого ИмяСправочника Из СписокСправочников Цикл
			
			Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
				МассивТипов.Добавить(Тип("СправочникСсылка." + ИмяСправочника));
			КонецЕсли;
			
		КонецЦикла;
		
		АнализируемыеПоля.Вставить(Элемент.Ключ, Новый ОписаниеТипов(МассивТипов));
		
	КонецЦикла;
	
	Возврат АнализируемыеПоля;
	
КонецФункции

// #КонецОбласти
