функция ЗадачаВыполнена() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	FTPСервер = Константы.ФТПСервер.Получить();
	FTPПорт = Константы.ФТППорт.Получить();
	FTPЛогин = Константы.ФТПЛогин.Получить();
	FTPПароль = Константы.ФТППароль.Получить();

	FTPСоединение = Новый FTPСоединение(FTPСервер, , FTPЛогин, FTPПароль, , Истина, 20);

	Попытка
	   	FTPСоединение.Переместить("/cvetkovtm.com/www/assets/shop/sync/Etsy.xlsx", "/cvetkovtm.com/www/assets/shop/sync/EtsyLast.xlsx");
	Исключение
			
	КонецПопытки;

	
КонецФункции