Процедура ВыполнитьВыгрузкуExcel() Экспорт
	
ПутьКФайлу = ПолучитьИмяВременногоФайла("xlsx");
УстановитьПривилегированныйРежим(Истина);
FTPСервер = Константы.ФТПСервер.Получить();
FTPПорт = Константы.ФТППорт.Получить();
FTPЛогин = Константы.ФТПЛогин.Получить();
FTPПароль = Константы.ФТППароль.Получить();
FTPСоединение = Новый FTPСоединение(FTPСервер, , FTPЛогин, FTPПароль, , Истина, 20);

Если FTPСоединение = Неопределено Тогда
	Возврат;
КонецЕсли;

FTPСоединение.УстановитьТекущийКаталог("/cvetkovtm.com/www/assets/shop/sync");
ПутьКФайлуСравнения = ПолучитьИмяВременногоФайла("xlsx");

Попытка
	FTPСоединение.Получить("EtsyLast.xlsx", ПутьКФайлуСравнения);
	ТабДокСравнения = Новый ТабличныйДокумент;
	ТабДокСравнения.Прочитать(ПутьКФайлуСравнения);
Исключение
	// Если файл не найден на FTP, будет сгенерировано исключение
	// В этом случае просто создаем новый пустой файл для сравнения
	ТабДокСравнения = Новый ТабличныйДокумент;
	ТабДокСравнения.Записать(ПутьКФайлуСравнения);
КонецПопытки;

ТипЦены = Константы.ТипЦенНашСайт.Получить();
ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокНашСайт.Получить();
//ГруппаСклада = Константы.СкладНашСайтРозница.Получить();
ВариантВыгрузки = Константы.ВариантВыгрузкиКаста.Получить();
ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(,,,"Etsy");
Остатки = ОстаткиКВыгрузке.Остатки;
Комплектующие = ОстаткиКВыгрузке.Комплектующие;
ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияНашСайт", ПроверятьРазбитиеРостовок, ВариантВыгрузки,, Истина);
ТабДок = Новый ТабличныйДокумент;
ТабДок.Очистить();
// Заголовки столбцов
ТабДок.Область(1, 1).Текст = "Ид";
ТабДок.Область(1, 2).Текст = "РознНаличие";
ТабДок.Область(1, 3).Текст = "Цена"; // Добавлен столбец Цена
ТабДок.Область(1, 4).Текст = "Номенклатура";
ТабДок.Область(1, 5).Текст = "Характеристика";
ТаблицаИдТоваров = Новый Соответствие;

Для НомерСтроки = 2 По ТабДокСравнения.ВысотаТаблицы Цикл
	Ид = ТабДокСравнения.Область(НомерСтроки, 1).Текст;
	РознНаличие = ТабДокСравнения.Область(НомерСтроки, 2).Текст;
	ТаблицаИдТоваров.Вставить(Ид, ?(РознНаличие = "", "0", РознНаличие));
КонецЦикла;

НомерСтроки = 2;
НужноЗаписатьФайл = Ложь;

Для Каждого Стр Из ТаблицаХарактеристик Цикл
	СпрГруппыЦветов = Стр.ГруппаЦвета;
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда 
		 ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов);
	    Если ТабФото.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
	КонецЕсли;	    
		
	РознНаличиеСравнения = ТаблицаИдТоваров.Получить(Стр.ИД);
	    
	Если РознНаличиеСравнения = Неопределено Тогда
	    // Новый товар - зеленый цвет
	    ТабДок.Область(НомерСтроки, 1, НомерСтроки, 2).ЦветФона = WebЦвета.Зеленый;
		НужноЗаписатьФайл = Истина;
	ИначеЕсли РознНаличиеСравнения <> Строка(Стр.Остаток) Тогда
	    // Изменилось РознНаличие - желтый цвет
	    ТабДок.Область(НомерСтроки, 2).ЦветФона = WebЦвета.Желтый;
		НужноЗаписатьФайл = Истина;
	Иначе
	    ТабДок.Область(НомерСтроки, 2).ЦветФона = WebЦвета.Белый;
	КонецЕсли;

	ТабДок.Область(НомерСтроки, 1).Текст = Стр.ИД;
	ТабДок.Область(НомерСтроки, 2).Текст = Стр.Остаток;
	ТабДок.Область(НомерСтроки, 3).Текст = Окр(Стр.Цена /40 + 7, 0); // Добавлена колонка с ценой
	ТабДок.Область(НомерСтроки, 4).Текст = Стр.Номенклатура;
	ТабДок.Область(НомерСтроки, 5).Текст = Стр.Характеристика;

	НомерСтроки = НомерСтроки + 1;
КонецЦикла;

Для Каждого КлючЗначение Из ТаблицаИдТоваров Цикл
	Ид = КлючЗначение.Ключ;
	РознНаличие = КлючЗначение.Значение;
	Если ТаблицаХарактеристик.Найти(Ид, "ИД") = Неопределено Тогда
	    // Товар отсутствует в ТаблицаХарактеристик - красный цвет
	    ТабДок.Область(НомерСтроки, 1).Текст = Ид;
	    ТабДок.Область(НомерСтроки, 2).Текст = РознНаличие;
	    ТабДок.Область(НомерСтроки, 1, НомерСтроки, 2).ЦветФона = WebЦвета.Красный;
	    НомерСтроки = НомерСтроки + 1;
	КонецЕсли;
КонецЦикла;

ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
УдалитьФайлы(ПутьКФайлуСравнения);

Если НужноЗаписатьФайл Тогда
	FTPСоединение.Записать(ПутьКФайлу, "Etsy.xlsx");
	Задачи.ЗадачиПользователя.Создать("Etsy-Обновить","Etsy-Обновить");
КонецЕсли;

УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры