Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;
Перем мТекущаяСхемаНалогообложения;

Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;
Перем мИспользоватьОборотнуюНоменклатуру Экспорт;
Перем мРазделятьПоСтавкамНДС Экспорт;
Перем ПартионныйУчетБУ;
Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;

Перем мУказаниеСкладовВТЧ Экспорт;
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мОтражатьВРегламентированномУчете Экспорт;
Перем мСтароеЗначениеСклада Экспорт;

Перем ЕстьБезналичныеРасчеты;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОтчетаОПродажахККМ()

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Артикул";
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Код";
		ТекстКодАртикул = "Код";
	Иначе
		ВыводитьКоды    = Ложь;
		Колонка         = "";
		ТекстКодАртикул = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
    Запрос.УстановитьПараметр("ВалютаДокумента", мВалютаРегламентированногоУчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|	Организация						   КАК Поставщик,	
	|	КассаККМ.Представление	 		   КАК КассаККМ,
	|	Склад.Представление         	   КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе 	   КАК Инвентаризация,
	|   Ответственный.ФизЛицо.Наименование КАК Отпустил,
	|	СуммаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС,
	|	&ВалютаДокумента КАК ВалютаДокумента,
	|	Товары.(
	|		НомерСтроки,
	|		Склад,			
	|		Номенклатура,
	|		ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|		Номенклатура.Код     КАК Код,
	|		Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|		Количество,
	|		ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|		Цена,
	|		Сумма,
	|		СуммаНДС,
	|		ПроцентСкидкиНаценки КАК Скидка,
	|		ПроцентАвтоматическихСкидок КАК АвтоматическаяСкидка,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	)
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки
	|";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ЗапросТовары = Шапка.Товары.Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетОРозничныхПродажах_ОтчетККМ";

	Макет = ПолучитьМакет("ОтчетККМ");
  	// печать производится на языке, указанном в настройках пользователя
#Если НЕ Cервер Тогда
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
#Иначе
	КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
#КонецЕсли
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Выводим шапку нкладной
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);

	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Отчет ЭККА';uk='Звіт ЕККА'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим информацию об Организации
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим реквизиты документа
	СписокДополнительныхПараметров = "КассаККМ,Склад,Инвентаризация";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;		
	
	//Печать табличной части
	ЕстьСкидки = ЗапросТовары.Итог("Скидка") + ЗапросТовары.Итог("АвтоматическаяСкидка") <> 0;

	Если ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	Если ЕстьСкидки Тогда
		ОбластьШапки  = ОбластьШапки  + "Скидка";
		ОбластьСтроки = ОбластьСтроки + "Скидка";
	КонецЕсли; 
	
	// Вывести табличную часть (товары и услуги)
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = Колонка;
	КонецЕсли;
	
	Суффикс = "";
	Если Шапка.УчитыватьНДС Тогда
		Если Шапка.СуммаВключаетНДС Тогда
			Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
		Иначе	
			Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
		КонецЕсли;
		Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
	КонецЕсли;
	ОбластьМакета.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
	ОбластьМакета.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	
	Сумма    = 0;
	СуммаНДС = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;
	
	Для каждого ВыборкаСтрокТовары из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);

		// Скидка может быть NULL
		ПроцентСкидки = ?(НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Скидка),0,ВыборкаСтрокТовары.Скидка) 
		              + ?(НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.АвтоматическаяСкидка),0,ВыборкаСтрокТовары.АвтоматическаяСкидка);

		Скидка = ВыборкаСтрокТовары.Сумма  / (100 - ПроцентСкидки)* ПроцентСкидки;

		Если ЕстьСкидки Тогда
			ОбластьМакета.Параметры.Скидка         = Скидка;
			ОбластьМакета.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Сумма    = Сумма    + ВыборкаСтрокТовары.Сумма;
		СуммаНДС = СуммаНДС + ВыборкаСтрокТовары.СуммаНДС;
		ВсегоСкидок    = ВсегоСкидок + Скидка;
		ВсегоБезСкидок = Сумма + ВсегоСкидок;

	КонецЦикла;

	ОбластьИтого = "Итого";
	Если ЕстьСкидки Тогда
		ОбластьИтого  = ОбластьИтого + "Скидка";
	КонецЕсли; 
	
	// Вывести Итого
	ОбластьМакета                 = Макет.ПолучитьОбласть(ОбластьИтого);
	ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);
	Если ЕстьСкидки Тогда
		ОбластьМакета.Параметры.ВсегоБезСкидок	= ОбщегоНазначения.ФорматСумм(ВсегоБезСкидок);
		ОбластьМакета.Параметры.ВсегоСкидок		= ОбщегоНазначения.ФорматСумм(ВсегоСкидок);
	КонецЕсли; 
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести ИтогоНДС
	Если Шапка.УчитыватьНДС Тогда
		// НДС
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаНДС,,"''");
		ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
		ТабДокумент.Вывести(ОбластьМакета);

		// всего с НДС (если сумма не включает НДС)
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(Сумма + СуммаНДС);
			ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Усього з ПДВ:'",КодЯзыкаПечать);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЕсли;
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ЗапросТовары.Количество() + "," +
											 НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента) + ".";
											 
	ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
	 										 + ?(НЕ Шапка.УчитыватьНДС, "", Символы.ПС + НСтр("ru='В т.ч. НДС: ';uk='У т.ч. ПДВ: '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаНДС, Шапка.ВалютаДокумента, КодЯзыкаПечать));
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьОтчетаОПродажахККМ()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяМакета = "ОтчетККМ" Тогда
		// Получить экземпляр документа на печать
		ТабДокумент = ПечатьОтчетаОПродажахККМ();
	ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
		ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");
	ИначеЕсли ИмяМакета = "РасходСРозничныхСкладовВЦенахАТТ" Тогда
		ТабДокумент = ЗаполнениеДокументов.НапечататьПриходРасходСРозничныхСкладовВЦенахАТТ(Ссылка, мВалютаРегламентированногоУчета, Ложь);
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ОтчетККМ", "Отчет о продажах");
	СтруктураМакетов.Вставить("СерийныеНомера",      "Список серийных номеров");
	СтруктураМакетов.Вставить("РасходСРозничныхСкладовВЦенахАТТ" , "Расход с розничных складов в ценах АТТ");

	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура выполняет заполнение табличной части проданными ТМЦ по инвентаризации товаров (розница).
//
// Параметры:
//  ДокументОснование - ссылка на документ основание (инвентаризация Товаров (розница)).
//
Процедура ЗаполнитьТоварыПоИнвентаризацииТоваров(ДокументОснование) Экспорт

	УчитыватьНДС     = Истина;
	СуммаВключаетНДС = Истина;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДокументСсылка"         , Ссылка);
	Запрос.УстановитьПараметр("ДокументОснованиеСсылка", ДокументОснование);
	Запрос.УстановитьПараметр("ТоварНовый"             , Справочники.Качество.Новый);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура,
	|	Док.ЕдиницаИзмерения,
	|	Док.Ссылка.Склад                              КАК Склад,
	|	Док.Ссылка.Склад.ВидСклада                    КАК ВидСклада,
	|	МАКСИМУМ(Док.КоличествоУчет - Док.Количество) КАК КоличествоОтклонение,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			СУММА(ВложенныйЗапрос.Количество)
	|	КОНЕЦ КАК КоличествоСписанное,
	|	Док.ЦенаВРознице КАК Цена,
	|	Док.ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры,
	|	Док.Качество
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК Док
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ 
	|       ДокСписание.Номенклатура,
	|       ДокСписание.ХарактеристикаНоменклатуры,
	|       ДокСписание.СерияНоменклатуры,
	|       ДокСписание.Качество,
	|       ДокСписание.Ссылка.Склад                         КАК Склад,
	|		ДокСписание.Количество                           КАК Количество,
	|       ДокСписание.Цена
	|	 ИЗ
	|       Документ.СписаниеТоваров.Товары КАК ДокСписание
	|    ГДЕ
	|       ДокСписание.Ссылка.Проведен
	|       И ДокСписание.Ссылка.ИнвентаризацияТоваровНаСкладе = &ДокументОснованиеСсылка
	|
	|    ОБЪЕДИНИТЬ ВСЕ
	|
	|	 ВЫБРАТЬ 
	|       ДокОтчетККМ.Номенклатура,
	|       ДокОтчетККМ.ХарактеристикаНоменклатуры,
	|       ДокОтчетККМ.СерияНоменклатуры,
	|       &ТоварНовый                                      КАК Качество,
	|       ДокОтчетККМ.Склад                                КАК Склад,
	|       ДокОтчетККМ.Количество                           КАК Количество,
	|       ДокОтчетККМ.Цена
	|	 ИЗ
	|       Документ.ОтчетОРозничныхПродажах.Товары КАК ДокОтчетККМ
	|    ГДЕ
	|       ДокОтчетККМ.Ссылка <> &ДокументСсылка
	|       И ДокОтчетККМ.Ссылка.Проведен
	|       И ДокОтчетККМ.Ссылка.ИнвентаризацияТоваровНаСкладе = &ДокументОснованиеСсылка) КАК ВложенныйЗапрос
	|ПО
	|      Док.Номенклатура               = ВложенныйЗапрос.Номенклатура
	|    И Док.ХарактеристикаНоменклатуры = ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|    И Док.СерияНоменклатуры          = ВложенныйЗапрос.СерияНоменклатуры
	|    И Док.Качество                   = ВложенныйЗапрос.Качество
	|    И Док.Ссылка.Склад               = ВложенныйЗапрос.Склад
	|    И Док.Цена                       = ВложенныйЗапрос.Цена
	|
	|ГДЕ
	|	Док.Ссылка = &ДокументОснованиеСсылка
	|   И ((Док.КоличествоУчет - Док.Количество) > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка.Склад,
	|	Док.Номенклатура,
	|	Док.ЕдиницаИзмерения,
	|	Док.ЦенаВРознице,
	|	Док.ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры,
	|	Док.Качество";
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		КоличествоСписать = Выборка.КоличествоОтклонение - Выборка.КоличествоСписанное;
		Если КоличествоСписать <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент                = Выборка.ЕдиницаИзмерения.Коэффициент;
		СтрокаТабличнойЧасти.Количество                 = КоличествоСписать;
		СтрокаТабличнойЧасти.Цена                       = Выборка.Цена;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
		СтрокаТабличнойЧасти.Склад                      = Выборка.Склад;

		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти,    ЭтотОбъект);
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	КонецЦикла;

#Если Клиент Тогда
	Если Товары.Количество() = 0 Тогда
		Сообщить("В документе """ + ДокументОснование.Метаданные().Представление() + """ № " + ДокументОснование.Номер +" отсутствуют товары учетное количество которых превышает фактическое.");
	КонецЕсли;
#КонецЕсли

КонецПроцедуры // ЗаполнитьТоварыПоИнвентаризацииТоваров()

// Заолняет табличную часть по сериям при оперативном проведении
//
Процедура ЗаполнитьПоСериям() Экспорт

	ТоварыТабличнойЧасти = Товары.Выгрузить();
	ТоварыТабличнойЧасти.Свернуть("Номенклатура");
	СкладыТабличнойЧасти = Товары.Выгрузить();
	СкладыТабличнойЧасти.Свернуть("Склад");

	МассивНоменклатуры = ТоварыТабличнойЧасти.ВыгрузитьКолонку("Номенклатура");
	МассивСклады       = СкладыТабличнойЧасти.ВыгрузитьКолонку("Склад");

	ТаблицаСерий = УправлениеЗапасами.ПолучитьТаблицуОстатковПоСериям(МассивСклады, Организация, МассивНоменклатуры, ,ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах);
	СтрокаИндекса = "Номенклатура,ХарактеристикаНоменклатуры,Качество";
	Если  ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах Тогда
		СтрокаИндекса = СтрокаИндекса+",Цена";
	КонецЕсли;
	ТаблицаСерий.Индексы.Добавить(СтрокаИндекса);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахТовары.НомерСтроки,
	|	ОтчетОРозничныхПродажахТовары.Номенклатура,
	|	ОтчетОРозничныхПродажахТовары.ЕдиницаИзмерения,
	|	ОтчетОРозничныхПродажахТовары.Коэффициент,
	|	ОтчетОРозничныхПродажахТовары.Цена,
	|	ОтчетОРозничныхПродажахТовары.Количество,
	|	ОтчетОРозничныхПродажахТовары.Сумма,
	|	ОтчетОРозничныхПродажахТовары.ХарактеристикаНоменклатуры,
	|	ОтчетОРозничныхПродажахТовары.СерияНоменклатуры,
	|	ОтчетОРозничныхПродажахТовары.Склад,
	|	ОтчетОРозничныхПродажахТовары.ПроцентСкидкиНаценки,
	|	ОтчетОРозничныхПродажахТовары.СтавкаНДС,
	|	ОтчетОРозничныхПродажахТовары.СуммаНДС,
	|	ОтчетОРозничныхПродажахТовары.ПроцентАвтоматическихСкидок,
	|	ОтчетОРозничныхПродажахТовары.УсловиеАвтоматическойСкидки,
	|	ОтчетОРозничныхПродажахТовары.ЗначениеУсловияАвтоматическойСкидки,
	|	ОтчетОРозничныхПродажахТовары.СчетУчетаБУ,
	|	ОтчетОРозничныхПродажахТовары.СхемаРеализации,
	|	ОтчетОРозничныхПродажахТовары.НалоговоеНазначениеДоходовИЗатрат,
	|	ОтчетОРозничныхПродажахТовары.НалоговоеНазначение,
	|	ОтчетОРозничныхПродажахТовары.ДокументПродажи,
	|	ОтчетОРозничныхПродажахТовары.НоменклатурнаяПозиция,
	|	ОтчетОРозничныхПродажахТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентХраненияОстатков,
	|	ОтчетОРозничныхПродажахТовары.КлючСвязи
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	|ГДЕ
	|	ОтчетОРозничныхПродажахТовары.Ссылка = &парамДокумент";
	
	Запрос.УстановитьПараметр("парамДокумент", Ссылка);
	
	ТоварыТабличнойЧасти = Запрос.Выполнить().Выгрузить();
	Товары.Очистить();

	КолонкиТабЧасти = ТоварыТабличнойЧасти.Колонки;

	СтруктДанныеСерНомера = УчетСерийныхНомеров.СформироватьИсходнуюТаблицуСерийныйНомеров(ТоварыТабличнойЧасти, СерийныеНомера);
	Для Каждого ИсходнаяСтрока ИЗ ТоварыТабличнойЧасти Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура"              , ИсходнаяСтрока.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
		СтруктураПоиска.Вставить("Качество"                  , Справочники.Качество.Новый);
		Если  ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах Тогда
			СтруктураПоиска.Вставить("Цена"                  , ИсходнаяСтрока.Цена);
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаСерий.НайтиСтроки(СтруктураПоиска);
		КоличествоОсталосьПогасить = ИсходнаяСтрока.Количество;
		СтрокаСПустойСерией = Неопределено;

		Для Каждого Строка Из НайденныеСтроки Цикл
			Если КоличествоОсталосьПогасить<=0 Тогда
				Прервать;
			КонецЕсли;
			Если Строка.Остаток <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОстатокВЕдиницах = Строка.Остаток * ИсходнаяСтрока.КоэффициентХраненияОстатков / ИсходнаяСтрока.Коэффициент; 
			Если ОстатокВЕдиницах >= КоличествоОсталосьПогасить Тогда
				КоэффСписания = КоличествоОсталосьПогасить / ОстатокВЕдиницах;
			Иначе
				КоэффСписания = 1
			КонецЕсли;

			СписанноеКоличество = Окр(ОстатокВЕдиницах * КоэффСписания, 3, РежимОкругления.Окр15как20);

			Если СписанноеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;

			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура                        = ИсходнаяСтрока.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения                    = ИсходнаяСтрока.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент                         = ИсходнаяСтрока.Коэффициент;
			НоваяСтрока.Цена                                = ИсходнаяСтрока.Цена;
			НоваяСтрока.ХарактеристикаНоменклатуры          = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры                   = Строка.СерияНоменклатуры;
			НоваяСтрока.ПроцентСкидкиНаценки                = ИсходнаяСтрока.ПроцентСкидкиНаценки;
			НоваяСтрока.ПроцентАвтоматическихСкидок         = ИсходнаяСтрока.ПроцентАвтоматическихСкидок;
			НоваяСтрока.УсловиеАвтоматическойСкидки         = ИсходнаяСтрока.УсловиеАвтоматическойСкидки;
			НоваяСтрока.ЗначениеУсловияАвтоматическойСкидки = ИсходнаяСтрока.ЗначениеУсловияАвтоматическойСкидки;
			НоваяСтрока.СтавкаНДС                           = ИсходнаяСтрока.СтавкаНДС;
			НоваяСтрока.Склад                               = ИсходнаяСтрока.Склад;
			НоваяСтрока.Количество                          = СписанноеКоличество;
				
			НоваяСтрока.СчетУчетаБУ                	= ИсходнаяСтрока.СчетУчетаБУ;
			НоваяСтрока.НалоговоеНазначение			= ИсходнаяСтрока.НалоговоеНазначение;
			НоваяСтрока.СхемаРеализации            	= ИсходнаяСтрока.СхемаРеализации;
			НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат 	= ИсходнаяСтрока.НалоговоеНазначениеДоходовИЗатрат;

			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);

			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СерияНоменклатуры) Тогда
				СтрокаСПустойСерией = НоваяСтрока;
			КонецЕсли;

			УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, ИсходнаяСтрока.НомерСтроки - 1, КоличествоОсталосьПогасить - СписанноеКоличество, НоваяСтрока, СписанноеКоличество);
			
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить-СписанноеКоличество;
			Строка.Остаток = Строка.Остаток - СписанноеКоличество * ИсходнаяСтрока.Коэффициент
			                                / ИсходнаяСтрока.КоэффициентХраненияОстатков;
		КонецЦикла;
		
		Если КоличествоОсталосьПогасить <> 0 Тогда
			Если СтрокаСПустойСерией = Неопределено Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура                        = ИсходнаяСтрока.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения                    = ИсходнаяСтрока.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент                         = ИсходнаяСтрока.Коэффициент;
				НоваяСтрока.Цена                                = ИсходнаяСтрока.Цена;
				НоваяСтрока.ХарактеристикаНоменклатуры          = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.СерияНоменклатуры                   = ИсходнаяСтрока.СерияНоменклатуры;
				НоваяСтрока.ПроцентСкидкиНаценки                = ИсходнаяСтрока.ПроцентСкидкиНаценки;
				НоваяСтрока.ПроцентАвтоматическихСкидок         = ИсходнаяСтрока.ПроцентАвтоматическихСкидок;
				НоваяСтрока.УсловиеАвтоматическойСкидки         = ИсходнаяСтрока.УсловиеАвтоматическойСкидки;
				НоваяСтрока.ЗначениеУсловияАвтоматическойСкидки = ИсходнаяСтрока.ЗначениеУсловияАвтоматическойСкидки;
				НоваяСтрока.СтавкаНДС                           = ИсходнаяСтрока.СтавкаНДС;
				НоваяСтрока.Склад                               = ИсходнаяСтрока.Склад;
				НоваяСтрока.Количество                          = КоличествоОсталосьПогасить;
				
				НоваяСтрока.СчетУчетаБУ                	= ИсходнаяСтрока.СчетУчетаБУ;
				НоваяСтрока.НалоговоеНазначение			= ИсходнаяСтрока.НалоговоеНазначение;
				НоваяСтрока.СхемаРеализации            	= ИсходнаяСтрока.СхемаРеализации;
				НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат 	= ИсходнаяСтрока.НалоговоеНазначениеДоходовИЗатрат;

				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
				
				УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, ИсходнаяСтрока.НомерСтроки - 1, 0, НоваяСтрока, КоличествоОсталосьПогасить);
				
			Иначе
				СтрокаСПустойСерией.Количество = СтрокаСПустойСерией.Количество + КоличествоОсталосьПогасить;

				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаСПустойСерией, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаСПустойСерией, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоСериям()

// Процедура проверяет заполненение реквизита ИнвентаризацияТоваровНаСкладе,
// и вызывает сервисный механизм для заполнения табличной части.
//
Процедура ДействиеЗаполнитьПоИнвентаризации()	Экспорт

	ЗаполнятьТабличнуюЧасть = Ложь;
	Если НЕ ЗначениеЗаполнено(ИнвентаризацияТоваровНаСкладе) Тогда
		
		ПредставлениеИнвентаризацияТоваровНаСкладе = Метаданные.Документы.ИнвентаризацияТоваровНаСкладе.Представление();
		ТекстПредупреждения = "Документ """ + ПредставлениеИнвентаризацияТоваровНаСкладе + """ не выбран.
		                      |Заполнение невозможно.";

	Иначе
		ЗаполнятьТабличнуюЧасть = Истина;
	КонецЕсли;

	Если Не ЗаполнятьТабличнуюЧасть Тогда
		
	#Если Клиент Тогда
		Предупреждение(ТекстПредупреждения, ,);
	#Иначе
		ВызватьИсключение ТекстПредупреждения;
	#КонецЕсли
	
		Возврат;
	КонецЕсли;

	Если Товары.Количество() > 0 Тогда
		
		ОчиститьТабЧасть = Истина;
		
		#Если Клиент Тогда
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		ОчиститьТабЧасть = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,) = КодВозвратаДиалога.Да;
		#КонецЕсли
		
		Если Не ОчиститьТабЧасть Тогда
			Возврат;
		КонецЕсли; 

		Товары.Очистить();
		СоставНабора.Очистить();
		СерийныеНомера.Очистить();
		СерийныеНомераСоставНабора.Очистить();
		
	КонецЕсли;

	ЗаполнитьТоварыПоИнвентаризацииТоваров(ИнвентаризацияТоваровНаСкладе);

КонецПроцедуры // КоманднаяПанельТоварыДействиеЗаполнить()

// Производит пересчет необходимых полей при изменении типа цен
//
Процедура ПриИзмененииТипаЦен()

	Если Товары.Количество() > 0 Тогда
		ПересчитатьТабЧасть = Истина;
		
		#Если Клиент Тогда
		ТекстВопроса = "Изменился тип цен. Пересчитать табличную часть?";
		ПересчитатьТабЧасть = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да;
		#КонецЕсли
		
		Если ПересчитатьТабЧасть Тогда

			СтруктураЗначений = Новый Структура;
			СтруктураЗначений.Вставить("НовыйТипЦен", ТипЦен);
			СтруктураЗначений.Вставить("НовыйВалютаДокумента", мВалютаРегламентированногоУчета);
			СтруктураЗначений.Вставить("НовыйКурсДокумента", 1);
			СтруктураЗначений.Вставить("НовыйКратностьДокумента", 1);

			СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
			
			// Получить нужные цены запросом
			РезультатЗапросаЦен = Ценообразование.СформироватьЗапросПоЦенам(СтруктураЗначений, 
			                                                  СпособЗаполненияЦен, 
			                                                  Товары.ВыгрузитьКолонку("Номенклатура"),
			                                                  Дата, Неопределено);

			ВыборкаИзРезультатаЗапроса = РезультатЗапросаЦен.Выбрать();
			
			СтруктураПоиска = Новый Структура(); // стркутура для поиска в результате запроса

			// В цикле по ТЧ перезаполняем цены, приводя их к текущим скидкам, валюте и режиму налогообложения
			Для каждого СтрокаТабличнойЧасти Из Товары Цикл

				СтруктураПоиска.Вставить("Номенклатура"              , СтрокаТабличнойЧасти.Номенклатура);
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);

				ВыборкаИзРезультатаЗапроса.Сбросить(); 
				Если ВыборкаИзРезультатаЗапроса.НайтиСледующий(СтруктураПоиска) Тогда // Нашли запись

					// Если для данного товара есть цена данного типа
					// Единицу устанавливаем в единицу цены, если она не задана, то в основную единицу товара
					Если НЕ ЗначениеЗаполнено(ВыборкаИзРезультатаЗапроса.Цена) Тогда
						СтрокаТабличнойЧасти.Цена = 0;
					Иначе
						// Присваиваем значение цены и единицы цены
						Если СтруктураЗначений.НовыйТипЦен.Рассчитывается Тогда

							Цена = ВыборкаИзРезультатаЗапроса.Цена * (1 + ВыборкаИзРезультатаЗапроса.ПроцентСкидкиНаценки / 100);
							СтруктураВалюты = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураЗначений.НовыйТипЦен.ВалютаЦены, ЭтотОбъект.Дата);
							МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Цена, 
														ВыборкаИзРезультатаЗапроса.ВалютаЦены,
														СтруктураЗначений.НовыйТипЦен.ВалютаЦены,
														ВыборкаИзРезультатаЗапроса.КурсВалютыЦены,
														СтруктураВалюты.Курс,
														ВыборкаИзРезультатаЗапроса.КратностьВалютыЦены,
														СтруктураВалюты.Кратность);
							СтрокаТабличнойЧасти.Цена = Ценообразование.ОкруглитьЦену(Цена,
																		СтруктураЗначений.НовыйТипЦен.ПорядокОкругления,
																		СтруктураЗначений.НовыйТипЦен.ОкруглятьВБольшуюСторону);
						Иначе
							СтрокаТабличнойЧасти.Цена = ВыборкаИзРезультатаЗапроса.Цена;
						КонецЕсли;

						// Пересчитываем цену в валюту документа
						Если СтруктураЗначений.НовыйВалютаДокумента <> ВыборкаИзРезультатаЗапроса.ВалютаЦены Тогда
							СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Цена, 
							                                    ВыборкаИзРезультатаЗапроса.ВалютаЦены, 
							                                    СтруктураЗначений.НовыйВалютаДокумента, 
							                                    ВыборкаИзРезультатаЗапроса.КурсВалютыЦены,
							                                    СтруктураЗначений.НовыйКурсДокумента, 
							                                    ВыборкаИзРезультатаЗапроса.КратностьВалютыЦены,
							                                    СтруктураЗначений.НовыйКратностьДокумента);
						КонецЕсли;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					КонецЕсли;                     	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПриИзмененииТипаЦен()
  
// Выполняет необходимые действия при изменении реквизита Склад
//
Процедура ПриИзмененииИнвентаризацииТоваровНаСкладе() Экспорт

	Если ЗначениеЗаполнено(ИнвентаризацияТоваровНаСкладе) Тогда
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ИнвентаризацияТоваровНаСкладе.Организация;
			ПриИзмененииОрганизации();
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Склад = ИнвентаризацияТоваровНаСкладе.Склад;
			ПриИзмененииСклада();
		КонецЕсли;               
	КонецЕсли;

КонецПроцедуры

// Выполняет необходимые действия при изменении реквизита Склад
//
Процедура ПриИзмененииСклада() Экспорт
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах Тогда
			Если Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
				#Если Клиент Тогда
				Предупреждение("Если установлен вид операции ""НТТ"", то склад можно выбрать только с видом ""НТТ""!");
				#КонецЕсли
				Склад = Справочники.Склады.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				#Если Клиент Тогда
				Предупреждение("Если установлен вид операции ""ККМ"", то склад не может быть выбран с видом ""НТТ""!");
				#КонецЕсли
				Склад = Справочники.Склады.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		Если УчитыватьНДС И Не СуммаВключаетНДС Тогда
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				#Если Клиент Тогда
				Предупреждение("Неавтоматизированная торговая точка не может быть выбрана, если НДС не включается в сумму!");
				#КонецЕсли
				Склад = Справочники.Склады.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;

		Если Склад.СуммовойУчет Тогда
			#Если Клиент Тогда
			Предупреждение("Не может быть выбрана неавтоматизированная торговая точка с суммовым учетом!"
	"Реализации товаров из неавтоматизированной торговой точки с суммовым учетом"
	"отражаются документом ""Приходный кассовый ордер"".");
			#КонецЕсли
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

	Если Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
		Если НЕ мУказаниеСкладовВТЧ Тогда
			ТипЦен = Склад.ТипЦенРозничнойТорговли;
			ПриИзмененииТипаЦен();
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если мУказаниеСкладовВТЧ Тогда
		РаботаСДиалогами.ИзменитьЗначениеСкладаВТабЧастях(
			ЭтотОбъект,
			Склад,
			мСтароеЗначениеСклада,
			"Товары",
			"Склад");
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
			
		Ответ = Вопрос("Установить счета бухгалтерского и налогового учета в соответствии со значениями по умолчанию?", 
						РежимДиалогаВопрос.ДаНет, 
						, , 
						"Изменения счетов учета");
			
	Иначе
			
		Ответ = КодВозвратаДиалога.Да;
			
	КонецЕсли;
					
					
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСчетаУчетаВТабЧасти(Товары        , "Товары"        , ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры //ПриИзмененииСклада()
   
// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
	ОбновитьПараметрыУчетнойПолитики(Дата, Организация);
	
	
КонецПроцедуры // ПриИзмененииОрганизации()

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	Если ЭтоНовый() Тогда
		
#Если Клиент Или ВнешнееСоединение Тогда
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , "Покупка", ПараметрОбъектКопирования, ПараметрОснование);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));

		Если (ЗначениеЗаполнено(ИнвентаризацияТоваровНаСкладе)) И (ЗначениеЗаполнено(Склад)) Тогда //Введен на основании
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрОбъектКопирования = Неопределено И ПараметрОснование = Неопределено Тогда

			ПриИзмененииДоговораЭквайрингаВнутр();

			// Установить вид операции из настроек пользователя
			ОсновнойВидОперации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойВидОперацииДокументаОтчетОРозничныхПродажах");
			Если ЗначениеЗаполнено(ОсновнойВидОперации) Тогда
				ВидОперации = ОсновнойВидОперации;
			КонецЕсли;
		КонецЕсли;
#КонецЕсли

		Если НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
			СчетДоходовРозничныхПродаж 			= ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
			СчетВычетаИзДоходовРозничныхПродаж  = ПланыСчетов.Хозрасчетный.ВычетыИзДоходаОтРозницы;
			СчетУчетаНДС 						= ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;
		КонецЕсли;

	КонецЕсли;
	
	
	
	// Сохраним текущее значение склада
	мСтароеЗначениеСклада = Склад;

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Выполняет инициализацию нового документа и устанавливает вид операции ОтчетНТТОПродажах.
// Вызывается из веб-приложения "Удаленный склад".
// 
Процедура ИнициализироватьНовыйДокументНТТ(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	ИнициализироватьДокумент(ПараметрОбъектКопирования, ПараметрОснование);
	ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах;
	
	Если ЗначениеЗаполнено(Склад) И Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
		
		Склад = Справочники.Склады.ПустаяСсылка();
		
	КонецЕсли;

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Производит заполнение и установку необходимых полей при изменении товара в табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка таб. части "Товары".
//
Процедура ПриИзмененииНоменклатурыТоваровВнутр(СтрокаТабличнойЧасти) Экспорт

	// Заполняем реквизиты табличной части.
	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	Если НЕ мУказаниеСкладовВТЧ Тогда
		ТекСклад = Склад;
	Иначе
		ТекСклад = СтрокаТабличнойЧасти.Склад;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекСклад) Тогда
		Если ТекСклад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект,
												мВалютаРегламентированногоУчета, мВалютаРегламентированногоУчета,
												ТипЦен);
		ИначеЕсли ТекСклад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуРозничнуюЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекСклад,
												мВалютаРегламентированногоУчета);
		ИначеЕсли ТекСклад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект,
												мВалютаРегламентированногоУчета, мВалютаРегламентированногоУчета,			
												ТекСклад.ТипЦенРозничнойТорговли, Истина);
			СтрокаТабличнойЧасти.Цена = Ценообразование.ОкруглитьЦену(СтрокаТабличнойЧасти.Цена, ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПриИзмененииНоменклатурыТоваровВнутр()

// Процедура выполняет необходимые действия при изменении номенклатуры в ТЧ "Товары".
//
// Параметры:
//  СтрокаТабличнойЧасти - строка таб. части "Товары".
//
Процедура ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти) Экспорт

	// Выполнить общие действия для всех документов при изменении номенклатуры.
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

	ПриИзмененииНоменклатурыТоваровВнутр(СтрокаТабличнойЧасти);

	// Рассчитываем реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, ЭтотОбъект);

	ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	
	// Ввод состава набора
	УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТабличнойЧасти, ЭтотОбъект);

КонецПроцедуры // ПриИзмененииНоменклатурыТоваров()
 
// Заполняет поля позиции табличной части Товары по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
// Параметры
//  НомерПозиции  – номер позиции табличной части
//
Процедура ЗаполнитьПозициюТоварыПоНоменклатуре(НомерПозиции) Экспорт
	
	СтрокаТабличнойЧасти = Товары.Получить(НомерПозиции); 
	ЗаполнитьСкладВПозицииТЧТовары(СтрокаТабличнойЧасти);
	ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти);

КонецПроцедуры // ЗаполнитьПозициюТоварыПоНоменклатуре()

// Заполняет поля всех позиций табличной части Товары по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ЗаполнитьПозицииТЧТовары() Экспорт
	
	Для НомерПозиции = 0 По Товары.Количество() - 1 Цикл	
		ЗаполнитьПозициюТоварыПоНоменклатуре(НомерПозиции);			
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПозицииТЧТовары()

// Заполняет поля позиции табличной части ОплатаПлатежнымиКартами по выбранному виду оплаты.
// Вызывается из веб-приложения "Удаленный склад"
//
// Параметры
//  НомерПозиции  – номер позиции табличной части
//
Процедура ЗаполнитьПозициюТЧОплатаПлатежнымиКартами(НомерПозиции) Экспорт
	
	ПриИзмененииВидаОплатыПлатежнымиКартами(ОплатаПлатежнымиКартами.Получить(НомерПозиции));

КонецПроцедуры // ЗаполнитьПозициюТЧОплатаПлатежнымиКартами()

// Заполняет поля всех позиций табличной части ОплатаПлатежнымиКартами по выбранному виду оплаты.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ЗаполнитьПозицииТЧОплатаПлатежнымиКартами() Экспорт
	
	Для НомерПозиции = 0 По ОплатаПлатежнымиКартами.Количество() - 1 Цикл	
		ЗаполнитьПозициюТЧОплатаПлатежнымиКартами(НомерПозиции);			
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПозицииТЧОплатаПлатежнымиКартами()

// Заполняет поля позиции табличной части ОплатаБанковскимиКредитами по выбранному виду оплаты.
// Вызывается из веб-приложения "Удаленный склад"
//
// Параметры
//  НомерПозиции  – номер позиции табличной части
//
Процедура ЗаполнитьПозициюТЧОплатаБанковскимиКредитами(НомерПозиции) Экспорт
	
	ПриИзмененииВидаОплатыБанковскимКредитом(ОплатаБанковскимиКредитами.Получить(НомерПозиции));

КонецПроцедуры // ЗаполнитьПозициюТЧОплатаБанковскимиКредитами()

// Заполняет поля всех позиций табличной части ОплатаБанковскимиКредитами по выбранному виду оплаты.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ЗаполнитьПозицииТЧОплатаБанковскимиКредитами() Экспорт
	
	Для НомерПозиции = 0 По ОплатаБанковскимиКредитами.Количество() - 1 Цикл	
		ЗаполнитьПозициюТЧОплатаБанковскимиКредитами(НомерПозиции);			
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПозицииТЧОплатаБанковскимиКредитами()

// Устанавливает значение реквизита Склад в позиции ТЧ Товары
//
// Параметры
//  СтрокаТабличнойЧасти  – Строка ТЧ Товары
//
Процедура ЗаполнитьСкладВПозицииТЧТовары(СтрокаТабличнойЧасти) Экспорт

	// Заполним склад в строке
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Склад) Тогда
		СтрокаТабличнойЧасти.Склад = Склад;
		Если УчитыватьНДС И Не СуммаВключаетНДС Тогда
			Если СтрокаТабличнойЧасти.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				#Если Клиент Тогда
				Предупреждение("НТТ не может быть выбрана, если НДС не включается в сумму!");
				#КонецЕсли
				СтрокаТабличнойЧасти.Склад = Справочники.Склады.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры // УстановитьСкладВПозицииТЧТовары()

// Пересчитывает суммы в позициях табличной части Товары.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьТабличнуюЧастьТовары() Экспорт

	Для Каждого СтрокаТабЧасти Из Товары Цикл
		
		ЗаполнитьСкладВПозицииТЧТовары(СтрокаТабЧасти);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабЧасти, ЭтотОбъект);

	КонецЦикла; 	

КонецПроцедуры // ПересчитатьТабличнуюЧастьТовары()

// Пересчитывает суммы в позициях табличной части ОплатаПлатежнымиКартами.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьТабличнуюЧастьОплатаПлатежнымиКартами() Экспорт

	Для Каждого СтрокаТабЧасти Из ОплатаПлатежнымиКартами Цикл
		
		ПересчитатьТорговуюУступку(СтрокаТабЧасти);

	КонецЦикла; 	

КонецПроцедуры // ПересчитатьТабличнуюЧастьОплатаПлатежнымиКартами()

// Пересчитывает суммы в позициях табличной части ОплатаБанковскимиКредитами.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьТабличнуюЧастьОплатаБанковскимиКредитами() Экспорт

	Для Каждого СтрокаТабЧасти Из ОплатаБанковскимиКредитами Цикл
		
		ПересчитатьСуммуКомиссии(СтрокаТабЧасти);

	КонецЦикла; 	

КонецПроцедуры // ПересчитатьТабличнуюЧастьОплатаБанковскимиКредитами()

// Проверяет заполенение табличных частей и пересчитывает значения вычисляемых реквизитов
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПередЗаписьюИзВебПриложения() Экспорт
	
#Если ВнешнееСоединение Тогда
	WEBПриложения.ПроверитьТабличнуюЧасть(ЭтотОбъект, "Товары");
#КонецЕсли

	Для Каждого СтрокаТабЧасти Из Товары Цикл
		
		ЗаполнитьСкладВПозицииТЧТовары(СтрокаТабЧасти);
		
	КонецЦикла;
	
	Для Каждого СтрокаТабЧасти Из ОплатаПлатежнымиКартами Цикл
		
		ПриИзмененииВидаОплатыПлатежнымиКартами(СтрокаТабЧасти, Ложь);
		
	КонецЦикла;
	
	Для Каждого СтрокаТабЧасти Из ОплатаБанковскимиКредитами Цикл
		
		ПриИзмененииВидаОплатыБанковскимКредитом(СтрокаТабЧасти, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет необходимые действия при изменении реквизита "ВидОплаты" в ТЧ "ОплатаБанковскимиКредитами".
//
// Параметры:
//  ТекущаяСтрока - строка, в которой необходимо выполнить пересчет.
//
Процедура ПриИзмененииДисконтнойКарты(ТекущаяСтрока) Экспорт

	ТекущаяСтрока.ВладелецДисконтнойКарты = ТекущаяСтрока.ДисконтнаяКарта.ВладелецКарты;

КонецПроцедуры // ПриИзмененииДисконтнойКарты()

// Процедура выполняет необходимые действия при изменении реквизита "ВидОплаты" в ТЧ "ОплатаПлатежнымиКартами".
//
// Параметры:
//  ТекущаяСтрока 			- строка, в которой необходимо выполнить пересчет;
//	ЗаполнитьПроцентУступки - булево, если Истина, реквизит ПроцентТорговойУступки
//								заполняется по выбранному виду оплаты, если Ложь - не заполняется.
//
Процедура ПриИзмененииВидаОплатыПлатежнымиКартами(ТекущаяСтрока, ЗаполнитьПроцентУступки = Истина) Экспорт
	
	УправлениеРозничнойТорговлей.ПроверитьКорректностьВидаОплаты(ТекущаяСтрока.ВидОплаты, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);
	
	Если ЗначениеЗаполнено(ДоговорЭквайринга) Тогда
		Если ЗаполнитьПроцентУступки Тогда
			ТекущаяСтрока.ПроцентТорговойУступки = УправлениеРозничнойТорговлей.ПолучитьПроцентТорговойУступки(ДоговорЭквайринга, ТекущаяСтрока.ВидОплаты);
		КонецЕсли;
		ПересчитатьТорговуюУступку(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет необходимые действия при изменении реквизита "ВидОплаты" в ТЧ "ОплатаБанковскимиКредитами".
//
// Параметры:
//  ТекущаяСтрока 			 - строка, в которой необходимо выполнить пересчет;
//	ЗаполнитьПроцентКомиссии - булево, если Истина, реквизит ПроцентБанковскойКомиссии
//								заполняется по выбранному виду оплаты, если Ложь - не заполняется.
//
Процедура ПриИзмененииВидаОплатыБанковскимКредитом(ТекущаяСтрока, ЗаполнитьПроцентКомиссии = Истина) Экспорт

	УправлениеРозничнойТорговлей.ПроверитьКорректностьВидаОплаты(ТекущаяСтрока.ВидОплаты, Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);
	
	ТекВидОплаты = ТекущаяСтрока.ВидОплаты;
	ТекущаяСтрока.БанкКредитор = ТекВидОплаты.БанкКредитор;
	ТекущаяСтрока.ДоговорВзаиморасчетовБанкаКредитора = ТекВидОплаты.ДоговорВзаиморасчетовБанкаКредитора;
	Если ЗаполнитьПроцентКомиссии Тогда
		ТекущаяСтрока.ПроцентБанковскойКомиссии = ТекВидОплаты.ПроцентБанковскойКомиссии;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорВзаиморасчетовБанкаКредитора) И ОтражатьВБухгалтерскомУчете Тогда
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, ТекущаяСтрока.БанкКредитор, ТекущаяСтрока.ДоговорВзаиморасчетовБанкаКредитора);
		
		ТекущаяСтрока.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
	КонецЕсли;

	ПересчитатьСуммуКомиссии(ТекущаяСтрока);

КонецПроцедуры // ПриИзмененииВидаОплатыБанковскимКредитом()

// Процедура пересчитывает значение банковской комиссии в переданной строке ТЧ.
//
// Параметры:
//  ТекущаяСтрока - строка, в которой необходимо выполнить пересчет.
//
Процедура ПересчитатьСуммуКомиссии(ТекущаяСтрока) Экспорт

	ТекущаяСтрока.СуммаБанковскойКомиссии = ТекущаяСтрока.Сумма * ТекущаяСтрока.ПроцентБанковскойКомиссии / 100;

КонецПроцедуры // ПересчитатьСуммуКомиссии()

// Процедура устанавливает значения зависимых реквизитов при изменении реквизита "ДоговорЭквайринга".
//
Процедура ПриИзмененииДоговораЭквайрингаВнутр() Экспорт

	Эквайрер = ДоговорЭквайринга.Эквайрер;
	ДоговорВзаиморасчетовЭквайрера = ДоговорЭквайринга.ДоговорВзаиморасчетов;

	Если ЗначениеЗаполнено(ДоговорВзаиморасчетовЭквайрера) И ОтражатьВБухгалтерскомУчете Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Эквайрер, ДоговорВзаиморасчетовЭквайрера);
		СчетУчетаРасчетовСЭквайрером = СчетаУчета.СчетРасчетов;
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииДоговораЭквайрингаВнутр()

// Процедура выполняет необходимые действия при изменении реквизита "ДоговорЭквайринга".
//
Процедура ПриИзмененииДоговораЭквайринга() Экспорт

	ПриИзмененииДоговораЭквайрингаВнутр();
	
	ПересчитатьЗначенияТорговойУступки = Истина;
	Если ОплатаПлатежнымиКартами.Количество() > 0 Тогда
		#Если Клиент Тогда
		ПересчитатьЗначенияТорговойУступки = Вопрос("Пересчитать значения торговой уступки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да;
		#КонецЕсли
	КонецЕсли;

	Если ПересчитатьЗначенияТорговойУступки Тогда
		СоответствиеТарифов = УправлениеРозничнойТорговлей.СформироватьСоответствиеТарифовЭквайринг(ДоговорЭквайринга);

		Для Каждого СтрокаОплаты Из ОплатаПлатежнымиКартами Цикл
			СтрокаОплаты.ПроцентТорговойУступки = СоответствиеТарифов[СтрокаОплаты.ВидОплаты];

			ПересчитатьТорговуюУступку(СтрокаОплаты);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ДоговорЭквайрингаПриИзменении()

// Процедура пересчитывает значение торговой уступки в переданной строке ТЧ.
//
// Параметры:
//  ТекущаяСтрока - строка, в которой необходимо выполнить пересчет.
//
Процедура ПересчитатьТорговуюУступку(ТекущаяСтрока) Экспорт

	ТекущаяСтрока.СуммаТорговойУступки = ТекущаяСтрока.Сумма * ТекущаяСтрока.ПроцентТорговойУступки / 100;

КонецПроцедуры // ПересчитатьТорговуюУступку()

// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента)

	Если ЗаполнятьБУ = Истина Тогда

		СтрокаТЧ.СчетУчетаБУ			= СчетаУчета.СчетУчетаБУ;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СхемаРеализации		= СчетаУчета.СхемаРеализации;
		КонецЕсли;
	

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		СтрокаТЧ.СчетУчетаБУ            = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СхемаРеализации 		= Справочники.СхемыРеализации.ПустаяСсылка();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУ

// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДокумента)

	Если ЗаполнятьНУ = Истина Тогда

		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		 	= СчетаУчета.НалоговоеНазначение;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 	= СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;
 
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда

		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 			= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 	= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаНУ

// Заполняет счета БУ и НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, ?(мУказаниеСкладовВТЧ, СтрокаТЧ.Склад, Склад));

	МетаданныеДока = Метаданные();
	
	ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДока);
	ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДока);

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части.
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

// Процедура выполняет дополнение документа значениями по умолчанию.
//
Процедура ДополнитьДокументЗначениямиПоУмолчанию() Экспорт

	Для Каждого СтрокаТЧ Из Товары Цикл
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект);
	КонецЦикла;

КонецПроцедуры // ДополнитьДокументЗначениямиПоУмолчанию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Записать суммы документа в соответствующие реквизиты шапки для показа в журналах
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
Процедура РасчетСуммДокумента() Экспорт

	СуммаДокумента = Товары.Итог("Сумма");

КонецПроцедуры // РасчетСуммДокумента

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСкидок(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Номенклатура");
	ТаблицаДвижений.Колонки.Добавить("ПолучательСкидки");
	ТаблицаДвижений.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаДвижений.Колонки.Добавить("УсловиеСкидки");
	ТаблицаДвижений.Колонки.Добавить("ЗначениеУсловияСкидки");
	ТаблицаДвижений.Колонки.Добавить("СуммаСкидки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаДвижений.Колонки.Добавить("НДССкидки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	ИмяКолонкиЦена = "Цена";

	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Если СтрокаТаблицы.Количество < 0 Тогда
			// при возвратах не делаем движения в регистр Предоставленные скидки, как и при обычных возвратах (от контрагентов)
			Продолжить;	
		
		КонецЕсли;
		
		СуммаБезСкидки = СтрокаТаблицы.СтоимостьБезСкидок;
		НДСБезСкидки 	= СтрокаТаблицы.НДСУпрБезСкидок;
		
		СуммаСоСкидками = СуммаБезСкидки;
		НДССоСкидками 	= НДСБезСкидки;
		
		СкидкиЕсть = Ложь;
		Если СтрокаТаблицы.ПроцентАвтоматическихСкидок <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Номенклатура = СтрокаТаблицы.Номенклатура;
			СтрокаДвижений.ПолучательСкидки = СтрокаТаблицы.Склад;
			СтрокаДвижений.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
//			СтрокаДвижений.Качество = СтрокаТаблицы.Качество;
			СтрокаДвижений.УсловиеСкидки = СтрокаТаблицы.УсловиеАвтоматическойСкидки;
			СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.ЗначениеУсловияАвтоматическойСкидки;
			СтрокаДвижений.СуммаСкидки 	= Окр((СуммаБезСкидки/100) * СтрокаТаблицы.ПроцентАвтоматическихСкидок,2);
			СуммаСоСкидками = СуммаСоСкидками - СтрокаДвижений.СуммаСкидки;
			
			// НДС скидки
			СтрокаДвижений.НДССкидки 	= Окр((НДСБезСкидки/100) * СтрокаТаблицы.ПроцентАвтоматическихСкидок,2);
			НДССоСкидками = НДССоСкидками - СтрокаДвижений.НДССкидки;
			
			СкидкиЕсть = Истина;
		КонецЕсли;
		Если СтрокаТаблицы.ПроцентСкидкиНаценки <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Номенклатура = СтрокаТаблицы.Номенклатура;
			СтрокаДвижений.ПолучательСкидки = СтрокаТаблицы.Склад;
			СтрокаДвижений.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
//			СтрокаДвижений.Качество = СтрокаТаблицы.Качество;
			СтрокаДвижений.УсловиеСкидки = Перечисления.УсловияСкидкиНаценки.РучнаяСкидка;
			СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.ПроцентСкидкиНаценки;
			СтрокаДвижений.СуммаСкидки = Окр((СуммаБезСкидки/100) * СтрокаТаблицы.ПроцентСкидкиНаценки,2);
			СуммаСоСкидками = СуммаСоСкидками - СтрокаДвижений.СуммаСкидки;
			
			// НДС скидки
			СтрокаДвижений.НДССкидки = Окр((НДСБезСкидки/100) * СтрокаТаблицы.ПроцентСкидкиНаценки,2);
			НДССоСкидками = НДССоСкидками - СтрокаДвижений.НДССкидки;
			
			СкидкиЕсть = Истина;
		КонецЕсли;
		Разница = СтрокаТаблицы.Стоимость - СуммаСоСкидками;
		
		НДССоСкидкамиРеально = СтрокаТаблицы.НДСУпр;
		РазницаНДС = НДССоСкидкамиРеально - НДССоСкидками;
		
		Если (Разница <> 0 ИЛИ РазницаНДС <> 0)
		   И СкидкиЕсть Тогда
			СтрокаДвижений.СуммаСкидки 	= СтрокаДвижений.СуммаСкидки - Разница;
			СтрокаДвижений.НДССкидки 	= СтрокаДвижений.НДССкидки - РазницаНДС;
		КонецЕсли;
	КонецЦикла;
	ТаблицаДвижений.Свернуть("Номенклатура,ПолучательСкидки,ХарактеристикаНоменклатуры,УсловиеСкидки,ЗначениеУсловияСкидки",
	                         "СуммаСкидки,НДССкидки");

	Возврат ТаблицаДвижений;

КонецФункции // ПодготовитьТаблицуСкидок()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
		ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

		ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТоваров, "Склад", "ВидСклада");
		Если ЕстьРозничныйСклад Тогда
			ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
			                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

			УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСклада");
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем отдельные процедуры подготовки для регл. и упр. учета
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)

	// Для корректного отражения возвратов
	ТаблицаТоваров.Колонки.Добавить("РасчетыВозврат", Новый ОписаниеТипов("ПеречислениеСсылка.РасчетыВозврат"));
	
	ТаблицаТоваров.Колонки.СчетРасходовБУ.Имя	   = "КорСчетСписанияБУ";
	ТаблицаТоваров.Колонки.СубконтоРасходовБУ1.Имя = "КорСубконтоСписанияБУ1";
	ТаблицаТоваров.Колонки.СубконтоРасходовБУ2.Имя = "КорСубконтоСписанияБУ2";
	ТаблицаТоваров.Колонки.СубконтоРасходовБУ3.Имя = "КорСубконтоСписанияБУ3";
	
	ТаблицаТоваров.Колонки.Добавить("ДокументОприходования");
	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("Организация");
	ТаблицаТоваров.Колонки.Добавить("ДоговорКонтрагента");

	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,                                 "Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,        "Организация");
	
	// для списания укажем "кор. налоговое назначение" = нал. назначение доходов и затрат
	// для отражения расходов по налогу на прибыль по списанной себестоимости
	Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
		ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("НалоговоеНазначениеДоходовИЗатрат") , "НалоговоеНазначениеНовое");
	КонецЕсли;
	
	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаТоваров.ЗаполнитьЗначения(0                            , "НДС");
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если СтрокаТаблицы.Количество < 0 Тогда
			СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат;
		Иначе
			СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты;
		КонецЕсли;
	КонецЦикла;

	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, Ложь);

КонецПроцедуры // ПодготовитьТаблицуТоваровРегл()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	// Надо добавить колонки "СуммаБезНДС"
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС"       , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("Стоимость"         , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СтоимостьБезСкидок", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСДок"       , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"           	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("НДСУпрБезСкидок" 	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	ИмяКолонкиЦена = "Цена";

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		СтрокаТаблицы.СуммаНДС           = СтрокаТаблицы.НДС;
		СтрокаТаблицы.СуммаБезНДС        = СтрокаТаблицы.Сумма - ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
		СтоимостьСНДС          = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
		ТекЦена = СтрокаТаблицы[ИмяКолонкиЦена];
		

		Если СтрокаТаблицы.ПроцентСкидкиНаценки + СтрокаТаблицы.ПроцентАвтоматическихСкидок <> 0 Тогда

			СтрокаТаблицы.СтоимостьБезСкидок = ТекЦена * ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.КоличествоДок), 0, СтрокаТаблицы.КоличествоДок);
			
			СтрокаТаблицы.НДСУпрБезСкидок = УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СтоимостьБезСкидок, УчитыватьНДС, СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
			
			Если УчитыватьНДС И СуммаВключаетНДС Тогда
				СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.СтоимостьБезСкидок - УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СтоимостьБезСкидок, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
			КонецЕсли;
			
		КонецЕсли;	
		
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, мВалютаРегламентированногоУчета, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 1, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 1, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		
		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, мВалютаРегламентированногоУчета, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 1, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 1, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		Если СтрокаТаблицы.ПроцентСкидкиНаценки + СтрокаТаблицы.ПроцентАвтоматическихСкидок <> 0 Тогда
			СтрокаТаблицы.СтоимостьБезСкидок = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СтоимостьБезСкидок, мВалютаРегламентированногоУчета, 
			                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
			                                 1, 
											 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                                 1, 
											 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			СтрокаТаблицы.НДСУпрБезСкидок = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДСУпрБезСкидок, мВалютаРегламентированногоУчета, 
			                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
			                                 1, 
											 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                                 1, 
											 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		КонецЕсли;								 
		
		//СтрокаТаблицы.Стоимость          = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, мВалютаРегламентированногоУчета, 
		//								 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		//								 1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		//								 1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		//СтрокаТаблицы.СтоимостьБезСкидок = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СтоимостьБезСкидок, мВалютаРегламентированногоУчета, 
		//								 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		//								 1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		//								 1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
		Если СтрокаТаблицы.ПроцентСкидкиНаценки + СтрокаТаблицы.ПроцентАвтоматическихСкидок = 0 Тогда
			СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.Стоимость;	
			СтрокаТаблицы.НДСУпрБезСкидок = СтрокаТаблицы.НДСУпр;
		КонецЕсли;	
										 
		СтрокаТаблицы.СуммаСНДСДок = СтрокаТаблицы.СуммаДок + ?(УчитыватьНДС И НЕ СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

	КонецЦикла;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация");
	
	Если  Не СтруктураШапкиДокумента.СкладВТабличнойЧасти Тогда
		СтруктураОбязательныхПолей.Вставить("Склад");

		Если ЗначениеЗаполнено(СтруктураШапкиДокумента.Склад) Тогда
			Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах Тогда
				Если СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
					ОбщегоНазначения.СообщитьОбОшибке("При данном виде операции в качестве склада может быть выбрана только НТТ!", Отказ, Заголовок);
				КонецЕсли;
			Иначе
				Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
					ОбщегоНазначения.СообщитьОбОшибке("При данном виде операции в качестве склада не может быть выбрана НТТ!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
		СтруктураОбязательныхПолей.Вставить("КассаККМ");
		Если ЗначениеЗаполнено(КассаККМ) И КассаККМ.Владелец <> Организация Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Выбранная касса ККМ не соответствует организации, указанной в документе!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	Если ОплатаПлатежнымиКартами.Количество() > 0 Тогда
		СтруктураОбязательныхПолей.Вставить("ДоговорЭквайринга");
		СтруктураОбязательныхПолей.Вставить("Эквайрер");
		СтруктураОбязательныхПолей.Вставить("ДоговорВзаиморасчетовЭквайрера");
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСЭквайрером");
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ДоговорВзаиморасчетовЭквайрера) И ДоговорВзаиморасчетовЭквайрера.Организация <> Организация Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Организация, указанная в договоре взаиморасчетов с эквайрером не соответствует организации, указанной в документе!", Отказ, Заголовок);
		КонецЕсли;

	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			
	 	СтруктураОбязательныхПолей.Вставить("СчетДоходовРозничныхПродаж");
	 	СтруктураОбязательныхПолей.Вставить("СчетВычетаИзДоходовРозничныхПродаж");
		
	КонецЕсли;
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если Не СтруктураШапкиДокумента.СкладВТабличнойЧасти 
		  И СтруктураШапкиДокумента.СуммоваяРозница = Истина Тогда
		  
			СтрокаСообщения = "Склад не может быть неавтоматизированной торговой точкой с суммовым учетом!"
"Реализации товаров из неавтоматизированной торговой точки с суммовым учетом"
"отражаются документом ""Приходный кассовый ордер"".";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
		  
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выполняет проверки,которые нужны только для упр. учета.
//
// Параметры:
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТоварыУпр(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.УчитыватьНДС И Не СтруктураШапкиДокумента.СуммаВключаетНДС Тогда
		Для каждого СтрокаТаблицы ИЗ ТаблицаПоТоварам Цикл
			Если СтрокаТаблицы.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Документ не может осуществлять реализацию с НТТ (строка " + СтрокаТаблицы.НомерСтроки + "), 
				|если НДС не включается в сумму.", Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Проверим заполнение автоматических скидок.
	Для каждого СтрокаТаблицы ИЗ ТаблицаПоТоварам Цикл
		ПроцентНеЗаполнен   = НЕ ЗначениеЗаполнено(СтрокаТаблицы.ПроцентАвтоматическихСкидок);
		УсловиеНеЗаполнено  = НЕ ЗначениеЗаполнено(СтрокаТаблицы.УсловиеАвтоматическойСкидки);
		ЗначениеНеЗаполнено = НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеУсловияАвтоматическойСкидки);
		
		
		Если (ПроцентНеЗаполнен
		   И УсловиеНеЗаполнено
		   И ЗначениеНеЗаполнено)
		 Или (НЕ ПроцентНеЗаполнен
		   И  НЕ УсловиеНеЗаполнено
		   И  НЕ ЗначениеНеЗаполнено)Тогда // Ошибок нет.
				
		Иначе
			Если НЕ ПроцентНеЗаполнен
			   И  НЕ УсловиеНеЗаполнено
			   И  ТипЗнч(СтрокаТаблицы.ЗначениеУсловияАвтоматическойСкидки) = Тип("Число")
			   И  СтрокаТаблицы.ЗначениеУсловияАвтоматическойСкидки = 0 Тогда
				// Ошибок нет.
			Иначе
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
				                               """ табличной части ""Товары"": ";
				Если ПроцентНеЗаполнен Тогда
					СтрокаСообщения = "Не заполнено значение реквизита ""Процент автоматической скидки""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Если УсловиеНеЗаполнено Тогда
					СтрокаСообщения = "Не заполнено значение реквизита ""Условие автоматической скидки""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Если ЗначениеНеЗаполнено Тогда
					СтрокаСообщения = "Не заполнено значение реквизита ""Значение условия автоматической скидки""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТоварыУпр

Процедура ПроверитьЗаполнениеТабличнойЧастиТоварыРегл(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПараметрыУчетнойПолитикиБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента.Дата, Ложь, СтруктураШапкиДокумента.Организация, "Бух");
	РазрешитьУчетУслугБезПлановыхЦен = СтруктураШапкиДокумента.РазрешитьУчетУслугБезПлановыхЦен;
	
	НехозВНД_НДС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность;
	НехозВНД_НП  = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
	
	Для Каждого СтрокаТЧ из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Товары"": ", СокрЛП(СтрокаТЧ.НомерСтроки));

		Если НЕ СтрокаТЧ.Услуга Тогда

			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетУчетаБУ) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Счет учета (БУ)""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли; // Если НЕ СтрокаТЧ.Услуга Тогда
		
		Если СтрокаТЧ.СчетУчетаБУЗабалансовый = Null Тогда
			СчетУчетаБУЗабалансовый = Ложь;
		Иначе
			СчетУчетаБУЗабалансовый = СтрокаТЧ.СчетУчетаБУЗабалансовый;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СхемаРеализации) Тогда
			СтрокаСообщения = "Не заполнено значение реквизита ""Схема реализации""!";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда   

			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Налоговое назначение (доходов и затрат) """;
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			ИначеЕсли СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = НехозВНД_НП Тогда 
				СтрокаСообщения = "Указано некорректное налоговое назначение доходов! Вид налоговой деятельности при реализации не может быть ""Не хозяйственной деятельностью"".";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И 
				НЕ УправлениеЗапасамиПартионныйУчет.КомиссионныйТовар(СтрокаТЧ.СчетУчетаБУ) И 
				НЕ СтрокаТЧ.Услуга Тогда
			
			Если СтруктураШапкиДокумента.ЕстьНДС Тогда

				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
					СтрокаСообщения = "Не заполнено значение реквизита ""Налоговое назначение (НДС)""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли СтрокаТЧ.НалоговоеНазначение = НехозВНД_НДС Тогда	
					
					СтрокаСообщения = "Указано некорректное налоговое назначение (НДС)!  Вид налоговой деятельности при реализации не может быть ""Не хозяйственной деятельностью"".";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
					
				Иначе
							     
					Если НЕ СтрокаТЧ.СтавкаНДС.Пустая()
					   И НЕ СтрокаТЧ.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая
					   И НЕ СтрокаТЧ.ВидДеятельностиНДС = УчетНДС.ПолучитьВидДеятельностиНДС(СтрокаТЧ.СтавкаНДС) Тогда
						   
						Если СтруктураШапкиДокумента.УчитыватьНДС Тогда
							СтрокаСообщения = "Указано некорректное налоговое назначение (НДС)! Оно  не соответствует ставке НДС, указанной в строке.";
					   	Иначе	
							СтрокаСообщения = "Указано некорректное налоговое назначение! Вид деятельности НДС должен быть ""Необлагаемая""";
					   	КонецЕсли;
						   
					   ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
							
				   КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли; // Если НЕ СтрокаТЧ.СчетУчетаБУЗабалансовый Тогда		
		
		
	КонецЦикла; // Для Каждого СтрокаТЧ из ТаблицаПоТоварам Цикл

	// Схемы реализации должны быть заполнены правильно
	СтруктураПараметровПроверки = Новый Структура;
	СтруктураПараметровПроверки.Вставить("СчетДоходовБУ",     "СчетДоходов");
	СтруктураПараметровПроверки.Вставить("КорСчетСписанияБУ", "СчетСебестоимости");
	СтруктураПараметровПроверки.Вставить("СчетВычетовИзДоходовБУ",  "СчетВычетовИзДоходов");
	СтруктураПараметровПроверки.Вставить("СчетВычетовИзРасходовБУ", "СчетСебестоимостиПриВозврате");
	
	БухгалтерскийУчет.ПроверитьСхемыРеализацииТабличнойЧастиНаЗаполненость(ЭтотОбъект, "Товары", , ТаблицаПоТоварам, 
														 СтруктураПараметровПроверки,
														 СтруктураШапкиДокумента,
														 Отказ, Заголовок);	
	
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Товары".
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Номенклатура, Количество, Сумма");
	
	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;
	
	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.УчитыватьНДС И Не СтруктураШапкиДокумента.СуммаВключаетНДС Тогда
		Для каждого СтрокаТаблицы ИЗ ТаблицаПоТоварам Цикл
			Если СтрокаТаблицы.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.ОшибкаПриПроведении("Документ не может осуществлять реализацию с неавтоматизированной торговой точки (строка " + СтрокаТаблицы.НомерСтроки + "), 
				|если НДС не включается в сумму.", Отказ, Заголовок);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.СкладВТабличнойЧасти Тогда
		
		СтрокаСообщения = "казан склад  - неавтоматизированная торговая точка с суммовым учетом!"
"Реализации товаров из неавтоматизированной торговой точки с суммовым учетом"
"отражаются документом ""Приходный кассовый ордер"".";

		Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл
			
			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Товары"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
			
			Если СтрокаТЧ.СуммоваяРозница = Истина Тогда
		  
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			КонецЕсли;
		
		КонецЦикла;
		  
	КонецЕсли;
	
	ПроверитьЗаполнениеТабличнойЧастиТоварыУпр(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиТоварыРегл(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
		
		ТаблицаПоТоварамБезУслуг = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам,
		                           Новый Структура("Услуга", Ложь)).Выгрузить();
		
		УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "Товары", ТаблицаПоТоварамБезУслуг, Отказ, Заголовок, "ВидСклада");	
		
	КонецЕсли;
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "ПродажиПоДисконтнымКартам".
//
// Параметры:
//  ТаблицаПоПродажамПоДисконтнымКартам - таблица значений, содержащая данные для проведения и проверки ТЧ.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - строка, заголовок сообщения об ошибках проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПродажиПоДисконтнымКартам(ТаблицаПоПродажамПоДисконтнымКартам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("ДисконтнаяКарта, Сумма");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ПродажиПоДисконтнымКартам", СтруктураОбязательныхПолей, Отказ, Заголовок);

	//УправлениеРозничнойТорговлей.ПроверитьКорректностьТипаОплатыВТЧ(ЭтотОбъект, "ОплатаБанковскимиКредитами",
	//   ТаблицаПоБанковскимКредитам, Отказ, Заголовок, Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОплатаПлатежнымиКартами()

// Проверяет правильность заполнения строк табличной части "ОплатаБанковскимиКредитами".
//
// Параметры:
//  ТаблицаПоПлатежнымКартам - таблица значений, содержащая данные для проведения и проверки ТЧ.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - строка, заголовок сообщения об ошибках проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплатаБанковскимиКредитами(ТаблицаПоБанковскимКредитам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("ВидОплаты, Сумма, БанкКредитор, ДоговорВзаиморасчетовБанкаКредитора");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда  
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
	КонецЕсли;
		
	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОплатаБанковскимиКредитами", СтруктураОбязательныхПолей, Отказ, Заголовок);

	УправлениеРозничнойТорговлей.ПроверитьКорректностьТипаОплатыВТЧ(ЭтотОбъект, "ОплатаБанковскимиКредитами",
	   ТаблицаПоБанковскимКредитам, Отказ, Заголовок, Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);

	ПредставлениеТабличнойЧасти = Метаданные().ТабличныеЧасти.ОплатаБанковскимиКредитами.Представление();

	Для Каждого СтрокаТЧ Из ТаблицаПоБанковскимКредитам Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Организация)
		   И ЗначениеЗаполнено(Организация)
		   И СтрокаТЧ.Организация <> Организация Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки)
			   + """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "выбран договор, оганизация которого не соответствует организации, указанной в документе!",
			                    Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОплатаПлатежнымиКартами()

// Проверяет правильность заполнения строк табличной части "ОплатаПлатежнымиКартами".
//
// Параметры:
//  ТаблицаПоПлатежнымКартам - таблица значений, содержащая данные для проведения и проверки ТЧ.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - строка, заголовок сообщения об ошибках проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплатаПлатежнымиКартами(ТаблицаПоПлатежнымКартам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("ВидОплаты, Сумма");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОплатаПлатежнымиКартами", СтруктураОбязательныхПолей, Отказ, Заголовок);

	УправлениеРозничнойТорговлей.ПроверитьКорректностьТипаОплатыВТЧ(ЭтотОбъект, "ОплатаПлатежнымиКартами",
	   ТаблицаПоПлатежнымКартам, Отказ, Заголовок, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОплатаПлатежнымиКартами()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоСкидкам, 
	                          ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, ТаблицаПоПродажамПоДисконтнымКартам, Отказ, Заголовок);

	// По некоторым регистрам услуги проводить не нужно.
	// Подготовим отдельную таблицу.
	ТаблицаПоТоварамБезУслуг = ТаблицаПоТоварам.Скопировать();
	Индекс = 0;
	Пока Индекс < ТаблицаПоТоварамБезУслуг.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамБезУслуг.Получить(Индекс);
		Если СтрокаТаблицы.Услуга Тогда
			ТаблицаПоТоварамБезУслуг.Удалить(СтрокаТаблицы);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	//Получим таблицу по комплектам.
	ТаблицаПоКомплектам = УправлениеЗапасами.СформироватьТаблицуКомплектующих(ТаблицаПоТоварамБезУслуг, ЭтотОбъект);

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоСкидкам,
	                       ТаблицаПоКомплектам , ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, 
						   ТаблицаПоПродажамПоДисконтнымКартам, Отказ, Заголовок);
						   
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоКомплектам, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, Отказ, Заголовок);

	ДвиженияРегистраОперативныхРасчетов(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоКомплектам, Отказ, Заголовок);

	ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоКомплектам, Отказ, Заголовок);

	// Зарегистрируем в последовательности УУ.
	Если ОтражатьВУправленческомУчете Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
		ЗаписьРегистрации.Период      = Дата;
	КонецЕсли;
	
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	
	Если УчетнаяПолитика.СписыватьПартииПриПроведенииДокументов Тогда

		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

	Иначе
		
		// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоСкидкам,
                                 ТаблицаПоТоварамБезУслуг, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, 
								 ТаблицаПоПродажамПоДисконтнымКартам, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда

		Возврат;
		
	КонецЕсли; 

	// По регистру РозничнаяВыручка.
	НаборДвижений = Движения.РозничнаяВыручка;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	СуммаПродажи = 0;
	СуммаВозврата = 0;
	ОпределитьСуммуПродажиИВозврата(ТаблицаПоТоварам, СуммаПродажи, СуммаВозврата);
		
	Если СуммаПродажи  <> 0 Тогда
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Сумма = СуммаПродажи;
		СтрокаДвижений.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.Продажа;
	КонецЕсли;
	Если СуммаВозврата <> 0 Тогда
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Сумма = СуммаВозврата;
		СтрокаДвижений.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.Возврат;
	КонецЕсли;
	СуммаПоКартам = ТаблицаПоПлатежнымКартам.Итог("Сумма");
	Если СуммаПоКартам <> 0 Тогда
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Сумма = - СуммаПоКартам;
		СтрокаДвижений.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.ОплатаПлатежнымиКартами;
	КонецЕсли;
	СуммаПоБанковскимКредитам = ТаблицаПоБанковскимКредитам.Итог("Сумма");
	Если СуммаПоБанковскимКредитам <> 0 Тогда
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Сумма = - СуммаПоБанковскимКредитам;
		СтрокаДвижений.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.ОплатаБанковскимиКредитами;
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(КассаККМ, "РозничнаяТочка");			
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Склад, "РозничнаяТочка");			
	КонецЕсли;
		
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");

	НаборДвижений.мПериод             = Дата;
	НаборДвижений.мТаблицаДвижений    = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.РозничнаяВыручка.ВыполнитьПриход();
	КонецЕсли;
		
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВРознице или ТоварыВНТТ.
		
	ТаблицаНаСкладах = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварамБезУслуг,
					   Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Оптовый)).Выгрузить();

	Если ТаблицаНаСкладах.Количество() > 0 Тогда
		НаборДвижений = Движения.ТоварыНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
								
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаНаСкладах, ТаблицаДвижений);
			
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьРасход();
		КонецЕсли;
	КонецЕсли;

	ТаблицаВРознице = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварамБезУслуг,
					  Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Розничный)).Выгрузить();

	Если ТаблицаВРознице.Количество() > 0 Тогда
		НаборДвижений = Движения.ТоварыВРознице;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаВРознице, ТаблицаДвижений);
			
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		// Проверка осатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьРасход();
		КонецЕсли;
	КонецЕсли;	
	
	ТаблицаВНТТ = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварамБезУслуг,
	              Новый Структура("ВидСклада", Перечисления.ВидыСкладов.НТТ)).Выгрузить();
			
	Если ТаблицаВНТТ.Количество() > 0 Тогда
			
		ТаблицаВНТТ.Колонки.ЦенаВРознице.Имя = "ЦенаВРозницеДок";
		ТаблицаВНТТ.Колонки.ЦенаНТТ.Имя = "ЦенаВРознице";
			
		НаборДвижений = Движения.ТоварыВНТТ;
			
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаВНТТ, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		// Проверка осатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		Если Не Отказ Тогда
			Движения.ТоварыВНТТ.ВыполнитьРасход();
		КонецЕсли;

	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ Продажи.

	НаборДвижений   = Движения.Продажи;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	ТаблицаПоТоварамПродажи = ТаблицаПоТоварам.Скопировать();
	ТаблицаПоТоварамПродажи.Колонки.НДС.Имя = "НДСРегл";
    ТаблицаПоТоварамПродажи.Колонки.НДСУпр.Имя = "НДС";

	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
		УправлениеПроектами.ОтразитьДвиженияПоПроектам(ТаблицаПоТоварамПродажи, ТаблицаДвижений, Проект, Дата, "Продажи");
	Иначе
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамПродажи, ТаблицаДвижений);
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка       , "ДокументПродажи");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация  , "Организация");

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.Продажи.ВыполнитьДвижения();
	КонецЕсли;

	// ПО РЕГИСТРУ ПродажиПоДисконтнымКартам.
	НаборДвижений = Движения.ПродажиПоДисконтнымКартам;

	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродажамПоДисконтнымКартам, ТаблицаДвижений);
	

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		НаборДвижений.ВыполнитьДвижения();
	КонецЕсли;
	
	// По регистрам взаиморасчетов отражаются безналичные расчеты
	Если ЕстьБезналичныеРасчеты Тогда
	
		НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыСКонтрагентами;
		ТаблицаВзаиморасчеты      = НаборЗаписейВзаиморасчеты.ВыгрузитьКолонки();
		НаборЗаписейРасчеты       = Движения.РасчетыСКонтрагентами;
		ТаблицаРасчеты            = НаборЗаписейРасчеты.ВыгрузитьКолонки();
	
		// Взаиморасчеты с эквайрером
		
		СуммаВзаиморасчетовПоКартам = ТаблицаПоПлатежнымКартам.Итог("Сумма");
		
		Если СуммаВзаиморасчетовПоКартам <> 0 Тогда
			
			СуммаУпрПоКартам = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
				СуммаВзаиморасчетовПоКартам, 
				мВалютаРегламентированногоУчета, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
				1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,	
				1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаВзаиморасчеты = ТаблицаВзаиморасчеты.Добавить();
			
			СтрокаВзаиморасчеты.ДоговорКонтрагента  = ДоговорВзаиморасчетовЭквайрера;
			СтрокаВзаиморасчеты.Контрагент          = Эквайрер;
			СтрокаВзаиморасчеты.Организация         = Организация;
			СтрокаВзаиморасчеты.Сделка              = Неопределено;
			СтрокаВзаиморасчеты.СуммаВзаиморасчетов = СуммаВзаиморасчетовПоКартам;
			СтрокаВзаиморасчеты.СуммаУпр            = СуммаУпрПоКартам;
			
			СтрокаРасчеты = ТаблицаРасчеты.Добавить();
			
			СтрокаРасчеты.ДоговорКонтрагента  = ДоговорВзаиморасчетовЭквайрера;
			СтрокаРасчеты.Контрагент  		  = Эквайрер;
			СтрокаРасчеты.Организация  	      = Организация;
			СтрокаРасчеты.Сделка              = Неопределено;
			СтрокаРасчеты.РасчетыВозврат      = Перечисления.РасчетыВозврат.Расчеты;
			СтрокаРасчеты.СуммаВзаиморасчетов = СуммаВзаиморасчетовПоКартам;
			СтрокаРасчеты.СуммаУпр            = СуммаУпрПоКартам;
			
		КонецЕсли;
		
		// Взаиморасчеты с банками по кредитам
		
		Для каждого СтрокаКредита Из ТаблицаПоБанковскимКредитам Цикл
		
			СуммаУпрПоКредиту = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
				СтрокаКредита.Сумма, 
				мВалютаРегламентированногоУчета, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
				1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,	
				1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаВзаиморасчеты = ТаблицаВзаиморасчеты.Добавить();
			
			СтрокаВзаиморасчеты.ДоговорКонтрагента  = СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора;
			СтрокаВзаиморасчеты.Контрагент          = СтрокаКредита.БанкКредитор;
			СтрокаВзаиморасчеты.Организация         = Организация;
			СтрокаВзаиморасчеты.Сделка              = Неопределено;
			СтрокаВзаиморасчеты.СуммаВзаиморасчетов = СтрокаКредита.Сумма;
			СтрокаВзаиморасчеты.СуммаУпр            = СуммаУпрПоКредиту;
			
			СтрокаРасчеты = ТаблицаРасчеты.Добавить();
			
			СтрокаРасчеты.ДоговорКонтрагента  = СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора;
			СтрокаРасчеты.Контрагент  		  = СтрокаКредита.БанкКредитор;
			СтрокаРасчеты.Организация  	      = Организация;
			СтрокаРасчеты.Сделка              = Неопределено;
			СтрокаРасчеты.РасчетыВозврат      = Перечисления.РасчетыВозврат.Расчеты;
			СтрокаРасчеты.СуммаВзаиморасчетов = СтрокаКредита.Сумма;
			СтрокаРасчеты.СуммаУпр            = СуммаУпрПоКредиту;
			
		КонецЦикла;
			
		НаборЗаписейВзаиморасчеты.мПериод            = Дата;
		НаборЗаписейВзаиморасчеты.мТаблицаДвижений   = ТаблицаВзаиморасчеты;
			
		Если Не Отказ Тогда
			НаборЗаписейВзаиморасчеты.ВыполнитьПриход();
		КонецЕсли;
			
		НаборЗаписейРасчеты.мПериод            = Дата;
		НаборЗаписейРасчеты.мТаблицаДвижений   = ТаблицаРасчеты;
			
		Если Не Отказ Тогда
			НаборЗаписейРасчеты.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ СкидкиСПродаж.

	НаборДвижений = Движения.ПредоставленныеСкидки;

	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоСкидкам, ТаблицаДвижений);

	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"ДокументСкидки");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ПредоставленныеСкидки.ВыполнитьДвижения();
	КонецЕсли;
	
	ТаблицаПоУслугам = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам,
	                           Новый Структура("Услуга", Истина)).Выгрузить();
	
	// Учет реализованных услуг без применения плановых цен 
	ДвиженияПоРегиструРеализацияУслугУпр(СтруктураШапкиДокумента, Дата, ТаблицаПоУслугам);
	
КонецПроцедуры

Процедура ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварамБезУслуг, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда

		Возврат;
		
	КонецЕсли;

	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамБезУслуг, ТаблицаДвижений);

	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам)

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, 		"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция, 		"ДопустимыйСтатус2");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.НаКомиссию,		"ДопустимыйСтатус3");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ДопустимыйСтатус4");

	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	
	// Данные для заполнения отчетов комитенту
	ТаблицаДвижений.ЗаполнитьЗначения(мВалютаРегламентированногоУчета, "ВалютаДокумента");
	ТаблицаДвижений.ЗаполнитьЗначения(1, "КурсДокумента");
	ТаблицаДвижений.ЗаполнитьЗначения(1, "КратностьДокумента");
			
	Для каждого Строка Из ТаблицаДвижений Цикл
		
		СтрокаТЧ = ТаблицаПоТоварам.Получить(ТаблицаДвижений.Индекс(Строка));
		Строка.СуммаЗадолженности   = СтрокаТЧ.СуммаСНДСДок;
	КонецЦикла;

КонецПроцедуры 

Процедура ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварамБезУслуг, Отказ, Заголовок) Экспорт
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.

	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамБезУслуг, ТаблицаДвижений);
	
	// Если ПУ по складам не ведется - очищаем
	Если НЕ СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Склад");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
    ТаблицаДвижений.ЗаполнитьЗначения(0,   "НомерСтроки");
	
	ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварамБезУслуг);
	
	// Свернем таблицу движений, просуммировав колонки "Количество" и "СуммаЗадолженности"
	// После этого, по одному товару/характеристике/...  будет только продажа либо только возврат
	КолонкиСуммирования = "Количество|СуммаЗадолженности";
	КолонкиГруппировок = "";
	Для каждого Колонка Из ТаблицаДвижений.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если Найти("|" +КолонкиСуммирования+ "|", "|" +ИмяКолонки+ "|") > 0 Тогда
			// эта колонка входит в список колонок суммирования
			Продолжить
		КонецЕсли;
		КолонкиГруппировок = КолонкиГруппировок + "," + ИмяКолонки;
	КонецЦикла;
	// заменим символ-разделитель на запятую
	КолонкиСуммирования = СтрЗаменить(КолонкиСуммирования, "|", ",");
	// удалим лишнюю запятую в списке колонок группировок
	КолонкиГруппировок = Прав(КолонкиГруппировок, СтрДлина(КолонкиГруппировок) - 1);
	
	ТаблицаДвижений.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	// удалим строки с нулевым количеством
	Сч = 0;
	Пока Сч < ТаблицаДвижений.Количество() Цикл
		СтрокаТаблицы = ТаблицаДвижений.Получить(Сч);
		Если СтрокаТаблицы.Количество = 0 Тогда
			 ТаблицаДвижений.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;

	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Товары;
	КонецЦикла;
	
	// Код операции
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.РеализацияРозница, "КодОперацииПартииТоваров");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И ЗначениеЗаполнено(Проект) Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Проект,"Проект");
	КонецЕсли;
	
	// Документ может содержать возвраты - движения с -. Они имеют код "Возврат"
	Для каждого Строка Из ТаблицаДвижений Цикл
		
		Если Строка.Количество<0 Тогда
			Строка.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя;
			Строка.Количество = - Строка.Количество;
		КонецЕсли;
		
	КонецЦикла;

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;

	Если Движения.СписанныеТовары.Модифицированность() Тогда
	    Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоКомплектам, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, Отказ, Заголовок)

	// Формирование бухгалтерских проводок
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;

	// Формирование бухгалтерских проводок

	// По некоторым регистрам услуги проводить не нужно.
	// Подготовим отдельную таблицу. В таблице комплектов услуг нет
	ТаблицаПоТоварамБезУслугИВозвратов = ТаблицаПоКомплектам.Скопировать();
	Индекс = 0;

	Пока Индекс < ТаблицаПоТоварамБезУслугИВозвратов.Количество() Цикл

		СтрокаТаблицы = ТаблицаПоТоварамБезУслугИВозвратов.Получить(Индекс);

		Если СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
			ТаблицаПоТоварамБезУслугИВозвратов.Удалить(СтрокаТаблицы);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;

	КонецЦикла;
	
	ТаблицаПоУслугам = ТаблицаПоТоварам.Скопировать();
	Индекс = 0;
	Пока Индекс < ТаблицаПоУслугам.Количество() Цикл

		СтрокаТаблицы = ТаблицаПоУслугам.Получить(Индекс);

		Если СтрокаТаблицы.Услуга Тогда
			Индекс = Индекс + 1;
		Иначе
			ТаблицаПоУслугам.Удалить(СтрокаТаблицы);
		КонецЕсли;

	КонецЦикла;

	// Списание товаров по партиям со склада.
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварамБезУслугИВозвратов, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ);	
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда

		УправлениеРозничнойТорговлей.ПереоценкаСписанияСРозничногоСкладаБухгалтерскийУчет(ЭтотОбъект, СтруктураШапкиДокумента, ТаблицаПоТоварамБезУслугИВозвратов);
		
	КонецЕсли;

	//Обработка возврата для тех строк, в которых отрицательное количество
	// для корректной обработки возврата в ту же кассовую смену.
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	Движения.Хозрасчетный.Записать();
	ВозвратПартийТоваров(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);

	ПроводкиБУ   = Движения.Хозрасчетный;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДока     = Дата;
	
	СчетОтраженияДоходов       		= СтруктураШапкиДокумента.СчетДоходовРозничныхПродаж;
	СчетОтраженияВычетаИзДоходов   	= СтруктураШапкиДокумента.СчетВычетаИзДоходовРозничныхПродаж;
	
	/////////////////////////////////////////////////////////////////////
	// Записи по выручке.
	
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
			
		// Выручка
		СуммаВыручки 	= СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
		Если СуммаВыручки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
		
			Проводка = ПроводкиБУ.Добавить();
				
			Проводка.Период          = Дата;
			Проводка.Активность      = Истина;
			Проводка.Организация     = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма           = СуммаВыручки;
			Проводка.Содержание      = "Доход от продаж в рознице";
			Проводка.НомерЖурнала    = "";
				
			Проводка.СчетКт         = СтрокаТаблицы.СчетДоходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.СубконтоДоходовБУ1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.СубконтоДоходовБУ2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.СубконтоДоходовБУ3);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы", СтрокаТаблицы.НоменклатурнаяГруппа);
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.НалоговоеНазначениеКт = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУКт = СуммаВыручки;
			КонецЕсли;
			
			Проводка.СчетДт          = СчетОтраженияДоходов;
			// Попытаемся установить субконто "Статья доходов" для транзитного счета 709х
			Если НЕ (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов, "ВидСубконто") = Неопределено) И
				 НЕ (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов, "ВидСубконто") = Неопределено) Тогда
				   
			   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов", Проводка.СубконтоКт.СтатьиДоходов);
				
		   	КонецЕсли; 

		Иначе
			
			Проводка = ПроводкиБУ.Добавить();
				
			Проводка.Период          = Дата;
			Проводка.Активность      = Истина;
			Проводка.Организация     = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма           = - СуммаВыручки;
			Проводка.Содержание      = "Вычет из доходов от продаж в рознице (возврат)";
			Проводка.НомерЖурнала    = "";
				
			Проводка.СчетДт         = СтрокаТаблицы.СчетВычетовИзДоходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.СубконтоВычетовИзДоходовБУ1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.СубконтоВычетовИзДоходовБУ2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.СубконтоВычетовИзДоходовБУ3);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТаблицы.НоменклатурнаяГруппа);
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = - СуммаВыручки;
			КонецЕсли;
			
			Проводка.СчетКт          = СчетОтраженияВычетаИзДоходов;
			// Попытаемся установить субконто "Статья доходов" для транзитного счета 709х
			Если НЕ (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов, "ВидСубконто") = Неопределено) И
				 НЕ (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов, "ВидСубконто") = Неопределено) Тогда
				   
			   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", Проводка.СубконтоДт.СтатьиДоходов);
				
		   КонецЕсли;

		КонецЕсли; 
			
	КонецЦикла;	
	
	// Учет реализованных услуг
	ДвиженияПоРегиструРеализацияУслуг(СтруктураШапкиДокумента, ДатаДока, ТаблицаПоУслугам);
	
	// Дополнительные проводки при наличии безналичных оплат
    ДвиженияПоРаспределениюОплат(СтруктураШапкиДокумента, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРаспределениюОплат(СтруктураШапкиДокумента, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, Отказ, Заголовок)
    
    Если НЕ ЕстьБезналичныеРасчеты Тогда
    	Возврат;
    КонецЕсли;
    
    // Убираем проводки по безналу
    // Делаем распределение наличных по типам оплаты. 
    // Вся сумма розничной выручки уже есть на соответствующем счету.
    // Для безнала и кредита списываем суммы со счета розничной выручки.
    
    ПроводкиБУ   = Движения.Хозрасчетный;
    ДатаДока     = Дата;
    
    // Взаиморасчеты с эквайрером
    
    СуммаПродажПоКартам = ТаблицаПоПлатежнымКартам.Итог("Сумма");
    	
    Если СуммаПродажПоКартам <> 0 Тогда
    		
    	Проводка = ПроводкиБУ.Добавить();
    	
        Проводка.Период      = ДатаДока;
    	Проводка.Организация = СтруктураШапкиДокумента.Организация;
    	Проводка.Сумма       = СуммаПродажПоКартам;
    	Проводка.Содержание  = "Оплата платежными картами";
    	
    	Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаРасчетовСЭквайрером;
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Эквайрер);
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДоговорВзаиморасчетовЭквайрера);
        
        Проводка.СчетКт       =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
    	
    КонецЕсли;
    	
    // Взаиморасчеты с банками по кредитам
    	
    Для каждого СтрокаКредита Из ТаблицаПоБанковскимКредитам Цикл
    	
    	Проводка = ПроводкиБУ.Добавить();
    	
        Проводка.Период      = ДатаДока;
    	Проводка.Организация = СтруктураШапкиДокумента.Организация;
    	Проводка.Сумма       = СтрокаКредита.Сумма;
    	Проводка.Содержание  = "Оплата банковским кредитом";
    	
    	Проводка.СчетДт = СтрокаКредита.СчетУчетаРасчетовСКонтрагентом;
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаКредита.БанкКредитор);
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора);
        
        Проводка.СчетКт       =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
        
    КонецЦикла;

КонецПроцедуры

Процедура ДвиженияПоРегиструРеализацияУслуг(СтруктураШапкиДокумента, ДатаДока, ТаблицаПоУслугам)
	

	Если НЕ СтруктураШапкиДокумента.РазрешитьУчетУслугБезПлановыхЦен Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтатьяЗатрат = Тип("СправочникСсылка.СтатьиЗатрат");
	
	ДвиженияРеализацияУслуг = Движения["РеализацияУслуг"];
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		СтрокаДвижения                       = ДвиженияРеализацияУслуг.Добавить();
		СтрокаДвижения.Период                = ДатаДока;
		СтрокаДвижения.Организация           = СтруктураШапкиДокумента.Организация;
		СтрокаДвижения.СчетРасходов          = СтрокаТаблицы.КорСчетСписанияБУ;
		СтрокаДвижения.НоменклатурнаяГруппа  = СтрокаТаблицы.НоменклатурнаяГруппа;
		СтрокаДвижения.Сумма                 = СтрокаТаблицы.СуммаБезНДСРегл;
		
		СтрокаДвижения.НалоговоеНазначениеДоходовИЗатрат  = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
		
		ЕстьСтатьяЗатрат = Ложь;
		Для Н = 1 По 3 Цикл
			Если ТипЗнч(СтрокаТаблицы["КорСубконтоСписанияБУ" + Н]) = ТипСтатьяЗатрат Тогда
				ЕстьСтатьяЗатрат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьСтатьяЗатрат = Истина Тогда
			СтрокаДвижения.СтатьяЗатрат = СтрокаТаблицы["КорСубконтоСписанияБУ" + Н];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструРеализацияУслугУпр(СтруктураШапкиДокумента, ДатаДока, ТаблицаПоУслугам)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.РазрешитьУчетУслугБезПлановыхЦенУпр Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРеализацияУслуг = Движения["РеализацияУслугУправленческийУчет"];
	
	// ЗаказРеализацияУслуг = УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,,Истина);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		СтрокаДвижения                       = ДвиженияРеализацияУслуг.Добавить();
		СтрокаДвижения.Период                = ДатаДока;
		СтрокаДвижения.НоменклатурнаяГруппа  = СтрокаТаблицы.НоменклатурнаяГруппа;
		СтрокаДвижения.Номенклатура			 = СтрокаТаблицы.Номенклатура;
		СтрокаДвижения.Подразделение		 = СтруктураШапкиДокумента.Подразделение;
		// СтрокаДвижения.ЗаказПокупателя		 = ЗаказРеализацияУслуг;
		СтрокаДвижения.ДокументПродажи		 = Ссылка;
		СтрокаДвижения.Сумма                 = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
		СтрокаДвижения.НДС					 = СтрокаТаблицы.НДСУпр;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияРегистраОперативныхРасчетов(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// По регистру ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов (взаиморасчеты с эквайрером).
	Если НЕ СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСЭквайрером Тогда
		Возврат;
	КонецЕсли;

	СуммаВзаиморасчетов = ОплатаПлатежнымиКартами.Итог("Сумма");

	Если СуммаВзаиморасчетов <> 0 Тогда
		
		Движение = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		
		Движение.ДоговорКонтрагента            = ДоговорВзаиморасчетовЭквайрера;
		Движение.Контрагент            		   = Эквайрер;
		Движение.Организация            	   = Организация;

		Движение.Сделка                        = Неопределено;
		Движение.ДокументРасчетовСКонтрагентом = Ссылка;
		Движение.ВидРасчетовСКонтрагентом      = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
		
		Движение.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
		
	КонецЕсли;
	
КонецПроцедуры

// Формируются проводки по отражаению возврата товаров
// 
Процедура ВозвратПартийТоваров(СтруктураШапкиДокумента, ТаблицаПоТоварамПараметр, Отказ, Заголовок)
	
	Перем ТаблицаПоТоварам;
	
	ТаблицаПоТоварам = ТаблицаПоТоварамПараметр.Скопировать();
	
	// нужно оставить только строки с возвратами. 
	УдаляемыеСтроки = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
		Если СтрокаТаблицы.Количество > 0 Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		Иначе
			СтрокаТаблицы.Количество = - СтрокаТаблицы.Количество;
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаТаблицы Из УдаляемыеСтроки Цикл
		ТаблицаПоТоварам.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	Если ТаблицаПоТоварам.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	
	// Теперь собственно проводим
	ПроводкиБУ = Движения.Хозрасчетный;
	
	ДатаДока = Дата;
	
	ТаблицаПоТоварам.Колонки.Добавить("СписанныеПартииБУ");
	
	//Установим управляемые блокировки
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		//Установим блокировку на движения регистратора
		СтруктураПараметров = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрБухгалтерии", "Хозрасчетный.НаборЗаписей");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Регистратор", Ссылка);
		
		СтруктураПараметров.Вставить("ИсточникДанных", ТаблицаПоТоварам);
		ОписаниеИсточника = Новый Соответствие;
		ОписаниеИсточника.Вставить("Регистратор", "ДокументПродажи");
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметров, ЗначенияБлокировки, ОписаниеИсточника);
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл
		
		СкладПроводок = СтрокаТЧ.Склад;
		
		ТаблицаВозвращенныхПартий =   СформироватьТаблицуВозвращенныхПартийБух(СтрокаТЧ.СчетУчетаБУ,
		                                                                    СтрокаТЧ.Номенклатура,
		                                                                    СтрокаТЧ.НалоговоеНазначение,
																			СтрокаТЧ.НоменклатурнаяПозиция,
		                                                                    ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументПродажи), СтрокаТЧ.ДокументПродажи, Ссылка),
		                                                                    СтрокаТЧ.Количество,
		                                                                    Отказ, Заголовок);
		СтрокаТЧ.СписанныеПартииБУ = ТаблицаВозвращенныхПартий;
		
		Если Не Отказ Тогда
			
			Если СтрокаТЧ.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				НеПогашеннаяСтоимость = - СтрокаТЧ.СуммаПродажная;
			КонецЕсли;
			
			Для каждого Партия Из ТаблицаВозвращенныхПартий Цикл
				
				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период       = ДатаДока;
				Проводка.Активность   = Истина;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание   = "Возврат товаров от покупателя";
				Проводка.Сумма        = - Партия.СуммаСписания;
				
				Если НЕ УправлениеЗапасамиПартионныйУчет.КомиссионныйТовар(СтрокаТЧ.СчетУчетаБУ) Тогда
					Проводка.СчетДт       = СтрокаТЧ.СчетВычетовИзРасходовБУ;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоВычетовИзРасходовБУ1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоВычетовИзРасходовБУ2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоВычетовИзРасходовБУ3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
					
					Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
						Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат;
						Проводка.СуммаНУДт = - Партия.СуммаСписанияНУ;
					КонецЕсли;
					
				КонецЕсли;
				
				Проводка.СчетКт       = СтрокаТЧ.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Склады",       СкладПроводок);
				Если (ПартионныйУчетБУ) ИЛИ (УправлениеЗапасамиПартионныйУчет.КомиссионныйТовар(СтрокаТЧ.СчетУчетаБУ)) Тогда 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Партии",       Партия.Партия);
				КонецЕсли;	
				
				Проводка.КоличествоКт = -Партия.Количество;
				
				Проводка.НалоговоеНазначениеКт = СтрокаТЧ.НалоговоеНазначение;				
				Проводка.СуммаНУКт = - Партия.СуммаСписанияНУ;				
				
				// Возможно, нужно откорректировать наценку
				Если СтрокаТЧ.ВидСклада = Перечисления.ВидыСкладов.Розничный
					И НЕ УправлениеЗапасамиПартионныйУчет.КомиссионныйТовар(СтрокаТЧ.СчетУчетаБУ) Тогда
					
					Если ТаблицаВозвращенныхПартий.Количество() - 1 = ТаблицаВозвращенныхПартий.Индекс(Партия) Тогда
						// последняя партия
						СтоимостьВПродажныхЦенах = НеПогашеннаяСтоимость;
					Иначе						
						СтоимостьВПродажныхЦенах = - (Партия.Количество/СтрокаТЧ.Количество)*СтрокаТЧ.СуммаПродажная;
					КонецЕсли; 
					
					
					Если    (СтоимостьВПродажныхЦенах - Партия.СуммаСписания  <> 0)
						ИЛИ ((СтоимостьВПродажныхЦенах - Партия.СуммаСписанияНУ  <> 0) И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль) Тогда
						// нужно начислить наценку
						Проводка = ПроводкиБУ.Добавить();
						
						Проводка.Период       = ДатаДока;
						Проводка.Активность   = Истина;
						Проводка.Организация  = СтруктураШапкиДокумента.Организация;
						Проводка.Содержание   = "Начисление наценки";
						Проводка.Сумма        = СтоимостьВПродажныхЦенах - Партия.СуммаСписания;
						
						Проводка.СчетДт       = СтрокаТЧ.СчетУчетаБУ;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, "Номенклатура", СтрокаТЧ.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, "Склады",       СкладПроводок);
						Если (ПартионныйУчетБУ) Тогда 
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, "Партии",       Партия.Партия);
						КонецЕсли;
					
						Проводка.СчетКт       = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Склады",       СкладПроводок);
						Если (ПартионныйУчетБУ) Тогда 
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, "Партии",       Партия.Партия);
						КонецЕсли;
						
						Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = СтрокаТЧ.НалоговоеНазначение;
						Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
							Проводка.СуммаНУДт = СтоимостьВПродажныхЦенах - Партия.СуммаСписанияНУ;
							Проводка.СуммаНУКт = СтоимостьВПродажныхЦенах - Партия.СуммаСписанияНУ;
						КонецЕсли;
						
					КонецЕсли; 
					
					Если СтрокаТЧ.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
						НеПогашеннаяСтоимость = НеПогашеннаяСтоимость - СтоимостьВПродажныхЦенах;
					КонецЕсли;
					
				КонецЕсли; 
					
			КонецЦикла; // Для каждого Партия Из ТаблицаВозвращенныхПартий Цикл
			
		КонецЕсли; // Если Не Отказ Тогда
		
	КонецЦикла; // Для Каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл
	
Конецпроцедуры

// На основании указанного в строке документа реализации
// подбираются партии, по которым будет отражать возврат.
// Сформированная таблица партий возвращается.
//
Функция СформироватьТаблицуВозвращенныхПартийБух(СчетУчета, Номенклатура, НалоговоеНазначение, НоменклатурнаяПозиция, ДокументОтгрузки, ВозвратКоличество, Отказ, Заголовок)
	
	ТаблицаВозвращенныхПартий = Новый ТаблицаЗначений;
	ТаблицаВозвращенныхПартий.Колонки.Добавить("Партия");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("Количество");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("СуммаСписания");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("СуммаСписанияНУ");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("Комиссионный");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("НоменклатурнаяПозиция");
	ТаблицаВозвращенныхПартий.Колонки.Добавить("СчетУчетаБУ");
	
	МассивВидовСубконто = Новый Массив;
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(СчетУчета) Тогда
		МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;
	
	Если ВестиУчетПоДопРазрезамРегл	Тогда
		МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции);
		Если УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(СчетУчета) Тогда
			ФильтрПоНоменклатурнойПозиции = " И СубконтоКт3 = &НоменклатурнаяПозиция";
		Иначе
			ФильтрПоНоменклатурнойПозиции = " И СубконтоКт2 = &НоменклатурнаяПозиция";
		КонецЕсли;						
	Иначе
		ФильтрПоНоменклатурнойПозиции = "";
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Регистратор",  ДокументОтгрузки);
	Запрос.УстановитьПараметр("СчетУчета",    СчетУчета);
	Запрос.УстановитьПараметр("Товар",        Номенклатура);
	Запрос.УстановитьПараметр("НалоговоеНазначение",        НалоговоеНазначение);
	Запрос.УстановитьПараметр("ВидыСубконто", МассивВидовСубконто);
	Запрос.УстановитьПараметр("НоменклатурнаяПозиция", НоменклатурнаяПозиция);
	
	Если УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(СчетУчета) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ОборотыДтКт.СубконтоКт2 КАК Партия,
		|	ОборотыДтКт.СуммаОборот КАК Сумма,
		|	ОборотыДтКт.СуммаНУОборотКт КАК СуммаНУ,
		|	ОборотыДтКт.КоличествоОборотКт КАК Количество
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , , СчетКт = &СчетУчета, &ВидыСубконто, СубконтоКт1 = &Товар И НалоговоеНазначениеКт = &НалоговоеНазначение"+ФильтрПоНоменклатурнойПозиции+") КАК ОборотыДтКт
		|
		|ГДЕ
		|	ОборотыДтКт.Регистратор = &Регистратор И
		|  (ОборотыДтКт.КоличествоОборотКт >= 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
		|	NULL КАК Партия,
		|	ОборотыДтКт.СуммаОборот КАК Сумма,
		|	ОборотыДтКт.СуммаНУОборотКт КАК СуммаНУ,
		|	ОборотыДтКт.КоличествоОборотКт КАК Количество
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , , СчетКт = &СчетУчета, &ВидыСубконто, СубконтоКт1 = &Товар И НалоговоеНазначениеКт = &НалоговоеНазначение"+ФильтрПоНоменклатурнойПозиции+") КАК ОборотыДтКт
		|
		|ГДЕ
		|	ОборотыДтКт.Регистратор = &Регистратор И
		|	(ОборотыДтКт.КоличествоОборотКт >= 0)
		|";
		
	КонецЕсли;
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Свернуть("Партия","Сумма,СуммаНУ,Количество");
	ТаблицаДанных.Сортировать("Количество Убыв");
	
	КоличествоНеПодобраноПартии = ВозвратКоличество;
	
	// Подберем партии, по которым отразим возврат
	Для каждого Партия Из ТаблицаДанных Цикл
		
		НоваяСтрока = ТаблицаВозвращенныхПартий.Добавить();
		НоваяСтрока.Партия = Партия.Партия;
		
		Если КоличествоНеПодобраноПартии > Партия.Количество Тогда
			
			НоваяСтрока.СуммаСписания 	= Партия.Сумма;
			НоваяСтрока.СуммаСписанияНУ = Партия.СуммаНУ;
			НоваяСтрока.Количество    	= Партия.Количество;
			КоличествоНеПодобраноПартии = КоличествоНеПодобраноПартии - Партия.Количество;
			
		Иначе
			
			НоваяСтрока.СуммаСписания 	= Окр(Партия.Сумма * (КоличествоНеПодобраноПартии / Партия.Количество), 2);
			НоваяСтрока.СуммаСписанияНУ = Окр(Партия.СуммаНУ * (КоличествоНеПодобраноПартии / Партия.Количество), 2);
			НоваяСтрока.Количество    	= КоличествоНеПодобраноПартии;
			КоличествоНеПодобраноПартии = 0;
			
		КонецЕсли;
		
		// Если подоброны партии для всего объема товара, то выходим из цикла
		Если КоличествоНеПодобраноПартии = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если в документе указан документ реалазации по которому было отгружено больше,
	// чем возвращается, то эту разницу отнесем на пустую партию.
	Если КоличествоНеПодобраноПартии > 0 Тогда
		
		СообщенияОбОшибке = Локализация.СтрШаблон1("Бух. учет. Документом ¤1¤ было реализовано ¤2¤ на ¤3¤ ед. меньше, чем возвращается.", СокрЛП(ДокументОтгрузки), Номенклатура, КоличествоНеПодобраноПартии);
		ОбщегоНазначения.ОшибкаПриПроведении(СообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
	Комиссионный = УправлениеЗапасамиПартионныйУчет.КомиссионныйТовар(СчетУчета);
	ТаблицаВозвращенныхПартий.ЗаполнитьЗначения(Комиссионный, "Комиссионный");
	ТаблицаВозвращенныхПартий.ЗаполнитьЗначения(СчетУчета, 	  "СчетУчетаБУ");
	ТаблицаВозвращенныхПартий.ЗаполнитьЗначения(НоменклатурнаяПозиция, 	  "НоменклатурнаяПозиция");
	
	Возврат ТаблицаВозвращенныхПартий;
	
КонецФункции // СформироватьТаблицуВозвращенныхПартий()

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
		
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Для определения где нужно проверять склад: в шапке или в ТЧ.
	СтруктураШапкиДокумента.Вставить("СкладВТабличнойЧасти",  мУказаниеСкладовВТЧ);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",                      "ВалютаУправленческогоУчета",                 "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",                      "КурсВалютыУправленческогоУчета",             "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",                "ВестиПартионныйУчетПоСкладам",               "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад",                          "ВидСклада",                                  "ВидСклада");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",                "ВедениеУчетаПоПроектам",                     "ВедениеУчетаПоПроектам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорВзаиморасчетовЭквайрера", "ВалютаВзаиморасчетов",                       "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",                "ВедениеУчетаПоПроектам",                     "ВедениеУчетаПоПроектам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад",           "СуммовойУчет",                   "СуммоваяРозница");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	СтруктураШапкиДокумента.Вставить("ВестиПоДокументамРасчетовСЭквайрером", ДоговорВзаиморасчетовЭквайрера.ВестиПоДокументамРасчетовСКонтрагентом);
	
	СтруктураШапкиДокумента.Вставить("ВалютаДокумента", мВалютаРегламентированногоУчета);
	
	// Для определения где нужно проверять склад: в шапке или в ТЧ.
	УказаниеСкладов = Константы.УказаниеСкладовВТабличнойЧастиДокументов.Получить();
	СкладВТабличнойЧасти =    (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
		                  Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации);
	СтруктураШапкиДокумента.Вставить("СкладВТабличнойЧасти", СкладВТабличнойЧасти);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, ТаблицаПоПродажамПоДисконтнымКартам) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Склад"                            , "Склад");
	СтруктураПолей.Вставить("ВидСклада"                        , "Склад.ВидСклада");
	СтруктураПолей.Вставить("Номенклатура"                     , "Номенклатура");
	СтруктураПолей.Вставить("Услуга"                           , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                            , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                         , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"             , "Номенклатура.НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Количество"                       , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("КоличествоДок"                    , "Количество");
	СтруктураПолей.Вставить("Цена"                             , "Цена");
	СтруктураПолей.Вставить("Сумма"                            , "Сумма");
	СтруктураПолей.Вставить("СуммаДок"                         , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                        , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                              , "СуммаНДС");
	СтруктураПолей.Вставить("НДСДок"                           , "СуммаНДС");
	СтруктураПолей.Вставить("НомерСтроки"                      , "НомерСтроки");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"       , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"                , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"             , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоматическихСкидок"      , "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("УсловиеАвтоматическойСкидки"      , "УсловиеАвтоматическойСкидки");
	СтруктураПолей.Вставить("ЗначениеУсловияАвтоматическойСкидки", "ЗначениеУсловияАвтоматическойСкидки");
	СтруктураПолей.Вставить("КлючСтроки"                       , "КлючСтроки");
	СтруктураПолей.Вставить("ТипНоменклатуры", "Номенклатура.ВидНоменклатуры.ТипНоменклатуры");
	СтруктураПолей.Вставить("КоличествоВЕдиницахДокумента"     , "Количество");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                 , "ЕдиницаИзмерения");
	
	СтруктураСложныхПолей = Новый Структура;
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей = Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		СтруктураСложныхПолей.Вставить("ЦенаВРознице" , "ВЫБОР	КОГДА Номенклатура.ЕдиницаХраненияОстатков.Коэффициент = 0.00 ТОГДА 0.00 ИНАЧЕ Цена / Коэффициент * Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КОНЕЦ");
	КонецЕсли;
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"            , "НоменклатурнаяПозиция");
	СтруктураПолей.Вставить("СуммоваяРозница"				   , "Склад.СуммовойУчет");
	СтруктураПолей.Вставить("ЦенаНТТ"                          , "Цена * Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Коэффициент");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"  			   , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("ДокументПродажи"              , "ДокументПродажи");
	СтруктураПолей.Вставить("СчетУчетаБУ",          "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаБУЗабалансовый", "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("СхемаРеализации"				   , "СхемаРеализации");
	СтруктураПолей.Вставить("СчетДоходовБУ"                    , "СхемаРеализации.СчетДоходов");
	СтруктураПолей.Вставить("СубконтоДоходовБУ1"               , "СхемаРеализации.СубконтоДоходов1");
	СтруктураПолей.Вставить("СубконтоДоходовБУ2"               , "СхемаРеализации.СубконтоДоходов2");
	СтруктураПолей.Вставить("СубконтоДоходовБУ3"               , "СхемаРеализации.СубконтоДоходов3");
	СтруктураПолей.Вставить("СчетВычетовИзДоходовБУ"           , "СхемаРеализации.СчетВычетовИзДоходов");
	СтруктураПолей.Вставить("СубконтоВычетовИзДоходовБУ1"      , "СхемаРеализации.СубконтоВычетовИзДоходов1");
	СтруктураПолей.Вставить("СубконтоВычетовИзДоходовБУ2"      , "СхемаРеализации.СубконтоВычетовИзДоходов2");
	СтруктураПолей.Вставить("СубконтоВычетовИзДоходовБУ3"      , "СхемаРеализации.СубконтоВычетовИзДоходов3");
	СтруктураПолей.Вставить("СчетРасходовБУ"                   , "СхемаРеализации.СчетСебестоимости");
	СтруктураПолей.Вставить("СубконтоРасходовБУ1"              , "СхемаРеализации.СубконтоСебестоимости1");
	СтруктураПолей.Вставить("СубконтоРасходовБУ2"              , "СхемаРеализации.СубконтоСебестоимости2");
	СтруктураПолей.Вставить("СубконтоРасходовБУ3"              , "СхемаРеализации.СубконтоСебестоимости3");
	СтруктураПолей.Вставить("СчетВычетовИзРасходовБУ"          , "СхемаРеализации.СчетСебестоимостиПриВозврате");
	СтруктураПолей.Вставить("СубконтоВычетовИзРасходовБУ1"     , "СхемаРеализации.СубконтоСебестоимостиПриВозврате1");
	СтруктураПолей.Вставить("СубконтоВычетовИзРасходовБУ2"     , "СхемаРеализации.СубконтоСебестоимостиПриВозврате2");
	СтруктураПолей.Вставить("СубконтоВычетовИзРасходовБУ3"     , "СхемаРеализации.СубконтоСебестоимостиПриВозврате3");
	СтруктураПолей.Вставить("НалоговоеНазначение"     		   , "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     		   , "НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат", "НалоговоеНазначениеДоходовИЗатрат");

	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей,СтруктураСложныхПолей);

	ПогрешностиОкругления = Новый Соответствие;
	
	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления);

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ВидОплаты", "ВидОплаты");
	СтруктураПолей.Вставить("ТипОплаты", "ВидОплаты.ТипОплаты");
	СтруктураПолей.Вставить("Сумма"    , "Сумма");

	ТаблицаПоПлатежнымКартам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОплатаПлатежнымиКартами", СтруктураПолей).Выгрузить();
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ВидОплаты"                          , "ВидОплаты");
	СтруктураПолей.Вставить("ТипОплаты"                          , "ВидОплаты.ТипОплаты");
	СтруктураПолей.Вставить("Сумма"                              , "Сумма");
	СтруктураПолей.Вставить("БанкКредитор"                       , "БанкКредитор");
	СтруктураПолей.Вставить("ДоговорВзаиморасчетовБанкаКредитора", "ДоговорВзаиморасчетовБанкаКредитора");
	СтруктураПолей.Вставить("Организация"                        , "ДоговорВзаиморасчетовБанкаКредитора.Организация");
	СтруктураПолей.Вставить("СуммаБанковскойКомиссии"            , "СуммаБанковскойКомиссии");
	СтруктураПолей.Вставить("СчетУчетаРасчетовСКонтрагентом"	 , "СчетУчетаРасчетовСКонтрагентом");

	ТаблицаПоБанковскимКредитам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОплатаБанковскимиКредитами", СтруктураПолей).Выгрузить();
		
    ТаблицаПоПродажамПоДисконтнымКартам = ПолучитьТаблицуПродажПоДисконтнымКартам(СтруктураШапкиДокумента);
	
КонецПроцедуры // СформироватьТаблицыДокумента()

// Функция возвращает таблицу продаж по дисконтным картам, необходимую для проведения документа.
//
// Параметры:
//  СтруктураШапкиДокумента - структура шапки документа.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица продаж по дисконтным картам.
//
Функция ПолучитьТаблицуПродажПоДисконтнымКартам(СтруктураШапкиДокумента)

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ДисконтнаяКарта"        , "ДисконтнаяКарта");
	СтруктураПолей.Вставить("ВладелецДисконтнойКарты", "ВладелецДисконтнойКарты");
	СтруктураПолей.Вставить("Сумма"                  , "Сумма");

	ТЗ = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПродажиПоДисконтнымКартам", СтруктураПолей).Выгрузить();

	Для Каждого СтрокаТЗ Из ТЗ Цикл
		СтрокаТЗ.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТЗ.Сумма, мВалютаРегламентированногоУчета,
								   СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
								   1,
								   СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
								   1,
								   СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
	КонецЦикла;

	Возврат ТЗ;

КонецФункции // ПолучитьТаблицуПродажПоДисконтнымКартам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда

		ФлагСкладНТТ = (ЗначениеЗаполнено(Основание.Склад)
		                 И Основание.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ);

		Если НЕ ФлагСкладНТТ Тогда
			Возврат;
		КонецЕсли;

		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		ИнвентаризацияТоваровНаСкладе = Основание;
		ТипЦен                        = Склад.ТипЦенРозничнойТорговли;
		ВидОперации                   = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах;

		ЗаполнитьТоварыПоИнвентаризацииТоваров(Основание);

	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АвторасчетНДС Тогда
		// соответствие для хранения погрешностей округлений
		ПогрешностиОкругления = Новый Соответствие();
		// пересчет сумм НДС с учетом ошибок округления
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Товары, ПолучитьСтруктуруРеквизитовДляАвторасчетаНДС(), ПогрешностиОкругления, "Товары");
	КонецЕсли;
	
	мТекущаяСхемаНалогообложения = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация); 

	Если НЕ мТекущаяСхемаНалогообложения.НДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Товары Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
	КонецЕсли; 
	
	Если НЕ мТекущаяСхемаНалогообложения.НалогНаПрибыль Тогда
		
		Для каждого СтрокаТЧ  Из Товары Цикл
		    СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = Неопределено;
		КонецЦикла; 
		
	КонецЕсли; 
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Товары");

	// Заполним реквизит склад в табличной части "Товары"
	УказаниеСкладов = Константы.УказаниеСкладовВТабличнойЧастиДокументов.Получить();
	СкладИзШапки    =  (УказаниеСкладов <> Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
		             И (УказаниеСкладов <> Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации);
	Для каждого СтрокаТЧ из Товары Цикл
		Если СкладИзШапки ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Склад) Тогда
			СтрокаТЧ.Склад = Склад;
		КонецЕсли;
	КонецЦикла;

	Если ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
		Для каждого СтрокаТЧ  Из Товары Цикл
			Если СтрокаТЧ.Склад.ВидСклада = перечисления.ВидыСкладов.Розничный 
				И НЕ СтрокаТЧ.СчетУчетаБУ.Забалансовый Тогда
				СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Товары");
	
	// Удаление неиспользуемых строк табличной части "Серийные номера".
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Перем Заголовок, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, ТаблицаПоПродажамПоДисконтнымКартам;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
		
	мТекущаяСхемаНалогообложения = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация); 

	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента);
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал", СтруктураПолейУчетнойПолитикиНУ);
	
	УчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, СтруктураШапкиДокумента.Организация, "Бух");
	Если Не Отказ Тогда
		РазрешитьУчетУслугБезПлановыхЦен = Не УчетнаяПолитикаБУ.ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам;
	Иначе
		РазрешитьУчетУслугБезПлановыхЦен = Ложь;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РазрешитьУчетУслугБезПлановыхЦен", РазрешитьУчетУслугБезПлановыхЦен);
	
	УчетнаяПолитикаУУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента.Дата, Отказ, , "Упр");
	Если Не Отказ Тогда
		РазрешитьУчетУслугБезПлановыхЦенУпр = Не УчетнаяПолитикаУУ.ПорядокРаспределенияРасходовНаОказаниеУслуг = Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам;
	Иначе
		РазрешитьУчетУслугБезПлановыхЦенУпр = Ложь;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РазрешитьУчетУслугБезПлановыхЦенУпр", РазрешитьУчетУслугБезПлановыхЦенУпр);
	
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим допустимость для пользователя цен документа
	УправлениеДопПравамиПользователей.ПроверитьДопустимостьЦенОтпуска(ЭтотОбъект, "Товары", Отказ);

	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, ТаблицаПоПродажамПоДисконтнымКартам);
	
	ЕстьБезналичныеРасчеты = ТаблицаПоПлатежнымКартам.Количество() > 0 ИЛИ ТаблицаПоБанковскимКредитам.Количество() > 0;
	Если ЕстьБезналичныеРасчеты Тогда
		СуммаПродажЗаНаличные = СуммаДокумента - ТаблицаПоПлатежнымКартам.Итог("Сумма") - ТаблицаПоБанковскимКредитам.Итог("Сумма");
		Если СуммаПродажЗаНаличные < 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Сумма оплаты платежными картами и банковскими кредитами больше общей суммы продаж по отчету!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	ПартионныйУчетБУ = УправлениеЗапасами.ВедетсяПартионныйУчет(ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Бух"));
	
	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверить заполнение ТЧ "ОплатаПлатежнымиКартами".
	ПроверитьЗаполнениеТабличнойЧастиОплатаПлатежнымиКартами(ТаблицаПоПлатежнымКартам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверить заполнение ТЧ "ОплатаБанковскимиКредитами".
	ПроверитьЗаполнениеТабличнойЧастиОплатаБанковскимиКредитами(ТаблицаПоБанковскимКредитам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверить заполнение ТЧ "ПродажиПоДисконтнымКартам".
	ПроверитьЗаполнениеТабличнойЧастиПродажиПоДисконтнымКартам(ТаблицаПоПродажамПоДисконтнымКартам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверить заполнение ТЧ "Состав набора".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура");
	СтруктураПолей.Вставить("Количество");
	СтруктураПолей.Вставить("Цена");
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СоставНабора", СтруктураПолей, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
	
		// Подготовим таблицу товаров для проведения.
		ТаблицаПоСкидкам = ПодготовитьТаблицуСкидок( ТаблицаПоТоварам, СтруктураШапкиДокумента);
		
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоСкидкам, 
			ТаблицаПоПлатежнымКартам, ТаблицаПоБанковскимКредитам, ТаблицаПоПродажамПоДисконтнымКартам, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	ЕстьАналитикаПоОбособленнымПодразделениям = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);

	мУчетДенежныхСредствПоОбособленнымПодразделениям = Ложь;
	Если мУчетнаяПолитикаБУ.Количество() > 0 Тогда	
		мУчетДенежныхСредствПоОбособленнымПодразделениям = ЕстьАналитикаПоОбособленнымПодразделениям И мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбщегоНазначения.УдалитьРегистрациюДокументаВПоследовательностях(ЭтотОбъект);
	
КонецПроцедуры

// Процедура формирует структуру содержащую реквизиты документа используемые при процедуре
// авторасчета НДС. Так как у этого документа нет реквизита ВалютаДокумента, в структуру
// добавляется значение валюты регламентированной валюты
//
// Возвращаемое значение:
//   Структура   –  содержаит значения реквизитов и дополнительные данные используемые при
//					проведении авторассчета сумм НДС
//
Функция ПолучитьСтруктуруРеквизитовДляАвторасчетаНДС() Экспорт

	ДанныеДокумента = Новый Структура;
	
	ДанныеДокумента.Вставить("УчитыватьНДС",	УчитыватьНДС);
	ДанныеДокумента.Вставить("СуммаВключаетНДС",СуммаВключаетНДС);
	ДанныеДокумента.Вставить("ВалютаДокумента",	мВалютаРегламентированногоУчета);
		
	Возврат ДанныеДокумента;

КонецФункции // ПолучитьСтруктуруРеквизитовДляАвторасчетаНДС()

// Определяет суммы продажи и суммы возвратов по табличной части "Товары".
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения ТЧ Товары
//  СуммаПродажи            - Общая сумма по строкам ТЧ с положительным количеством/суммой
//  СуммаВозврата           - Общая сумма по строкам ТЧ с отрицательным количеством/суммой
//
Процедура ОпределитьСуммуПродажиИВозврата(ТаблицаПоТоварам, СуммаПродажи = 0, СуммаВозврата = 0)
	
	СуммаПродажи = 0;
	СуммаВозврата = 0;	
	
	Для каждого Строка Из ТаблицаПоТоварам Цикл
		
		Если Строка.Количество >= 0  Тогда
		
			СуммаПродажи = СуммаПродажи + Строка.Сумма + ?(СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
		Иначе
			
			СуммаВозврата = СуммаВозврата + Строка.Сумма + ?(СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));
мПараметрыСвязиСтрокТЧ.Вставить("СоставНабора", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");
мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
                  Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации);

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата, Ссылка.Организация, Ложь);

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
