

Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт

	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 
	
	ТипЦены                   = Константы.ТипЦенРозетка                       .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс                    .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиРозетка              .Получить();

	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	
	
	ТолькоСНаличием = Истина;
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,,,,ТолькоСНаличием);
	Остатки = ОстаткиКВыгрузке.Остатки;
	Комплектующие = ОстаткиКВыгрузке.Комплектующие;	
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");
	Если СтрДлина(Врем)= 7 Тогда
		Врем  = Лев(Врем,4);
	Иначе
		Врем  = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 
	|<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+"""> 
	|<shop>
	|<name>Cvetkov</name>
	|<company>Cvetkov TM</company>
	|<url>https://www.cvetkovtm.com/</url>
	|<currencies>
	|<currency id=""UAH"" rate=""1""/>
	|</currencies>");
	
	ВыборкаКатегорий = Справочники.КатегорииРозетка.Выбрать();
	
	// Категории
	ТД.ЗаписатьСтроку("<categories>");
	Пока ВыборкаКатегорий.Следующий() Цикл
		Если ВыборкаКатегорий.ПометкаУдаления ИЛИ ВыборкаКатегорий.Наименование = "нет" Тогда Продолжить; КонецЕсли;
	    	Код = ОбщегоНазначения.УбратьНоликиСлева(ВыборкаКатегорий.Код);
			ТД.ЗаписатьСтроку("<category id="""+Код+""">"+ВыборкаКатегорий.Наименование+"</category>");
		
	КонецЦикла;
	ТД.ЗаписатьСтроку("</categories>");

	ТД.ЗаписатьСтроку("<offers>");	

	Контрагент =  Справочники.Контрагенты.НайтиПоКоду("000004143");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000003117");
	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияРозетка", ПроверятьРазбитиеРостовок, ВариантВыгрузки,,,200,ТолькоСНаличием,Контрагент,Договор);	
	
	Для Каждого Стр из ТаблицаХарактеристик Цикл 		
		ЗаписатьНоменклатуру(Стр, ТД);
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>
	|</shop>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, ТД)
	
	Цена = Стр.Цена;	
	СпрГруппыЦветов	= Стр.ГруппаЦвета;
	Номенклатура = Стр.Номенклатура;
	ПерваяЦена           = стр.ПерваяЦена;

	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	Характеристика = Стр.Характеристика;
	ХарактеристикаОбъект = Стр.Характеристика.ПолучитьОбъект();
	Ид = Стр.ИД;	
	Доступна = Стр.Доступна;
	ШтрихКод = Стр.ШтрихКод;
	Скидка = Стр.Скидка;
	Остаток = Стр.Остаток;
	ИдГуппы = Стр.ИдГуппы;
	Наценка = Стр.Наценка;
	КатегорияРозетка = Номенклатура.КатегорияРозетка;
			
	available = ?(Доступна,"true","false");	
	ТД.ЗаписатьСтроку("<offer id="""+Ид+""" available="""+available+""">");	
	
	ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
			
	НаименованиеУкр = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Ложь, Ложь);
	НаименованиеУкр = СтрЗаменить(НаименованиеУкр,"св "," світло ");
	НаименованиеУкр = СтрЗаменить(НаименованиеУкр,"св. "," світло ");
	НаименованиеУкр = СтрЗаменить(НаименованиеУкр,"Cв "," світло ");
	НаименованиеУкр = СтрЗаменить(НаименованиеУкр," т "," темно ");
	НаименованиеУкр = СтрЗаменить(НаименованиеУкр," т. "," темно ");

	НаименованиеУкр = СтрЗаменить(НаименованиеУкр,"  "," "); 

	ТД.ЗаписатьСтроку("<name>"+НаименованиеУкр+"</name>");
	
	//Цена
	//Если Скидка>0 Или Наценка < 70 Тогда
	    ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</price>");
		ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))         +"</price_old>");	
	//Иначе
		//ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");
	//КонецЕсли;
	
	ПромоЦена = ХарактеристикаОбъект.ПолучитьЦену(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000026"));	           
	Если ПромоЦена <> 0 Тогда 
		ТД.ЗаписатьСтроку("<price_promo>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПромоЦена,"ЧДЦ="))+"</price_promo>");
	КонецЕсли;       
	
	ТД.ЗаписатьСтроку("<categoryId>"+ОбщегоНазначения.УбратьНоликиСлева(КатегорияРозетка.Код)+"</categoryId>");
	
	/// Рус Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Истина);	
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description>"+Описание+"</description>");
	
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Ложь);
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description_ua>"+Описание+"</description_ua>");

	
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов, Истина, Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			Если Фот.НеВыгружать ИЛИ Фот.НеВыгружатьРозница Тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяФото = Фот.Наименование;
			
			Если Фот.Название = "Video" Тогда
				ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgjpg/" + ИмяФото + "</picture>");
			Иначе 
				ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Параметры
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Розетка");
	Категория = Номенклатура.КатегорияРозетка;
	ИсключениеСвойств = Неопределено;		

	Свойства = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Категория, Характеристика,"name","paramid","valueid",ИсключениеСвойств);
    ТД.ЗаписатьСтроку(Свойства);
	
	//ТД.ЗаписатьСтроку("<param name=""Страна-производитель"" paramid=""87790"" valueid=""429058"" >Украина</param>");
	//ТД.ЗаписатьСтроку("<param name=""Страна регистрации бренда"" paramid=""87790"" valueid=""544338"" >Украина</param>");
	ТД.ЗаписатьСтроку("<vendor>Cvetkov</vendor>");	
	ТД.ЗаписатьСтроку("<stock_quantity>"+Остаток+"</stock_quantity>");
		
	//ТД.ЗаписатьСтроку("<param name=""Доставка/Оплата"">Предоплата 150 Грн при наложенном платеже</param>");
	ТД.ЗаписатьСтроку("<param name=""Модель для группировки"" paramid=""215080"">"+ИдГуппы+"</param>");
	ТД.ЗаписатьСтроку("<article>" + ШтрихКод + "</article>");
	
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры
