// #Область СлужебныеПроцедурыИФункции

// Выводит сообщение пользователю методом "Сообщить"
// 
Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	                                
	ТекстСообщения = НСтр("ru='"+ТекстСообщения+"';uk='"+ТекстСообщения+"'");	
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
	
КонецПроцедуры

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения,
// 
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник) Экспорт
	
	Для Каждого Значение Из МассивИсточник Цикл
		МассивПриемник.Добавить(Значение);
	КонецЦикла;
			
КонецПроцедуры

// Создает копию значения типа Массив.
//
// Параметры:
//  МассивИсточник - Массив - массив, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(Элемент);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

// #КонецОбласти