#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "НезавершенноеПроизводство";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Описание исходного текста запроса.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	НезавершенноеПроизводство.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводство.Регистратор КАК Регистратор,
	|	НезавершенноеПроизводство.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|	НезавершенноеПроизводство.НачОст,
	|	НезавершенноеПроизводство.НачОстНДС,
	|	НезавершенноеПроизводство.Приход,
	|	НезавершенноеПроизводство.ПриходНДС,
	|	НезавершенноеПроизводство.Расход,
	|	НезавершенноеПроизводство.РасходНДС,
	|	НезавершенноеПроизводство.КонОст,
	|	НезавершенноеПроизводство.КонОстНДС,
	|	НезавершенноеПроизводство.НоменклатураЗатратКоличество
	|{ВЫБРАТЬ
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	Регистратор.*,
	|	НоменклатураЗатрат.*,
	|   НоменклатураЗатратКоличество,
	|	НачОст,
	|	НачОстНДС,
	|	Приход,
	|	ПриходНДС,
	|	Расход,
	|	РасходНДС,
	|	КонОст,
	|	КонОстНДС}
	|
	|ИЗ 
	|(ВЫБРАТЬ
	|	НезавершенноеПроизводствоНачальныеОстатки.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоНачальныеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	Неопределено КАК СтатьяЗатрат,
	|	Неопределено КАК Регистратор,
	|	Неопределено КАК НоменклатураЗатрат,
	|   0 КАК НоменклатураЗатратКоличество,
	|	СтоимостьОстаток КАК НачОст,
	|	НДСОстаток КАК НачОстНДС,
	|	0 КАК Приход,
	|	0 КАК ПриходНДС,
	|	0 КАК Расход,
	|	0 КАК РасходНДС,
	|	0 КАК КонОст,
	|	0 КАК КонОстНДС
	|	
	|	ИЗ РегистрНакопления.НезавершенноеПроизводство.Остатки(&ДатаНач, {Подразделение.* КАК Подразделение, НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа} ) КАК НезавершенноеПроизводствоНачальныеОстатки
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	НезавершенноеПроизводствоКонечныеОстатки.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоКонечныеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	Неопределено КАК СтатьяЗатрат,
	|	Неопределено КАК Регистратор,
	|	Неопределено КАК НоменклатураЗатрат,
	|   0 КАК НоменклатураЗатратКоличество,
	|	0 КАК НачОст,
	|	0 КАК НачОстНДС,
	|	0 КАК Приход,
	|	0 КАК ПриходНДС,
	|	0 КАК Расход,
	|	0 КАК РасходНДС,
	|	СтоимостьОстаток КАК КонОст,
	|	НДСОстаток КАК КонОстНДС
	|	
	|	ИЗ РегистрНакопления.НезавершенноеПроизводство.Остатки(&ДатаКон, {Подразделение.* КАК Подразделение, НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа}) КАК НезавершенноеПроизводствоКонечныеОстатки
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
    |
	|	НезавершенноеПроизводствоОбороты.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор КАК Регистратор,
	|	НезавершенноеПроизводствоОбороты.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|   СУММА(НезавершенноеПроизводствоОбороты.НоменклатураЗатратКоличество) КАК НоменклатураЗатратКоличество,
	|	СУММА(0) КАК НачОст,
	|	СУММА(0) КАК НачОстНДС,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияПриход ТОГДА (НезавершенноеПроизводствоОбороты.Стоимость) ИНАЧЕ 0 КОНЕЦ) КАК Приход,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияПриход ТОГДА (НезавершенноеПроизводствоОбороты.НДС) ИНАЧЕ 0 КОНЕЦ) КАК ПриходНДС,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияРасход ТОГДА (НезавершенноеПроизводствоОбороты.Стоимость) ИНАЧЕ 0 КОНЕЦ) КАК Расход,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияРасход ТОГДА (НезавершенноеПроизводствоОбороты.НДС) ИНАЧЕ 0 КОНЕЦ) КАК РасходНДС,
	|	СУММА(0) КАК КонОст,
	|	СУММА(0) КАК КонОстНДС
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводствоОбороты
	|ГДЕ
	|	НезавершенноеПроизводствоОбороты.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|{ГДЕ
	|	НезавершенноеПроизводствоОбороты.Подразделение.* КАК Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат.* КАК СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор.* КАК Регистратор}
	|
	|СГРУППИРОВАТЬ ПО
	|	НезавершенноеПроизводствоОбороты.Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.НоменклатураЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор
	|) КАК НезавершенноеПроизводство
    |
	|{ГДЕ
	|	НезавершенноеПроизводство.Подразделение.*,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа.*,
	|	НезавершенноеПроизводство.СтатьяЗатрат.*,
	|	НезавершенноеПроизводство.Регистратор.*,
	|	НезавершенноеПроизводство.НоменклатураЗатрат.*,
	|   НезавершенноеПроизводство.НоменклатураЗатратКоличество,
	|	НезавершенноеПроизводство.НачОст,
	|	НезавершенноеПроизводство.НачОстНДС,
	|	НезавершенноеПроизводство.Приход,
	|	НезавершенноеПроизводство.ПриходНДС,
	|	НезавершенноеПроизводство.Расход,
	|	НезавершенноеПроизводство.РасходНДС,
	|	НезавершенноеПроизводство.КонОст,
	|	НезавершенноеПроизводство.КонОстНДС}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	НоменклатураЗатрат.*,
	|	Регистратор.*}
	|
	|ИТОГИ
	|	СУММА(НачОст),
	|	СУММА(НачОстНДС),
	|	СУММА(Приход),
	|	СУММА(ПриходНДС),
	|	СУММА(Расход),
	|	СУММА(РасходНДС),
	|	СУММА(КонОст),
	|	СУММА(КонОстНДС),
	|	СУММА(НоменклатураЗатратКоличество)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	НоменклатураЗатрат.*,
	|	Регистратор.*}";
	
	
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", "Номенклатурная группа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", "Статья затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатураЗатрат", "Израсходованые материалы");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОст"	   , "Нач. остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОстНДС"   , "Нач. остаток (НДС)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Приход"	   , "Приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПриходНДС"   , "Приход (НДС)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Расход"	   , "Расход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РасходНДС"   , "Расход (НДС)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОстС"	   , "Кон. остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОстНДС"   , "Кон. остаток (НДС)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатураЗатратКоличество"   , "Количество израсходованных материалов");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	УниверсальныйОтчет.ДобавитьПоказатель("НачОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", "Начальный остаток (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НачОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Приход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("ПриходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("НоменклатураЗатратКоличество", "К-во материалов", Ложь, "ЧЦ=15; ЧДЦ=3", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Расход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("РасходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КонОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", "Конечный остаток (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("КонОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("НоменклатурнаяГруппа");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяЗатрат");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("НоменклатурнаяГруппа");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли