

			///////////////////////////////////////////////////////////////////
			//		    ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАБОТЕ С ВЕРСИЯМИ МОДУЛЕЙ    //
			/////////////////////////////////////////////////////////////////

Функция ПолучитьСлужебноеНазваниеКонфигурации() Экспорт
	
	Возврат "UTP 1.2";
	//Возврат "UT 11";
	
КонецФункции

Функция ПолучитьЛокализациюКонфигурации() Экспорт
	//UKR
	//BEL
	//KAZ
	//БВ
	Возврат "UKR";
	//
КонецФункции

Функция РазобратьФайлСАктуальнымиВерсиямиМодулей(ИмяФайла) Экспорт
	
	ТзнВерсииМодулей = Новый ТаблицаЗначений;
	ТзнВерсииМодулей.Колонки.Добавить("НаименованиеКонфигурации");
	ТзнВерсииМодулей.Колонки.Добавить("РелизКонфигурации");
	ТзнВерсииМодулей.Колонки.Добавить("НаименованиеМодуля");
	ТзнВерсииМодулей.Колонки.Добавить("ВерсияМодуля");
	ТзнВерсииМодулей.Колонки.Добавить("Локализация");
	ТзнВерсииМодулей.Колонки.Добавить("Ссылка");
	ТзнВерсииМодулей.Колонки.Добавить("История");
		
	Чтение = новый ЧтениеXML;
	Чтение.ОткрытьФайл(сокрЛП(ИмяФайла));
	Modules 		= Ложь;
	Location        = Ложь;
	Link       		= Ложь;
	Module 	 		= Ложь;
	Name1C 			= Ложь;
	Version1C 		= Ложь;
	NameModule 		= Ложь;
	VersionModule 	= Ложь;
	
	History 		= Ложь;
	HModule 		= Ложь;
	HVersionModule 	= Ложь;
	HDescriptions 	= Ложь;

	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И НЕ History И Чтение.Имя = "Modules" Тогда
			Modules = Истина;
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И НЕ History И Чтение.Имя = "Modules" тогда
			Modules = Ложь;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И НЕ History И Чтение.Имя = "Module" И Modules Тогда
			Module = Истина;
			НовСтрока = ТзнВерсииМодулей.Добавить();
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И НЕ History И Чтение.Имя = "Module" И Modules Тогда 	
			Module = Ложь;
		КонецЕсли;
		
		Если Modules И Module И НЕ History тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "Name1C" Тогда
				Name1C = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Name1C" тогда
				Name1C = Ложь;
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "Version1C" Тогда
				Version1C = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Version1C" тогда
				Version1C = Ложь;
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "NameModule" Тогда
				NameModule = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "NameModule" тогда
				NameModule = Ложь;
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "VersionModule" Тогда
				VersionModule = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "VersionModule" тогда
				VersionModule = Ложь;
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "Location" Тогда
				Location = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Location" тогда
				Location = Ложь;
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "Link" Тогда
				Link = Истина;
			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Link" тогда
				Link = Ложь;
			КонецЕсли;
			
			Если Name1C И Чтение.Имя = "#text" тогда
				НовСтрока.НаименованиеКонфигурации = Чтение.Значение;
			КонецЕсли;
			
			Если Version1C И Чтение.Имя = "#text" тогда
				НовСтрока.РелизКонфигурации = Чтение.Значение;
			КонецЕсли;
			
			Если NameModule И Чтение.Имя = "#text" тогда
				НовСтрока.НаименованиеМодуля = Чтение.Значение;
			КонецЕсли;
			
			Если VersionModule И Чтение.Имя = "#text" тогда
				НовСтрока.ВерсияМодуля = Чтение.Значение;
			КонецЕсли;
			
			Если Location И Чтение.Имя = "#text" тогда
				НовСтрока.Локализация = Чтение.Значение;
			КонецЕсли;
			
			Если Link И Чтение.Имя = "#text" тогда
				НовСтрока.Ссылка = Чтение.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "History" Тогда
			
			History = Истина;
			
			тзнИстории = Новый ТаблицаЗначений;
			тзнИстории.Колонки.Добавить("ВерсияМодуля"); 
			тзнИстории.Колонки.Добавить("Описание"); 
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "History" тогда
			
			History = Ложь;
			
			НовСтрока.История = тзнИстории;
			
		КонецЕсли;
			
		Если  Modules И Module И History тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "Module" Тогда
				
				HModule = Истина;
				
				НовИстрия = тзнИстории.Добавить();	

			ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Module" тогда
				HModule = Ложь;
			КонецЕсли;
			
			Если  Modules И Module И History И HModule тогда
				
				Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "VersionModule" Тогда
					HVersionModule = Истина;
				ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "VersionModule" тогда
					HVersionModule = Ложь;
				КонецЕсли;
				
				Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя 	= "Descriptions" Тогда
					HDescriptions = Истина;
				ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Descriptions" тогда
					HDescriptions = Ложь;
				КонецЕсли;
				
				Если HVersionModule И Чтение.Имя = "#text" тогда
					НовИстрия.ВерсияМодуля = Чтение.Значение;
				КонецЕсли;
				
				Если HDescriptions И Чтение.Имя = "#text" тогда
					НовИстрия.Описание = Чтение.Значение;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТзнВерсииМодулей;
	
КонецФункции

Функция РазобратьВерсиюМодуля4(ВерсияМодуля)
		
	СтруктураРазбора = Новый Структура;
	СтруктураРазбора.Вставить("МажорнаяВерсия"	, 0);
	СтруктураРазбора.Вставить("МинорнаяВерсия"	, 0);
	СтруктураРазбора.Вставить("Релиз"			, 0);
	СтруктураРазбора.Вставить("Сборка"			, 0);

	ДлинаВерсии = СтрДлина(ВерсияМодуля);	
	
	Ряд = 1;
	Версия = "";
	Для Пер = 1 по ДлинаВерсии Цикл
		
		Сим = Сред(ВерсияМодуля, Пер,1);
		
		Если Сим = "." тогда
			
			Если Ряд = 1 тогда
				СтруктураРазбора.МажорнаяВерсия = Число(Версия); 	
			ИначеЕсли Ряд = 2 тогда
				СтруктураРазбора.МинорнаяВерсия = Число(Версия); 	
			ИначеЕсли Ряд = 3 тогда
				СтруктураРазбора.Релиз 			= Число(Версия); 	
			КонецЕсли;
			
			Ряд 	= Ряд + 1;
			Версия 	= "";
			
		Иначе
			Версия 	= Версия + Сим;	
			
			Если Пер = ДлинаВерсии тогда
				СтруктураРазбора.Сборка 		= Число(Версия); 	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураРазбора;
	
КонецФункции

Функция ПроверитьАктуальностьТекущегоМодуля4(ВерсияТекущегоМодуля, ВерсияАктуальногоМодуля) Экспорт
	
	Результат = Истина;
	
	РазобранаяВерсияТекущегоМодуля 		= РазобратьВерсиюМодуля4(ВерсияТекущегоМодуля);
	РазобранаяВерсияАктуальногоМодуля 	= РазобратьВерсиюМодуля4(ВерсияАктуальногоМодуля);
	
	Если  РазобранаяВерсияТекущегоМодуля.МажорнаяВерсия < РазобранаяВерсияАктуальногоМодуля.МажорнаяВерсия тогда
		Результат = Ложь;
	ИначеЕсли РазобранаяВерсияТекущегоМодуля.МажорнаяВерсия = РазобранаяВерсияАктуальногоМодуля.МажорнаяВерсия тогда
		
		Если  РазобранаяВерсияТекущегоМодуля.МинорнаяВерсия < РазобранаяВерсияАктуальногоМодуля.МинорнаяВерсия тогда
			Результат = Ложь;	
		ИначеЕсли  РазобранаяВерсияТекущегоМодуля.МинорнаяВерсия = РазобранаяВерсияАктуальногоМодуля.МинорнаяВерсия тогда

			Если  РазобранаяВерсияТекущегоМодуля.Релиз < РазобранаяВерсияАктуальногоМодуля.Релиз тогда
				Результат = Ложь;	
			ИначеЕсли  РазобранаяВерсияТекущегоМодуля.Релиз = РазобранаяВерсияАктуальногоМодуля.Релиз тогда
				Если  РазобранаяВерсияТекущегоМодуля.Сборка < РазобранаяВерсияАктуальногоМодуля.Сборка тогда
					Результат = Ложь;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция Версия() Экспорт
	Возврат "7.0.1.4";
КонецФункции

Функция ПроверкаОбновленияДанныхМодуляОбменаССайтом(ОсновныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Версия = Версия();
	
	ПредыдущаяВерсия = Константы.Б_НомерВерсииМодуляОбменаССайтом.Получить();
	
	ПервыйЗапуск = НЕ ПредыдущаяВерсия = Версия;
	
	Если НЕ ПервыйЗапуск Тогда
		Возврат Истина;
	КонецЕсли;
	
	
	Пока Константы.Б_НомерВерсииМодуляОбменаССайтом.Получить() <> Версия Цикл
		
		ПредыдущаяВерсия = Константы.Б_НомерВерсииМодуляОбменаССайтом.Получить();
		
		Если ПредыдущаяВерсия = "" Тогда
			
			Результат = ОбновлениеДоВерсии5_0_0_1(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("5.0.0.1");
			Иначе
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли ПредыдущаяВерсия = "5.0.0.1" тогда
			СообщитьПодробно("Обновление с версии 5.0.0.1 до 5.0.0.2.", ОсновныеПараметры);	
		    Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("5.0.0.2");
		ИначеЕсли ПредыдущаяВерсия = "5.0.0.2" тогда
			СообщитьПодробно("Обновление с версии 5.0.0.2 до 5.0.0.3.", ОсновныеПараметры);	
		    Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("5.0.0.3");
		ИначеЕсли ПредыдущаяВерсия = "5.0.0.3" тогда
			СообщитьПодробно("Обновление с версии 5.0.0.3 до 5.0.0.4.", ОсновныеПараметры);	
		    Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("5.0.0.4");
		ИначеЕсли ПредыдущаяВерсия = "5.0.0.4" Тогда
			
			Результат = ОбновлениеДоВерсии5_0_0_5(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("5.0.0.5");
			Иначе
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли ПредыдущаяВерсия = "5.0.0.5" Тогда
			
			Результат = ОбновлениеДоВерсии6_0_0_1(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.0.0.1");
			Иначе
				Возврат Результат;
			КонецЕсли;
			
		ИначеЕсли ПредыдущаяВерсия = "6.0.0.1" Тогда
			
			Результат = ОбновлениеДоВерсии6_0_2_1(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.0.2.1");
			Иначе
				Возврат Результат;
			КонецЕсли;  
			
		ИначеЕсли ПредыдущаяВерсия = "6.0.2.1" Тогда
			
			Результат = ОбновлениеДоВерсии6_0_3_1(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.0.3.1");
			Иначе
				Возврат Результат;
			КонецЕсли; 
		ИначеЕсли ПредыдущаяВерсия = "6.0.3.1" Тогда
			СообщитьПодробно("Обновление с версии 6.0.3.1 до 6.0.3.3", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.0.3.3");
		ИначеЕсли ПредыдущаяВерсия = "6.0.3.3" Тогда
			СообщитьПодробно("Обновление с версии 6.0.3.3 до 6.0.3.4", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.0.3.4");
		ИначеЕсли ПредыдущаяВерсия = "6.0.3.4" Тогда
			
			Результат = ОбновлениеДоВерсии6_5_0_0(ОсновныеПараметры);
			
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.5.0.0");
			Иначе
				Возврат Результат;
			КонецЕсли;   
			
		ИначеЕсли ПредыдущаяВерсия = "6.5.0.0" Тогда
			СообщитьПодробно("Обновление с версии 6.5.0.0 до 6.5.0.1", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("6.5.0.1");
			
		ИначеЕсли ПредыдущаяВерсия = "6.5.0.1" Тогда
			
			Результат = ОбновлениеДоВерсии7_0_0_0(ОсновныеПараметры);
				
			Если Результат = Истина тогда
				Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("7.0.0.0");
			Иначе
				Возврат Результат;
			КонецЕсли; 
			
		ИначеЕсли ПредыдущаяВерсия = "7.0.0.0" Тогда
			СообщитьПодробно("Обновление с версии 7.0.0.0 до 7.0.1.2", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("7.0.1.2");
		ИначеЕсли ПредыдущаяВерсия = "7.0.1.2" Тогда
			СообщитьПодробно("Обновление с версии 7.0.1.2 до 7.0.1.3", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("7.0.1.3");
		ИначеЕсли ПредыдущаяВерсия = "7.0.1.3" Тогда
			СообщитьПодробно("Обновление с версии 7.0.1.3 до 7.0.1.4", ОсновныеПараметры);	
			Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить("7.0.1.4");
		Иначе 
		    Константы.Б_НомерВерсииМодуляОбменаССайтом.Установить(Версия);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ОбновлениеДоВерсии5_0_0_1(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 4.0.0.1.", ОсновныеПараметры);	
	
	МассивРегистров = Новый Массив;
	МассивРегистров.Добавить("РИ_ИдентификаторыНоменклатурыБитрикс");
	МассивРегистров.Добавить("РИ_ИдентификаторыХарактеристикНоменклатурыБитрикс");
	МассивРегистров.Добавить("РИ_ИдентификаторыСвойствНоменклатурыБитрикс");
	МассивРегистров.Добавить("РИ_ИдентификаторыЗначенийСвойствНоменклатурыБитрикс");
	МассивРегистров.Добавить("РИ_ИдентификаторыКонтрагентовБитрикс");
	             
	Попытка
	
		Для каждого ТекЗначение из МассивРегистров Цикл
			
			Регистр = Метаданные.РегистрыСведений.Найти(ТекЗначение);
			Если Регистр <> Неопределено тогда
				
				СообщитьПодробно("Перенос идентификторов Битрикс из регистра сведений " + ТекЗначение + " в общие реквизиты соответствующего объекта.", ОсновныеПараметры);	
				Выборка = РегистрыСведений[ТекЗначение].Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.Объект.Б_Идентификатор = "" тогда 
					
						Объект = Выборка.Объект.ПолучитьОбъект();
						Объект.Б_Идентификатор = Выборка.Идентификатор;
						Объект.Записать();
					Конецесли;
					
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЦикла;
	
		СообщитьПодробно("Обновление до версии 4.0.0.1 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 4.0.0.1 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;

КонецФункции

Функция ОбновлениеДоВерсии5_0_0_5(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 5.0.0.5.", ОсновныеПараметры);	
	
	Попытка
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				Если НЕ лСохраненныеНастройки.ИнформацияОНоменклатуре.Свойство("ВыгружатьКартинкиИФайлыПредложений") тогда
					лСохраненныеНастройки.ИнформацияОНоменклатуре.Вставить("ВыгружатьКартинкиИФайлыПредложений", Ложь);
				КонецЕсли;
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);
				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 5.0.0.5 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 5.0.0.5 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Функция ОбновлениеДоВерсии6_0_0_1(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 6.0.0.1.", ОсновныеПараметры);	
	
	Попытка
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				Если НЕ лСохраненныеНастройки.Заказы.Свойство("ВыгружатьВсеДокументы") тогда
					лСохраненныеНастройки.Заказы.Вставить("ВыгружатьВсеДокументы", лСохраненныеНастройки.Заказы.ВыгружатьВсеЗаказы);
				КонецЕсли;
				
				
				лТзнДопРеквизитов = лСохраненныеНастройки.ИнформацияОНоменклатуре.СоответствиеДополнительныхРеквизитовНоменклатуры;
				
				Если лТзнДопРеквизитов.Найти("Планируемая дата поступления") = Неопределено тогда 
					НоваяСтрока = лТзнДопРеквизитов.Добавить();
					НоваяСтрока.НаименованиеПоля 	= "Планируемая дата поступления";
					НоваяСтрока.НаименованиеПоля1С 	= "Планируемая дата поступления";
				КонецЕсли;
				
				
				Если НЕ лСохраненныеНастройки.Заказы.Свойство("ВыгрузкаОплат") тогда
					лСохраненныеНастройки.Заказы.Вставить("ВыгрузкаОплат", Ложь);
				КонецЕсли;
				
				Если НЕ лСохраненныеНастройки.Заказы.Свойство("КоличествоДокументовВПакете") тогда
					лСохраненныеНастройки.Заказы.Вставить("КоличествоДокументовВПакете", лСохраненныеНастройки.Заказы.КоличествоЗаказовВПакете);
				КонецЕсли;
				
				лВременныеДанные = ПланыОбмена.Б_ОбменССайтом.ПолучитьПустуюСтруктуруНастроекДляОтборов();
	
				ПостроительОтчетаОтгрузок = Новый ПостроительОтчета;
				ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОтгрузок(ПостроительОтчетаОтгрузок		, лВременныеДанные);
				ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОтгрузок(ПостроительОтчетаОтгрузок	, лВременныеДанные);
				лСохраненныеНастройки.Заказы.Вставить("ПостроительОтчетаОтгрузок", УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчетаОтгрузок.Отбор));	
				
				ПостроительОтчетаОплат = Новый ПостроительОтчета;
				ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОплат(ПостроительОтчетаОплат			, лВременныеДанные);
				ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОплат(ПостроительОтчетаОплат	, лВременныеДанные);
				лСохраненныеНастройки.Заказы.Вставить("ПостроительОтчетаОплат", УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчетаОплат.Отбор));	
				
				лДокументыЗагрузки 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ДокументыЗагрузки;
				лТзнВрем 			= лДокументыЗагрузки.СкопироватьКолонки();
				Для каждого ТекСтрока из лДокументыЗагрузки Цикл
					
					Если ТекСтрока.Документ = "ЗаказПокупателя" тогда
					
						НоваяСтрока = лТзнВрем.Вставить(0);
						НоваяСтрока.ВидДокумента = "Заказ товара";
						
					ИначеЕсли ТекСтрока.Документ = "ПриходныйКассовыйОрдер" тогда
					
						НоваяСтрока = лТзнВрем.Вставить(2);
						НоваяСтрока.ВидДокумента = "Выплата наличных денег";
						
					ИначеЕсли ТекСтрока.Документ = "ОплатаОтПокупателяПлатежнойКартой" тогда
					
						НоваяСтрока = лТзнВрем.Вставить(3);
						НоваяСтрока.ВидДокумента = "Выплата безналичных денег";
						
					ИначеЕсли ТекСтрока.Документ = "РеализацияТоваровУслуг" тогда
					
						НоваяСтрока = лТзнВрем.Вставить(1);
						НоваяСтрока.ВидДокумента = "Отпуск товара";
					Иначе
					
						НоваяСтрока = лТзнВрем.Добавить();
						НоваяСтрока.ВидДокумента = "Не известно";
					КонецЕсли;
					
					НоваяСтрока.Документ 						= ТекСтрока.Документ;
					НоваяСтрока.СинонимДокумента 				= ТекСтрока.СинонимДокумента;
					
					НоваяСтрока.НумерацияДокументов 			= ТекСтрока.НумерацияДокументов;
					НоваяСтрока.ДатаДокументов 					= ТекСтрока.ДатаДокументов;
					НоваяСтрока.ДействияСОтмененнымиДокументами = ТекСтрока.ДействияСОтмененнымиДокументами;
					НоваяСтрока.РежимЗаписиДокументов 			= ТекСтрока.РежимЗаписиДокументов;
					
				КонецЦикла;
				
				лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ДокументыЗагрузки = лТзнВрем; 
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);
				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 6.0.0.1 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 6.0.0.1 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Функция ОбновлениеДоВерсии6_0_2_1(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 6.0.2.1.", ОсновныеПараметры);	
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;	
	Попытка
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			лЕстьКодСтрокиВЗаказах 		= Ложь;
			лЕстьКодСтрокиВОтгрузках	= Ложь;
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				лДокументыЗагрузки 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияТабличныхЧастейДокументов;
				
				лТзнВрем 			= лДокументыЗагрузки.СкопироватьКолонки();
				
				Для каждого ТекСтрока из лДокументыЗагрузки Цикл
					
					НоваяСтрока = лТзнВрем.Добавить();
					НоваяСтрока.Документ 				= ТекСтрока.Документ;
					НоваяСтрока.НаименованиеРеквизита1С = ТекСтрока.НаименованиеРеквизита1С;
					НоваяСтрока.СинонимРеквизита1С 		= ТекСтрока.СинонимРеквизита1С;
					НоваяСтрока.ТабличнаяЧасть 			= ТекСтрока.ТабличнаяЧасть;
					НоваяСтрока.ПолеXML 				= ТекСтрока.ПолеXML;
					
					Если ТекСтрока.Документ = "ЗаказПокупателя" И ТекСтрока.НаименованиеРеквизита1С = "КлючСтроки" тогда
						лЕстьКодСтрокиВЗаказах = Истина;	
						НоваяСтрока.Значение 				= "Ключ строки";
						НоваяСтрока.ТипДанных 				= "Из поля XML документа";
					Иначе
						НоваяСтрока.Значение 				= ТекСтрока.Значение;
						НоваяСтрока.ТипДанных 				= ТекСтрока.ТипДанных;  					
					КонецЕсли;
					
					Если ТекСтрока.Документ = "РеализацияТоваровУслуг" И ТекСтрока.НаименованиеРеквизита1С = "КлючСтроки" тогда
						лЕстьКодСтрокиВОтгрузках = Истина;	
						НоваяСтрока.Значение 				= "Ключ строки";
						НоваяСтрока.ТипДанных 				= "Из поля XML документа";
					Иначе
						НоваяСтрока.Значение 				= ТекСтрока.Значение;
						НоваяСтрока.ТипДанных 				= ТекСтрока.ТипДанных;  					
					КонецЕсли;
					
				КонецЦикла;
				
				Если НЕ лЕстьКодСтрокиВЗаказах тогда
					НоваяСтрока = лТзнВрем.Добавить();
					НоваяСтрока.Документ 				= "ЗаказПокупателя";
					НоваяСтрока.НаименованиеРеквизита1С = "КлючСтроки";
					НоваяСтрока.СинонимРеквизита1С 		= "Ключ строки";
					НоваяСтрока.ТабличнаяЧасть 			= "Товары";
					НоваяСтрока.ПолеXML 				= "Товары";
					НоваяСтрока.Значение 				= "Ключ строки";
					НоваяСтрока.ТипДанных 				= "Из поля XML документа";
				КонецЕсли;
				
				Если НЕ лЕстьКодСтрокиВОтгрузках тогда
					НоваяСтрока = лТзнВрем.Добавить();
					НоваяСтрока.Документ 				= "РеализацияТоваровУслуг";
					НоваяСтрока.НаименованиеРеквизита1С = "КлючСтроки";
					НоваяСтрока.СинонимРеквизита1С 		= "Ключ строки";
					НоваяСтрока.ТабличнаяЧасть 			= "Товары";
					НоваяСтрока.ПолеXML 				= "Товары";
					НоваяСтрока.Значение 				= "Ключ строки";
					НоваяСтрока.ТипДанных 				= "Из поля XML документа";
				КонецЕсли;
				
				//////////////////
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "ДоговорКонтрагента"			, "Договор контрагента"		, "Из поля XML документа"	, "Договор контрагента");
				//БВ
				//ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СтавкаНДС"						, "Ставка НДС"			, "Фиксированное значение"	, Перечисления.СтавкиНДС.НДС18);
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СтавкаНДС"						, "Ставка НДС"			, "Фиксированное значение"	, Перечисления.СтавкиНДС.НДС20);
				//
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СуммаНДС"						, "Сумма НДС"			, "Из поля XML документа"	, "Сумма НДС");
				                                                                                                                                                            		
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СуммаПлатежа"					, "Сумма платежа"		, "Из поля XML документа"	, "Сумма");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "КратностьВзаиморасчетов"		, "Кратность взаиморасчетов"	, "Фиксированное значение"	, 1);
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "КурсВзаиморасчетов"			, "Курс взаиморасчетов"	, "Из поля XML документа"	, "Курс взаиморасчетов");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СуммаВзаиморасчетов"			, "Сумма взаиморасчетов", "Из поля XML документа"	, "Сумма");
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "Сделка"						, "Сделка"					, "Из поля XML документа"	, "Основание");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "ДокументРасчетовСКонтрагентом"	, "Документ расчетов с контрагентом"	, "Из поля XML документа"	, "Документ расчетов с контрагентом");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиТЧДокументаПоУмолчанию(лТзнВрем, "ПлатежноеПоручениеВходящее", "РасшифровкаПлатежа", "", "СтатьяДвиженияДенежныхСредств"	, "Статья движения денежных средств"	, "Фиксированное значение"	, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя);
				//////////////////
				
				лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияТабличныхЧастейДокументов = лТзнВрем; 
								
				
				лШапкаДокумента 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияШапокДокументов;
				
				//////////////////
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Дата"						, "Дата"					, "Из поля XML документа"	, "Дата с сайта с учетом настройки обмена");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Б_Идентификатор"			, "Идентификатор битрикс"	, "Из поля XML документа"	, "Номер с сайта");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Б_ДатаДокумента"			, "Дата документа Битрикс"	, "Из поля XML документа"	, "Дата с сайта");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Б_НомерВерсии"				, "Номер версии Битрикс"	, "Из поля XML документа"	, "Номер версии с сайта");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "ПометкаУдаления"			, "Пометка удаления"		, "Из поля XML документа"	, "Пометка удаления");
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Комментарий"				, "Комментарий"				, "Из поля XML документа"	, "Комментарий");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Организация"				, "Организация"				, "Фиксированное значение"	, Справочники.Организации.ПустаяСсылка());
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Ответственный"				, "Ответственный"			, "Фиксированное значение"	, Справочники.Пользователи.ПустаяСсылка());
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Подразделение"				, "Подразделение"			, "Фиксированное значение"	, Справочники.Подразделения.ПустаяСсылка());
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "Контрагент"					, "Контрагент"				, "Из поля XML документа"	, "Контрагент");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "ДоговорКонтрагента"			, "Договор контрагента"		, "Из поля XML документа"	, "Договор контрагента");

				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "ВидОперации"				, "Вид операции"			, "Фиксированное значение"	, Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя);
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "СчетОрганизации"			, "Счет организации"		, "Из поля XML документа"	, "Банковский счет организации");
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "СтатьяДвиженияДенежныхСредств"	, "Статья движения денежных средств", "Фиксированное значение", Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя);
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "ОтраженоВОперУчете"			, "Отражено в опер. учете"	, "Фиксированное значение", Истина);
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "СуммаДокумента"				, "Сумма документа"			, "Из поля XML документа"	, "Сумма");
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПлатежноеПоручениеВходящее", "ВалютаДокумента"			, "Валюта документа"		, "Из поля XML документа"	, "Валюта");
		
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПоступлениеБезналичныхДенежныхСредств", "ДокументОснование"			, "Документ основание"		, "Из поля XML документа"	, "Основание");
				
				ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(лШапкаДокумента, "ПоступлениеБезналичныхДенежныхСредств", "ВидОперации"				, "Вид операции"			, "Фиксированное значение"	, Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя);              
				//////////////////
				
				лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияШапокДокументов = лШапкаДокумента; 
				
				
				лДокументыЗагрузки 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ДокументыЗагрузки;
				лТзнВрем 			= лДокументыЗагрузки.СкопироватьКолонки();
				Для каждого ТекСтрока из лДокументыЗагрузки Цикл
					
					НоваяСтрока = лТзнВрем.Добавить();
					
					НоваяСтрока.Документ 						= ТекСтрока.Документ;
					НоваяСтрока.СинонимДокумента 				= ТекСтрока.СинонимДокумента;
					
					Если ТекСтрока.Документ = "ОплатаОтПокупателяПлатежнойКартой" тогда
						НоваяСтрока.ВидДокумента 					= "Эквайринговая операция";
					Иначе
						НоваяСтрока.ВидДокумента 					= ТекСтрока.ВидДокумента;
					КонецЕсли;				
					
					НоваяСтрока.НумерацияДокументов 			= ТекСтрока.НумерацияДокументов;
					НоваяСтрока.ДатаДокументов 					= ТекСтрока.ДатаДокументов;
					НоваяСтрока.ДействияСОтмененнымиДокументами = ТекСтрока.ДействияСОтмененнымиДокументами;
					НоваяСтрока.РежимЗаписиДокументов 			= ТекСтрока.РежимЗаписиДокументов;
					
				КонецЦикла;
				
				//////////////////  
				
				Если лТзнВрем.Найти("Выплата безналичных денег") = неопределено тогда
					НоваяСтрока = лТзнВрем.Добавить();
					НоваяСтрока.Документ 			= "ПлатежноеПоручениеВходящее";
					НоваяСтрока.СинонимДокумента 	= "Выплата безналичных денег";
					НоваяСтрока.ВидДокумента 	= "Выплата безналичных денег";
					
					НоваяСтрока.НумерацияДокументов 			= "Автоматически";
					НоваяСтрока.ДатаДокументов 					= "С сайта";
					НоваяСтрока.ДействияСОтмененнымиДокументами = "Помечать на удаление";
					НоваяСтрока.РежимЗаписиДокументов 			= "Только записывать документы";
				КонецЕсли;
				//////////////////
				
				лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ДокументыЗагрузки = лТзнВрем; 
				
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);
				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 6.0.1.2 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 6.0.1.2 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Функция ОбновлениеДоВерсии6_0_3_1(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 6.0.3.1.", ОсновныеПараметры);	
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;	
	Попытка
		
		ЗагружаемыеТипыОплат = Новый СписокЗначений;
		ЗагружаемыеТипыОплат.Добавить("Выплата наличных денег"		,, Истина);
		ЗагружаемыеТипыОплат.Добавить("Эквайринговая операция"		,, Истина);
		ЗагружаемыеТипыОплат.Добавить("Выплата безналичных денег"	,, Истина);
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лУзелОбмена.ДеактивироватьТоварыЕслиПолнаяВыгрузка = Истина;
				
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				Если лСохраненныеНастройки.Заказы.Свойство("ЗагружаемыеТипыОплат") = Ложь тогда
					
					лСохраненныеНастройки.Заказы.Вставить("ЗагружаемыеТипыОплат", ЗагружаемыеТипыОплат);
					
				КонецЕсли;
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);

				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 6.0.3.1 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 6.0.3.1 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Функция ОбновлениеДоВерсии6_5_0_0(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 6.5.0.0.", ОсновныеПараметры);	
	
	Попытка
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				
				Если Выборка.ОбменВРеальномВремени тогда
					Константы.Б_ИспользоватьМеханизмОбменаВРеальномВремени.Установить(Истина);	
					Константы.Б_НастройкаОбменаДокументовВРеальномВремени.Установить(Выборка.Ссылка);	
				КонецЕсли;
				
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				Если лСохраненныеНастройки.Свойство("Заказы") = Истина тогда
					
					РеквизитыДокументовЗагрузки 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияШапокДокументов;
					
					Для Каждого ТекСтрока из РеквизитыДокументовЗагрузки Цикл
						Если ТекСтрока.НаименованиеРеквизита1С = "Б_Идентификатор" И ТекСтрока.Значение = "Номер с сайта" тогда
							ТекСтрока.Значение = "Ид с сайта";	
						КонецЕсли;
					КонецЦикла;
					
					лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияШапокДокументов = РеквизитыДокументовЗагрузки;
					
					//добавляем реквизиты, для видов оплат 
					РеквизитыДокументовЗагрузки 	= лСохраненныеНастройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов.ВсеСоответствияШапокДокументов;
					НайденныеСтроки = РеквизитыДокументовЗагрузки.НайтиСтроки(Новый Структура("Документ, НаименованиеРеквизита1С", "ОплатаОтПокупателяПлатежнойКартой", "ВидОплаты"));				
					Если НайденныеСтроки.Количество() = 0 тогда
						ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(РеквизитыДокументовЗагрузки, "ОплатаОтПокупателяПлатежнойКартой", "ВидОплаты", "Вид оплаты", "Из поля XML документа", "Вид оплаты");
					Иначе
						Для каждого текСтрока из НайденныеСтроки Цикл
							текСтрока.ТипДанных = "Из поля XML документа";	
							текСтрока.Значение = "Вид оплаты";	
						КонецЦикла;
					КонецЕсли;
					
					НайденныеСтроки = РеквизитыДокументовЗагрузки.НайтиСтроки(Новый Структура("Документ, НаименованиеРеквизита1С", "ОплатаОтПокупателяПлатежнойКартой", "ПроцентТорговойУступки"));				
					Если НайденныеСтроки.Количество() = 0 тогда
						ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(РеквизитыДокументовЗагрузки, "ОплатаОтПокупателяПлатежнойКартой", "АдресЭП", "Процент торговой уступки", "Из поля XML документа", "Процент торговой уступки");
					Иначе
						Для каждого текСтрока из НайденныеСтроки Цикл
							текСтрока.ТипДанных = "Из поля XML документа";	
							текСтрока.Значение = "Процент торговой уступки";	
						КонецЦикла;
					КонецЕсли;
					
					НайденныеСтроки = РеквизитыДокументовЗагрузки.НайтиСтроки(Новый Структура("Документ, НаименованиеРеквизита1С", "ОплатаОтПокупателяПлатежнойКартой", "СуммаТорговойУступки"));				
					Если НайденныеСтроки.Количество() = 0 тогда
						ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСтрокиДокументаПоУмолчанию(РеквизитыДокументовЗагрузки, "ОплатаОтПокупателяПлатежнойКартой", "СуммаТорговойУступки", "Сумма торговой уступки", "Из поля XML документа", "Сумма торговой уступки");
					Иначе
						Для каждого текСтрока из НайденныеСтроки Цикл
							текСтрока.ТипДанных = "Из поля XML документа";	
							текСтрока.Значение = "Сумма торговой уступки";	
						КонецЦикла;
					КонецЕсли;
					
					лВременныеДанные = ПланыОбмена.Б_ОбменССайтом.ПолучитьПустуюСтруктуруНастроекДляОтборов();
					
					Если лСохраненныеНастройки.Заказы.Свойство("НастройкиКомпоновкиДанныхЗаказов") = Истина тогда
						
						ПостроительОтчетаЗаказов = Новый ПостроительОтчета;
						ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительЗаказов(ПостроительОтчетаЗаказов			, лВременныеДанные);
						ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяЗаказов(ПостроительОтчетаЗаказов	, лВременныеДанные);
						
						лСохраненныеНастройки.Заказы.ПостроительОтчетаЗаказов = УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчетаЗаказов.Отбор);	
						
					КонецЕсли;
					
					Если лСохраненныеНастройки.Заказы.Свойство("НастройкиКомпоновкиДанныхОплат") = Истина тогда
						
						ПостроительОтчетаОплат = Новый ПостроительОтчета;
						ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОплат(ПостроительОтчетаОплат			, лВременныеДанные);
						ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОплат(ПостроительОтчетаОплат	, лВременныеДанные);
											
						лСохраненныеНастройки.Заказы.ПостроительОтчетаОплат = УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчетаОплат.Отбор);	
						
					КонецЕсли;
					
					Если лСохраненныеНастройки.Заказы.Свойство("НастройкиКомпоновкиДанныхОтгрузок") = Истина тогда
						
						ПостроительОтчетаОтгрузок = Новый ПостроительОтчета;
						ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОтгрузок(ПостроительОтчетаОтгрузок		, лВременныеДанные);
						ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОтгрузок(ПостроительОтчетаОтгрузок	, лВременныеДанные);
											
						лСохраненныеНастройки.Заказы.ПостроительОтчетаОтгрузок = УправлениеОтчетами.ПолучитьКопиюОтбораВТЗ(ПостроительОтчетаОтгрузок.Отбор);	
						
					КонецЕсли;
						
					Массив = Новый Массив;
					Массив.Добавить(Тип("СписокЗначений"));
					ОписаниеТиповСпк = Новый ОписаниеТипов(Массив);
					
					Массив = Новый Массив;
					Массив.Добавить(Тип("СправочникСсылка.ДоговорыЭквайринга"));
					ОписаниеТиповЭТ = Новый ОписаниеТипов(Массив);

					Массив = Новый Массив;
					Массив.Добавить(Тип("СправочникСсылка.Кассы"));
					ОписаниеТиповК = Новый ОписаниеТипов(Массив);
					
					Массив = Новый Массив;
					Массив.Добавить(Тип("СправочникСсылка.ВидыОплатЧекаККМ"));
					ОписаниеТиповВО = Новый ОписаниеТипов(Массив);
					
					СоответствиеПлатежныхСистемИКасс = Новый ТаблицаЗначений;
					СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ПлатежнаяСистема"		, ОписаниеТиповСпк);
					СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("Касса"					, ОписаниеТиповК);
					СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ДоговорЭквайринга"		, ОписаниеТиповЭТ);
					СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ВидОплаты"				, ОписаниеТиповВО);
	
					лСохраненныеНастройки.Заказы.СоответствиеПлатежныхСистемИКасс = СоответствиеПлатежныхСистемИКасс;	
					
				КонецЕсли;
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);

				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 6.5.0.0 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 6.5.0.0 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Функция ОбновлениеДоВерсии7_0_0_0(ОсновныеПараметры)
	
	СообщитьПодробно("Начало обновления до версии 7.0.0.0", ОсновныеПараметры);	
	
	Попытка
		
		Выборка = ПланыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			
			Если Выборка.Ссылка <> ПланыОбмена.Б_ОбменССайтом.ЭтотУзел() тогда
				
				лУзелОбмена = Выборка.ПолучитьОбъект();
				лСохраненныеНастройки = лУзелОбмена.СохраненныеНастройки.Получить();
				
				Если лСохраненныеНастройки.Свойство("Контрагенты") = Истина тогда
					
					НастройкиКонтрагентов 	= лСохраненныеНастройки.Контрагенты;
					
					Если НастройкиКонтрагентов.Свойство("СпособИдентификацииКонтрагентов") тогда
						лСпособИдентификацииКонтрагентов = НастройкиКонтрагентов.СпособИдентификацииКонтрагентов;
					Иначе
						лСпособИдентификацииКонтрагентов = "";	
					КонецЕсли;
					
					СпкПорядокИдентификацииЮ = новый СписокЗначений;
					СпкПорядокИдентификацииЮ.Добавить("Внешний идентификатор");
					СпкПорядокИдентификацииЮ.Добавить(лСпособИдентификацииКонтрагентов);
					СпкПорядокИдентификацииЮ.Добавить("Email");
					
					СпкПорядокИдентификацииФ = новый СписокЗначений;
					СпкПорядокИдентификацииФ.Добавить("Внешний идентификатор");
					СпкПорядокИдентификацииФ.Добавить(?(лСпособИдентификацииКонтрагентов = "ИНН", "Наименование", лСпособИдентификацииКонтрагентов));
					СпкПорядокИдентификацииФ.Добавить("Email");
	
					Если НЕ НастройкиКонтрагентов.Свойство("ПорядокИдентификацииФизЛиц") тогда
						НастройкиКонтрагентов.Вставить("ПорядокИдентификацииФизЛиц"	, СпкПорядокИдентификацииФ);	
					КонецЕсли;
					
					Если НЕ НастройкиКонтрагентов.Свойство("ПорядокИдентификацииЮрЛиц") тогда
						НастройкиКонтрагентов.Вставить("ПорядокИдентификацииЮрЛиц"	, СпкПорядокИдентификацииЮ);	
					КонецЕсли;
					
					лСохраненныеНастройки.Контрагенты = НастройкиКонтрагентов;	
					
				КонецЕсли;
				
				Если лСохраненныеНастройки.Свойство("ИнформацияОНоменклатуре") = Истина тогда
					
					НастройкиТоваров 	= лСохраненныеНастройки.ИнформацияОНоменклатуре;
					
					Для Каждого ТекСтрока из НастройкиТоваров.СоответствиеОсновныхРеквизитовНоменклатуры Цикл
						
						лНаименованиеПоля1С = ТекСтрока.НаименованиеПоля1С;
						
						Если Найти(лНаименованиеПоля1С, "Номенклатура") > 0 тогда 
							
							лНаименованиеПоля1С = стрЗаменить(лНаименованиеПоля1С, "Номенклатура", "[Номенклатура]");

							лНаименованиеПоля1С = "[Результат] = Строка(" + лНаименованиеПоля1С + ")";	
							
							ТекСтрока.НаименованиеПоля1С = лНаименованиеПоля1С;
						КонецЕсли;
						
					КонецЦикла;
					
					лСохраненныеНастройки.ИнформацияОНоменклатуре = НастройкиТоваров;	
					
				КонецЕсли;
				
				Попытка
					лТаблицаИнфоблоков = Выборка.СохраненнаяТаблицаКаталогов.Получить();
					
					Если ТипЗнч(лТаблицаИнфоблоков) = Тип("ТаблицаЗначений") тогда
						Для каждого ТекИнфоблок из лТаблицаИнфоблоков Цикл
							
							Если ТипЗнч(ТекИнфоблок.ДеревоГрупп) = Тип("ДеревоЗначений") тогда
								лИнфоблок = Справочники.Б_ПользовательскиеГруппыТоваров.НайтиПоНаименованию(ТекИнфоблок.ИдКаталога, Истина, Справочники.Б_ПользовательскиеГруппыТоваров.ПустаяСсылка());
								Если Не ЗначениеЗаполнено(лИнфоблок) тогда
											
									НовыйИнфоблок = Справочники.Б_ПользовательскиеГруппыТоваров.СоздатьЭлемент();
									НовыйИнфоблок.Наименование 			= ТекИнфоблок.ИдКаталога;
									НовыйИнфоблок.ИдентификаторРаздела 	= ТекИнфоблок.ИдКаталога;
									НовыйИнфоблок.Инфоблок				= Истина;
									НовыйИнфоблок.Записать();
									
									лИнфоблок = НовыйИнфоблок.Ссылка;
								КонецЕсли;
										
								 ОбновлениеДоВерсии7_0_0_0_ПереборПользовательскогоДереваГруппРекурсивно(ТекИнфоблок.ДеревоГрупп.Строки, лИнфоблок);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				Исключение
					СообщитьПодробно("Не удалось сконвертировать пользовательское дерево групп для настройки:" + Выборка.Наименование, ОсновныеПараметры);
				КонецПопытки;
				
				лУзелОбмена.СохраненныеНастройки = Новый ХранилищеЗначения(лСохраненныеНастройки);

				лУзелОбмена.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		СообщитьПодробно("Обновление до версии 7.0.0.0 завершено.", ОсновныеПараметры);
		Возврат Истина;
		
	Исключение
		
		СообщитьПодробно("Обновление до версии 7.0.0.0 завершено с ошибками. Продолжение обмена невозможно.", ОсновныеПараметры, Истина, Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Процедура ОбновлениеДоВерсии7_0_0_0_ПереборПользовательскогоДереваГруппРекурсивно(ДеревоГрупп, Родитель);
	
	Для Каждого СтрокаДерева Из ДеревоГрупп Цикл
		
		лРаздел = Справочники.Б_ПользовательскиеГруппыТоваров.НайтиПоРеквизиту("ИдентификаторРаздела", СтрокаДерева.ИдГруппы, Родитель);
		
		Если ЗначениеЗаполнено(лРаздел) тогда
			Сообщить("Раздел с ИД:" + СтрокаДерева.ИдГруппы + " будет пропущен, т.к. уже есть раздел с таким ИД.");
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Справочники.Б_ПользовательскиеГруппыТоваров.СоздатьЭлемент();
		НовыйЭлемент.Наименование 			= СтрокаДерева.Группа;
		НовыйЭлемент.ИдентификаторРаздела 	= СтрокаДерева.ИдГруппы;
		НовыйЭлемент.Родитель 				= Родитель;
		
		Для каждого ТекЭлемент из СтрокаДерева.Номенклатура Цикл
			НовыйЭлемент.Товары.Добавить().Номенклатура = ТекЭлемент.Значение;
		КонецЦикла;
		
		НовыйЭлемент.Записать();
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбновлениеДоВерсии7_0_0_0_ПереборПользовательскогоДереваГруппРекурсивно(СтрокаДерева.Строки, НовыйЭлемент.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


			///////////////////////////////////////////////////////////////////
			//		    ПРОЦЕДУРЫ И ФУНКЦИИ С ПОДПИСКОЙ НА СОБЫТИЯ          //
			/////////////////////////////////////////////////////////////////

Процедура ЗарегистрироватьИзмененияПриКопированииСправочниковДокументов(Источник, Отказ) Экспорт
	
	лМетаданные = Источник.Метаданные();
	ПризнакИспользованияОР 	= Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	
	Если Метаданные.ОбщиеРеквизиты.Б_Идентификатор.Состав.Найти(лМетаданные).Использование = ПризнакИспользованияОР тогда
		Источник.Б_Идентификатор = "";
	КонецЕсли;
	
	Если Метаданные.ОбщиеРеквизиты.Б_НомерВерсии.Состав.Найти(лМетаданные).Использование = ПризнакИспользованияОР тогда
		Источник.Б_НомерВерсии = "";
	КонецЕсли;
	
	Если Метаданные.ОбщиеРеквизиты.Б_ДатаДокумента.Состав.Найти(лМетаданные).Использование = ПризнакИспользованияОР тогда
		Источник.Б_ДатаДокумента = "";
	КонецЕсли;
	
КонецПроцедуры
			
Процедура ЗарегистрироватьИзмененияПередЗаписьюРегистраСведенийДляОбменаССайтами(Источник, Отказ, Замещение) Экспорт
	ЗарегистрироватьИзменения(Источник, Замещение);
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами(Источник, Отказ) Экспорт
	ЗарегистрироватьИзменения(Источник);
КонецПроцедуры

Процедура ПриУдаленииПроведенияДокументовДляОбменаССайтомОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзменения(Источник);
	
КонецПроцедуры

// Выборочно регистрирует изменения по узлам планов обмена с сайтом
//
//
// Параметры:
// Объект		- Объект метаданных - источник события
//   
Процедура ЗарегистрироватьИзменения(Объект, Замещение = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Объект);
	ТипОбъектаДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	ИзмененияЗарегестрированы = Ложь;
	
	// Регистрация типовых справочников
	Если ТипОбъекта = Тип("СправочникОбъект.ИнформационныеКарты") 
		ИЛИ ТипОбъекта = Тип("ПланВидовХарактеристикОбъект.СвойстваОбъектов")     
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Номенклатура")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Контрагенты")   		 
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.КлассификаторЕдиницИзмерения") тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
		
		ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(ТипЗнч(Объект.Ссылка));	
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") 
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.ЗначенияСвойствОбъектов")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Организации")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Пользователи")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Подразделения")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.КлассификаторСтранМира")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Валюты")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.КонтактныеЛица")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Склады")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.КонтактныеЛицаКонтрагентов") 
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.НоменклатурныеГруппы") Тогда
		
		ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(ТипЗнч(Объект.Ссылка));	
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ХранилищеДополнительнойИнформации") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Объект);
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Б_ПользовательскиеГруппыТоваров") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Б_ПользовательскиеГруппыТоваровТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВремТовары
		|ИЗ
		|	Справочник.Б_ПользовательскиеГруппыТоваров.Товары КАК Б_ПользовательскиеГруппыТоваровТовары
		|ГДЕ
		|	Б_ПользовательскиеГруппыТоваровТовары.Ссылка В ИЕРАРХИИ(&Раздел)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВремТовары.Номенклатура
		|			ИЗ
		|				ВремТовары)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВремТовары");
		
		Запрос.УстановитьПараметр("Раздел", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Выборка.Ссылка);
		КонецЦикла;	
		
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда 
			
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Владелец.Владелец);
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ХарактеристикиНоменклатуры")Тогда			
		
		ИзмененияЗарегестрированы = Истина;
		
		Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда 
			
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Владелец);
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект);
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ЦеновыеГруппы") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЦеноваяГруппа В ИЕРАРХИИ(&ЦеноваяГруппа)");
		
		Запрос.УстановитьПараметр("ЦеноваяГруппа", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Выборка.Ссылка);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ВидыДисконтныхКарт") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнформационныеКарты.Ссылка КАК КартаЛояльности
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|ГДЕ
		|	ИнформационныеКарты.ВидДисконтнойКарты = &ВидКарты";
		Запрос.УстановитьПараметр("ВидКарты",Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Выборка.КартаЛояльности);
		КонецЦикла;
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
		
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ОтменаСкидокНоменклатуры") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для Каждого ТекСтрока из  Объект.Документы Цикл
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(ТекСтрока.УстановкаСкидокНоменклатуры);
		КонецЦикла;
		
	//Регистрация регистров
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗначенияСвойствОбъектов") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			ТипДанных = ТипЗнч(Запись.Объект);
			
			Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Объект);
			ИначеЕсли ТипДанных = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
				Если Запись.Объект.ПолучитьОбъект() <> Неопределено Тогда
					Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Объект.Владелец);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.Б_СвойстваТоваровДокументов") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Документ);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.НазначенияСвойствОбъектов") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			ТипДанных = ТипЗнч(Запись.Объект);
			
			Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Объект);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыНаСкладах")
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыВРознице")
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыВНТТ")
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыВРезервеНаСкладах")
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыКПередачеСоСкладов")
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") 
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.КомплектующиеНоменклатуры") Тогда
		
			ИзмененияЗарегестрированы = Истина;
		Если Замещение Тогда
			ОбъектМетаданных = Объект.Метаданные();
			//БВ
			//ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
			ИмяБазовогоТипа = ОбщегоНазначенияДополнительно.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
			//
			
			Если ИмяБазовогоТипа = "РегистрыСведений" Тогда
				
				СтарыйНаборЗаписей = РегистрыСведений[ОбъектМетаданных.Имя].СоздатьНаборЗаписей();
				
			ИначеЕсли ИмяБазовогоТипа = "РегистрыНакопления" Тогда
				
				СтарыйНаборЗаписей = РегистрыНакопления[ОбъектМетаданных.Имя].СоздатьНаборЗаписей();
				
			Иначе
				
				УстановитьПривилегированныйРежим(Ложь);
				
				Возврат;
				
			КонецЕсли;
			
			Для Каждого ЗначениеОтбора Из Объект.Отбор Цикл
				
				Если ЗначениеОтбора.Использование = Ложь Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
				СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
				СтрокаОтбора.Использование = Истина;
				
			КонецЦикла;
			
			СтарыйНаборЗаписей.Прочитать();
			
			Для каждого Запись Из СтарыйНаборЗаписей Цикл
			
				Если ЗначениеЗаполнено(Запись.Номенклатура) тогда 
					Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Номенклатура);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого Запись Из Объект Цикл
			
			Если ЗначениеЗаполнено(Запись.Номенклатура) тогда
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Номенклатура);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ШтрихКоды") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			Если ТипЗнч(Запись.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Владелец);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ЗаказыПокупателей") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			Если ТипЗнч(Запись.ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя")
				И ЗначениеЗаполнено(Запись.ЗаказПокупателя) Тогда
				
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.ЗаказПокупателя);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ВзаиморасчетыСКонтрагентами") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Для каждого Запись Из Объект Цикл
			
			Если ТипЗнч(Запись.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")
				И ЗначениеЗаполнено(Запись.Сделка) Тогда
				
				Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Запись.Сделка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	// Регистрация документов
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ЗаказПокупателя") ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ОплатаОтПокупателяПлатежнойКартой") ИЛИ ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПлатежныйОрдерПоступлениеДенежныхСредств") ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(Объект.Ссылка);
		
	КонецЕсли;
	
	Если ТипОбъектаДокумент Тогда
		
		ИзмененияЗарегестрированы = Истина;
		
		МетаданныеДокумента = Объект.Метаданные();
		
		Если ЕстьТабЧастьДокумента("Заказы", МетаданныеДокумента) Тогда
			
			Для каждого Заказ Из Объект.Заказы Цикл
				Если МетаданныеДокумента.Имя = "ЗакрытиеВнутреннихЗаказов" Тогда
					ИмяРеквизитаТЧ = "ВнутреннийЗаказ";
				Иначе
					ИмяРеквизитаТЧ = "ЗаказПокупателя";
				КонецЕсли;
				Для каждого СтрокаТЧ Из Заказ[ИмяРеквизитаТЧ].Товары Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
						Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(СтрокаТЧ.Номенклатура);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		//БВ
		Если ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) Тогда
			Для каждого СтрокаТЧ Из Объект.Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
					Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(СтрокаТЧ.Номенклатура);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//

	КонецЕсли;
	
	Если НЕ ИзмененияЗарегестрированы тогда
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт. ЗарегистрироватьЭлементПользовательскогоСправочника(Объект);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);   
	
КонецПроцедуры

Функция ЕстьТабЧастьДокумента(ИмяТабЧасти, МетаданныеДокумента) 

	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		
		Если МетаданныеДокумента.ТабличныеЧасти[ИмяТабЧасти].Реквизиты.Найти("Номенклатура") = Неопределено тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 

КонецФункции // ЕстьТабЧастьДокумента()

Функция ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(ТипОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	СвойстваОбъектов.ТипЗначения,
	|	СвойстваОбъектов.Ссылка КАК Свойство
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов";
	
	ВыборкаСвойств = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСвойств.Следующий() Цикл
		
		Если ВыборкаСвойств.ТипЗначения.СодержитТип(ТипОбъекта) тогда
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ЗарегистрироватьИзменения(ВыборкаСвойств.Свойство);
		КонецЕсли;
		
	КонецЦикла;
	 
КонецФункции



			///////////////////////////////////////////////////////////////////
			//		    ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАБОТЕ С LONG PULLING        //
			/////////////////////////////////////////////////////////////////
			
// Процедура запускается фоновым заданием. Необходима для запуска реал тайм обемена заказов
Процедура ВыполнениеLongPullingФоновыхЗаданий() Экспорт
	
	Если НЕ Константы.Б_ИспользоватьМеханизмОбменаВРеальномВремени.Получить() тогда
		Сообщить("Механизм обмена в реальном времени отключен");
		Возврат;	
	КонецЕсли;
	
	НужныйПлан = Константы.Б_НастройкаОбменаДокументовВРеальномВремени.Получить();	
	
	Если ЗначениеЗаполнено(НужныйПлан) тогда

		Параметры = Новый Структура;
		НастройкиУспешноДобавлены = ДобавитьОсновныеНастройкиВПараметры(НужныйПлан, Параметры);
		
		Если НЕ НастройкиУспешноДобавлены тогда
			Возврат;
		КонецЕсли;
		
		НастройкиУспешноДобавлены = ДобавитьНастройкиОбменаВПараметры(НужныйПлан, Параметры);
		
		Если НЕ НастройкиУспешноДобавлены тогда
			Возврат;		
		КонецЕсли;
		
		Продолжаем = Истина;
		
		Пока Продолжаем Цикл
			
			ПустаяДата 	= Дата("01.01.0001 0:00:00");
			
			ТекДата  	= НачалоДня(ТекущаяДата());
			ТекВремя 	= ТекущаяДата() - ТекДата;
			
			НашеРегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б_ЗаданиеОбменССайтомОнлайн);
			НашеРасписание = НашеРегламентноеЗадание.Расписание;
			
			лВремяНачала= НашеРасписание.ВремяНачала 	- ПустаяДата;
			лВремяКонца = НашеРасписание.ВремяКонца 	- ПустаяДата;
			
			Если  ((ТекВремя < лВремяНачала И ЗначениеЗаполнено(НашеРасписание.ВремяНачала)) 
				ИЛИ (ТекущаяДата() < НашеРасписание.ДатаНачала И ЗначениеЗаполнено(НашеРасписание.ВремяНачала))
				ИЛИ (ТекущаяДата() > НашеРасписание.ДатаКонца И ЗначениеЗаполнено(НашеРасписание.ДатаКонца))
				ИЛИ (ТекВремя > лВремяКонца И ЗначениеЗаполнено(НашеРасписание.ВремяКонца))) И Б_СерверПовтИсп.ПолучитьПараметрыСоединения().Тип <> "Файл" тогда
				
				Продолжаем = Ложь;
				
			КонецЕсли;
			
			НастройкиПодключения = Новый Структура;
			
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			
			Если ПолучитьНастройкиПодключения(НастройкиПодключения, Параметры, Параметры.АдресСайта + "?type=listen&version=2.1") Тогда
				
				Результат = ВыполнениеLongPullingРекурсивно(Параметры, НастройкиПодключения);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает ответ от сайта при реал тайм обмене. Если ответ с кодом 302 - происходит переадресация 
//
// Параметры:
//  ПараметрыОбмена		 - 	 Настройки узла обмена  
//  НастройкиПодключения - 	 Структура с настройками подключения к сайту 
// Возвращаемое значение:
//   Истина, если обмен успешно завершен 
Функция ВыполнениеLongPullingРекурсивно(ПараметрыОбмена, НастройкиПодключения)
	
	Соединение = ПолучитьСоединениеССервером(НастройкиПодключения, ПараметрыОбмена);
	
	Если Соединение = Неопределено Тогда
		
		СообщитьПодробно("Авторизация не выполнена.", ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
		
	КонецЕсли;
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		
		ОтветСервера = Соединение.Получить(НастройкиПодключения.АдресСкрипта, ИмяФайлаОтвета);
	Исключение
		
		СообщитьПодробно("Не удалось получить данные с сервера на этом подключении в реал-тайм обмене. ", ПараметрыОбмена, Истина, Истина)
		
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);
	Исключение
	КонецПопытки;
	
	Если ОтветСервера <> Неопределено тогда
		
		Если ОтветСервера.КодСостояния = 200 тогда
			
			ВыполнитьОбмен(ПараметрыОбмена.ссылка);
			
		ИначеЕсли ОтветСервера.КодСостояния = 304 тогда
	
			Возврат Истина;
		
		ИначеЕсли ОтветСервера.КодСостояния = 302 тогда
			
			Переадресация = ОтветСервера.заголовки.получить("Location");			
			
			НастройкиПодключенияПереадресации = Новый Структура;
			
			Если ПолучитьНастройкиПодключения(НастройкиПодключенияПереадресации, ПараметрыОбмена, Переадресация) Тогда
				
				Результат = ВыполнениеLongPullingРекурсивно(ПараметрыОбмена, НастройкиПодключенияПереадресации);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


			///////////////////////////////////////////////////////////////////
			//		    ПРОЦЕДУРЫ И ФУНКЦИИ С РАБОТОЙ XDTO          		//
			/////////////////////////////////////////////////////////////////

Функция ПолучениеТипОбъектаXDTO(ПараметрыОбмена, Объект, Сложный = Ложь, ВладелецТип = Неопределено) Экспорт
	
	Если Сложный тогда
		
		Возврат	ВладелецТип.Свойства.Получить(Объект).Тип;
		
	иначе
		
		Возврат ПараметрыОбмена.МояФабрикаXDTO.Тип(ПараметрыОбмена.ПространствоИмен,Объект);
		
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, ЗначенияРеквизитов, ТипpЗначенияРеквизита, ИмяРеквизита, Значение) Экспорт
	
	ЗначениеРеквизита 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(ТипpЗначенияРеквизита);
	
	ЗначениеРеквизита.Наименование 	= ИмяРеквизита;
	ЗначениеРеквизита.Значение.добавить(XMLСтрока(Значение));
	
	ЗначенияРеквизитов.ЗначениеРеквизита.Добавить(ЗначениеРеквизита);
	
КонецПроцедуры

Процедура ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, ЗначенияСвойств, ТипЗначенияСвойства, ИдСвойства, НаименованиеСвойства, Значение) Экспорт
	
	ЗначенияСвойства 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(ТипЗначенияСвойства);
	
	ЗначенияСвойства.Ид 			= ИдСвойства;
	ЗначенияСвойства.Наименование 	= НаименованиеСвойства;
	ЗначенияСвойства.Значение.добавить(XMLСтрока(Значение));
	
	ЗначенияСвойств.ЗначенияСвойства.Добавить(ЗначенияСвойства);
	
КонецПроцедуры

Функция ПолучитьАдресXDTO(ПараметрыОбмена, ПредставлениеАдреса) Экспорт
	
	XDTOАдресТип 				= ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Адрес");
	XDTOАдресноеПолеТип 		= ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "АдресноеПоле", Истина, XDTOАдресТип);
	
	XDTOАдрес					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOАдресТип);
	
	XDTOАдрес.Представление 	= ПредставлениеАдреса.Представление;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле1) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Почтовый индекс", ПредставлениеАдреса.Поле1);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле1) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Страна", ПредставлениеАдреса.Поле1);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле2) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Регион", ПредставлениеАдреса.Поле2);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле3) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Район", ПредставлениеАдреса.Поле3);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле4) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Город", ПредставлениеАдреса.Поле4);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле5) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Населенный пункт", ПредставлениеАдреса.Поле5);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле6) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Улица", ПредставлениеАдреса.Поле6);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле7) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Дом", ПредставлениеАдреса.Поле7);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле8) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Корпус", ПредставлениеАдреса.Поле8);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса.Поле9) тогда
		ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, "Квартира", ПредставлениеАдреса.Поле9);	
	КонецЕсли;
	
	Возврат XDTOАдрес; 
	
КонецФункции

Процедура ДобавитьАдресноеПолеXDTO(ПараметрыОбмена, XDTOАдрес, XDTOАдресноеПолеТип, ТипПоля, Значение) Экспорт
	
	XDTOАдресноеПоле			= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOАдресноеПолеТип);
	XDTOАдресноеПоле.Тип      	= ТипПоля;
	XDTOАдресноеПоле.Значение 	= Значение;  	
	XDTOАдрес.АдресноеПоле.Добавить(XDTOАдресноеПоле);	
	
КонецПроцедуры

Функция ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, ВидКонтакта, ПредставлениеКонтакта) Экспорт

	XDTOКонтакт				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтактТип);

	XDTOКонтакт.Тип 		= ВидКонтакта;
	XDTOКонтакт.Значение 	= ПредставлениеКонтакта;
	
	Возврат XDTOКонтакт;
	
КонецФункции

Функция ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип) Экспорт
	
	XDTOКоммерческаяИнформация 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКоммерческаяИнформацияТип); 
	XDTOКоммерческаяИнформация.ВерсияСхемы 		= ПараметрыОбмена.ВерсияСхемы;
	XDTOКоммерческаяИнформация.ДатаФормирования = XMLСтрока(ТекущаяДата());
	
	возврат XDTOКоммерческаяИнформация;
	
КонецФункции

Функция ЭтоСписокXDTO(ОбъектXDTO) Экспорт
	
	Если ТипЗнч(ОбъектXDTO) = Тип("СписокXDTO") тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОбъектXDTOСодержитСвойство(ОбъектXDTO, Свойство) Экспорт
	
	ЕстьСвойство = ОбъектXDTO.Свойства().Получить(Свойство) <> Неопределено
		И ОбъектXDTO[Свойство] <> Неопределено;
		
	Возврат ЕстьСвойство;
	
КонецФункции

Функция СвойствоXDTOЗаполнено(СвойствоXDTO)Экспорт
	
	СвойствоЗаполнено = Истина;
	
	Если ТипЗнч(СвойствоXDTO) = Тип("ОбъектXDTO")
		ИЛИ ТипЗнч(СвойствоXDTO) = Тип("СписокXDTO")
		ИЛИ НЕ ЗначениеЗаполнено(СвойствоXDTO) Тогда
		
		СвойствоЗаполнено = Ложь;
		
	КонецЕсли;
	
	Возврат СвойствоЗаполнено;
	
КонецФункции

Функция ДанныеЗаказовВXDTO(ПараметрыОбмена, СтрокаXML) Экспорт
	
	ОбъектXML = Новый ЧтениеXML;
	
	Попытка
		
		ОбъектXML.УстановитьСтроку(СтрокаXML);
		
	Исключение
		
		СообщитьПодробно("Не удалось прочитать XML.", ПараметрыОбмена);	
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Попытка
		КоммерческаяИнформацияXDTO = ПараметрыОбмена.МояФабрикаXDTO.ПрочитатьXML(ОбъектXML);
	Исключение
		
		СообщитьПодробно("Не удалось прочитать XML.", ПараметрыОбмена);	
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат КоммерческаяИнформацияXDTO;
	
КонецФункции

Функция ПолучитьМассивОбъектовСпискаXDTO(СписокXDTO) Экспорт
	
	МассивОбъектовXDTO = Новый Массив;
	
	Если ТипЗнч(СписокXDTO) = Тип("СписокXDTO") Тогда
		
		Для каждого ОбъектXDTO Из СписокXDTO Цикл 
			МассивОбъектовXDTO.Добавить(ОбъектXDTO);
		КонецЦикла;
		
	Иначе
		МассивОбъектовXDTO.Добавить(СписокXDTO);
	КонецЕсли;
	
	Возврат МассивОбъектовXDTO;
	
КонецФункции

Функция ПолучитьЗначениеПоСвойству(ОбъектXDTO, Свойство, ТипСвойства) Экспорт
	
	Результат = "";
	
	Если ОбъектXDTOСодержитСвойство(ОбъектXDTO, Свойство)Тогда
		Если СвойствоXDTOЗаполнено(ОбъектXDTO[Свойство]) тогда
			Результат = XMLЗначение(Тип(ТипСвойства), ОбъектXDTO[Свойство]);	
		КонецЕсли;
	КонецЕсли;		
	
	Возврат Результат;	
	
КонецФункции

Функция ОбработатьЗначенияРеквизитовXDTO(ПараметрыОбмена, ЗначенияРеквизитовXDTO)Экспорт 
	
	тзнЗначенияРеквизитов = Новый ТаблицаЗначений;
	тзнЗначенияРеквизитов.Колонки.Добавить("Наименование");
	тзнЗначенияРеквизитов.Колонки.Добавить("Значение");
	
	
	Если ОбъектXDTOСодержитСвойство(ЗначенияРеквизитовXDTO, "ЗначениеРеквизита") Тогда
		
		ЗначениеРеквизитаXDTO = ЗначенияРеквизитовXDTO.ЗначениеРеквизита;
		
		Если ЭтоСписокXDTO(ЗначениеРеквизитаXDTO) тогда
			Для каждого ТекЗначениеРеквизита из ЗначениеРеквизитаXDTO Цикл
				
				НовСтр 				= тзнЗначенияРеквизитов.Добавить();
				НовСтр.Наименование = ПолучитьЗначениеПоСвойству(ТекЗначениеРеквизита, "Наименование"	, "Строка");
				НовСтр.Значение	 	= ПолучитьЗначениеПоСвойству(ТекЗначениеРеквизита, "Значение"		, "Строка");
				
			КонецЦикла;
		Иначе
			НовСтр 				= тзнЗначенияРеквизитов.Добавить();
				НовСтр.Наименование = ПолучитьЗначениеПоСвойству(ТекЗначениеРеквизита, "Наименование"	, "Строка");
				НовСтр.Значение	 	= ПолучитьЗначениеПоСвойству(ТекЗначениеРеквизита, "Значение"		, "Строка");
			
		КонецЕсли;	
		
	Конецесли;

    Возврат тзнЗначенияРеквизитов;
	
КонецФункции

Функция ОбработатьЗначенияСвойствXDTO(ПараметрыОбмена, ИнформацияОЧекеXDTO)Экспорт
	
	тзнЗначенияСвойствXDTO = Новый ТаблицаЗначений;
	тзнЗначенияСвойствXDTO.Колонки.Добавить("Ид");
	тзнЗначенияСвойствXDTO.Колонки.Добавить("Наименование");
	тзнЗначенияСвойствXDTO.Колонки.Добавить("Значение");
	
	Если ОбъектXDTOСодержитСвойство(ИнформацияОЧекеXDTO, "ЗначенияСвойств") Тогда
		
		ЗначенияСвойствXDTO = ИнформацияОЧекеXDTO.ЗначенияСвойств;
		
		Если ЭтоСписокXDTO(ЗначенияСвойствXDTO) тогда
			Для каждого ТекЗначениеСвойства из ЗначенияСвойствXDTO Цикл
				НовСтр 				= тзнЗначенияСвойствXDTO.Добавить();
				НовСтр.Ид 			= ПолучитьЗначениеПоСвойству(ТекЗначениеСвойства, "Ид"				, "Строка");
				НовСтр.Наименование = ПолучитьЗначениеПоСвойству(ТекЗначениеСвойства, "Наименование"	, "Строка");
				НовСтр.Значение	 	= ПолучитьЗначениеПоСвойству(ТекЗначениеСвойства, "Значение"		, "Строка");
			КонецЦикла;
		Иначе
			НовСтр 				= тзнЗначенияСвойствXDTO.Добавить();
			НовСтр.Ид 			= ПолучитьЗначениеПоСвойству(ЗначенияСвойствXDTO.ЗначенияСвойства, "Ид"			, "Строка");
			НовСтр.Наименование = ПолучитьЗначениеПоСвойству(ЗначенияСвойствXDTO.ЗначенияСвойства, "Наименование"	, "Строка");
			НовСтр.Значение	 	= ПолучитьЗначениеПоСвойству(ЗначенияСвойствXDTO.ЗначенияСвойства, "Значение"		, "Строка");
		КонецЕсли;	
		
	Конецесли;

    Возврат тзнЗначенияСвойствXDTO;
	
КонецФункции

Функция ОбработатьЗначенияСкидокXDTO(ПараметрыОбмена, СкидкиXDTO)Экспорт 
	
	тзнСкидок = Новый ТаблицаЗначений;
	тзнСкидок.Колонки.Добавить("Наименование");
	тзнСкидок.Колонки.Добавить("Процент");
	тзнСкидок.Колонки.Добавить("Сумма");
	тзнСкидок.Колонки.Добавить("УчтеноВСумме");
	
	
	Если ОбъектXDTOСодержитСвойство(СкидкиXDTO, "Скидка") Тогда
		
		СкидкаXDTO = СкидкиXDTO.Скидка;
		
		Если ЭтоСписокXDTO(СкидкаXDTO) тогда
			Для каждого ТекЗначениеСкидки из СкидкаXDTO Цикл
				
				НовСтр 				= тзнСкидок.Добавить();
				НовСтр.Наименование = ПолучитьЗначениеПоСвойству(ТекЗначениеСкидки, "Наименование"	, "Строка"); 
				НовСтр.Процент	 	= ПолучитьЗначениеПоСвойству(ТекЗначениеСкидки, "Процент"		, "Число"); 
				НовСтр.Сумма 		= ПолучитьЗначениеПоСвойству(ТекЗначениеСкидки, "Сумма"			, "Число"); 
				НовСтр.УчтеноВСумме	= ПолучитьЗначениеПоСвойству(ТекЗначениеСкидки, "УчтеноВСумме"	, "Булево"); 
				
			КонецЦикла;
		Иначе
			НовСтр 				= тзнСкидок.Добавить();
			НовСтр.Наименование = ПолучитьЗначениеПоСвойству(СкидкаXDTO, "Наименование"	, "Строка"); 
			НовСтр.Процент	 	= ПолучитьЗначениеПоСвойству(СкидкаXDTO, "Процент"		, "Число"); 
			НовСтр.Сумма 		= ПолучитьЗначениеПоСвойству(СкидкаXDTO, "Сумма"		, "Число"); 
			НовСтр.УчтеноВСумме	= ПолучитьЗначениеПоСвойству(СкидкаXDTO, "УчтеноВСумме"	, "Булево"); 
			
		КонецЕсли;	
		
	Конецесли;

    Возврат тзнСкидок;
	
КонецФункции

Функция ОбработатьИнформациюОЧеке(ПараметрыОбмена, ИнформацияОЧекеXDTO)

	ИнформацияОЧеке = Новый Структура;
	ИнформацияОЧеке.Вставить("Ид", ПолучитьЗначениеПоСвойству(ИнформацияОЧекеXDTO, "Ид", "Строка")); 	
	ИнформацияОЧеке.Вставить("ЗначенияСвойств", ОбработатьЗначенияСвойствXDTO(ПараметрыОбмена, ИнформацияОЧекеXDTO)); 	
	
	Возврат ИнформацияОЧеке;
	
КонецФункции

Функция ОбработатьИнформацияОЧекахXDTO(ПараметрыОбмена, ИнформацияОЧекахXDTO)Экспорт
	
	тзнИнформацияОЧекахX = Новый ТаблицаЗначений;
	тзнИнформацияОЧекахX.Колонки.Добавить("Чек");
	
	Если ОбъектXDTOСодержитСвойство(ИнформацияОЧекахXDTO, "ИнформацияОЧеке") Тогда
		
		ИнформацияОЧекеXDTO = ИнформацияОЧекахXDTO.ИнформацияОЧеке;
		
		Если ЭтоСписокXDTO(ИнформацияОЧекеXDTO) тогда
			Для Каждого ТекЗначениеРеквизита из ИнформацияОЧекеXDTO Цикл
				НовСтр 			= тзнИнформацияОЧекахX.Добавить();
				НовСтр.Чек 		= ОбработатьИнформациюОЧеке(ПараметрыОбмена, ТекЗначениеРеквизита);
			КонецЦикла;
		Иначе
			НовСтр 				= тзнИнформацияОЧекахX.Добавить();
			НовСтр.Чек 			= ОбработатьИнформациюОЧеке(ПараметрыОбмена, ИнформацияОЧекеXDTO);
		КонецЕсли;	
		
	Конецесли;
	//НовСтр.Значение	 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ТекЗначениеРеквизита, "Значение"		, "Строка");
    Возврат тзнИнформацияОЧекахX;
	
КонецФункции


			///////////////////////////////////////////////////////////////////
			//		    ПРОЦЕДУРЫ И ФУНКЦИИ С РАБОТОЙ HTTP          		//
			/////////////////////////////////////////////////////////////////
			
Процедура ДобавитьПараметрыПротоколаОбменаВСтруктуру(СтруктураПараметров)
	
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_Инициализация"			, "&mode=init");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_ПередачаФайла"			, "&mode=file&filename=");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_ИмпортФайлаСервером"		, "&mode=import&filename=");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_ПолучитьДанные"			, "&mode=query");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта", "&mode=success");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_ДеактивацияДанныхПоДате"	, "&mode=deactivate");
	СтруктураПараметров.Вставить("ПараметрЗапросаHTTP_ОкончаниеВыгрузкиТоваров"	, "&mode=complete");
	
	СтруктураПараметров.Вставить("ОтветСервера_ZIPРазрешен"								, "zip=yes");
	СтруктураПараметров.Вставить("ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена"	, "file_limit=");
	СтруктураПараметров.Вставить("ОтветСервера_УспешноеЗавершениеТекущейОперации"		, "success");
	СтруктураПараметров.Вставить("ОтветСервера_АварийноеЗавершениеТекущейОперации"		, "failure");
	СтруктураПараметров.Вставить("ОтветСервера_ВыполнениеТекущейОперации"				, "progress");
	
КонецПроцедуры	

Функция ПолучитьРезультатТестовогоПодключенияКСайту(ПараметрыОбмена) Экспорт
	
	НастройкиПодключения = Новый Структура;
	ТипСоединения = "catalog";
	
	Если НЕ ПолучитьНастройкиПодключения(НастройкиПодключения, ПараметрыОбмена) Тогда
		
		Возврат "Ошибка при получении параметров подключения к сайту.";
		
	КонецЕсли;
	
	Соединение = ПолучитьСоединениеССервером(НастройкиПодключения, ПараметрыОбмена);
	
	Если Соединение = Неопределено Тогда
		
		Возврат "Ошибка при установке соединения с сайтом.";
		
	КонецЕсли;
	
	ОтветСервера = "";
	
	Успешно = АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);
	
	Если Успешно Тогда
		Возврат "Соединение с сайтом успешно установлено.";
	Иначе
		Возврат "Не удалось установить соединение.";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНастройкиПодключения(НастройкиПодключения, ПараметрыОбмена,АдресПереадресации = "") Экспорт
	
	НастройкиПодключения.Вставить("Пользователь", ПараметрыОбмена.ИмяПользователя);
	НастройкиПодключения.Вставить("Пароль", ПараметрыОбмена.Пароль);
	
	Если НЕ АдресСайтаРазобран(НастройкиПодключения, ПараметрыОбмена, АдресПереадресации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкаПроксиСервера = ПолучениеФайловИзИнтернета.ПолучитьНастройкиПроксиНаСервере1СПредприятие();
	
	Если НастройкаПроксиСервера <> Неопределено
		И НастройкаПроксиСервера["ИспользоватьПрокси"] = Ложь Тогда
		НастройкаПроксиСервера = Неопределено;
	КонецЕсли;
	
	Протокол = ?(НастройкиПодключения.ЗащищенноеСоединение, "https", "http");
	Прокси = ?(НастройкаПроксиСервера = Неопределено, Неопределено, ПолучитьПрокси(НастройкаПроксиСервера, Протокол));
	
	НастройкиПодключения.Вставить("Прокси", Прокси);
	
	Возврат Истина;
КонецФункции

Функция ПолучитьПрокси(НастройкаПроксиСервера, Протокол) Экспорт
	
	Если НастройкаПроксиСервера <> Неопределено Тогда
		ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
		ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
		Если ИспользоватьПрокси Тогда
			Если ИспользоватьСистемныеНастройки Тогда
				// Системные настройки прокси-сервера
				Прокси = Новый ИнтернетПрокси(Истина);
			Иначе
				// Ручные настройки прокси-сервера
				Прокси = Новый ИнтернетПрокси;
				Прокси.Установить(Протокол, НастройкаПроксиСервера["Сервер"], НастройкаПроксиСервера["Порт"]);
				Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкаПроксиСервера["НеИспользоватьПроксиДляЛокальныхАдресов"];
				Прокси.Пользователь = НастройкаПроксиСервера["Пользователь"];
				Прокси.Пароль       = НастройкаПроксиСервера["Пароль"];
			КонецЕсли;
		Иначе
			// Не использовать прокси-сервер	
			Прокси = Новый ИнтернетПрокси(Ложь);
		КонецЕсли;
	Иначе
		Прокси = Неопределено;
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Функция ПолучитьСоединениеССервером(ПараметрыПодключения, ПараметрыОбмена) Экспорт
	
		Соединение = НеОпределено;
		
		Попытка
			
			СисИнфо = Новый СистемнаяИнформация;
			//БВ
			//Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.3.721") < 0  тогда	
			Если ОбщегоНазначенияКлиентСерверДополнительно.СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.3.721") < 0  тогда	
			//
				Выполнить("Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер, ПараметрыПодключения.Порт, ПараметрыПодключения.Пользователь, ПараметрыПодключения.Пароль, ПараметрыПодключения.Прокси, ПараметрыПодключения.ЗащищенноеСоединение)");
			Иначе
				
				Выполнить("Если НЕ ПараметрыПодключения.ЗащищенноеСоединение тогда
				|	ssl = Неопределено;
				|Иначе
				|	
				|	ssl = Новый ЗащищенноеСоединениеOpenSSL(
				|	Неопределено,
				|	Неопределено); 
				|КонецЕсли;
				|Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер, ПараметрыПодключения.Порт, ПараметрыПодключения.Пользователь, ПараметрыПодключения.Пароль, ПараметрыПодключения.Прокси, ,ssl)");	
			КонецЕсли;	
			
		Исключение
			
			СообщитьПодробно(" Не удалось установить соединение с сервером. Проверьте правильность адреса сервера, порт, имя пользователя и пароль.", ПараметрыОбмена, Истина, Истина);	
			
			Соединение = Неопределено;
			
		Конецпопытки;
		
	Возврат Соединение;
	
КонецФункции

Функция АвторизацияВыполнена(Соединение, ПараметрыПодключения, 
	ОтветСервера, ПараметрыОбмена, ТипСоединения = "catalog") Экспорт
	
	Соединение = ПолучитьСоединениеССервером(ПараметрыПодключения, ПараметрыОбмена);
	
	Если Соединение = Неопределено Тогда
		
		СообщитьПодробно("Авторизация не выполнена.", ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
	КонецЕсли;
	
	ОтветСервера = ПолучитьДанныеССервера(Соединение, ПараметрыПодключения.АдресСкрипта + "?type=" + ТипСоединения + "&mode=checkauth", , ПараметрыОбмена);
	
	Если ОтветСервера = Неопределено Тогда 
		
		СообщитьПодробно("Авторизация не выполнена. Ответ с сервера не пришел.", ПараметрыОбмена);	
		Возврат Ложь;
	КонецЕсли;
	
	Если СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) <> "success" Тогда
		
		СообщитьПодробно("Авторизация не выполнена." + Символы.ПС + "Не удалось установить соединение с сервером. Проверьте имя пользователя и пароль.", ПараметрыОбмена);	
		СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция АдресСайтаРазобран(НастройкиПодключения, ПараметрыОбмена, АдресПереадресации = "")
	
	АдресСайта = ?(АдресПереадресации = "", СокрЛП(ПараметрыОбмена.АдресСайта) , СокрЛП(АдресПереадресации)); 
	
	Сервер = ""; 
	
	Порт = 0;
	
	АдресСкрипта = "";
	
	ЗащищенноеСоединение = Ложь;
	
	Если НЕ ПустаяСтрока(АдресСайта) Тогда
		
		АдресСайта = СтрЗаменить(АдресСайта, "\", "/");
		АдресСайта = СтрЗаменить(АдресСайта, " ", "");
		
		Если НРег(Лев(АдресСайта, 7)) = "http://" Тогда
			АдресСайта = Сред(АдресСайта, 8);
		ИначеЕсли НРег(Лев(АдресСайта, 8)) = "https://" Тогда
			АдресСайта = Сред(АдресСайта, 9);
			ЗащищенноеСоединение = Истина;
		КонецЕсли;
		
		ПозицияСлэша = Найти(АдресСайта, "/");
		
		Если ПозицияСлэша > 0 Тогда
			Сервер = Лев(АдресСайта, ПозицияСлэша - 1);
			АдресСкрипта = Прав(АдресСайта, СтрДлина(АдресСайта) - ПозицияСлэша);
		Иначе	
			Сервер = АдресСайта;
			АдресСкрипта = "";
		КонецЕсли;
		
		ПозицияДвоеточия = Найти(Сервер, ":");
		ПортСтрока = "0";
		Если ПозицияДвоеточия > 0 Тогда
			СерверСПортом = Сервер;
			Сервер = Лев(СерверСПортом, ПозицияДвоеточия - 1);
			ПортСтрока = Прав(СерверСПортом, СтрДлина(СерверСПортом) - ПозицияДвоеточия);
		КонецЕсли;
		
		Попытка
			
			Порт = Число(ПортСтрока);
			
		Исключение
			
			СообщитьПодробно("Не удалось получить номер порта: " + ПортСтрока + Символы.ПС + "Проверьте правильность ввода адреса сайта.", ПараметрыОбмена, Истина, Истина);	
			
			Возврат Ложь;
			
		КонецПопытки;
		
		Если Порт = 0 Тогда
			Порт = ?(ЗащищенноеСоединение, 443, 80);
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПодключения.Вставить("Сервер", Сервер); 
	НастройкиПодключения.Вставить("Порт", Порт);
	НастройкиПодключения.Вставить("АдресСкрипта", АдресСкрипта);
	НастройкиПодключения.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеССервера(Соединение, ПараметрыЗапроса = "", Заголовки = "", ПараметрыОбмена) Экспорт
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		
		Соединение.Получить(СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
		
	Исключение
		
		СообщитьПодробно("Не удалось получить данные с сервера. Проверьте правильность адреса сервера, порт, имя пользователя и пароль," + Символы.ПС + "а также настройки подключения к Интернет.", ПараметрыОбмена, Истина, Истина)
		
	КонецПопытки;
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	ОтветСервера = НеОпределено;
	
	Если ФайлОтвета.Существует() Тогда
		ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);          
		ТекстОтвета = ЧтениеТекста.Прочитать();
		
		Если НЕ ПустаяСтрока(ТекстОтвета) Тогда
			ОтветСервера = ТекстОтвета;
		Иначе
			СообщитьПодробно("Получение данных с сервера: Получен пустой ответ сервера.", ПараметрыОбмена, Истина, Истина);	
		КонецЕсли;
		
	Иначе
		
		СообщитьПодробно("Получение данных с сервера: Ответ сервера не получен.", ПараметрыОбмена, Истина, Истина);	
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции

Функция ПолучитьРезультатОтправкиФайлаНаСервер(ПараметрыОбмена,ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="")
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Соединение.ОтправитьДляОбработки(ПолноеИмяФайла, СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		
		СообщитьПодробно(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ПараметрыОбмена, Истина, Истина);	
	КонецПопытки;
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);          
		ТекстОтвета = ЧтениеТекста.Прочитать();
		
		Если НЕ ПустаяСтрока(ТекстОтвета) Тогда
			ОтветСервера = ТекстОтвета;
		Иначе
			СообщитьПодробно("Получение данных с сервера: Получен пустой ответ сервера.", ПараметрыОбмена, Истина, Истина);	
		КонецЕсли;
		
	Иначе
		
		СообщитьПодробно("Отправка файла на сервер: Ответ сервера не получен.", ПараметрыОбмена, Истина, Истина);	
		
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции



			///////////////////////////////////////////////////////////////////
			//		   	 ПРОЦЕДУРЫ И ФУНКЦИИ С ПО РАБОТЕ С ФС        		//
			/////////////////////////////////////////////////////////////////

Функция ПолучитьПутьДляПлатформы(ПлатформаWindows, Путь) Экспорт
	
	Если ПлатформаWindows Тогда
		ЧтоМенять = "/";
		НаЧтоМенять = "\";
	Иначе
		ЧтоМенять = "\";
		НаЧтоМенять = "/";
	КонецЕсли;
	
	Путь = СтрЗаменить(Путь, ЧтоМенять, НаЧтоМенять);
	
	Возврат Путь;
	
КонецФункции

Функция СуществуетФайл(ИмяФайла) Экспорт
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует()  Тогда  
		Возврат Истина;
	КонецЕсли;  
	Возврат Ложь;
КонецФункции

Функция КаталогОчищен(Каталог, ПараметрыОбмена) Экспорт
	
	Попытка
		
		УдалитьФайлы(Каталог, "*.*");
		
	Исключение
		
		СообщитьПодробно("Не удалось очистить каталог обмена: (" + Каталог + ")", ПараметрыОбмена);	
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции



			///////////////////////////////////////////////////////////////////
			//		   	 ПРОЦЕДУРЫ И ФУНКЦИИ С ЛОГИРОВАНИЕМ         		//
			/////////////////////////////////////////////////////////////////

Процедура СообщитьПодробно(пСобытие, ОсновныеПараметры = Неопределено, Логирование = Истина, ЗаписьВЖурналРегистрации = Ложь) Экспорт
	
	#Если Клиент Тогда
		Сообщить(пСобытие);
	#КонецЕсли
	
	Если ЗаписьВЖурналРегистрации тогда
		ЗаписьЖурналаРегистрации("СобытияОбменаДанныхМодуляБитрикс", УровеньЖурналаРегистрации.Информация,,, пСобытие);
    КонецЕсли;
	
	Если Логирование и НЕ ОсновныеПараметры = Неопределено Тогда
		
		Если ОсновныеПараметры.ИмяФайлаЛога <> "" тогда
			
			Текст = Новый ЗаписьТекста(ОсновныеПараметры.ИмяФайлаЛога, КодировкаТекста.ANSI,,истина);
			Текст.ЗаписатьСтроку(Строка(ТекущаяДата()) + "--" + пСобытие);
			Текст.Закрыть(); 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОтображениеСостояния(ТекстСостояния)
	
	#Если Клиент Тогда
		Состояние(ТекстСостояния);
	#КонецЕсли
	
КонецПроцедуры

Процедура ДобавитьИнформациюООшибкеВОбмене(УзелОбмена, Ошибка) Экспорт
	
	лНаборЗаписей = РегистрыСведений.Б_ИнформацияОНастройкахОбменаССайтом.СоздатьНаборЗаписей();
	
	НоваяЗапись = РегистрыСведений.Б_ИнформацияОНастройкахОбменаССайтом.СоздатьМенеджерЗаписи();
	НоваяЗапись.НастройкаОбмена 			 = УзелОбмена;
	НоваяЗапись.ВидСостояния				 = "Ошибка";	
	НоваяЗапись.Ошибка						 = Ошибка;	
	НоваяЗапись.Записать();		
	
КонецПроцедуры


			///////////////////////////////////////////////////////////////////
			//		     ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ         				//
			/////////////////////////////////////////////////////////////////

Процедура ЗаданиеОбменССайтом(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбмена = ПланыОбмена.Б_ОбменССайтом.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыОбмена.ИспользоватьРегламентныеЗадания Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбмен(ПараметрыОбмена);
	
КонецПроцедуры

Функция ПолучитьВерсиюОбъекта(ПараметрыОбмена, Версия, ТипОбъекта) Экспорт
	
	 лВерсия = Версия;
	 
	Если (ТипОбъекта = "Товаров" ИЛИ ТипОбъекта = "Предложений") И ПараметрыОбмена.ПринудительнаяПолноеОбновлениеДанныхТовара тогда
		лВерсия = Версия + ПараметрыОбмена.ПрефиксВерсии;	
		Возврат лВерсия;
	КонецЕсли;
	
	Если ПараметрыОбмена.НастройкаВерсионностиВыгружаемыхДанных <> Неопределено тогда
		НайденноеЗначение = ПараметрыОбмена.НастройкаВерсионностиВыгружаемыхДанных.НайтиПоЗначению(ТипОбъекта);
		
		Если НайденноеЗначение <> Неопределено тогда
			Если НайденноеЗначение.Пометка тогда
				лВерсия = Версия + ПараметрыОбмена.ПрефиксВерсии;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат лВерсия;
	
КонецФункции

//процедура используется много где, поэтому Вид отбора лучше не трогать 
Процедура ЗаполнитьОтборПоТаблицеЗначений(Отбор, ТЗ, ВидОтбора = "") Экспорт 

	Для каждого ЭлементОтбора Из ТЗ Цикл
	
		СтрокаТаблицы = Неопределено;
		
		Для каждого стр Из Отбор Цикл
			
			Если стр.Представление = ЭлементОтбора.Представление
				И стр.ТипЗначения = ЭлементОтбора.ТипЗначения Тогда
				Если ПустаяСтрока(стр.Представление)
					И ПустаяСтрока(стр.ПутьКданным) Тогда
					
					Продолжить;
					
				КонецЕсли;
				СтрокаТаблицы = стр;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПустаяСтрока(ЭлементОтбора.ПутьКданным) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы = Неопределено Тогда
			
			Если ВидОтбора = "ОбщаяИнформация" тогда
				
				Если ЭлементОтбора.Имя = "СвойствоНоменклатуры" тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли ВидОтбора = "Свойства" тогда	
				Если ЭлементОтбора.Имя <> "СвойствоНоменклатуры" тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТаблицы = Отбор.Добавить(ЭлементОтбора.ПутьКданным, ЭлементОтбора.Имя, ЭлементОтбора.Представление);		
			
		КонецЕсли;
	
		СтрокаТаблицы.ВидСравнения = ЭлементОтбора.ВидСравнения;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЭлементОтбора, "Значение, ЗначениеПо, ЗначениеС, Использование");

	КонецЦикла;

КонецПроцедуры 

   

			///////////////////////////////////////////////////////////////////
			//			       ПРОЦЕДУРЫ И ФУНКЦИИ ОБМЕНА                   //
			/////////////////////////////////////////////////////////////////
			
Процедура ВыполнитьОбмен(Настройка, ПринудительнаяПолноеОбновлениеДанныхТовара = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОсновныеПараметры = Новый Структура;
	НастройкиУспешноДобавлены = ДобавитьОсновныеНастройкиВПараметры(Настройка, ОсновныеПараметры);
	
	Если НЕ НастройкиУспешноДобавлены тогда
		Возврат;
	КонецЕсли;
	
	СообщитьПодробно("______________________________________________________________________", ОсновныеПараметры);	
	СообщитьПодробно("Начало обмена узла " + Строка(Настройка), ОсновныеПараметры, Истина, Истина);	
	
	//Проверяем, необходимо ли сделать обновление базы.
	
	Если НЕ ПроверкаОбновленияДанныхМодуляОбменаССайтом(ОсновныеПараметры) тогда
		
		СообщитьПодробно("Не удалось установить все обновления. Продолжение выгрузки невозможно." , ОсновныеПараметры, Истина, Истина);	
		
		Возврат;
		
	КонецЕсли;
	
	НастройкиУспешноДобавлены = ДобавитьНастройкиОбменаВПараметры(Настройка, ОсновныеПараметры, ПринудительнаяПолноеОбновлениеДанныхТовара);
	
	Если НЕ НастройкиУспешноДобавлены тогда
		Возврат;		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгружатьНаСайт Тогда
		
		ОписаниеОшибки = "";
		
		НастройкиПодключения = Новый Структура;
		
		Если НЕ ПолучитьНастройкиПодключения(НастройкиПодключения, ОсновныеПараметры) Тогда
			
			СообщитьПодробно(ОписаниеОшибки, ОсновныеПараметры, Истина, Истина);	
			
			Возврат;
			
		КонецЕсли;
		
		ДобавитьПараметрыПротоколаОбменаВСтруктуру(НастройкиПодключения);
		
		ОсновныеПараметры.Вставить("НастройкиПодключения", НастройкиПодключения);
		
	КонецЕсли;
	
	//Обмен
	КаталогВыгрузки = "";
	
	Если НЕ ОсновныеПараметры.ВыгружатьНаСайт Тогда
		КаталогВыгрузки = ОсновныеПараметры.КаталогВыгрузки;
	КонецЕсли;
	
	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		КаталогВыгрузки = КаталогВременныхФайлов() + Строка(ГСЧ.СлучайноеЧисло()) + "\";
	Иначе
		КаталогВыгрузки = ОсновныеПараметры.КаталогВыгрузки;
		ПоследнийСимвол = Прав(КаталогВыгрузки, 1);
		Если НЕ ПоследнийСимвол = "\" Тогда
			КаталогВыгрузки = КаталогВыгрузки + "\";
		КонецЕсли;
	КонецЕсли;
	
	ПодкаталогБезопасностиКаталогаВыгрузки = "webdata\";
	КаталогНаДиске = КаталогВыгрузки + ПодкаталогБезопасностиКаталогаВыгрузки + СокрЛП(ОсновныеПараметры.Ссылка.Код);
	КаталогНаДиске = ПолучитьПутьДляПлатформы(ОсновныеПараметры.ПлатформаWindows, КаталогНаДиске);
	
	СообщитьПодробно("  Каталог на диске: " + КаталогНаДиске, ОсновныеПараметры, Истина, Ложь);	
	
	Попытка
		СоздатьКаталог(КаталогНаДиске);
	Исключение
		
		СообщитьПодробно(ОписаниеОшибки(), ОсновныеПараметры, Истина, Истина);	
		
		Возврат;
		
	КонецПопытки;
	
	Если НЕ КаталогОчищен(КаталогНаДиске, ОсновныеПараметры) Тогда
		
		СообщитьПодробно("Не удалось очистить каталог: " + КаталогНаДиске + ". Продолжение выгрузки невозможно." , ОсновныеПараметры, Истина, Истина);	
		
		Возврат;
		
	КонецЕсли;
	
	ОсновныеПараметры.Вставить("КаталогНаДиске"	, КаталогНаДиске);
	ОсновныеПараметры.ФайлЗагрузки = ПолучитьПутьДляПлатформы(ОсновныеПараметры.ПлатформаWindows, ОсновныеПараметры.ФайлЗагрузки);
	
	ОсновныеПараметры.Вставить("ПодкаталогФайлов"	, "import_files");
	ОсновныеПараметры.Вставить("НаименованиеНалога"	, "НДС");
	ОсновныеПараметры.Вставить("НаименованиеСкидки"	, НСтр("ru = 'Скидка'"));
	
	
	Если ОсновныеПараметры.ОбменТоварами Тогда
		
		СообщитьПодробно("Выгрузка информации по товарам.", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка неотправленного пакета общей информации для товарам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "ОбщаяИнформация", Истина);
		СообщитьПодробно("Выгрузка неотправленного пакета общей информации для ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры			, "ОбщаяИнформация");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры	, "ОбщаяИнформация");
		
		Если ОсновныеПараметры.ВыгружатьСвойства тогда
			
			СообщитьПодробно("Выгрузка неотправленных пакетов данных о  свойствах.", ОсновныеПараметры);	
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Свойства", Истина);
			СообщитьПодробно("Выгрузка неотправленных пакетов данных о свойствах ЗАВЕРШЕНА", ОсновныеПараметры);	
			
			СообщитьПодробно("Выгрузка свойств товаров и предложений.", ОсновныеПараметры);	
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "Свойства");
			Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Свойства");
			СообщитьПодробно("Выгрузка свойств товаров и предложений ЗАВЕРШЕНА", ОсновныеПараметры);
			
		КонецЕсли;		
		
		СообщитьПодробно("Выгрузка неотправленных пакетов данных о товарах и предложениях.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Товары", Истина);
		СообщитьПодробно("Выгрузка неотправленных пакетов данных  о товарах и предложениях ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации  о товарах и предложениях.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "Товары");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Товары");
		СообщитьПодробно("Выгрузка информации  о товарах и предложениях ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгрузкаСкидок Тогда 
		
		СообщитьПодробно("Выгрузка информации по скидкам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Скидки", Истина);
		СообщитьПодробно("Выгрузка информации по скидкам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации по скидкам", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "Скидки");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Скидки");
		СообщитьПодробно("Выгрузка информации по скидкам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгрузкаКартЛояльности Тогда 
		
		СообщитьПодробно("Выгрузка информации по дисконтным картам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "КартыЛояльности", Истина);
		СообщитьПодробно("Выгрузка информации по дисконтным картам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации по дисконтным картам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "КартыЛояльности");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "КартыЛояльности", Истина);
		СообщитьПодробно("Выгрузка информации по дисконтным картам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгрузкаКонтрагентов Тогда
		
		СообщитьПодробно("Выгрузка неотправленных пакетов о информации по контрагентам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Контрагенты", Истина);
		СообщитьПодробно("Выгрузка неотправленных пакетов и информации по контрагентам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации по контрагентам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "Контрагенты");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Контрагенты");
		СообщитьПодробно("Выгрузка информации по контрагентам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ОбменДокументами Тогда
		
		СообщитьПодробно("Загрузка информации по документам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииЗагрузкиДанныхИзСайта.ЗагрузкаДокументов(ОсновныеПараметры);
		СообщитьПодробно("Загрузка информации по документам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		
		СообщитьПодробно("Выгрузка неотправленных пакетов о информации по документам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Документы", Истина);
		СообщитьПодробно("Выгрузка неотправленных пакетов о информации по документам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации по документам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "Документы");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "Документы");
		СообщитьПодробно("Выгрузка информации по документам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгрузкаПользовательскихСправочников Тогда 
		
		СообщитьПодробно("Выгрузка информации по пользовательским справочникам.", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "ПользовательскиеСправочники", Истина);
		СообщитьПодробно("Выгрузка информации по пользовательским справочникам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
		СообщитьПодробно("Выгрузка информации по пользовательским справочникам", ОсновныеПараметры);	
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеПакетовДанных(ОсновныеПараметры, "ПользовательскиеСправочники");
		Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ФормированиеФайловXMLОбменаДанных(ОсновныеПараметры, "ПользовательскиеСправочники");
		СообщитьПодробно("Выгрузка информации по пользовательским справочникам ЗАВЕРШЕНА", ОсновныеПараметры);	
		
	КонецЕсли;
	
	Если ОсновныеПараметры.ВыгружатьЛогНаСайт И ОсновныеПараметры.ВыгружатьНаСайт И ОсновныеПараметры.ИмяФайлаЛога <> "" тогда
		
		СообщитьПодробно("Выгрузка текущего лог файла на сайт.", ОсновныеПараметры, Истина);	
		
		ВыгрузитьЛогФайлНаСайт(ОсновныеПараметры);
		
	КонецЕсли;
	
	УдалитьФайлы(ОсновныеПараметры.ФайлСхемы);
	
	Если ОсновныеПараметры.ОбменВыполненБезОшибок тогда
		лНаборЗаписей = РегистрыСведений.Б_ПакетныйОбмен.СоздатьНаборЗаписей();
		лНаборЗаписей.Отбор.Объект.Установить(ОсновныеПараметры.Ссылка);
		лНаборЗаписей.Записать();
		
		лНоваяЗапись = РегистрыСведений.Б_ИнформацияОНастройкахОбменаССайтом.СоздатьМенеджерЗаписи();
		лНоваяЗапись.НастройкаОбмена 				= ОсновныеПараметры.Ссылка;
		лНоваяЗапись.ВидСостояния 					= "Принудительная полная выгрузка";
		лНоваяЗапись.ПринудительнаяПолнаяВыгрузка 	= Ложь;
		лНоваяЗапись.Записать();
	КонецЕсли;
	
	СообщитьПодробно("Завершение обмена " + Строка(Настройка), ОсновныеПараметры, Истина, Истина);	
	СообщитьПодробно("______________________________________________________________________", ОсновныеПараметры);	
	ОтображениеСостояния("");	
	
КонецПроцедуры   

Функция ПолучитьМассивРеквизитов5ВерсииМодуля()
	
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить("АдресСайта");
	МассивРеквизитов.Добавить("ВыгружатьЛогНаСайт");
	МассивРеквизитов.Добавить("ВыгружатьНаСайт");
	МассивРеквизитов.Добавить("ДеактивироватьТоварыЕслиПолнаяВыгрузка");
	МассивРеквизитов.Добавить("ИдентификаторРегламентногоЗадания");
	МассивРеквизитов.Добавить("ИмяПользователя");
	МассивРеквизитов.Добавить("ИспользоватьРегламентныеЗадания");
	МассивРеквизитов.Добавить("Код");
	МассивРеквизитов.Добавить("КаталогВыгрузки");
	МассивРеквизитов.Добавить("КаталогЛога");
	МассивРеквизитов.Добавить("Комментарий");
	МассивРеквизитов.Добавить("НастройкаВерсионностиВыгружаемыхДанных");
	МассивРеквизитов.Добавить("ОбменВРеальномВремени");
	МассивРеквизитов.Добавить("Пароль");
	МассивРеквизитов.Добавить("ТаймаутМеждуПовторамиНеудачноОтправленныхПакетах");
	МассивРеквизитов.Добавить("ФайлЗагрузки");
	МассивРеквизитов.Добавить("ХранитьФайлыОбменаНаСайте");
	МассивРеквизитов.Добавить("ЧислоПовторовПриНеудачноОтправленныхПакетах");
	МассивРеквизитов.Добавить("Идентификатор");
	МассивРеквизитов.Добавить("ВыгружатьТолькоИзменения");
	МассивРеквизитов.Добавить("СохраненнаяТаблицаКаталогов");
	МассивРеквизитов.Добавить("СохраненнаяТаблицаОтборовКаталогов");
	МассивРеквизитов.Добавить("СохраненныеНастройки");
	МассивРеквизитов.Добавить("ОбменДокументами");
	МассивРеквизитов.Добавить("ОбменТоварами");
	МассивРеквизитов.Добавить("ОбменПользовательскимиСправочниками");
	
	Возврат МассивРеквизитов;
	
КонецФункции
			
Функция ДобавитьОсновныеНастройкиВПараметры(УзелОбмена, Параметры) Экспорт
	
	МассивРеквизитов = ПолучитьМассивРеквизитов5ВерсииМодуля();

	//добавляем реквизиты узла обмена
	Для каждого ТекРеквизит из УзелОбмена.Метаданные().Реквизиты Цикл
		
		Если МассивРеквизитов.Найти(ТекРеквизит.Имя) = Неопределено тогда
			Продолжить;
		КонецЕсли;         
		
		Параметры.Вставить(ТекРеквизит.Имя, УзелОбмена[ТекРеквизит.Имя]);
	КонецЦикла;
	
	//Добавляем свойства, которые используем в обмене
	Параметры.Вставить("СвойствоИдМетодаОплаты", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Метод оплаты ИД", Истина));
	Параметры.Вставить("СвойствоИдентификаторОтправления", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Идентификатор отправления", Ложь));
	
	Параметры.Вставить("ОбменВыполненБезОшибок"		, Истина);
	//общие настройки
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	лКаталогДляСхемыXSD = КаталогВременныхФайлов() + Строка(ГСЧ.СлучайноеЧисло()) + "\" + СокрЛП(УзелОбмена.Код);

	СоздатьКаталог(лКаталогДляСхемыXSD);

	лфайлСхемыXSD 	= лКаталогДляСхемыXSD +"\SchemaXSD_Exchange.XSD";
	СхемаXSD  		= ПланыОбмена.Б_ОбменССайтом.ПолучитьМакет("СхемаXSDОбмена");
	СхемаXSD.Записать(лфайлСхемыXSD);

	Параметры.Вставить("ПространствоИмен", "urn:1C.ru:commerceml_3");
	Параметры.Вставить("МояФабрикаXDTO", );
	           
	Параметры.Вставить("ВерсияСхемы"		, "3.1");
	Параметры.Вставить("ФайлСхемы"			, лфайлСхемыXSD);
	
	Параметры.Вставить("ФорматСуммы"		, "ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");
	Параметры.Вставить("ФорматКоличества"	, "ЧРД=.; ЧН=; ЧГ=");
	
	Параметры.Вставить("Ссылка"				, УзелОбмена);
	
	ГСЧ = новый ГенераторСлучайныхЧисел;	
	Параметры.Вставить("ИдентификаторОбмена", Строка(Формат(ГСЧ.СлучайноеЧисло(), "ЧГ=0"))); 
	
	Параметры.Вставить("ПрефиксВерсии"		, Строка(Формат(ТекущаяДата()-НачалоДня(ТекущаяДата()), "ЧГ=0"))); 
	
	Параметры.Вставить("УчетнаяПолитика"	, ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ТекущаяДата(), Ложь, , , Ложь));
	
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Параметры.Вставить("ПлатформаWindows", ПлатформаWindows);
	
	ДатаФормирования = ТекущаяДата();
	Параметры.Вставить("ДатаФормирования", ДатаФормирования);
																																																					
	//добавляем расширения картинок
	РазрешенныеТипыКартинок = Новый Массив;
	РазрешенныеТипыКартинок.Добавить("gif");
	РазрешенныеТипыКартинок.Добавить("jpg");
	РазрешенныеТипыКартинок.Добавить("jpeg");
	РазрешенныеТипыКартинок.Добавить("png");
	РазрешенныеТипыКартинок.Добавить(".gif");
	РазрешенныеТипыКартинок.Добавить(".jpg");
	РазрешенныеТипыКартинок.Добавить(".jpeg");
	РазрешенныеТипыКартинок.Добавить(".png");
	РазрешенныеТипыКартинок.Добавить("");
	Параметры.Вставить("РасширенияКартинок", РазрешенныеТипыКартинок);
	
	Параметры.НастройкаВерсионностиВыгружаемыхДанных = УзелОбмена.НастройкаВерсионностиВыгружаемыхДанных.Получить();  	
	
	Параметры.Вставить("ДатаДеактивацииПриПакетнойВыгрузке"		, Неопределено);
	
	//добавляем  данные для логирования
	Если Параметры.КаталогЛога = "" тогда
		
		Сообщить("Для настройки не задан каталог хранения лога. Лог будет храниться в каталоге выгрузки файлов.");
		
		Параметры.КаталогЛога = Параметры.КаталогВыгрузки;
		
		Если Параметры.КаталогЛога = "" тогда
			Сообщить("Не удалось указать каталог выгрузки в качестве каталога хранения лога. Ведение лога невозможно.");
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяФайлаЛога = "";
	Если НЕ ПустаяСтрока(Параметры.КаталогЛога) Тогда
		
		лКаталогЛога = ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, Параметры.КаталогЛога + "\reports"); 
			
		Если НЕ СуществуетФайл(лКаталогЛога) тогда
			СоздатьКаталог(лКаталогЛога);	
		КонецЕсли;
			
		ИмяФайлаЛога = ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, лКаталогЛога + "\") + "Exchange_" + "(" + УзелОбмена.Наименование +  ")" +  СокрЛП(Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd")) + ".txt";
		
	КонецЕсли;
	
	Параметры.Вставить("ИмяФайлаЛога", ИмяФайлаЛога);
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьНастройкиОбменаВПараметры(УзелОбмена, Параметры, ПринудительнаяПолноеОбновлениеДанныхТовара = Ложь) Экспорт
	
	ВыполнятьПолнуюВыгрузкуПринудительно = Ложь;
	Выборка = РегистрыСведений.Б_ИнформацияОНастройкахОбменаССайтом.Выбрать(Новый Структура("НастройкаОбмена" , УзелОбмена));
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСостояния = "Принудительная полная выгрузка" тогда
			ВыполнятьПолнуюВыгрузкуПринудительно = Выборка.ПринудительнаяПолнаяВыгрузка;
		КонецЕсли;
	КонецЦикла;
	Параметры.Вставить("ВыполнятьПолнуюВыгрузкуПринудительно", ВыполнятьПолнуюВыгрузкуПринудительно);	
	
	Параметры.Вставить("ПолнаяВыгрузка"	, (НЕ Параметры.ВыгружатьТолькоИзменения ИЛИ Параметры.ВыполнятьПолнуюВыгрузкуПринудительно));
	
	Если Параметры.ВыполнятьПолнуюВыгрузкуПринудительно ИЛИ ПринудительнаяПолноеОбновлениеДанныхТовара тогда
		Параметры.Вставить("ПринудительнаяПолноеОбновлениеДанныхТовара", Истина);   		
	Иначе
		Параметры.Вставить("ПринудительнаяПолноеОбновлениеДанныхТовара", Ложь);   		
	КонецЕсли;
	
	Если Параметры.ОбменТоварами Тогда
		
		ТаблицаКаталогов = Параметры.СохраненнаяТаблицаКаталогов.Получить();
		ДобавитьКлассификаторыВТаблицуКаталогов(ТаблицаКаталогов);
		Параметры.Вставить("ТаблицаКаталогов", ТаблицаКаталогов);
		
		Параметры.Вставить("ТаблицаОтборовКаталогов", Параметры.СохраненнаяТаблицаОтборовКаталогов.Получить());
		
	КонецЕсли;	
	
	
	///////////////////////////////////////
	// КЭШИРОВАНИЕ ОБЩЕЙ ИНФОРМАЦИИ     //
	/////////////////////////////////////

	тзнКэшДанных = новый ТаблицаЗначений;
	тзнКэшДанных.Колонки.Добавить("ИдКаталога");
	тзнКэшДанных.Колонки.Добавить("ОбщийСписокСкладов");
	тзнКэшДанных.Колонки.Добавить("ОбщийСписокТиповЦен");
	тзнКэшДанных.Колонки.Добавить("ОбщийСписокЕдиницИзмерений");
	////////////////////////////////////////////
	тзнКэшДанных.Колонки.Добавить("ИмяДанных");
	тзнКэшДанных.Колонки.Добавить("Значение");
	
	Параметры.Вставить("КэшДанных", тзнКэшДанных);
	
	///////////////////////////////////////
	// ПАРАМЕТРЫ ОБЪЕКТОВ               //
	/////////////////////////////////////
	
	СтрСохраненныхНастроек = Параметры.СохраненныеНастройки.Получить();	
	
	Если СтрСохраненныхНастроек = Неопределено тогда
		Сообщить("Ошибка в данных настройки. Пересоздадите эту настройку обмена.");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка		
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.ИнформацияОНоменклатуре);
		Параметры.НастройкаСвойствТоваровИХарактеристик = ПланыОбмена.Б_ОбменССайтом.ОбновитьСвойстваВТаблицеЗначений(Параметры.НастройкаСвойствТоваровИХарактеристик);
		
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.ПользовательскиеСправочники);
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.Скидки);
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.КартыЛояльности);
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.Контрагенты);
		  
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, СтрСохраненныхНастроек.Заказы);
	    ДобавитьСтруктурыНастроекВПараметры(Параметры, Параметры.СохраненныеНастройкиЗагружаемыхДокументов);
		
		//проверка корректности значений параметров объектов
		
		
		//соответствия касс конвертируем в одну таблицу.
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТиповС = Новый ОписаниеТипов(Массив);
	
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ДоговорыЭквайринга"));
		ОписаниеТиповЭТ = Новый ОписаниеТипов(Массив);

		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Кассы"));
		ОписаниеТиповК = Новый ОписаниеТипов(Массив);
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыОплатЧекаККМ"));
		ОписаниеТиповВО = Новый ОписаниеТипов(Массив);
		
		СоответствиеПлатежныхСистемИКасс = Новый ТаблицаЗначений;
		СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ИдПлатежнойСистемы"		, ОписаниеТиповС);
		СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("НазваниеПлатежнойСистемы", ОписаниеТиповС);
		СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("Касса"					, ОписаниеТиповК);
		СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ДоговорЭквайринга"		, ОписаниеТиповЭТ);
		СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ВидОплаты"				, ОписаниеТиповВО);
		
		Если ЗначениеЗаполнено(Параметры.СоответствиеПлатежныхСистемИКасс) тогда
			Для каждого ТекЭлемент из Параметры.СоответствиеПлатежныхСистемИКасс Цикл
				
				Для Каждого ТекПлатежнаяСистема из ТекЭлемент.ПлатежнаяСистема Цикл 
					НоваяСтрока = СоответствиеПлатежныхСистемИКасс.Добавить();
					НоваяСтрока.Касса 						= ТекЭлемент.Касса;
					НоваяСтрока.ДоговорЭквайринга 			= ТекЭлемент.ДоговорЭквайринга;
					НоваяСтрока.ИдПлатежнойСистемы 			= ТекПлатежнаяСистема.Значение;
					НоваяСтрока.НазваниеПлатежнойСистемы 	= ТекПлатежнаяСистема.Представление;
					НоваяСтрока.ВидОплаты 					= ТекЭлемент.ВидОплаты;
					
				КонецЦикла;		
				
			КонецЦикла;
			
		КонецЕсли;
		Параметры.СоответствиеПлатежныхСистемИКасс = СоответствиеПлатежныхСистемИКасс;
		//////////////////////////////////////////////////////////////////////////////////////////////////		
		
		Параметры.КоличествоТоваровВПакете  			= ?(Параметры.КоличествоТоваровВПакете 				= 0, 1, Параметры.КоличествоТоваровВПакете);
		Параметры.КоличествоДокументовВПакете			= ?(Параметры.КоличествоДокументовВПакете 			= 0, 1, Параметры.КоличествоДокументовВПакете);
		Параметры.КоличествоКонтрагентовВПакете 		= ?(Параметры.КоличествоКонтрагентовВПакете 		= 0, 1, Параметры.КоличествоКонтрагентовВПакете);
		Параметры.КоличествоЭлементовСправочникаВПакете = ?(Параметры.КоличествоЭлементовСправочникаВПакете = 0, 1, Параметры.КоличествоЭлементовСправочникаВПакете);
		Параметры.КоличествоКартЛояльностиВПакете 		= ?(Параметры.КоличествоКартЛояльностиВПакете 		= 0, 1, Параметры.КоличествоКартЛояльностиВПакете);
		Параметры.КоличествоПредложенийВПакете 			= ?(Параметры.КоличествоПредложенийВПакете 			= 0, 1, Параметры.КоличествоПредложенийВПакете);
		Параметры.КоличествоСвойствВПакете 				= ?(Параметры.КоличествоСвойствВПакете 				= 0, 1, Параметры.КоличествоСвойствВПакете);
		Параметры.КоличествоСкидокВПакете 				= ?(Параметры.КоличествоСкидокВПакете 				= 0, 1, Параметры.КоличествоСкидокВПакете);
	Исключение
		Сообщить("Ошибка в данных настройки. Пересоздадите эту настройку обмена.");
		Возврат Ложь;
	КонецПопытки;
	
	//Проверяем важные реквизиты	
	
	Если НЕ СтрСохраненныхНастроек.ИнформацияОНоменклатуре.Свойство("ВыгружатьКартинкиИФайлыПредложений") тогда
		Параметры.Вставить("ВыгружатьКартинкиИФайлыПредложений", Ложь);
	КонецЕсли;
	
	//добавляем массивы документов для отборов
	Если Параметры.ОбменДокументами тогда
		
		ВремВыгружатьТолькоИзменения = Параметры.ВыгружатьТолькоИзменения;
		Параметры.ВыгружатьТолькоИзменения = Ложь;
		
		лИспользуетсяОтборПоЗаказам = Ложь;
		Для Каждого ТекОтбор из Параметры.ПостроительОтчетаЗаказов Цикл
			Если ТекОтбор.Использование тогда
				лИспользуетсяОтборПоЗаказам = Истина;	
			КонецЕсли;
		КонецЦикла;
		
		Если лИспользуетсяОтборПоЗаказам тогда
			
			Запрос = Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ПолучитьЗапросДляВыгрузкиДанных(Параметры, "Документы", "Заказы");
			ТаблицаВыгрузкиЗаказов = Запрос.Выполнить().Выгрузить();
			Параметры.Вставить("ВыгружаемыеЗаказыПоОтборам", ТаблицаВыгрузкиЗаказов.ВыгрузитьКолонку("Объект"));	
			
		Иначе
			Параметры.Вставить("ВыгружаемыеЗаказыПоОтборам", Неопределено);	
		КонецЕсли;
		
		лИспользуетсяОтборПоОплатам = Ложь;
		Если Параметры.ВыгрузкаОплат тогда
			Для Каждого ТекОтбор из Параметры.ПостроительОтчетаОплат Цикл
				Если ТекОтбор.Использование тогда
					лИспользуетсяОтборПоОплатам = Истина;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если лИспользуетсяОтборПоОплатам тогда
			
			Запрос = Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ПолучитьЗапросДляВыгрузкиДанных(Параметры, "Документы", "Оплаты");
			ТаблицаВыгрузкиОплат = Запрос.Выполнить().Выгрузить();
			Параметры.Вставить("ВыгружаемыеОплатыПоОтборам", ТаблицаВыгрузкиОплат.ВыгрузитьКолонку("Объект"));	
			
		Иначе
			Параметры.Вставить("ВыгружаемыеОплатыПоОтборам", Неопределено);	
		КонецЕсли;
		
		
		лИспользуетсяОтборПоОтгрузкам = Ложь;
		Если Параметры.ВыгрузкаОтгрузок тогда
			Для Каждого ТекОтбор из Параметры.ПостроительОтчетаОтгрузок Цикл
				Если ТекОтбор.Использование тогда
					лИспользуетсяОтборПоОтгрузкам = Истина;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если лИспользуетсяОтборПоОтгрузкам тогда
			
			Запрос = Б_ПроцедурыИФункцииВыгрузкиДанныхНаСайт.ПолучитьЗапросДляВыгрузкиДанных(Параметры, "Документы", "Отгрузки");
			ТаблицаВыгрузкиОтгрузок = Запрос.Выполнить().Выгрузить();
			Параметры.Вставить("ВыгружаемыеОтгрузкиПоОтборам", ТаблицаВыгрузкиОтгрузок.ВыгрузитьКолонку("Объект"));	
			
		Иначе
			Параметры.Вставить("ВыгружаемыеОтгрузкиПоОтборам", Неопределено);	
		КонецЕсли;
		
		Параметры.ВыгружатьТолькоИзменения = ВремВыгружатьТолькоИзменения;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьКлассификаторыВТаблицуКаталогов(ТаблицаКаталогов) Экспорт
	
	Если ТаблицаКаталогов.Колонки.Найти("ДеревоГрупп") <> Неопределено тогда
		ТаблицаКаталогов.Колонки.Удалить(ТаблицаКаталогов.Колонки.Индекс(ТаблицаКаталогов.Колонки.ДеревоГрупп));
		ТаблицаКаталогов.Колонки.Добавить("ДеревоГрупп");
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКаталогов Цикл
		
		НайденноеДеревоГрупп = Справочники.Б_ПользовательскиеГруппыТоваров.НайтиПоНаименованию(СтрокаТаблицы.ИдКаталога,Истина);
		
		Если ЗначениеЗаполнено(НайденноеДеревоГрупп) тогда
			
			Выборка = Справочники.Б_ПользовательскиеГруппыТоваров.Выбрать(НайденноеДеревоГрупп);
			Если НЕ Выборка.Следующий() Тогда
				НайденноеДеревоГрупп = Справочники.Б_ПользовательскиеГруппыТоваров.ПустаяСсылка();	
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТаблицы.ДеревоГрупп = НайденноеДеревоГрупп;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура Таймаут(ДлительностьСек) Экспорт
	
	Начало = ТекущаяДата();
	Сч = 0;
	
	Пока Истина Цикл
		
		Сч = Сч + 1;
		
		Если Сч % 10000 = 0 Тогда
			Если ТекущаяДата() - Начало > ДлительностьСек Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтруктурыНастроекВПараметры(Параметры, СтруктураНастроек)
	
	Для Каждого ТекКлюч из СтруктураНастроек Цикл
		
		Если НЕ Параметры.Свойство(ТекКлюч.Ключ) тогда
			Параметры.Вставить(ТекКлюч.Ключ, ТекКлюч.Значение);	
		КонецЕсли;
  	КонецЦикла;
	
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ВыгрузитьДанныеНаСайт(ПараметрыОбмена, ИмяКаталога, ПолноеИмяФайла,
			МассивПодкаталогов = Неопределено,
			ОжидатьЗавершенияИмпортаФайловСервером = Ложь,
			ТипСоединения = "catalog") Экспорт
	
	ОтветСервера = "";
	Соединение = Неопределено;
	НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;
	
	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СообщитьПодробно("Отправка запроса на авторизацию.", ПараметрыОбмена);
	
	Успешно = АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);
	
	Если Не Успешно Тогда
		СообщитьПодробно("Выгрузка на сайт не выполнена.", ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	
	Попытка
		Токен			= "&" + СтрПолучитьСтроку(ОтветСервера, 4);
	Исключение
		
		Токен = "";
		СообщитьПодробно("CSRF токен не поддерживается. Для того, чтобы поддерживался - необходимо обновить БУС.", ПараметрыОбмена);	
		
	КонецПопытки;
	
	//Если у нас полная выгрузка, то получаем дату, до которой не загруженные элементы будут деактивированы.
	
	Если НЕ ПараметрыОбмена.ВыгружатьТолькоИзменения И ТипСоединения = "catalog" тогда
		
		Если ПараметрыОбмена.ДатаДеактивацииПриПакетнойВыгрузке = Неопределено тогда
			Попытка
				ПараметрыОбмена.ДатаДеактивацииПриПакетнойВыгрузке	=  "&" + СтрПолучитьСтроку(ОтветСервера, 5);
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	СообщитьПодробно("Отправка запроса на инициализацию, для определения версии обмена данных.", ПараметрыОбмена);
	
	ОтветСервера = ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_Инициализация + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы, ЗаголовкиЗапросов, ПараметрыОбмена);
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьПодробно("Выгрузка на сайт не выполнена. Ответ не пришел", ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = Ложь;
	ОграничениеРазмераФрагментаФайлаОбмена = 0;
	
	Если (ТипСоединения = "catalog" И СтрЧислоСтрок(ОтветСервера) < 2) тогда
		СообщитьПодробно("Выгрузка на сайт информации о товарах не выполнена." + Символы.ПС + " Не удалось прочитать ответ сервера. Параметры обмена не получены.", ПараметрыОбмена);	
		СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
		
	КонецЕсли;
	
	Если(ТипСоединения = "sale"  И (СтрЧислоСтрок(ОтветСервера) < 4)) Тогда
		
		СообщитьПодробно("Выгрузка на сайт заказов не выполнена." + Символы.ПС + " Не удалось прочитать ответ сервера. Параметры обмена не получены.", ПараметрыОбмена);	
		СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена, Истина, Истина);	
		Возврат Ложь;
		
	КонецЕсли;
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = НастройкиПодключения.ОтветСервера_ZIPРазрешен;
	
	Попытка 
		
		ОграничениеРазмераФрагментаФайлаОбмена = Число(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))), НастройкиПодключения.ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
		
	Исключение
		
		СообщитьПодробно("Ошибка получения параметров обмена (ограничение размера файла)!", ПараметрыОбмена, Истина, Истина);	
		СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
		ОграничениеРазмераФрагментаФайлаОбмена = -1;
		
	КонецПопытки;
	
	КаталогДляВыгрузки = ИмяКаталога;
	
	МассивИсходныхXMLФайлов = Новый Массив;
	МассивИсходныхXMLФайлов.Добавить(Новый Файл(ПолноеИмяФайла));
	
	Если ZIPФайлыРазрешены Тогда
		
		СписокФайловДляОтправки = ПолучитьСписокZIPАрхивов(ПараметрыОбмена, КаталогДляВыгрузки, МассивПодкаталогов);
		
	Иначе
		
		СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(КаталогДляВыгрузки, МассивПодкаталогов);
		
	КонецЕсли;
	
	Если СписокФайловДляОтправки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		СписокФайловДляОтправки = ПолучитьСписокФрагментовФайлов(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена);
	КонецЕсли;
	
	ВсегоФайлов = СписокФайловДляОтправки.Количество();
	
	Для Каждого ТекФайл Из СписокФайловДляОтправки цикл
		
		ОтветСервера = ПолучитьРезультатОтправкиФайлаНаСервер(ПараметрыОбмена, ТекФайл.Значение, Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление + Токен, ЗаголовкиЗапросов);
		Если ZIPФайлыРазрешены Тогда
			Попытка
				УдалитьФайлы(ТекФайл.Значение);
			Исключение
			КонецПопытки;                                                        
		КонецЕсли;
		
		Если ОтветСервера = Неопределено Тогда
			
			СообщитьПодробно("Не удалось получить ответ сервера. Файл не отправлен.", ПараметрыОбмена);	
			
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		
		Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			СообщитьПодробно("Произошла ошибка на стороне сервера. Файл не отправлен." + " (" + ТекФайл.Значение + ")." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
			
			Возврат Ложь;
			
		ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
			СообщитьПодробно("Получен расширенный статус успешного завершения сеанса." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
				
			КонецЕсли;
			
		Иначе
			
			СообщитьПодробно("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен" + " (" + ТекФайл.Значение + ")." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
			СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////
	
	ИмпортУспешноЗавершен = Ложь;
	
	Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
		
		Для Каждого ТекФайл Из МассивИсходныхXMLФайлов Цикл
			
			ИмпортПродолжается = Истина;
			ТекущееСостояние = "";
			
			Пока ИмпортПродолжается Цикл
				
				ИмпортПродолжается = Ложь;
				
				ОтветСервера = ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ИмпортФайлаСервером + ТекФайл.Имя + Токен, ЗаголовкиЗапросов, ПараметрыОбмена);
				
				Если ОтветСервера = Неопределено Тогда 
					
					Успешно = Ложь;
					СообщитьПодробно(ТекФайл.Имя + ": Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.", ПараметрыОбмена);	
					
				ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
					
					Успешно = Ложь;
					СообщитьПодробно(ТекФайл.Имя + ": Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.", ПараметрыОбмена);	
				Иначе
					
					СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
					
					Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
						
						Успешно = Ложь;
						СообщитьПодробно(ТекФайл.Имя + ": Произошла ошибка на стороне сервера."	+ Символы.ПС + "Ответ сервера" + ": " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
						
					ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
						
						ИмпортУспешноЗавершен = Истина;
						СообщитьПодробно(ТекФайл.Имя + ": Данные успешно обработаны сервером." + Символы.ПС + "Ответ сервера" + ": " + ОтветСервера, ПараметрыОбмена);	
					ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_ВыполнениеТекущейОперации Тогда
						
						ИмпортПродолжается = Истина;
						ОтображениеСостояния(ОтветСервера);
						
						лСообщениеСервера = ?(СтрЧислоСтрок(ОтветСервера) >1, СтрПолучитьСтроку(ОтветСервера,2), ОтветСервера);
						СообщитьПодробно("Процес выполнения обмена: " + лСообщениеСервера, ПараметрыОбмена);
						
					Иначе
						
						Успешно = Ложь;
						СообщитьПодробно(ТекФайл.Имя + ": Произошла ошибка на стороне сервера. Получен неизвестный статус импорта." + Символы.ПС + "Ответ сервера" + ": " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
						СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ИмпортУспешноЗавершен Тогда
				
				ОтображениеСостояния("");

				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОтображениеСостояния("");
	
	Возврат Успешно;
	
КонецФункции

Функция ВыгрузитьЛогФайлНаСайт(ПараметрыОбмена)
	
	ТипСоединения = "catalog";
	ОтветСервера = "";
	Соединение = Неопределено;
	
	НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;
	
	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СообщитьПодробно("Отправка запроса на авторизацию.", ПараметрыОбмена);
	
	Успешно = АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);
	
	Если Не Успешно Тогда
		СообщитьПодробно("Выгрузка на сайт не выполнена.", ПараметрыОбмена);	
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	
	Попытка
		Токен			= "&" + СтрПолучитьСтроку(ОтветСервера, 4);
	Исключение
		
		Токен = "";
		СообщитьПодробно("CSRF токен не поддерживается. Для того, чтобы поддерживался - необходимо обновить БУС.", ПараметрыОбмена);	
		
	КонецПопытки;
	
	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ПолноеИмяФайлаАрхива = ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогЛога + "\reports\" + "Exchange_" + "(" + ПараметрыОбмена.ссылка.Наименование +  ")" +  СокрЛП(Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd")) + ".zip");
	ЗаписьАрхива = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	НовыйСписокФайлов = Новый СписокЗначений;
	ЗаписьАрхива.Добавить(ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогЛога + "\reports\" + "Exchange_" + "(" + ПараметрыОбмена.ссылка.Наименование +  ")" +  СокрЛП(Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd")) + ".txt"));
	
	Если ПараметрыОбмена.ХранитьФайлыОбменаНаСайте тогда
		МассивПодкаталогов = Новый Массив;
		МассивПодкаталогов.Добавить(СокрЛП(ПараметрыОбмена.ссылка.Код));
		
	    ИмяАрхиваОбмена = ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогЛога + "\reports\Exchange.zip");
		
		СписокАрхивов 	= ПолучитьСписокZIPАрхивов(ПараметрыОбмена, ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогЛога + "\reports"), МассивПодкаталогов, ИмяАрхиваОбмена);
		
		Если СписокАрхивов.Количество() > 0 тогда
			ЗаписьАрхива.Добавить(СписокАрхивов[0].значение);
		КонецЕсли;
	КонецЕсли;
	Попытка
		ЗаписьАрхива.Записать();
	Исключение
		СообщитьПодробно("Не удалось записать zip-архив на диск!", ПараметрыОбмена);	
	КонецПопытки;
	
	Если ПараметрыОбмена.ХранитьФайлыОбменаНаСайте тогда
		Если СписокАрхивов.Количество() > 0 тогда
			УдалитьФайлы(СписокАрхивов[0].значение);				
		КонецЕсли;	
	КонецЕсли;	
	
	ПредставлениеФайла 	=  "\Reports\" + "Exchange_" + "(" + ПараметрыОбмена.ссылка.Наименование +  ")" +  СокрЛП(Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd")) + ".zip";
	
	ОтветСервера 		= ПолучитьРезультатОтправкиФайлаНаСервер(ПараметрыОбмена, ПолноеИмяФайлаАрхива, Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ПередачаФайла + ПредставлениеФайла + Токен, ЗаголовкиЗапросов);
	
	УдалитьФайлы(ПолноеИмяФайлаАрхива);
	
	Если ОтветСервера = Неопределено Тогда
		
		СообщитьПодробно("Не удалось получить ответ сервера. Файл не отправлен.", ПараметрыОбмена);	
		
		Возврат Ложь;
	КонецЕсли;
	
	СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
	
	Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
		
		СообщитьПодробно("Произошла ошибка на стороне сервера. Файл не отправлен." + " (" + ПолноеИмяФайлаАрхива + ")." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
		
		Возврат Ложь;
		
	ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
		
		Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
			СообщитьПодробно("Получен расширенный статус успешного завершения сеанса." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
			
		КонецЕсли;
		
	Иначе
		
		СообщитьПодробно("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен" + " (" + ПолноеИмяФайлаАрхива + ")." + Символы.ПС + "Ответ сервера: " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
		СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыгрузитьДанныеНаСайтУпрощенно(ПараметрыОбмена, ТипСоединения = "catalog", ПараметрыЗапроса = "") Экспорт
	
	ОтветСервера = "";
	Соединение = Неопределено;
	НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;
	
	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СообщитьПодробно("Отправка запроса на авторизацию.", ПараметрыОбмена);
	
	Успешно = АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);
	
	Если Не Успешно Тогда
		СообщитьПодробно("Не выполнена выгрузка на сайт информации.", ПараметрыОбмена);	
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	
	Попытка
		Токен			= "&" + СтрПолучитьСтроку(ОтветСервера, 4);
	Исключение
		
		Токен = "";
		СообщитьПодробно("CSRF токен не поддерживается. Для того, чтобы поддерживался - необходимо обновить БУС.", ПараметрыОбмена);	
		
	КонецПопытки;
	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;
	ОтветСервера = ПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрыЗапроса + Токен, ЗаголовкиЗапросов, ПараметрыОбмена);
	
	Если ОтветСервера = Неопределено Тогда 
		
		Успешно = Ложь;
		СообщитьПодробно("Не удалось получить текущее состояние процесса.", ПараметрыОбмена);	
		
	ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
		
		Успешно = Ложь;
		СообщитьПодробно("Не удалось получить текущее состояние процесса.", ПараметрыОбмена);	
	Иначе
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
		
		Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			Успешно = Ложь;
			СообщитьПодробно("Произошла ошибка на стороне сервера."	+ Символы.ПС + "Ответ сервера" + ": " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
			
		ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			ИмпортУспешноЗавершен = Истина;
			
		ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_ВыполнениеТекущейОперации Тогда
			
			ИмпортПродолжается = Истина;
		Иначе
			
			Успешно = Ложь;
			СообщитьПодробно("Произошла ошибка на стороне сервера. Получен неизвестный статус." + Символы.ПС + "Ответ сервера" + ": " + Символы.ПС + ОтветСервера, ПараметрыОбмена);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

Функция ПолучитьСписокZIPАрхивов(ПараметрыОбмена, КаталогДляВыгрузки, МассивПодкаталогов, ИмяФайла = "")
	
	// Для корректного формирования zip перемещаем файлы во временную папку, а их нее уже пакуем.
	// Иначе не удается получить правильную струкутру папок архива объектом ЗаписьЗипФайла (пути сохраняются без import_files)
	
	ВременнаяПапка = ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows,КаталогВременныхФайлов() + ПараметрыОбмена.ИдентификаторОбмена + "\" + "webdata_zip");
	
	КаталогОчищен(ВременнаяПапка, ПараметрыОбмена);
	СоздатьКаталог(ВременнаяПапка);
	
	Если МассивПодкаталогов <> Неопределено Тогда
	
		Для Каждого Подкаталог Из МассивПодкаталогов Цикл
			СоздатьКаталог(ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (ВременнаяПапка + "\" + Подкаталог)));
			Файлы = НайтиФайлы(ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (КаталогДляВыгрузки + "\" + Подкаталог)), "*.*", Истина);
			Для Каждого Файл Из Файлы Цикл
				Если Файл.ЭтоКаталог() Тогда
					Продолжить;
				КонецЕсли;
				ПапкаФайла = СтрЗаменить(Файл.Путь, ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, КаталогДляВыгрузки + "\" + Подкаталог + "\") , "");
				НовыйПуть = ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (ВременнаяПапка + "\" + Подкаталог + "\" + ПапкаФайла));
				СоздатьКаталог(НовыйПуть);
				КопироватьФайл(Файл.ПолноеИмя, НовыйПуть + Файл.Имя);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	ПолноеИмяФайлаАрхива = ?(ИмяФайла = "", ПолучитьИмяВременногоФайла("zip"), ИмяФайла);
	ЗаписьАрхива = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	
	НовыйСписокФайлов = Новый СписокЗначений;
	
	Если ИмяФайла = "" тогда            //для отправления XML файлов в лог
		ЗаписьАрхива.Добавить(ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, КаталогДляВыгрузки + "\*.xml"), РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	КонецЕсли;
	
	ЗаписьАрхива.Добавить(ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ВременнаяПапка + "\*.*"), РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	Попытка
		ЗаписьАрхива.Записать();
	Исключение
		
		СообщитьПодробно("Не удалось записать zip-архив на диск!", ПараметрыОбмена);	
		
		УдалитьФайлы(ВременнаяПапка);

		Возврат НовыйСписокФайлов;
	КонецПопытки;
	
	УдалитьФайлы(ВременнаяПапка);

	ФайлАрхива = Новый Файл(ПолноеИмяФайлаАрхива);
	НовыйСписокФайлов.Добавить(ПолноеИмяФайлаАрхива, ФайлАрхива.Имя);
	
	Возврат НовыйСписокФайлов;
	
КонецФункции


Функция ПолучитьСписокФрагментовФайлов(СписокФайлов, ОграничениеРазмераФрагмента)
	
	НовыйСписокФайлов = Новый СписокЗначений;
	Для Каждого ТекФайл Из СписокФайлов цикл
		
		ФайлНаДиске = Новый Файл(ТекФайл.Значение);
		Если ФайлНаДиске.Размер() > ОграничениеРазмераФрагмента Тогда
			МассивФрагментов = РазделитьФайл(ФайлНаДиске.ПолноеИмя, ОграничениеРазмераФрагмента);
			Для Каждого НовыйФайл Из МассивФрагментов Цикл
				НовыйСписокФайлов.Добавить(НовыйФайл, ТекФайл.Представление);
			КонецЦикла;
			УдалитьФайлы(ФайлНаДиске.ПолноеИмя);
		Иначе
			НовыйСписокФайлов.Добавить(ТекФайл.Значение, ТекФайл.Представление);
		КонецЕсли;
		
	КонецЦикла;
	Возврат НовыйСписокФайлов;
	
КонецФункции

Функция ПолучитьСписокФайловДляОтправки(КаталогНаДиске, МассивПодкаталогов);
	
	СписокФайлов = Новый СписокЗначений;
	Маска = "*.*";
	
	ВсеФайлыДляВыгрузки = НайтиФайлы(КаталогНаДиске, Маска);
	
	Если МассивПодкаталогов <> Неопределено Тогда
		
		Для Каждого Подкаталог Из МассивПодкаталогов Цикл
			
			ФайлыВПодкаталоге = НайтиФайлы(КаталогНаДиске + "\" + Подкаталог, Маска);
			
			Для Каждого ТекФайл Из ФайлыВПодкаталоге Цикл
				
				Если ТекФайл.ЭтоКаталог() Тогда
					
					ФайлыВДобавочномПодкаталоге = НайтиФайлы(ТекФайл.ПолноеИмя, Маска);
					
					Для Каждого ТекФайлВПодкаталоге Из ФайлыВДобавочномПодкаталоге Цикл
						
						Если НЕ ТекФайлВПодкаталоге.ЭтоКаталог() Тогда	
							ВсеФайлыДляВыгрузки.Добавить(ТекФайлВПодкаталоге);
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					ВсеФайлыДляВыгрузки.Добавить(ТекФайл);  
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ТекФайл Из ВсеФайлыДляВыгрузки цикл
		
		Если НЕ ТекФайл.ЭтоКаталог() Тогда
			
			ПолноеИмяФайлаДляСервера = ПолучитьИмяФайлаДляСервера(КаталогНаДиске, ТекФайл);
			СписокФайлов.Добавить(ТекФайл.ПолноеИмя, ПолноеИмяФайлаДляСервера);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокФайлов;
	
КонецФункции

Функция ПолучитьИмяФайлаДляСервера(КаталогНаДиске, ФайлОбъект)
	
	ПолноеИмяФайлаДляСервера = "";
	
	Если Найти(ФайлОбъект.Имя, ".xml") > 0 Тогда
		
		ПолноеИмяФайлаДляСервера = ФайлОбъект.Имя;
		
	Иначе
		
		//у картинки надо оставить 2 папки и развернуть слэши
		ПолноеИмяФайлаДляСервера = ФайлОбъект.ПолноеИмя;
		ПутьДляУдаления = КаталогНаДиске + "\";
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, ПутьДляУдаления, "");
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, "\", "/");
		
	КонецЕсли;
	
	ПолноеИмяФайлаДляСервера = ПолучитьИмяФайлаБезДополнительныхРасширений(КаталогНаДиске, ПолноеИмяФайлаДляСервера);
	
	Возврат ПолноеИмяФайлаДляСервера;
	
КонецФункции

Функция ПолучитьИмяФайлаБезДополнительныхРасширений(КаталогНаДиске, ИсходноеИмяФайла)
	
	ПозицияТочки = Найти(ИсходноеИмяФайла, ".");
	
	ИмяФайла = Лев(ИсходноеИмяФайла, ПозицияТочки - 1);
	
	ПраваяЧастьИсходногоИмени = Прав(ИсходноеИмяФайла, СтрДлина(ИсходноеИмяФайла) - ПозицияТочки);
	
	ПозицияТочки = Найти(ПраваяЧастьИсходногоИмени, ".");
	
	Расширение = ПраваяЧастьИсходногоИмени;
	
	Если ПозицияТочки > 0 Тогда
		Расширение = Лев(ПраваяЧастьИсходногоИмени, ПозицияТочки - 1);
	КонецЕсли;
	
	Возврат ИмяФайла + "." + Расширение;
	
КонецФункции

функция ПолучитьМассивУзлов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Б_ОбменССайтом.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.Б_ОбменССайтом КАК Б_ОбменССайтом
	|ГДЕ
	|	(Б_ОбменССайтом.Ссылка <> &ЭтотУзел)	
	|";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.Б_ОбменССайтом.ЭтотУзел());
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат МассивУзлов; 
	
КонецФункции


Функция ПолучитьЗначениеХранилищаНастроек(Настройка, НаименованиеКлюча = "") Экспорт
	
	Результат = Неопределено;
	
	СохраненныеНастройки = ХранилищеОбщихНастроек.Загрузить("Настройки 1С-Битрикс", Настройка);
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") тогда
		Если СохраненныеНастройки.Свойство(НаименованиеКлюча) <> Неопределено И СохраненныеНастройки.Свойство(НаименованиеКлюча) <> Ложь тогда
			Результат = СохраненныеНастройки[НаименованиеКлюча];	
		Иначе
			СохраненныеНастройки.Вставить(НаименованиеКлюча, Неопределено);
			УстановитьЗначениеВХранилищаНастроек(Настройка, СохраненныеНастройки);
		КонецЕсли;	
	Иначе         		
		
		Если СохраненныеНастройки = Неопределено тогда
			УстановитьЗначениеВХранилищаНастроек(Настройка, Неопределено);
		Иначе
			Результат = СохраненныеНастройки;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

Процедура УстановитьЗначениеВХранилищаНастроек(Настрока, ЗначениеНастройки) Экспорт

	ХранилищеОбщихНастроек.Сохранить("Настройки 1С-Битрикс", Настрока, ЗначениеНастройки, "Настройки 1С-Битрикс");
	
КонецПроцедуры
