Перем мВалютаРегламентированногоУчета Экспорт;

Перем НомераСубконтоРДпоСчету;

Перем мУдалятьДвижения;

Перем мКоэффициентПропорциональногоНДС Экспорт;

Перем мТекущаяСхемаНалогообложения Экспорт;

///////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()
  	ЗапросШапка = Новый Запрос;
	ЗапросШапка.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	КорректировкаДолга.ВидОперации,
	|	КорректировкаДолга.Номер,
	|	КорректировкаДолга.Дата,
	|	КорректировкаДолга.КонтрагентДебитор КАК Дебитор,
	|	КорректировкаДолга.КонтрагентКредитор КАК Кредитор,
	|	КорректировкаДолга.Организация,
	|	КорректировкаДолга.ВалютаДокумента,
	|	КорректировкаДолга.ДоговорКонтрагента,
	|	КорректировкаДолга.ДоговорКонтрагента.Дата  		  КАК ДоговорДата,
	|	КорректировкаДолга.ДоговорКонтрагента.Номер 		  КАК ДоговорНомер,
	|	КорректировкаДолга.ДоговорКонтрагента.Наименование    КАК ДоговорНаименованиеДляПечати,
	|	КорректировкаДолга.Ответственный.ФизЛицо.Наименование КАК ОтветственныйПредставление
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Ссылка = &ТекущийДокумент";
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	Шапка.Следующий();
	

	ЗапросДолги = Новый Запрос;
	ЗапросДолги.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросДолги.УстановитьПараметр("ВидЗадолженностиДебиторка", Перечисления.ВидыЗадолженности.Дебиторская);
	ЗапросДолги.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаДолга.ДоговорКонтрагента,
	|	КорректировкаДолга.ДоговорКонтрагента.Дата  		КАК ДоговорДата,
	|	КорректировкаДолга.ДоговорКонтрагента.Номер 		КАК ДоговорНомер,
	|	КорректировкаДолга.ДоговорКонтрагента.Наименование  КАК ДоговорНаименованиеДляПечати,
	|	КорректировкаДолга.ДоговорКонтрагента.ВалютаВзаиморасчетов  КАК ВалютаВзаиморасчетов,
	|   КорректировкаДолга.ВидЗадолженности 				КАК ВидЗадолженности,
	|   КорректировкаДолга.КурсВзаиморасчетов 				КАК КурсВзаиморасчетов,
	|   КорректировкаДолга.КратностьВзаиморасчетов 			КАК КратностьВзаиморасчетов,
	|	СУММА(КорректировкаДолга.Сумма) 					КАК Сумма,
	|	СУММА(КорректировкаДолга.СуммаВзаиморасчетов) 		КАК СуммаВзаиморасчетов
	|ИЗ
	|	Документ.КорректировкаДолга.СуммыДолга КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаДолга.ДоговорКонтрагента,
	|	КорректировкаДолга.ВидЗадолженности,
	|   КорректировкаДолга.КурсВзаиморасчетов,
	|   КорректировкаДолга.КратностьВзаиморасчетов 
	|";
						
	ТаблицаЗадолженностей = ЗапросДолги.Выполнить().Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировкаДолга_Акт";
	Макет       = ПолучитьМакет("Взаимозачет");
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда 
		СтрокаШапки = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Акт взаимозачета';uk='Акт взаємозаліку'",КодЯзыкаПечать),КодЯзыкаПечать);
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		СтрокаШапки = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Акт взаимозачета (перенос задолженности)';uk='Акт взаємозаліку (перенесення заборгованості)'",КодЯзыкаПечать),КодЯзыкаПечать);
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		СтрокаШапки = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Акт списания задолженности';uk='Акт списання заборгованості'",КодЯзыкаПечать),КодЯзыкаПечать);
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
		СтрокаШапки = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Ввод остатков взаиморасчетов';uk='Введення залишків взаєморозрахунків'",КодЯзыкаПечать),КодЯзыкаПечать);
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		СтрокаШапки = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Изменение (формирование) задолженности';uk='Зміна (формування) заборгованності'",КодЯзыкаПечать),КодЯзыкаПечать);
	КонецЕсли;
	
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,",,КодЯзыкаПечать);
	ПредставлениеДебитора    = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Дебитор, 	 Шапка.Дата), "ПолноеНаименование,",,КодЯзыкаПечать);
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
		ПредставлениеКредитора   = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Кредитор, 	 Шапка.Дата), "ПолноеНаименование,",,КодЯзыкаПечать);
	Иначе
		ПредставлениеКредитора   = ПредставлениеДебитора;	
	КонецЕсли;
	
	ПредставлениеВалюты = Строка(Шапка.ВалютаДокумента);
	
	Если  ОтражатьВБухгалтерскомУчете Тогда
		Если НЕ (ВалютаДокумента = мВалютаРегламентированногоУчета или ВалютаДокумента = Справочники.Валюты.ПустаяСсылка()) Тогда
			ТаблицаЗадолженностей.Колонки.Удалить("Сумма");
			ТаблицаЗадолженностей.Колонки.СуммаВзаиморасчетов.Имя = "Сумма";
		КонецЕсли; 
	Иначе
		// валюта документа - валюта управленческого учета.
		// пересчитаем задолженность в эту валюту
		ДанныеПоВалюте = МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаУправленческогоУчета"), Дата);
		Если ДанныеПоВалюте.Курс = 0 Тогда
			ДанныеПоВалюте.Курс = 1;
		КонецЕсли;
		
		Для каждого Строка Из ТаблицаЗадолженностей Цикл
			
			Если Строка.ВалютаВзаиморасчетов = Шапка.ВалютаДокумента Тогда
			
				 Продолжить;
			
			КонецЕсли;
			
			Если Строка.КратностьВзаиморасчетов = 0 Тогда
				Строка.КратностьВзаиморасчетов = 1;	
			КонецЕсли;
			
			Строка.СуммаВзаиморасчетов = Строка.СуммаВзаиморасчетов * Строка.КурсВзаиморасчетов / Строка.КратностьВзаиморасчетов 
										/ ДанныеПоВалюте.Курс * ДанныеПоВалюте.Кратность;
			
		КонецЦикла;
		
		ТаблицаЗадолженностей.Колонки.Удалить("Сумма");
		ТаблицаЗадолженностей.Колонки.СуммаВзаиморасчетов.Имя = "Сумма";
		
	КонецЕсли;
		
	СуммаДеб  = 0;
	СуммаКред = 0;
	
	Для каждого СтрокаСумм Из ТаблицаЗадолженностей Цикл
		Если  СтрокаСумм.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
			СуммаДеб  = СуммаДеб + СтрокаСумм.Сумма;
		ИначеЕсли  СтрокаСумм.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
			СуммаКред = СуммаКред + СтрокаСумм.Сумма;
		КонецЕсли; 
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.СтрокаШапки = СтрокаШапки;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Нпп = 1;
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДебиторки");
	СтрокаДебиторки  =  Строка(НПП) + 
						НСтр("ru='. Задолженность ';uk='. Заборгованість '",КодЯзыкаПечать)+
						ПредставлениеДебитора+" перед " + ПредставлениеОрганизации + 
						НСтр("ru=' составляет ';uk=' становить '",КодЯзыкаПечать) + 
						Формат(СуммаДеб, НСтр("ru='ЧЦ=15; ЧДЦ=2; ЧН=Ноль';uk='ЧЦ=15; ЧДЦ=2; ЧН=Нуль'",КодЯзыкаПечать))+" "+ 
						ПредставлениеВалюты + НСтр("ru=' по следующим договорам:';uk=' по наступних договорах:'",КодЯзыкаПечать);
	
	ОбластьМакета.Параметры.СтрокаДебиторки = СтрокаДебиторки;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДебиторки");
	Для каждого СтрокаЗадолженности Из ТаблицаЗадолженностей Цикл
		Если  НЕ СтрокаЗадолженности.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
			Продолжить;
		КонецЕсли; 
		ОбластьМакета.Параметры.СтрокаДокументовДебДоговор = ПредставлениеДоговораДляПечати(СтрокаЗадолженности,КодЯзыкаПечать);
		ОбластьМакета.Параметры.СтрокаДокументовДебСумма   = Формат(СтрокаЗадолженности.Сумма, НСтр("ru='ЧЦ=15; ЧДЦ=2; ЧН=Ноль';uk='ЧЦ=15; ЧДЦ=2; ЧН=Нуль'",КодЯзыкаПечать))+" "+ПредставлениеВалюты;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Если НЕ Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		Нпп = Нпп + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКредиторки");
		СтрокаКредиторки = Строка(НПП) + 
						   НСтр("ru='. Задолженность ';uk='. Заборгованість '",КодЯзыкаПечать)+
						   ПредставлениеОрганизации+" перед " + ПредставлениеКредитора + 
						   НСтр("ru=' составляет ';uk=' становить '",КодЯзыкаПечать) +
						   Формат(СуммаКред, НСтр("ru='ЧЦ=15; ЧДЦ=2; ЧН=Ноль';uk='ЧЦ=15; ЧДЦ=2; ЧН=Нуль'",КодЯзыкаПечать))+" "+ 
						   ПредставлениеВалюты + НСтр("ru=' по следующим договорам:';uk=' по наступних договорах:'",КодЯзыкаПечать);
		
		ОбластьМакета.Параметры.СтрокаКредиторки = СтрокаКредиторки;
		
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКредиторки");
		Для каждого СтрокаЗадолженности Из ТаблицаЗадолженностей Цикл
			Если  СтрокаЗадолженности.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
				Продолжить;
			КонецЕсли; 
			ОбластьМакета.Параметры.СтрокаДокументовКредДоговор = ПредставлениеДоговораДляПечати(СтрокаЗадолженности,КодЯзыкаПечать);
			ОбластьМакета.Параметры.СтрокаДокументовКредСумма   = Формат(СтрокаЗадолженности.Сумма, НСтр("ru='ЧЦ=15; ЧДЦ=2; ЧН=Ноль';uk='ЧЦ=15; ЧДЦ=2; ЧН=Нуль'",КодЯзыкаПечать))+" "+ПредставлениеВалюты;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли; 
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		Нпп = Нпп + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПереносаЗадолженности");
		ПредставлениеДоговора = ПредставлениеДоговораДляПечати(Шапка,КодЯзыкаПечать);
		СтрокаПереноса   = Строка(НПП) + НСтр("ru='. Данным Актом указанная кредиторская и дебиторская задолженность ';uk='. Даним Актом зазначена кредиторська й дебіторська заборгованість '",КодЯзыкаПечать) + ПредставлениеОрганизации +
										 НСтр("ru=' признается задолежнностью перед ';uk=' визнається заборгованістю перед '",КодЯзыкаПечать) + ПредставлениеКредитора + НСтр("ru=' по договору ';uk=' за договором '",КодЯзыкаПечать) + ПредставлениеДоговора;
		
		ОбластьМакета.Параметры.СтрокаПереноса = СтрокаПереноса;
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	Если ИмяМакета = "КорректировкаДолга" Тогда
		// Получить экземпляр документа на печать
		ТабДокумент = ПечатьДокумента();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("КорректировкаДолга", "Корректировка долга");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ЗаполнятьБУ) Экспорт

	СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, СтрокаТЧ.ДоговорКонтрагента.Владелец, СтрокаТЧ.ДоговорКонтрагента);

	Если СтрокаТЧ.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
		Если ЗаполнятьБУ Тогда
			СтрокаТЧ.СчетУчетаРасчетов = СчетаУчета.СчетРасчетов;	
		КонецЕсли;
		
		СтрокаТЧ.СчетУчетаНДС		   		= СчетаУчета.СчетУчетаНДСПриобретений;
		СтрокаТЧ.СчетУчетаНДСПодтвержденный	= СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
		СтрокаТЧ.СтавкаНДС					= СчетаУчета.СтавкаНДСПриобретений;
		
		СтрокаТЧ.НалоговоеНазначение		= СчетаУчета.НалоговоеНазначениеПриобретений;
        Если СтрокаТЧ.ЗаТару Тогда
			СтрокаТЧ.НалоговоеНазначение	= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
		КонецЕсли;
		
	ИначеЕсли СтрокаТЧ.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
		Если ЗаполнятьБУ Тогда
			СтрокаТЧ.СчетУчетаРасчетов = СчетаУчета.СчетРасчетовПокупателя;
		КонецЕсли;
		
		СтрокаТЧ.СчетУчетаНДС		   		= СчетаУчета.СчетУчетаНДСПродаж;
		СтрокаТЧ.СчетУчетаНДСПодтвержденный	= СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
		СтрокаТЧ.СтавкаНДС					= СчетаУчета.СтавкаНДСПродаж;

	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Процедура ЗаполнитьСчетаУчетаВШапке() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		
		СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДтСписаниеЗадолженностиКорректировкаДолга);
		СчетДт			= СчетУчета.СчетУчетаБУ;
		СубконтоДт1 	= СчетУчета.Субконто1;
		СубконтоДт2 	= СчетУчета.Субконто2;
		СубконтоДт3 	= СчетУчета.Субконто3;
		Если НЕ ЗначениеЗаполнено(СчетДт) Тогда
			СчетДт = ПланыСчетов.Хозрасчетный.СомнительныеИБезнадежныеДолги;
		КонецЕсли;
		
		СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(Организация, Перечисления.ВидыПрочихСчетовУчета.СчетКтСписаниеЗадолженностиКорректировкаДолга);
		СчетКт			= СчетУчета.СчетУчетаБУ;
		СубконтоКт1 	= СчетУчета.Субконто1;
		СубконтоКт2 	= СчетУчета.Субконто2;
		СубконтоКт3 	= СчетУчета.Субконто3;
		Если НЕ ЗначениеЗаполнено(СчетКт) Тогда
			СчетКт = ПланыСчетов.Хозрасчетный.ДоходОтСписанияКредиторскойЗадолженности;	
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, КонтрагентКредитор, ДоговорКонтрагента);
		
		Если ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
			
			СчетДт = СчетаУчета.СчетАвансов;
			СчетКт = СчетаУчета.СчетРасчетов;
			
			СчетУчетаНДС		   		= СчетаУчета.СчетУчетаНДСПриобретений;
			СчетУчетаНДСПодтвержденный	= СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			
		ИначеЕсли ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
			
			СчетДт = СчетаУчета.СчетРасчетовПокупателя;
			СчетКт = СчетаУчета.СчетАвансовПокупателя;
			
			СчетУчетаНДС		   		= СчетаУчета.СчетУчетаНДСПродаж;
			СчетУчетаНДСПодтвержденный	= СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда	
		
		СчетДт = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		
	Иначе
		
		СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Функция ПредставлениеДоговораДляПечати(Данные, КодЯзыка)
	
	Значение = "";
	
	Если ЗначениеЗаполнено(Данные.ДоговорНомер) Тогда
		//заменим название договора на его настоящий номер
		Значение = "№ " + СокрП(Данные.ДоговорНомер);
	Иначе
		// названием остается наименование справочника
		Значение = Данные.ДоговорНаименованиеДляПечати;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ДоговорДата) Тогда
		// добавим дату договора
		Значение = Значение + НСтр("ru=' от ';uk=' від '",КодЯзыка) + Формат(Данные.ДоговорДата,"ДФ=dd.MM.yyyy")
	КонецЕсли;

	Возврат Значение;
	
КонецФункции // ПредставлениеДоговораДляПечати()

// Заполняет документ остатками взаиморасчетов по контрагенту
//
Процедура ЗаполнитьОстаткамиВзаиморасчетовУпр(ПоКонтрагенту, ВидЗадолженности) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Контрагент",  ПоКонтрагенту);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента,
	 |	ВзаиморасчетыСКонтрагентами.Сделка,
	 |	ЕСТЬNULL(ВзаиморасчетыПоДокументам.ДокументРасчетовСКонтрагентом, НЕОПРЕДЕЛЕНО) КАК ДокументРасчетовСКонтрагентом,
	 |	ЕСТЬNULL(ВзаиморасчетыПоДокументам.СуммаВзаиморасчетовОстаток, ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетовОстаток) КАК СуммаВзаиморасчетовОстаток,
	 |	ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	 |	КурсыВалютСрезПоследних.Курс      КАК КурсВзаиморасчетов,
	 |	КурсыВалютСрезПоследних.Кратность КАК КратностьВзаиморасчетов
	 |ИЗ
	 |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Контрагент И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентами
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки( , Контрагент = &Контрагент И Организация = &Организация) КАК ВзаиморасчетыПоДокументам
	 |		ПО ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента = ВзаиморасчетыПоДокументам.ДоговорКонтрагента
	 |			И ВзаиморасчетыСКонтрагентами.Сделка = ВзаиморасчетыПоДокументам.Сделка
     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента,) КАК КурсыВалютСрезПоследних
	 |		ПО ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
	 |";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаВзаиморасчетовОстаток > 0 И ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
			НоваяСтрока = СуммыДолга.Добавить();
			НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетовОстаток;
			НоваяСтрока.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская;
		ИначеЕсли Выборка.СуммаВзаиморасчетовОстаток < 0 И  ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда 
			НоваяСтрока = СуммыДолга.Добавить();
			НоваяСтрока.СуммаВзаиморасчетов = - Выборка.СуммаВзаиморасчетовОстаток;
			НоваяСтрока.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская;
		Иначе
			Продолжить;
		КонецЕсли;
		НоваяСтрока.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		НоваяСтрока.Сделка = Выборка.Сделка;
		НоваяСтрока.ДокументРасчетовСКонтрагентом = Выборка.ДокументРасчетовСКонтрагентом;
		НоваяСтрока.КурсВзаиморасчетов = Выборка.КурсВзаиморасчетов;
		НоваяСтрока.КратностьВзаиморасчетов = Выборка.КратностьВзаиморасчетов;
		
		Если НоваяСтрока.КратностьВзаиморасчетов <> 0 Тогда
			НоваяСтрока.Сумма   = НоваяСтрока.СуммаВзаиморасчетов * НоваяСтрока.КурсВзаиморасчетов / НоваяСтрока.КратностьВзаиморасчетов;		
		КонецЕсли;
		
		Если НоваяСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель;
		ИначеЕсли НоваяСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик;
        ИначеЕсли НоваяСтрока.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель;
		Иначе
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик;
		КонецЕсли;
		
		НоваяСтрока.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты;	
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет документ остатками взаиморасчетов по контрагенту
//
Процедура ЗаполнитьОстаткамиВзаиморасчетовРегл(ПоКонтрагенту, ВидЗадолженности) Экспорт

	СчетаРасчетов = Новый Массив();
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НаличиеНужныхСубконто.ЕстьДокументыРасчетов = 1
		|			ТОГДА Хозрасчетный.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетаПоДокументам,
		|	ВЫБОР
		|		КОГДА НаличиеНужныхСубконто.ЕстьДокументыРасчетов = 0
		|			ТОГДА Хозрасчетный.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетаБезДокументов,
		|	НаличиеНужныхСубконто.ЕстьДокументыРасчетов
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ХозрасчетныйВидыСубконто.Ссылка КАК Ссылка,
		|			МАКСИМУМ(ВЫБОР
		|					КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоКонтрагенты
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЕстьКонтрагенты,
		|			МАКСИМУМ(ВЫБОР
		|					КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоДоговоры
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЕстьДоговоры,
		|			МАКСИМУМ(ВЫБОР
		|					КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоДокументыРасчетов
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЕстьДокументыРасчетов
		|		ИЗ
		|			ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ХозрасчетныйВидыСубконто.Ссылка) КАК НаличиеНужныхСубконто
		|		ПО Хозрасчетный.Ссылка = НаличиеНужныхСубконто.Ссылка
		|ГДЕ
		|	НаличиеНужныхСубконто.ЕстьКонтрагенты = 1
		|	И НаличиеНужныхСубконто.ЕстьДоговоры = 1
		|	И Хозрасчетный.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
		|	И Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаРасчетов)";
	
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	Запрос.УстановитьПараметр("ВидСубконтоКонтрагенты", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Запрос.УстановитьПараметр("ВидСубконтоДоговоры", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("ВидСубконтоДокументыРасчетов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	СчетаУчетаРасчетов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	СчетаРасчетовБезАналитикиПоДокументам = СчетаУчетаРасчетов.ВыгрузитьКолонку("СчетаБезДокументов");
	СчетаРасчетовСАналитикойПоДокументам = СчетаУчетаРасчетов.ВыгрузитьКолонку("СчетаПоДокументам");

	Запрос = Новый Запрос;
	
	Запрос.Текст = "";
	
	Если не СчетаРасчетовБезАналитикиПоДокументам.Количество() = 0 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ДокументРасчетов,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ХозрасчетныйОстатки.Субконто2.ВидДоговора КАК ВидДоговора,
		|	ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		&Период,
		|		Счет В (&СчетаРасчетовБезАналитикиПоДокументам),
		|		&ВидыСубконтоБезДокументов,
		|		Организация = &Организация
		|		    И Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов = &ВалютаДокумента	
		|	И ВЫБОР КОГДА ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|				ТОГДА ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.СуммаОстаток > 0
		|						ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток < 0
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток > 0
		|							ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток < 0
		|						КОНЕЦ
		|				КОНЕЦ";
	КонецЕсли;
	
	Если не СчетаРасчетовСАналитикойПоДокументам.Количество() = 0 Тогда
	
		Запрос.Текст = ?(ПустаяСтрока(Запрос.Текст),"",Запрос.Текст + Символы.ПС + "Объединить Все" +Символы.ПС)+
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
		|	ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ХозрасчетныйОстатки.Субконто2.ВидДоговора КАК ВидДоговора,
		|	ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		&Период,
		|		Счет В (&СчетаРасчетовСАналитикойПоДокументам),
		|		&ВидыСубконтоСДокументами,
		|		Организация = &Организация
		|		    И Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов = &ВалютаДокумента	
		|	И ВЫБОР КОГДА ХозрасчетныйОстатки.Субконто2.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|				ТОГДА ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.СуммаОстаток > 0
		|						ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток < 0
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток > 0
		|							ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток < 0
		|						КОНЕЦ
		|				КОНЕЦ";

	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент", ПоКонтрагенту);
	Запрос.УстановитьПараметр("ВидЗадолженности",ВидЗадолженности);
	Запрос.УстановитьПараметр("ВидЗадолженностиДебиторская",Перечисления.ВидыЗадолженности.Дебиторская);
	Запрос.УстановитьПараметр("ВидЗадолженностиКредиторская",Перечисления.ВидыЗадолженности.Кредиторская);
	
	ВалютыРеглУчета = Новый СписокЗначений;
	ВалютыРеглУчета.Добавить(глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	ВалютыРеглУчета.Добавить(Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаРегУчета",ВалютыРеглУчета);
	Запрос.УстановитьПараметр("ВалютаДокумента",ВалютаДокумента);
	
	Если ВалютыРеглУчета.НайтиПоЗначению(ВалютаДокумента) = неопределено Тогда
		//Документ в иностранной валюте. Установим отбор только по договорам в нужной валюте
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Организация = &Организация","Организация = &Организация и Валюта = &ВалютаДокумента");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СчетаРасчетовБезАналитикиПоДокументам",СчетаРасчетовБезАналитикиПоДокументам);
	Запрос.УстановитьПараметр("СчетаРасчетовСАналитикойПоДокументам", СчетаРасчетовСАналитикойПоДокументам);
	
	ВидыСубконтоБезДокументов = Новый Массив();
	ВидыСубконтоБезДокументов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоБезДокументов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос.УстановитьПараметр("ВидыСубконтоБезДокументов",ВидыСубконтоБезДокументов);
	
	ВидыСубконтоСДокументами = Новый Массив();
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос.УстановитьПараметр("ВидыСубконтоСДокументами", ВидыСубконтоСДокументами);
	
	ТекущийРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Множитель = ?(ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская,1,-1);
	Для каждого СтрокаОстатков Из ТекущийРезультат Цикл
	    НоваяСтрока = СуммыДолга.Добавить();
		НоваяСтрока.ВидЗадолженности = ВидЗадолженности;
		НоваяСтрока.ДоговорКонтрагента = СтрокаОстатков.Договор;
		Если НоваяСтрока.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл = Истина Тогда
			НоваяСтрока.ДокументРасчетовСКонтрагентом = СтрокаОстатков.ДокументРасчетов;	
		ИначеЕсли НЕ НоваяСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			НоваяСтрока.Сделка = СтрокаОстатков.ДокументРасчетов;	
		КонецЕсли;
		
		НоваяСтрока.СчетУчетаРасчетов = СтрокаОстатков.Счет;
		Если ВалютыРеглУчета.НайтиПоЗначению(ВалютаДокумента) = неопределено Тогда
			НоваяСтрока.СуммаВзаиморасчетов = Множитель*СтрокаОстатков.ВалютнаяСуммаОстаток;
			
			НоваяСтрока.КурсВзаиморасчетов = КурсДокумента;
			НоваяСтрока.КратностьВзаиморасчетов = КратностьДокумента;
			
			НоваяСтрока.Сумма = Множитель*СтрокаОстатков.СуммаОстаток;
			
		Иначе	
			
			ДанныеВалюты = МодульВалютногоУчета.ПолучитьКурсВалюты(НоваяСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
			
			Если ДанныеВалюты.Курс = 0 Тогда
				ДанныеВалюты.Курс = 1;	
			КонецЕсли;
			
			НоваяСтрока.КурсВзаиморасчетов      = ДанныеВалюты.Курс;
			НоваяСтрока.КратностьВзаиморасчетов = ДанныеВалюты.Кратность;
			
			НоваяСтрока.СуммаВзаиморасчетов = Множитель * СтрокаОстатков.СуммаОстаток / ДанныеВалюты.Курс * ДанныеВалюты.Кратность;	
			                                                            
			НоваяСтрока.Сумма = Множитель*СтрокаОстатков.СуммаОстаток;
			
		КонецЕсли; 
		
		
		Если НоваяСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель;
		ИначеЕсли НоваяСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик;
        ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель;
		Иначе
			НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик;
		КонецЕсли;
		
		НоваяСтрока.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты;	
		
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, Ложь);
		НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма*УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/(100 +УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		РассчитатьПропорциональныйНДС(НоваяСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСуммДолга(РезультатЗапросаПоСуммамДолга, СтруктураШапкиДокумента)

	ТаблицаПоСуммамДолга = РезультатЗапросаПоСуммамДолга.Выгрузить();

	ПодготовитьТаблицуСуммДолгаУпр(ТаблицаПоСуммамДолга, СтруктураШапкиДокумента);
	ПодготовитьТаблицуСуммДолгаРегл(ТаблицаПоСуммамДолга, СтруктураШапкиДокумента);

	Возврат ТаблицаПоСуммамДолга;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуСуммДолгаУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	// Переименуем колонку "Сумма" в "Стоимость" (как в регистрах).
	ТаблицаТоваров.Колонки.Добавить("ДолгУпр", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ВидРасчетовСКонтрагентом", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыРасчетовСКонтрагентами"));

	ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.ВидыРасчетовСКонтрагентами.Прочее, "ВидРасчетовСКонтрагентом");
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		Если СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтрокаТаблицы.СделкаВзаиморасчеты = Неопределено;
		КонецЕсли;

		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.ДолгУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВзаиморасчетов, 
		                                 СтрокаТаблицы.ВалютаВзаиморасчетов,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтрокаТаблицы.КурсВзаиморасчетов,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтрокаТаблицы.КратностьВзаиморасчетов,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

										 
		Если СтрокаТаблицы.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
			ИЛИ СтрокаТаблицы.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
			Тогда
			
			СтрокаТаблицы.ВидРасчетовСКонтрагентом =  Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
			
		ИначеЕсли СтрокаТаблицы.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем 
			ИЛИ СтрокаТаблицы.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
			Тогда
			
			СтрокаТаблицы.ВидРасчетовСКонтрагентом =  Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
			
		КонецЕсли; 
										 
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТаблицуСуммДолгаРегл(ТаблицаРасчетов, СтруктураШапкиДокумента)
  	
	// Добполнение таблицы расчетов полями.
	
	ТаблицаРасчетов.Колонки.Вставить(1,"Контрагент", 		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаРасчетов.Колонки.Добавить("ЭтоВозврат", 			Новый ОписаниеТипов("Булево"));
	// Заполняем контрагента по значению поля КонтрагентДебитор
	ТаблицаРасчетов.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентДебитор,"Контрагент");
	СтрокиКредиторки = ТаблицаРасчетов.найтиСтроки(Новый Структура("ВидЗадолженности", Перечисления.ВидыЗадолженности.Кредиторская));
	ТаблицаРасчетов.Колонки.Добавить("ДобавленнаяСтрокаПереносаЗадолженности", Новый ОписаниеТипов("Булево"));

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
		
		// Контрагент для кредиторской задолженности устанавливается из другого поля
		Для каждого СтрокаКредиторки Из СтрокиКредиторки Цикл
			СтрокаКредиторки.Контрагент = СтруктураШапкиДокумента.КонтрагентКредитор;
		КонецЦикла; 
		
		// Если не используется вспомогательный счет, в качестве субсчета устанавливаем счет 00 для последующей корректировки (объединения)
		// движений по кредиторской и дебиторской задолженностям.
		
		Если не СтруктураШапкиДокумента.ИспользоватьВспомогательныйСчет Тогда
			ТаблицаРасчетов.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.Вспомогательный,"КоррСчет");
			ТаблицаРасчетов.ЗаполнитьЗначения(Неопределено, "КоррСубконто1, КоррСубконто2, КоррСубконто3");
		КонецЕсли; 
		
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		// Счет переноса для кредиторской задолженности устанавливается из другого поля
		Для каждого СтрокаКредиторки Из СтрокиКредиторки Цикл
			СтрокаКредиторки.КоррСчет = СтруктураШапкиДокумента.СчетКт;
		КонецЦикла; 
		
		ТаблицаРасчетов.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентКредитор,"КоррСубконто1");
		ТаблицаРасчетов.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента,"КоррСубконто2");
		
		// При наличии аналитики по документам расчетов в конце документ перенесем из проводки по счету учета
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
			ИЛИ СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			ТаблицаРасчетов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка,	"КоррСубконто3"); 
		Иначе
			ТаблицаРасчетов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Ссылка,	"КоррСубконто3");
		КонецЕсли;
	ИначеЕсли  СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Если СтруктураШапкиДокумента.СписыватьИзРезерваСомнительныхДолгов Тогда
				Для каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
					СтрокаРасчетов.КоррСчет = СтруктураШапкиДокумента.СчетРезерваСомнительныхДолгов;
					СтрокаРасчетов.КоррСубконто1 = Неопределено;
					СтрокаРасчетов.КоррСубконто2 = Неопределено;
					СтрокаРасчетов.КоррСубконто3 = Неопределено;
				КонецЦикла; 
			КонецЕсли;
			
		КонецЕсли;
		
		// Счет и аналитику списания для кредиторской задолженности устанавливается из другого поля
		Для каждого СтрокаКредиторки Из СтрокиКредиторки Цикл
			СтрокаКредиторки.КоррСчет = СтруктураШапкиДокумента.СчетКт;
			СтрокаКредиторки.КоррСубконто1 = СтруктураШапкиДокумента.СубконтоКт1;
			СтрокаКредиторки.КоррСубконто2 = СтруктураШапкиДокумента.СубконтоКт2;
			СтрокаКредиторки.КоррСубконто3 = СтруктураШапкиДокумента.СубконтоКт3;
		КонецЦикла; 
	КонецЕсли;
	
	// Определим вид погашения задолженности - возврат оплаты или непосредственно погашение.
	Для каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаРасчетов.Сделка) Тогда
		
			СтрокаРасчетов.Сделка = Неопределено;
		
		КонецЕсли;
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			// по БУ задолженность будет формирвоваться метотом "как по оплате", поэтому определим в каких случаях у нас будет "возврат оплаты"
			Если  СтрокаРасчетов.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская 
				И СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель тогда
				СтрокаРасчетов.ЭтоВозврат = Истина;
			ИначеЕсли СтрокаРасчетов.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
				    И СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
				СтрокаРасчетов.ЭтоВозврат = Истина;
			КонецЕсли; 
		Иначе	
			// по БУ задолженность будет погашаться метотом "как по оплате", поэтому определим в каких случаях у нас будет "возврат оплаты"
			Если  СтрокаРасчетов.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская 
				И СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик тогда
				//Это возврат от поставщика
				СтрокаРасчетов.ЭтоВозврат = Истина;
			ИначеЕсли СтрокаРасчетов.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
				    И СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
				//Это возврат покупателю
				СтрокаРасчетов.ЭтоВозврат = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	// Дополним таблицу расчетов полями валютной сумм (для отработки стандартных механизмов движения денег)
	ТаблицаРасчетов.Колонки.Добавить("ГривневаяСумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаРасчетов.Колонки.Добавить("ВалютнаяСумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ТаблицаРасчетов.ЗагрузитьКолонку(ТаблицаРасчетов.ВыгрузитьКолонку("СуммаВзаиморасчетов"),"ВалютнаяСумма");
	ТаблицаРасчетов.ЗагрузитьКолонку(ТаблицаРасчетов.ВыгрузитьКолонку("Сумма"),"ГривневаяСумма");
	
	ТаблицаРасчетов.Колонки.Добавить("МоментОпределенияБазыНДС", Новый ОписаниеТипов("ПеречислениеСсылка.МоментыОпределенияНалоговойБазы"));

	ТаблицаРасчетов.Колонки.Добавить("СделкаБУ");
	ТаблицаРасчетов.Колонки.Добавить("СделкаНУ");
	Для каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
		
			СтрокаРасчетов.СделкаБУ = УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтрокаРасчетов, ?(ЗначениеЗаполнено(СтрокаРасчетов.ДокументРасчетовСКонтрагентом),СтрокаРасчетов.ДокументРасчетовСКонтрагентом,Ссылка),СтрокаРасчетов.Сделка); 
			СтрокаРасчетов.СделкаНУ = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаРасчетов, ?(ЗначениеЗаполнено(СтрокаРасчетов.ДокументРасчетовСКонтрагентом),СтрокаРасчетов.ДокументРасчетовСКонтрагентом,Ссылка),СтрокаРасчетов.Сделка);  
			
		Иначе	
			
			СтрокаРасчетов.СделкаБУ = УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтрокаРасчетов, Ссылка,СтрокаРасчетов.Сделка); 
			СтрокаРасчетов.СделкаНУ = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаРасчетов, Ссылка,СтрокаРасчетов.Сделка);  
		
		КонецЕсли;
		
	КонецЦикла;

	ТаблицаРасчетов.Колонки.Добавить("СуммаНДСВал", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаРасчетов.Колонки.Добавить("ПроводкиСуммаНДС", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	//определим имеется ли налоговый кредит по данной операции, и таким образом проводка по счету НДС.
	Для каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
		
		Если    НЕ СтрокаРасчетов.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально
			ИЛИ НЕ СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
		
			СтрокаРасчетов.СуммаНДСПропорциональноКредит = 0;	
		
		КонецЕсли;
		
		СуммаНДСРегл = СтрокаРасчетов.СуммаНДС;
		
		Если СтрокаРасчетов.Внешнеэкономический Тогда
			
			СтрокаРасчетов.СуммаНДСВал = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаРасчетов.СуммаНДС, 
											СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
											СтруктураШапкиДокумента.ВалютаДокумента,
											1,
											СтрокаРасчетов.КурсВзаиморасчетов, 
											1,
											СтрокаРасчетов.КратностьВзаиморасчетов);
											
		Иначе	
			
			СтрокаРасчетов.СуммаНДСВал = СуммаНДСРегл;
			
		КонецЕсли;
		
		
		Если   СтрокаРасчетов.ВозвратнаяТара ИЛИ 
			   (      СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик 
			     И НЕ УчетНДС.ЕстьПравоНаНалоговыйКредит(СтрокаРасчетов.НалоговоеНазначение)) Тогда
		
			СтрокаРасчетов.ПроводкиСуммаНДС = 0;	
			
		Иначе
			
			Если  СтрокаРасчетов.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально
				И СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
				
				СтрокаРасчетов.ПроводкиСуммаНДС = СтрокаРасчетов.СуммаНДСПропорциональноКредит;	
				
			Иначе	
				
				СтрокаРасчетов.ПроводкиСуммаНДС = СуммаНДСРегл;	
			
			КонецЕсли;

		КонецЕсли;
		
		Если  НЕ СтрокаРасчетов.ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета
			И НЕ СтрокаРасчетов.Внешнеэкономический = Истина Тогда
			
			СтрокаРасчетов.СуммаВзаиморасчетовБУ = СтрокаРасчетов.Сумма;  	
		
		КонецЕсли;
		
		Если СтрокаРасчетов.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
			
			Если СтрокаРасчетов.ВозвратнаяТара Тогда
				СтрокаРасчетов.МоментОпределенияБазыНДС = СтрокаРасчетов.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПокупкам;
			Иначе//товары	
				СтрокаРасчетов.МоментОпределенияБазыНДС = СтрокаРасчетов.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПокупкам;
			КонецЕсли;
			
		Иначе// покупатель	
			
			Если СтрокаРасчетов.ВозвратнаяТара Тогда
				СтрокаРасчетов.МоментОпределенияБазыНДС = СтрокаРасчетов.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам;
			Иначе//товары	
				СтрокаРасчетов.МоментОпределенияБазыНДС = СтрокаРасчетов.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента");

	Если СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
		СтруктураОбязательныхПолей.Вставить("КонтрагентДебитор");
		СтруктураОбязательныхПолей.Вставить("КонтрагентКредитор");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ИспользоватьВспомогательныйСчет Тогда
			СтруктураОбязательныхПолей.Вставить("СчетДт", "Не заполнен вспомогательный счет для проведения взаиморасчета");
		КонецЕсли; 
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
		СтруктураОбязательныхПолей.Вставить("КонтрагентДебитор");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолей.Вставить("СчетДт", "Не заполнен вспомогательный счет для проведения ввода остатков");
		КонецЕсли; 
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		СтруктураОбязательныхПолей.Вставить("КонтрагентДебитор");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолей.Вставить("СчетДт", "Не заполнен корреспондирующий счет");
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				Если СчетДт.НалоговыйУчет = Истина Тогда
					
					СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");	

					ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
					Для НомСубконто = 1 По 3 Цикл
						Если СчетДт.ВидыСубконто.Количество()<НомСубконто Тогда
							Прервать;
						КонецЕсли;
						
						ВидСубконто = СчетДт.ВидыСубконто[НомСубконто-1].ВидСубконто;
						Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
							 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
							 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
							ЕстьСубконтоСтатьяЗатратДоходов = Истина;
							Прервать;
						КонецЕсли;

					КонецЦикла;
					
					Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
						СтруктураОбязательныхПолей.Вставить("СубконтоДт" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто); 	
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;			
		КонецЕсли; 
	Иначе
		СтруктураОбязательныхПолей.Вставить("КонтрагентДебитор","Не заполнен контрагент для списания (формирования) задолженности");
		Если СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			
			СтруктураОбязательныхПолей.Вставить("КонтрагентКредитор","Не заполнен контрагент для зачисления задолженности");
			Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
				И (СтруктураШапкиДокумента.ЕстьНДС) Тогда
				СтруктураОбязательныхПолей.Вставить("ТипКонтрагента","Не заполнен тип контрагента для зачисления задолженности");
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И не ТаблицаПоСуммамДолга.Найти(Перечисления.ВидыЗадолженности.Дебиторская,"ВидЗадолженности") = Неопределено Тогда
				СтруктураОбязательныхПолей.Вставить("СчетДт","Не заполнен счет зачисления дебиторской задолженности");
			КонецЕсли; 
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И не ТаблицаПоСуммамДолга.Найти(Перечисления.ВидыЗадолженности.Кредиторская,"ВидЗадолженности") = Неопределено Тогда
				СтруктураОбязательныхПолей.Вставить("СчетКт","Не заполнен счет зачисления кредиторской задолженности");
			КонецЕсли;
			
			Если   СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
				 И СтруктураШапкиДокумента.ЕстьНДС Тогда
				 СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
				 СтруктураОбязательныхПолей.Вставить("СчетУчетаНДСПодтвержденный");
			КонецЕсли;
			
		ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И не ТаблицаПоСуммамДолга.Найти(Перечисления.ВидыЗадолженности.Дебиторская,"ВидЗадолженности") = Неопределено Тогда
				СтруктураОбязательныхПолей.Вставить("СчетДт","Не заполнен счет списания дебиторской задолженности");
				
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И не ТаблицаПоСуммамДолга.Найти(Перечисления.ВидыЗадолженности.Кредиторская,"ВидЗадолженности") = Неопределено Тогда
				СтруктураОбязательныхПолей.Вставить("СчетКт","Не заполнен счет списания кредиторской задолженности");
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И
				 СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
				Если НЕ НеСторнироватьДоходыСебестоимостьВНУ Тогда
					СтруктураОбязательныхПолей.Вставить("ПараметрыСписанияСебестоимостиНУ");
				КонецЕсли;
				
				Если СписыватьИзРезерваСомнительныхДолгов Тогда
					
					СтруктураОбязательныхПолей.Вставить("СчетРезерваСомнительныхДолгов");
					
					Если ЗначениеЗаполнено(СчетДт) Тогда
					
						ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
						Для НомСубконто = 1 По 3 Цикл
							Если СчетДт.ВидыСубконто.Количество()<НомСубконто Тогда
								Прервать;
							КонецЕсли;
							
							ВидСубконто = СчетДт.ВидыСубконто[НомСубконто-1].ВидСубконто;
							Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
								 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
								 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
								ЕстьСубконтоСтатьяЗатратДоходов = Истина;
								Прервать;
							КонецЕсли;

						КонецЦикла;
						
						Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
							СтруктураОбязательныхПолей.Вставить("СубконтоДт" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто); 	
						КонецЕсли;

					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СчетКт) Тогда
				
					ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
					Для НомСубконто = 1 По 3 Цикл
						Если СчетКт.ВидыСубконто.Количество()<НомСубконто Тогда
							Прервать;
						КонецЕсли;
						
						ВидСубконто = СчетКт.ВидыСубконто[НомСубконто-1].ВидСубконто;
						Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
							 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
							 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
							ЕстьСубконтоСтатьяЗатратДоходов = Истина;
							Прервать;
						КонецЕсли;

					КонецЦикла;
					
					Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
						СтруктураОбязательныхПолей.Вставить("СубконтоКт" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто); 	
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли; 
	
	Если СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.ДоговорКонтрагента)Тогда

			СтрокаСообщения = "Не заполнен договор для зачисления задолженности!";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, СтатусСообщения.Внимание);
		КонецЕсли;
		
		// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
			СтруктураОбязательныхПолей.Вставить("Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам""! 
			|Заполните поле ""Заказ покупателя (Заказ поставщика)""!");
		ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			СтруктураОбязательныхПолей.Вставить("Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам""! 
			|Заполните поле ""Счет покупателя (Счет поставщика)""!");
		КонецЕсли;

	КонецЕсли; 
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
 	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ТипПоставщик  = Перечисления.СтатусыКонтрагентов.Поставщик;
	ТипПокупатель = Перечисления.СтатусыКонтрагентов.Покупатель;
	ДоговорСПоставщиком = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ДоговорСПокупателем = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	
	Если  СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
		И (СтруктураШапкиДокумента.ЕстьНДС) 
		И (   (СтруктураШапкиДокумента.ВидДоговора = ДоговорСПоставщиком и НЕ СтруктураШапкиДокумента.ТипКонтрагента = ТипПоставщик)
		   ИЛИ(СтруктураШапкиДокумента.ВидДоговора = ДоговорСПокупателем и НЕ СтруктураШапкиДокумента.ТипКонтрагента = ТипПокупатель))	Тогда
		   
		СтрокаСообщения = "Тип контрагента для зачисления задолженности не соответствует виду договора этого контрагента!";
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, СтатусСообщения.Внимание);
		
	КонецЕсли; 

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "СуммыДолга".
//
// Параметры:
// Параметры: 
//  ТаблицаПоСуммамДолга    - таблица значений, содержащая данные для проведения и проверки ТЧ СуммыДолга
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиСуммыДолга(ТаблицаПоСуммамДолга, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "СуммыДолга";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов");

	Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ЕстьНДС Тогда

		СтруктураОбязательныхПолей.Вставить("ТипКонтрагента");
		СтруктураОбязательныхПолей.Вставить("РасчетыВозврат");	
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договорах взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоСуммамДолга, Отказ, Заголовок);

	Для каждого СтрокаТаблицы Из ТаблицаПоСуммамДолга Цикл

		Если СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		 ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда

			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
			                                 """ табличной части ""Суммы долга"": ";

			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СделкаВзаиморасчеты) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " выбран договор, взаиморасчеты по которому ведутся по заказам.
				                    |Необходимо заполнить сделку!", Отказ, Заголовок);
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;

	// Если проведение взаимозачета - проверим на совпадение суммы дебиторской и кредиторской задолженности. 
	// Взаимозачет проводится только при полном совпадении сумм
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
		
		ТабСумм         = ТаблицаПоСуммамДолга.Скопировать();
		
		Если СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета или СтруктураШапкиДокумента.ВалютаДокумента = Справочники.Валюты.ПустаяСсылка() Тогда
			ТабСумм.Свернуть("ВидЗадолженности","Сумма");
		Иначе
			ТабСумм.Свернуть("ВидЗадолженности","СуммаВзаиморасчетов");
			ТабСумм.Колонки.СуммаВзаиморасчетов.Имя = "Сумма";
		КонецЕсли; 
		
		СуммаДеб  = 0;
		СуммаКред = 0;
		
		Для каждого СтрокаСумм Из ТабСумм Цикл
			Если  СтрокаСумм.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
				СуммаДеб  = СтрокаСумм.Сумма;
			ИначеЕсли  СтрокаСумм.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
				СуммаКред = СтрокаСумм.Сумма;
			КонецЕсли; 
		КонецЦикла; 
		
		Разница = СуммаДеб - СуммаКред;
		
		Если не Разница =0  Тогда
			ТекстСообщения = "Не совпадают суммы дебиторской и кредиторской задолженности при проведении взаимозачета. Взаимозачет не может быть проведен.";
			ТекстСообщения = ТекстСообщения + Символы.ПС+
							 "Дебиторская задолженность: " + Формат(СуммаДеб, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")+" " +Строка(СтруктураШапкиДокумента.ВалютаДокумента);
			ТекстСообщения = ТекстСообщения + Символы.ПС+
							 "Кредиторская задолженность: " + Формат(СуммаКред, "ЧЦ=15; ЧДЦ=2; ЧН=-")+" "+Строка(СтруктураШапкиДокумента.ВалютаДокумента);
			ТекстСообщения = ТекстСообщения + Символы.ПС+
							 "Разница: " + Формат(Разница, "ЧЦ=15;ЧДЦ=2")+Строка(СтруктураШапкиДокумента.ВалютаДокумента);
			
			ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщения, Отказ, Заголовок);
		КонецЕсли; 
	КонецЕсли;
	
	ТипПоставщик  = Перечисления.СтатусыКонтрагентов.Поставщик;
	ТипПокупатель = Перечисления.СтатусыКонтрагентов.Покупатель;
			
	ДоговорСПоставщиком = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ДоговорСПокупателем = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ДоговорПрочее	    = Перечисления.ВидыДоговоровКонтрагентов.Прочее;

	Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ЕстьНДС Тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаПоСуммамДолга Цикл

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Суммы долга"": ", СокрЛП(СтрокаТаблицы.НомерСтроки));
			
			Если     СтрокаТаблицы.СложныйНалоговыйУчет
				И (    СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков
				   ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности)
				И НЕ (СтрокаТаблицы.ВозвратнаяТара И СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат)
				И НЕ СтрокаТаблицы.ВидДоговора = ДоговорПрочее Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначение) 
					И СтруктураШапкиДокумента.ЕстьНДС
					И СтрокаТаблицы.ТипКонтрагента = ТипПоставщик Тогда
					
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указано налоговое назначение!", Отказ, Заголовок);
				КонецЕсли;
		
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указана ставка НДС!", Отказ, Заголовок);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДС) и СтрокаТаблицы.СуммаНДС <> 0 Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указан счет учета НДС (неподтвержденный)!", Отказ, Заголовок);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДСПодтвержденный) и СтрокаТаблицы.СуммаНДС <> 0 Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указан Счет  НДС кредита (обязательств)!", Отказ, Заголовок);
				КонецЕсли;

			ИначеЕсли  НЕ  СтрокаТаблицы.СложныйНалоговыйУчет Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначение) 
					И СтруктураШапкиДокумента.ЕстьНДС
					И СтрокаТаблицы.ТипКонтрагента = ТипПоставщик Тогда
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указано налоговое назначение!", Отказ, Заголовок);
				КонецЕсли;
	
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указана ставка НДС!", Отказ, Заголовок);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДС) И НЕ СтрокаТаблицы.ВозвратнаяТара Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указан счет учета НДС (неподтвержденный)!", Отказ, Заголовок);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДСПодтвержденный)  И НЕ СтрокаТаблицы.ВозвратнаяТара Тогда
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указан Счет  НДС кредита (обязательств)!", Отказ, Заголовок);
				КонецЕсли;
				
			КонецЕсли;
			
			Если    (СтрокаТаблицы.ВидДоговора = ДоговорСПоставщиком и НЕ СтрокаТаблицы.ТипКонтрагента = ТипПоставщик)
				ИЛИ (СтрокаТаблицы.ВидДоговора = ДоговорСПокупателем и НЕ СтрокаТаблицы.ТипКонтрагента = ТипПокупатель)	Тогда
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " значение реквизита ""тип контрагента"" не соответствует виду договора!", Отказ, Заголовок);
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;	
	
	
	Если   СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
		И (СтруктураШапкиДокумента.ЕстьНДС) 
		И  СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
		И ЗначениеЗаполнено(ТипКонтрагента) Тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаПоСуммамДолга Цикл

			Если ЗначениеЗаполнено(СтрокаТаблицы.ТипКонтрагента)
				И НЕ (СтрокаТаблицы.ТипКонтрагента = ТипКонтрагента) Тогда
				
				Если ЗначениеЗаполнено(Заголовок) Тогда
					Сообщить(Заголовок);
					Заголовок = "";
				КонецЕсли;
				
				Сообщить("В одной из строк документа указан тип контрагента, который не совпадает с типом контрагента-получателя!
						 |Проводки по налоговым регистрам для контрагента-получателя будут сформированы инверсно (""как возврат"")");
				
				Прервать	
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиСуммыДолга()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения          - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента  - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоСуммамДолга     - таблица значений, содержащая данные для проведения и проверки ТЧ СуммыДолга,
//  Отказ                    - флаг отказа в проведении,
//  Заголовок                - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);
	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);	
	ДвиженияПоПереносуЗадолженности(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);

	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Формирует движения по регистрам для целей упр. учета
//
// Параметры:
//  РежимПроведения         - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  ТаблицаПоСуммамДолга    - таблица значений, содержащая данные для проведения и проверки ТЧ СуммыДолга,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		 Возврат;
	КонецЕсли;  

	ТаблицаУвеличениеДолга = ТаблицаПоСуммамДолга.Скопировать();
	ТаблицаУменьшениеДолга = ТаблицаПоСуммамДолга.Скопировать();
	
	ВидЗадолженностиДляОтбораВТаблицуУвеличенияДолга = Перечисления.ВидыЗадолженности.Кредиторская;
	Если    СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков
		ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		ВидЗадолженностиДляОтбораВТаблицуУвеличенияДолга = Перечисления.ВидыЗадолженности.Дебиторская;
	КонецЕсли;
	ВидЗадолженностиДляОтбораВТаблицуУменьшенияДолга = Перечисления.ВидыЗадолженности.Дебиторская;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков
		ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		ВидЗадолженностиДляОтбораВТаблицуУменьшенияДолга = Перечисления.ВидыЗадолженности.Кредиторская;
	КонецЕсли;

	Счетчик = 0;
	Пока Счетчик < ТаблицаУвеличениеДолга.Количество() Цикл

		СтрокаТаблицы = ТаблицаУвеличениеДолга.Получить(Счетчик);
		Если не СтрокаТаблицы.ВидЗадолженности = ВидЗадолженностиДляОтбораВТаблицуУвеличенияДолга
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			 ТаблицаУвеличениеДолга.Удалить(СтрокаТаблицы);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;

	КонецЦикла;

	Счетчик = 0;
	Пока Счетчик < ТаблицаУменьшениеДолга.Количество() Цикл

		СтрокаТаблицы = ТаблицаУменьшениеДолга.Получить(Счетчик);

		Если не СтрокаТаблицы.ВидЗадолженности = ВидЗадолженностиДляОтбораВТаблицуУменьшенияДолга 
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			 ТаблицаУменьшениеДолга.Удалить(СтрокаТаблицы);
		Иначе 
			Счетчик= Счетчик + 1;
		КонецЕсли;

	КонецЦикла;
	
	Если ТаблицаУвеличениеДолга.Количество() > 0 Тогда

		ТаблицаУвеличениеДолга.Колонки.ДолгУпр.Имя = "СуммаУпр";
		ТаблицаУвеличениеДолга.Колонки.Удалить("Сделка");
		ТаблицаУвеличениеДолга.Колонки.СделкаВзаиморасчеты.Имя = "Сделка";

		// ПО РЕГИСТРУ ВзаиморасчетыСКонтрагентами.
		НаборДвижений = Движения.ВзаиморасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений.Очистить();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУвеличениеДолга, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
		КонецЕсли;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			// необходимо сделать противоположные движения по контрагенту-получателю.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентКредитор, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
			Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Сделка");
			Иначе
				ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка, "Сделка");
			КонецЕсли;
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход();
			КонецЕсли;
		
		КонецЕсли;	
		
		// ПО РЕГИСТРУ РасчетыСКонтрагентами.
		НаборДвижений = Движения.РасчетыСКонтрагентами;
		ТаблицаУвеличениеДолга.Колонки.Сделка.Имя = "СделкаВзаиморасчеты";
		ТаблицаУвеличениеДолгаРасчеты = ТаблицаУвеличениеДолга.Скопировать();
		ТаблицаУвеличениеДолгаРасчеты.Колонки.СделкаРасчеты.Имя = "Сделка";

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУвеличениеДолгаРасчеты, ТаблицаДвижений);
			
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Расчеты,"РасчетыВозврат");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.РасчетыСКонтрагентами.ВыполнитьПриход();
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			// необходимо сделать противоположные движения по контрагенту-получателю.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентКредитор, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
			Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Сделка");
			Иначе
				ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка, "Сделка");
			КонецЕсли;
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.РасчетыСКонтрагентами.ВыполнитьРасход();
			КонецЕсли;
		
		КонецЕсли;	
		
	КонецЕсли;

	Если ТаблицаУменьшениеДолга.Количество() > 0 Тогда

		ТаблицаУменьшениеДолга.Колонки.ДолгУпр.Имя = "СуммаУпр";
		ТаблицаУменьшениеДолга.Колонки.Удалить("Сделка");
		ТаблицаУменьшениеДолга.Колонки.СделкаВзаиморасчеты.Имя = "Сделка";

		// ПО РЕГИСТРУ ВзаиморасчетыСКонтрагентами.
		НаборДвижений = Движения.ВзаиморасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУменьшениеДолга, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход();
		КонецЕсли;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			// необходимо сделать противоположные движения по контрагенту-получателю.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентКредитор, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
			Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Сделка");
			Иначе
				ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка, "Сделка");
			КонецЕсли;

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
			КонецЕсли;
		
		КонецЕсли;	
		
		НаборДвижений = Движения.РасчетыСКонтрагентами;
		ТаблицаУменьшениеДолга.Колонки.Сделка.Имя = "СделкаВзаиморасчеты";
		ТаблицаУменьшениеДолгаРасчеты = ТаблицаУменьшениеДолга.Скопировать();
		ТаблицаУменьшениеДолгаРасчеты.Колонки.СделкаРасчеты.Имя = "Сделка";

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУменьшениеДолгаРасчеты, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Расчеты,"РасчетыВозврат");
			
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.РасчетыСКонтрагентами.ВыполнитьРасход();
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			// необходимо сделать противоположные движения по контрагенту-получателю.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КонтрагентКредитор, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
			Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Сделка");
			Иначе
				ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка, "Сделка");
			КонецЕсли;

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.РасчетыСКонтрагентами.ВыполнитьПриход();
			КонецЕсли;
		
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура  ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		 Возврат;
	КонецЕсли;  
	
	ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность = ТаблицаПоСуммамДолга.Скопировать();
	ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность  = ТаблицаПоСуммамДолга.Скопировать();
	
	ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность = ТаблицаПоСуммамДолга.Скопировать();
	ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность  = ТаблицаПоСуммамДолга.Скопировать();

	Счетчик = 0;
	Пока Счетчик < ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность.Количество() Цикл

		СтрокаТаблицы = ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность.Получить(Счетчик);
		Если не СтрокаТаблицы.ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации
			ИЛИ не СтрокаТаблицы.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность.Удалить(СтрокаТаблицы);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;

	КонецЦикла;

	Счетчик = 0;
	Пока Счетчик < ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность.Количество() Цикл

		СтрокаТаблицы = ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность.Получить(Счетчик);

		Если не СтрокаТаблицы.ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации
			или не СтрокаТаблицы.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность.Удалить(СтрокаТаблицы);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;

	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность.Количество() Цикл

		СтрокаТаблицы = ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность.Получить(Счетчик);

		Если не СтрокаТаблицы.ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению 
			или не СтрокаТаблицы.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность.Удалить(СтрокаТаблицы);
		Иначе 
			Счетчик= Счетчик + 1;
		КонецЕсли;

	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность.Количество() Цикл

		СтрокаТаблицы = ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность.Получить(Счетчик);
		Если не СтрокаТаблицы.ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению 
			или не СтрокаТаблицы.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская
			ИЛИ СтрокаТаблицы.ВзаиморасчетыЗакрыты Тогда
			ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность.Удалить(СтрокаТаблицы);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;

	КонецЦикла;

	ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность.Колонки.Удалить("Сделка");
	ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность.Колонки.СделкаВзаиморасчеты.Имя= "Сделка";
	
	ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность.Колонки.Удалить("Сделка");
	ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность.Колонки.СделкаВзаиморасчеты.Имя	= "Сделка";
	
	ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность.Колонки.Удалить("Сделка");
	ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность.Колонки.СделкаВзаиморасчеты.Имя= "Сделка";
	
	ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность.Колонки.Удалить("Сделка");	
	ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность.Колонки.СделкаВзаиморасчеты.Имя	= "Сделка";
	
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
		// контролировать остатки по расчетным документам не нужно
		СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
	КонецЕсли;
	ДатаДвижений = УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Дата, Дата);
	
	ТаблицаПлатежей = ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов(ТаблицаРасчетыСПокупателямиКредиторскаяЗадолженность);
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
		Если    ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков 
			ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
		УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ТаблицаПлатежей, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок, Ложь);
	КонецЕсли;

	ТаблицаПлатежей = ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов(ТаблицаРасчетыСПокупателямиДебиторскаяЗадолженность);
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков 
		 ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
		УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ТаблицаПлатежей, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок, Ложь);
	КонецЕсли;
	
	ТаблицаПлатежей = ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов(ТаблицаРасчетыСПоставщикамиКредиторскаяЗадолженность);
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков
		 ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
		УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ТаблицаПлатежей, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок, Ложь);
	КонецЕсли;
	
	ТаблицаПлатежей = ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов(ТаблицаРасчетыСПоставщикамиДебиторскаяЗадолженность);
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков 
		 ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
		УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ТаблицаПлатежей, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок, Ложь);
	КонецЕсли;	

КонецПроцедуры

// Используется при проведении документа "Корректировка долга" с операцией "Перенос задолженности".
// Формирует движения регистров по контрагенту, на которого переносится долг.
//
Процедура ДвиженияПоПереносуЗадолженности(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		 Возврат;
	КонецЕсли;  
	
	Если СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.ДоговорКонтрагентаВестиПоДокументамРасчетовСКонтрагентом = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ВидРасчетовСКонтрагентом = 
			?(СтруктураШапкиДокумента.ДоговорКонтрагентаВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			ИЛИ СтруктураШапкиДокумента.ДоговорКонтрагентаВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером,
			Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации, Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению);
			
	// Движения регистров ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов
	
	Для каждого СтрокаДолга Из ТаблицаПоСуммамДолга Цикл
		
		ПереносДолгаНаДругогоКонтрагента = СтруктураШапкиДокумента.ДоговорКонтрагента <> СтрокаДолга.ДоговорКонтрагента;
		
		ВидДвижения = ?(СтрокаДолга.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская, 
					ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);		
					
		НоваяСуммаВзаиморасчетов    = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			СтрокаДолга.СуммаВзаиморасчетов,
			СтрокаДолга.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.ДоговорКонтрагентаВалютаВзаиморасчетов,
			СтрокаДолга.КурсВзаиморасчетов, СтруктураШапкиДокумента.ДоговорКонтрагентаКурсВзаиморасчетов,
			СтрокаДолга.КратностьВзаиморасчетов, СтруктураШапкиДокумента.ДоговорКонтрагентаКратностьВзаиморасчетов);
		
		Движение = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
		
		Движение.ВидДвижения = ВидДвижения;
		Движение.Период      = СтруктураШапкиДокумента.Дата;
		Движение.Активность  = Истина;
		
		Движение.Организация        = СтруктураШапкиДокумента.Организация;
		Движение.Контрагент         = СтруктураШапкиДокумента.КонтрагентКредитор;
		Движение.ДоговорКонтрагента = СтруктураШапкиДокумента.ДоговорКонтрагента;
		Движение.Сделка             = СтруктураШапкиДокумента.Сделка;
		
		НовыйДокументРасчетов = ?(НЕ ЗначениеЗаполнено(СтрокаДолга.ДокументРасчетовСКонтрагентом) ИЛИ ПереносДолгаНаДругогоКонтрагента, 
			СтруктураШапкиДокумента.Ссылка, СтрокаДолга.ДокументРасчетовСКонтрагентом);
			
		Движение.ДокументРасчетовСКонтрагентом = НовыйДокументРасчетов;
		Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
		
		Движение.СуммаВзаиморасчетов = НоваяСуммаВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает таблицу значений, не содержащую строк источника со значением Ложь в колонке "ВестиПоДокументамРасчетовСКонтрагентом"
//
// Параметры:
// ТаблицаИсточник		- <ТаблицаЗначений> исходная таблица. 
//							Обязательно должна содержать колонку "ВестиПоДокументамРасчетовСКонтрагентом"
//
Функция ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов(ТаблицаИсточник)
	
	ТаблицаРезультат = ТаблицаИсточник.Скопировать();
	СтрокиНеПоДокументам = ТаблицаРезультат.НайтиСтроки(Новый Структура("ВестиПоДокументамРасчетовСКонтрагентом", Ложь));
	Для каждого СтрокаНеПоДокументам Из СтрокиНеПоДокументам Цикл
		ТаблицаРезультат.Удалить(СтрокаНеПоДокументам);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;

КонецФункции // ПодготовитьТаблицуПлатежейОперативныхВзаиморасчетов()

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)
	
	Если ТаблицаПоСуммамДолга.Количество()=0 Тогда
		 Возврат;
	КонецЕсли;  
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		 Возврат;
	КонецЕсли;  
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
	
		ДвиженияПоВводуНачальныхОстатков(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);	
		
	Иначе
		
		ТаблицаДебиторскойЗадолженности = ТаблицаПоСуммамДолга.Скопировать();
		ТаблицаКредиторскойЗадолженности = ТаблицаПоСуммамДолга.Скопировать();

		ВидЗадолженностиДебиторская = Перечисления.ВидыЗадолженности.Дебиторская;
		ВидЗадолженностиКредиторская = Перечисления.ВидыЗадолженности.Кредиторская;
		
		Счетчик = 0;
		Пока Счетчик < ТаблицаДебиторскойЗадолженности.Количество() Цикл

			СтрокаТаблицы = ТаблицаДебиторскойЗадолженности.Получить(Счетчик);
			Если не СтрокаТаблицы.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда
				 ТаблицаДебиторскойЗадолженности.Удалить(СтрокаТаблицы);
			Иначе
				// заполним поле "сделка" по правилам расчетных документов
				Если СтрокаТаблицы.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
					СтрокаТаблицы.Сделка = СтрокаТаблицы.ДокументРасчетовСКонтрагентом;
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
						СтрокаТаблицы.Сделка = Неопределено;
					КонецЕсли;
				ИначеЕсли НЕ (    СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
			  		          ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
					СтрокаТаблицы.Сделка = Неопределено;
				КонецЕсли;
				Счетчик = Счетчик + 1;
			КонецЕсли;

		КонецЦикла;

		Счетчик = 0;
		Пока Счетчик < ТаблицаКредиторскойЗадолженности.Количество() Цикл

			СтрокаТаблицы = ТаблицаКредиторскойЗадолженности.Получить(Счетчик);
			Если не СтрокаТаблицы.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
				 ТаблицаКредиторскойЗадолженности.Удалить(СтрокаТаблицы);
			Иначе
				// заполним поле "сделка" по правилам расчетных документов
				Если СтрокаТаблицы.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
					СтрокаТаблицы.Сделка = СтрокаТаблицы.ДокументРасчетовСКонтрагентом;
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
						СтрокаТаблицы.Сделка = Неопределено;
					КонецЕсли;
				ИначеЕсли НЕ (    СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
			  		          ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
					СтрокаТаблицы.Сделка = Неопределено;
				КонецЕсли;
				Счетчик = Счетчик + 1;
			КонецЕсли;

		КонецЦикла;

		// нужно изменить дебеторскую/кредиторскую задолженность для вида операции "изменение (фомрирование) задолженности"
		// так как для всех других видов операций (кроме еще ввода начальных остатков) указанная задолженность погашается,
		// а здесь наоборот, формируется.
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			ВремТабл 						 = ТаблицаДебиторскойЗадолженности;
			ТаблицаДебиторскойЗадолженности  = ТаблицаКредиторскойЗадолженности;
			ТаблицаКредиторскойЗадолженности = ВремТабл;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
			
			Если ТаблицаДебиторскойЗадолженности.Колонки.Найти("НалоговоеНазначение")  = Неопределено Тогда
				ТаблицаДебиторскойЗадолженности.Колонки.Добавить("НалоговоеНазначение")
			КонецЕсли;
			// заполним налоговое назначение - значением из шапки (по прибыли).
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				ТаблицаДебиторскойЗадолженности.ЗаполнитьЗначения(СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат, "НалоговоеНазначение");
				// суммы по списанию дебеторской задолженности в НУ не должны фигурировать
				ТаблицаДебиторскойЗадолженности.Колонки.Добавить("НеОтноситьНаЗатратыПоНУ");
				ТаблицаДебиторскойЗадолженности.ЗаполнитьЗначения(Истина, "НеОтноситьНаЗатратыПоНУ");
			КонецЕсли;
			
			
			Если ТаблицаКредиторскойЗадолженности.Колонки.Найти("НалоговоеНазначение")  = Неопределено Тогда
				ТаблицаКредиторскойЗадолженности.Колонки.Добавить("НалоговоеНазначение")
			КонецЕсли;
			// заполним налоговое назначение - значением из шапки (по прибыли).
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				ТаблицаКредиторскойЗадолженности.ЗаполнитьЗначения(СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат, "НалоговоеНазначение");
			КонецЕсли;
			
		Иначе
			// удаляем налоговое назначение, так как при движении денег могут ошибочно сформироваться 
			// движения по налоговому учету (по налоговому назначению по НДС).
			Если НЕ ТаблицаДебиторскойЗадолженности.Колонки.Найти("НалоговоеНазначение") = Неопределено Тогда
				ТаблицаДебиторскойЗадолженности.Колонки.Удалить("НалоговоеНазначение")
			КонецЕсли;
			//Если ТаблицаКредиторскойЗадолженности.Колонки.Найти("НалоговоеНазначение") = Неопределено Тогда
			Если НЕ ТаблицаКредиторскойЗадолженности.Колонки.Найти("НалоговоеНазначение") = Неопределено Тогда
				ТаблицаКредиторскойЗадолженности.Колонки.Удалить("НалоговоеНазначение")
			КонецЕсли;
			
		КонецЕсли;
		
		ДвиженияПоРегистрамБухгалтерии(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок, ТаблицаДебиторскойЗадолженности,ТаблицаКредиторскойЗадолженности);

		ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);
		
		ДвиженияПоСписаниюЗадолженнстиПоНалоговомуУчету(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ЕстьЕдиныйНалог И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		ДвиженияПоЕдиномуНалогу(СтруктураШапкиДокумента, ТаблицаКредиторскойЗадолженности);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоЕдиномуНалогу(СтруктураШапкиДокумента, ТаблицаКредиторскойЗадолженности)
	
	СуммаЕН = ТаблицаКредиторскойЗадолженности.Итог("Сумма");
	Если СтруктураШапкиДокумента.ЕстьНДС Тогда
		СуммаЕН = СуммаЕН - ТаблицаКредиторскойЗадолженности.Итог("ПроводкиСуммаНДС");
	КонецЕсли;
	
	Если СуммаЕН > 0 Тогда
		Движение = Движения.КнигаДоходовРасходовПоЕдиномуНалогу.Добавить();
		Движение.Период = СтруктураШапкиДокумента.Дата;
		Движение.Регистратор = СтруктураШапкиДокумента.Ссылка;
		Движение.Организация = СтруктураШапкиДокумента.Организация;
		Движение.Статья = Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыПросроченнаяЗадолженность;
		Движение.Сумма = СуммаЕН;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоВводуНачальныхОстатков(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок)
	
	ПроводкиБУ 			= Движения.Хозрасчетный;
	
	ОиПНДСПродаж 		= Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	ОиПНДСПриобретений 	= Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	НУПродаж 			= Движения.ПродажиНалоговыйУчет;
	НУПриобретений 		= Движения.ПриобретенияНалоговыйУчет;
	
	ВидЗадолженностиДебиторская  = Перечисления.ВидыЗадолженности.Дебиторская;
	ВидЗадолженностиКредиторская = Перечисления.ВидыЗадолженности.Кредиторская;

	ВспомогательныйСчет = СтруктураШапкиДокумента.СчетДт;	

	ДатаСторноДвижений = КонецМесяца(СтруктураШапкиДокумента.Дата)+2;
	
	Для каждого СтрокаЗадолженности Из ТаблицаПоСуммамДолга Цикл
		
		Если СтрокаЗадолженности.ВзаиморасчетыЗакрыты Тогда
			// сфорируем только движения по ожидаемому и подтвержденному НДС
			
				// ожидаемый и подтвержденный НДС
				Если  НЕ СтрокаЗадолженности.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее 
					И      СтруктураШапкиДокумента.ЕстьНДС
					И НЕ  (СтрокаЗадолженности.ВозвратнаяТара И СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат)
					И     (НЕ (СтрокаЗадолженности.Внешнеэкономический = Истина) ИЛИ СтрокаЗадолженности.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель) Тогда
						
					   Если СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель Тогда
							   
						   РегистрОиПНДС = ОиПНДСПродаж;
							   
						   Движение 		 = РегистрОиПНДС.Добавить();	
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
						   КонецЕсли;
							   
					   Иначе// СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Поставщик
							   
						   РегистрОиПНДС = ОиПНДСПриобретений;

						   Движение 			= РегистрОиПНДС.Добавить();
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
						   КонецЕсли;
							   
						   Движение.ДляХозяйственнойДеятельности = ?(СтрокаЗадолженности.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
						   Движение.ВидДеятельностиНДС 			 = СтрокаЗадолженности.ВидДеятельностиНДС;
						   Движение.Амортизируется 				= СтрокаЗадолженности.Амортизируется;
						   Движение.СуммаНДСПропорционально = СтрокаЗадолженности.СуммаНДСПропорциональноКредит;
						   
					   КонецЕсли;
					   
					   Движение.ВидДвижения  			= ВидДвиженияНакопления.Приход;
					   Движение.Период	 				= СтруктураШапкиДокумента.Дата;
					   Движение.Организация 		  	= СтруктураШапкиДокумента.Организация;
					   Движение.ДоговорКонтрагента 		= СтрокаЗадолженности.ДоговорКонтрагента;
	  				   Движение.Сделка				    = СтрокаЗадолженности.СделкаНУ;
					   Движение.ВозвратнаяТара	  		= СтрокаЗадолженности.ВозвратнаяТара;
					   Движение.СтавкаНДС	  			= СтрокаЗадолженности.СтавкаНДС;
					   Движение.БазаНДС  				= СтрокаЗадолженности.СуммаВзаиморасчетовБУ - СтрокаЗадолженности.СуммаНДСВал;
					   Движение.СуммаНДС    			= СтрокаЗадолженности.СуммаНДСВал;
					   Движение.КодОперации 			= КодыОпераций.ОжидаемыйНДС;						   
					   
					   // бухгалтерские проводки - НДС
					   Если  СтрокаЗадолженности.ПроводкиСуммаНДС <> 0 Тогда
						   
						   Проводка = ПроводкиБУ.Добавить();
						   Проводка.Период			= СтруктураШапкиДокумента.Дата;
						   Проводка.Организация		= СтруктураШапкиДокумента.Организация;
						   Проводка.НомерЖурнала	= "";
						   Проводка.Содержание		= "Ввод начальных остатков по взаиморасчетам (НДС)";
						   Проводка.Сумма			= СтрокаЗадолженности.ПроводкиСуммаНДС;
						   
						   Если СтрокаЗадолженности.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
							   // покупатель
							   Проводка.СчетДт = ВспомогательныйСчет;
							   
							   Проводка.СчетКт = СтрокаЗадолженности.СчетУчетаНДС;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
							   
						   Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							   // поставщик
							   Проводка.СчетДт = СтрокаЗадолженности.СчетУчетаНДС;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
							   
							   Проводка.СчетКт 	= ВспомогательныйСчет;
							   
						   КонецЕсли;
						   
					   КонецЕсли;					   
					   
				   КонецЕсли;
				   
			   Продолжить;
	   
		КонецЕсли;
		   
		// бухгалтерские проводки  - взаиморасчеты
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период			= СтруктураШапкиДокумента.Дата;
		Проводка.Организация	= СтруктураШапкиДокумента.Организация;
		Проводка.НомерЖурнала	= "";
		Проводка.Содержание		= "Ввод начальных остатков по взаиморасчетам";
		Проводка.Сумма			= СтрокаЗадолженности.Сумма;
		
		Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда
			
			Проводка.СчетДт = СтрокаЗадолженности.СчетОплаты;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
					
			НомерСубконтоРД = ПолучитьНомерСубконтоРД(СтрокаЗадолженности.СчетОплаты);
			Если не НомерСубконтоРД = 0  Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаБУ);
			КонецЕсли;
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтрокаЗадолженности.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаДт = СтрокаЗадолженности.СуммаВзаиморасчетовБУ;
			КонецЕсли;			
			
			Проводка.СчетКт 	= ВспомогательныйСчет;
			
		Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда	
			
			Проводка.СчетДт 	= ВспомогательныйСчет;
			
			Проводка.СчетКт = СтрокаЗадолженности.СчетОплаты;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
			
			НомерСубконтоРД = ПолучитьНомерСубконтоРД(СтрокаЗадолженности.СчетОплаты);
			Если не НомерСубконтоРД = 0  Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаБУ);
			КонецЕсли;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтрокаЗадолженности.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаКт = СтрокаЗадолженности.СуммаВзаиморасчетовБУ;
			КонецЕсли;			
			
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
    		   
			Если СтрокаЗадолженности.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
				
				//налоговые регистры не заполняем
				Продолжить;
				
			КонецЕсли; 
		
			Если СтрокаЗадолженности.СложныйНалоговыйУчет Тогда
					
				// бухгалтерские проводки - НДС
				Если  СтруктураШапкиДокумента.ЕстьНДС 
					И СтрокаЗадолженности.ПроводкиСуммаНДС <> 0 Тогда
						
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период			= СтруктураШапкиДокумента.Дата;
					Проводка.Организация	= СтруктураШапкиДокумента.Организация;
					Проводка.НомерЖурнала	= "";
					Проводка.Содержание		= "Ввод начальных остатков по взаиморасчетам (НДС)";
					Проводка.Сумма			= СтрокаЗадолженности.ПроводкиСуммаНДС;
						
					Если    ЭтоОплата(СтрокаЗадолженности)
					   И НЕ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
					   // формируются проводки типа 00(6442) - 6441 на сумму НДС
						   
						Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
							// покупатель
							Проводка.СчетДт = СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
							Если СтрокаЗадолженности.НетНалоговойНакладной Тогда
								Проводка.СчетКт = СтрокаЗадолженности.СчетУчетаНДС;
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
							Иначе	
								Проводка.СчетКт = ВспомогательныйСчет;	
							КонецЕсли;
											
						Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							// поставщик
							Если СтрокаЗадолженности.НетНалоговойНакладной Тогда
								Проводка.СчетДт = СтрокаЗадолженности.СчетУчетаНДС;
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
							Иначе
								Проводка.СчетДт = ВспомогательныйСчет;
							КонецЕсли;
									
							Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
													
						КонецЕсли;
						
					ИначеЕсли НЕ ЭтоОплата(СтрокаЗадолженности)
							 И    СтрокаЗадолженности.НетНалоговойНакладной 
							И НЕ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
						   // формируются проводки типа 6442 - 00 на сумму НДС
							
						Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
							// поставщик
							Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
													
							Проводка.СчетКт 	= ВспомогательныйСчет;
											
						Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							// покупатель
							Проводка.СчетДт 	= ВспомогательныйСчет;
											
							Проводка.СчетКт = СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
													
						КонецЕсли;
							
					ИначеЕсли НЕ ЭтоОплата(СтрокаЗадолженности)
							 И СтрокаЗадолженности.НетНалоговойНакладной 
							И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
						   // формируются проводки типа 00 - 6441 на -сумму НДС (для приведения остатков к учету "по отгрузке")
							   
						   Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда
							   // покупатель
							   Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
								   
							   Проводка.СчетКт 	= ВспомогательныйСчет;
								   
						   Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда	
							   // поставщик
							   Проводка.СчетДт 	= ВспомогательныйСчет;
								   
							   Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
								   
						   КонецЕсли;
							   
						   Проводка.Сумма = - Проводка.Сумма;
							   
					Иначе
						// в остальных случаях проводки не формируются.	   
						ПроводкиБУ.Удалить(Проводка);
							
					КонецЕсли;
						
					// сформируем проводку по регистрации авансов (отмена регистрации)
					Если  (   ЭтоОплата(СтрокаЗадолженности) И НЕ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке)
					  ИЛИ (НЕ ЭтоОплата(СтрокаЗадолженности) И    СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате) Тогда
						  
						  // формируются проводки типа 6442 - 6441 на -сумму НДС
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период			= ДатаСторноДвижений;
						Проводка.Организация	= СтруктураШапкиДокумента.Организация;
						Проводка.НомерЖурнала	= "";
						Проводка.Содержание		= "Отмена регистрации авансов (НДС)";
						Проводка.Сумма			=  - СтрокаЗадолженности.ПроводкиСуммаНДС;
						
						Если (СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская И    ЭтоОплата(СтрокаЗадолженности)) 
						  ИЛИ(СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская  И НЕ ЭтоОплата(СтрокаЗадолженности))	Тогда
							// покупатель
							Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
 						    ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
							
							Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
											
						Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							// поставщик
							Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);																					
											
							Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
													
						КонецЕсли;
							
						Если НЕ ЭтоОплата(СтрокаЗадолженности) Тогда
							// долг по отгрузке при методе определения базы - по оплате
							Проводка.Сумма =  - Проводка.Сумма;
						КонецЕсли; 
							
					КонецЕсли;
						
				КонецЕсли; 
					
				// Налоговый учет (продаж/приобретений)
				Если  СтруктураШапкиДокумента.ЕстьНДС Тогда
					  
				  Если СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель Тогда
						  
					  Движение = НУПродаж.Добавить();
						  
					  Если ЭтоОплата(СтрокаЗадолженности) Тогда
						  // оплата
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю;
						  КонецЕсли;
					  Иначе
						  //отгрузка
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя;
						  КонецЕсли;
					  КонецЕсли; 
						  
				  Иначе// СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Поставщик
						  
					  Движение = НУПриобретений.Добавить();
						  
					  Если ЭтоОплата(СтрокаЗадолженности) Тогда
						  // оплата
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком;
						  КонецЕсли;
					  Иначе
						  //отгрузка
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику;
						  КонецЕсли;
					  КонецЕсли; 
					  
				  КонецЕсли; 
					  
				  Движение.Период	 		  		= СтруктураШапкиДокумента.Дата;
				  Движение.Организация 		  		= СтруктураШапкиДокумента.Организация;
				  Движение.ДоговорКонтрагента 		= СтрокаЗадолженности.ДоговорКонтрагента;
				  Движение.Сделка				    = СтрокаЗадолженности.СделкаНУ;
				  Движение.ВозвратнаяТара	  		= СтрокаЗадолженности.ВозвратнаяТара;
				  Движение.СуммаВзаиморасчетов      = СтрокаЗадолженности.СуммаВзаиморасчетовБУ;
					  
				КонецЕсли;			
					
					
				// ожидаемый и подтвержденный НДС
				Если  СтруктураШапкиДокумента.ЕстьНДС
					// по возвратам тары в регистарах ожидаемого и подтвержденного НДС учет не ведется
					И НЕ  (СтрокаЗадолженности.ВозвратнаяТара И СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат)									
					И     (НЕ (СтрокаЗадолженности.Внешнеэкономический = Истина) ИЛИ СтрокаЗадолженности.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель ИЛИ СтрокаЗадолженности.СтавкаНДС = Перечисления.СтавкиНДС.НДС20) Тогда
						
					   Если СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель Тогда
							   
						   РегистрОиПНДС = ОиПНДСПродаж;
							   
						   Движение 		 = РегистрОиПНДС.Добавить();	
						   ДвижениеВыпискаНН = РегистрОиПНДС.Добавить();
						   ДвижениеСторно    = РегистрОиПНДС.Добавить();
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
						   КонецЕсли;
							   
					   Иначе// СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Поставщик
							   
						   РегистрОиПНДС = ОиПНДСПриобретений;

						   Движение 			= РегистрОиПНДС.Добавить();
						   ДвижениеВыпискаНН 	= РегистрОиПНДС.Добавить();
						   ДвижениеСторно 		= РегистрОиПНДС.Добавить();
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
						   КонецЕсли;
							   
						   Движение.ДляХозяйственнойДеятельности = ?(СтрокаЗадолженности.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
						   Движение.ВидДеятельностиНДС 			 = СтрокаЗадолженности.ВидДеятельностиНДС;
						   Движение.Амортизируется	 			 = СтрокаЗадолженности.Амортизируется;
						   Движение.СуммаНДСПропорционально 	 = СтрокаЗадолженности.СуммаНДСПропорциональноКредит;
						   
					   КонецЕсли;
						   
					   Если (НЕ ЭтоОплата(СтрокаЗадолженности) 
							  И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате
							  И СтрокаЗадолженности.НетНалоговойНакладной) Тогда
							Движение.Период		  	= ДатаСторноДвижений;
							Движение.КодОперации 	= КодыОпераций.ОтменаРегистрацииАвансов;
					   Иначе	
							   Движение.Период	 = СтруктураШапкиДокумента.Дата;
							Если ЭтоОплата(СтрокаЗадолженности) Тогда
								Движение.КодОперации = КодыОпераций.РегистрацияАвансов;
							Иначе	
								Движение.КодОперации = КодыОпераций.ОжидаемыйНДС;
							КонецЕсли;
					   КонецЕсли;
					   Движение.ВидДвижения  			= ВидДвиженияНакопления.Приход;
					   Движение.Организация 		  	= СтруктураШапкиДокумента.Организация;
					   Движение.ДоговорКонтрагента 		= СтрокаЗадолженности.ДоговорКонтрагента;
	  				   Движение.Сделка				    = СтрокаЗадолженности.СделкаНУ;
					   Движение.ВозвратнаяТара	  		= СтрокаЗадолженности.ВозвратнаяТара;
					   Движение.СтавкаНДС	  			= СтрокаЗадолженности.СтавкаНДС;
					   Движение.БазаНДС  				= СтрокаЗадолженности.СуммаВзаиморасчетовБУ - СтрокаЗадолженности.СуммаНДСВал;
					   Движение.СуммаНДС    			= СтрокаЗадолженности.СуммаНДСВал;
						   
					   Если НЕ СтрокаЗадолженности.НетНалоговойНакладной Тогда
							   
						   // сформируем движение по выписке налоговой
						   ЗаполнитьЗначенияСвойств(ДвижениеВыпискаНН,Движение,,"НомерСтроки");					   
						   ДвижениеВыпискаНН.ВидДвижения = ВидДвиженияНакопления.Расход;
						   ДвижениеВыпискаНН.КодОперации = КодыОпераций.ПодтвержденныйНДС;
							   
					   КонецЕсли;
						   
					   Если ЭтоОплата(СтрокаЗадолженности) Тогда
							   
						   // добавим движения по регистрации авансов (отмена регистрации):
						   // сторно на начало следующего месяца
						   ЗаполнитьЗначенияСвойств(ДвижениеСторно,Движение,,"НомерСтроки");
							   
						   ДвижениеСторно.СуммаНДС    = -ДвижениеСторно.СуммаНДС;
						   ДвижениеСторно.БазаНДС     = -ДвижениеСторно.БазаНДС;
						   ДвижениеСторно.Период      = ДатаСторноДвижений;
						   ДвижениеСторно.КодОперации = КодыОпераций.ОтменаРегистрацииАвансов;
							   
					   КонецЕсли; 
						   
					   // оставим только те движения, которые имеют смысл:
					   Если НЕ ЭтоОплата(СтрокаЗадолженности) ИЛИ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
							   
							РегистрОиПНДС.Удалить(ДвижениеСторно);
							   
					   КонецЕсли;
						   
					  Если  (   ЭтоОплата(СтрокаЗадолженности) И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке)
						ИЛИ (НЕ ЭтоОплата(СтрокаЗадолженности) И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате) Тогда
							
						   УдалятьДвижение = Истина;
						   Если (НЕ ЭтоОплата(СтрокаЗадолженности) 
								  И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате
								  И СтрокаЗадолженности.НетНалоговойНакладной) Тогда
								   УдалятьДвижение = Ложь;	
						   КонецЕсли;
							
						  Если УдалятьДвижение Тогда
							   РегистрОиПНДС.Удалить(Движение);
						  КонецЕсли;
							  
						  РегистрОиПНДС.Удалить(ДвижениеВыпискаНН);
							   
					   ИначеЕсли СтрокаЗадолженности.НетНалоговойНакладной Тогда
							   
						  РегистрОиПНДС.Удалить(ДвижениеВыпискаНН);
							      
					   КонецЕсли;
							   
				   КонецЕсли; 
				   
		   Иначе // упрощенный налоговый учет
					
				// бухгалтерские проводки - НДС
				Если  СтруктураШапкиДокумента.ЕстьНДС 
					И СтрокаЗадолженности.ПроводкиСуммаНДС <> 0 Тогда
						
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период			= СтруктураШапкиДокумента.Дата;
					Проводка.Организация	= СтруктураШапкиДокумента.Организация;
					Проводка.НомерЖурнала	= "";
					Проводка.Содержание		= "Ввод начальных остатков по взаиморасчетам (НДС)";
					Проводка.Сумма			= СтрокаЗадолженности.ПроводкиСуммаНДС;
						
					Если    ЭтоОплата(СтрокаЗадолженности)
					   И НЕ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
					   // формируются проводки типа 00(6442) - 6441 на сумму НДС
						   
						Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
							// покупатель
							Проводка.СчетДт = СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);
							
							Если СтрокаЗадолженности.НетНалоговойНакладной Тогда
								Проводка.СчетКт = СтрокаЗадолженности.СчетУчетаНДС;
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
							Иначе	
								Проводка.СчетКт = ВспомогательныйСчет;	
							КонецЕсли;
											
						Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							// поставщик
							Если СтрокаЗадолженности.НетНалоговойНакладной Тогда
								Проводка.СчетДт = СтрокаЗадолженности.СчетУчетаНДС;
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
								ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
							Иначе
								Проводка.СчетДт = ВспомогательныйСчет;
							КонецЕсли;
									
							Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
													
						КонецЕсли;
						
					ИначеЕсли НЕ ЭтоОплата(СтрокаЗадолженности)
							 И    СтрокаЗадолженности.НетНалоговойНакладной 
							 И НЕ СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
							 
							 // формируются проводки типа 6442 - 00 на сумму НДС
							
						Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
							// поставщик
							Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
													
							Проводка.СчетКт 	= ВспомогательныйСчет;
											
						Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская Тогда	
							// покупатель
							Проводка.СчетДт 	= ВспомогательныйСчет;
											
							Проводка.СчетКт = СтрокаЗадолженности.СчетУчетаНДС;
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
													
						КонецЕсли;
							
					ИначеЕсли НЕ ЭтоОплата(СтрокаЗадолженности)
							   И СтрокаЗадолженности.НетНалоговойНакладной 
							   И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
						   // формируются проводки типа 6441 - 00 на сумму НДС 
							   
						   Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиКредиторская Тогда
							   // поставщик
							   Проводка.СчетДт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
								   
							   Проводка.СчетКт 	= ВспомогательныйСчет;
								   
						   Иначе//Если СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженностиДебиторская  Тогда	
							   // покупатель
							   Проводка.СчетДт 	= ВспомогательныйСчет;
								   
							   Проводка.СчетКт 	= СтрокаЗадолженности.СчетУчетаНДСПодтвержденный;
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаЗадолженности.Контрагент);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", 	СтрокаЗадолженности.ДоговорКонтрагента);
							   ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаЗадолженности.СделкаНУ);								
								   
						   КонецЕсли;
							   
					Иначе
						// в остальных случаях проводки не формируются.	   
						ПроводкиБУ.Удалить(Проводка);
							
					КонецЕсли;
						
				КонецЕсли; 
				
				// Налоговый учет (продаж/приобретений)
				Если  СтруктураШапкиДокумента.ЕстьНДС  Тогда
					  
				  Если СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель Тогда
						  
					  Движение = НУПродаж.Добавить();
						  
					  Если ЭтоОплата(СтрокаЗадолженности) Тогда
						  // оплата
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю;
						  КонецЕсли;
					  Иначе
						  //отгрузка
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя;
						  КонецЕсли;
					  КонецЕсли; 
					  
				  Иначе// СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Поставщик
						  
					  Движение = НУПриобретений.Добавить();
						  
					  Если ЭтоОплата(СтрокаЗадолженности) Тогда
						  // оплата
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком;
						  КонецЕсли;
					  Иначе
						  //отгрузка
						  Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							  // расчеты
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;
						  Иначе
							  //возврат	
							  Движение.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику;
						  КонецЕсли;
					  КонецЕсли; 
					  
					  Движение.ДляХозяйственнойДеятельности = ?(СтрокаЗадолженности.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
					  Движение.ВидДеятельностиНДС 			= СтрокаЗадолженности.ВидДеятельностиНДС;
					  Движение.Амортизируется	 			= СтрокаЗадолженности.Амортизируется;
					  Движение.СуммаНДСПропорционально = СтрокаЗадолженности.СуммаНДСПропорциональноКредит
				  КонецЕсли; 
					  
				  Движение.Период	 		  		= СтруктураШапкиДокумента.Дата;
				  Движение.Организация 		  		= СтруктураШапкиДокумента.Организация;
				  Движение.ДоговорКонтрагента 		= СтрокаЗадолженности.ДоговорКонтрагента;
				  Движение.Сделка				    = СтрокаЗадолженности.СделкаНУ;
				  Движение.СтавкаНДС	  			= СтрокаЗадолженности.СтавкаНДС;
				  Движение.ВозвратнаяТара	  		= СтрокаЗадолженности.ВозвратнаяТара;
				  
				  Движение.СуммаВзаиморасчетов      = СтрокаЗадолженности.СуммаВзаиморасчетовБУ;
				  Движение.СуммаНДС	  				= СтрокаЗадолженности.СуммаНДСВал;
				  
				КонецЕсли;			
				
				// ожидаемый и подтвержденный НДС
				Если  СтруктураШапкиДокумента.ЕстьНДС
					// по возвратам тары в регистарах ожидаемого и подтвержденного НДС учет не ведется
					И НЕ  (СтрокаЗадолженности.ВозвратнаяТара И СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат)
					И     (НЕ (СтрокаЗадолженности.Внешнеэкономический = Истина) ИЛИ СтрокаЗадолженности.ТипКонтрагента = Перечисления.СтатусыКонтрагентов.Покупатель) Тогда
						
					   Если СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель Тогда
							   
						   РегистрОиПНДС = ОиПНДСПродаж;
							   
						   Движение 		 = РегистрОиПНДС.Добавить();	
						   ДвижениеВыпискаНН = РегистрОиПНДС.Добавить();
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
						   КонецЕсли;
							   
					   Иначе// СтрокаЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Поставщик
							   
						   РегистрОиПНДС = ОиПНДСПриобретений;

						   Движение 			= РегистрОиПНДС.Добавить();
						   ДвижениеВыпискаНН 	= РегистрОиПНДС.Добавить();
							   
						   КодыОпераций = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений;
							   
						   Если СтрокаЗадолженности.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
							   // расчеты
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
						   Иначе
							   //возврат	
							   Движение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
						   КонецЕсли;
							   
						   Движение.ДляХозяйственнойДеятельности = ?(СтрокаЗадолженности.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
						   Движение.ВидДеятельностиНДС 			 = СтрокаЗадолженности.ВидДеятельностиНДС;
						   Движение.Амортизируется 				 = СтрокаЗадолженности.Амортизируется;
					   	   Движение.СуммаНДСПропорционально 	 = СтрокаЗадолженности.СуммаНДСПропорциональноКредит
							   
					   КонецЕсли;
					   
					   Движение.ВидДвижения  			= ВидДвиженияНакопления.Приход;
					   Движение.Период	 				= СтруктураШапкиДокумента.Дата;
					   Движение.Организация 		  	= СтруктураШапкиДокумента.Организация;
					   Движение.ДоговорКонтрагента 		= СтрокаЗадолженности.ДоговорКонтрагента;
	  				   Движение.Сделка				    = СтрокаЗадолженности.СделкаНУ;
					   Движение.ВозвратнаяТара	  		= СтрокаЗадолженности.ВозвратнаяТара;
					   Движение.СтавкаНДС	  			= СтрокаЗадолженности.СтавкаНДС;
					   Движение.БазаНДС  				= СтрокаЗадолженности.СуммаВзаиморасчетовБУ - СтрокаЗадолженности.СуммаНДСВал;
					   Движение.СуммаНДС    			= СтрокаЗадолженности.СуммаНДСВал;
					   Движение.КодОперации 			= КодыОпераций.ОжидаемыйНДС;						   
					   Если НЕ СтрокаЗадолженности.НетНалоговойНакладной Тогда
							   
						   // сформируем движение по выписке налоговой
						   ЗаполнитьЗначенияСвойств(ДвижениеВыпискаНН,Движение,,"НомерСтроки");					   
						   ДвижениеВыпискаНН.ВидДвижения = ВидДвиженияНакопления.Расход;
						   ДвижениеВыпискаНН.КодОперации = КодыОпераций.ПодтвержденныйНДС;
							   
					   КонецЕсли;
						   
					  // оставим только те движения, которые имеют смысл:
						   
					  Если  (   ЭтоОплата(СтрокаЗадолженности) И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке)
						ИЛИ (НЕ ЭтоОплата(СтрокаЗадолженности) И СтрокаЗадолженности.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате) Тогда
							
						   РегистрОиПНДС.Удалить(Движение);
						   РегистрОиПНДС.Удалить(ДвижениеВыпискаНН);
							   
					   ИначеЕсли СтрокаЗадолженности.НетНалоговойНакладной Тогда
							   
						  РегистрОиПНДС.Удалить(ДвижениеВыпискаНН);
							      
					   КонецЕсли;
							   
				   КонецЕсли; 
				   
		   КонецЕсли;
	   
	   КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок) 
	
	Если  НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		Возврат;
	КонецЕсли; 
	
	НаборДвиженийПриобретений = Движения.ПриобретенияНалоговыйУчет; 	
	НаборДвиженийПродаж       = Движения.ПродажиНалоговыйУчет; 
	
	ВидЗадолженностиДебиторская  = Перечисления.ВидыЗадолженности.Дебиторская;
	ВидЗадолженностиКредиторская = Перечисления.ВидыЗадолженности.Кредиторская;
	
	Поставщик  = Перечисления.СтатусыКонтрагентов.Поставщик;
	Покупатель = Перечисления.СтатусыКонтрагентов.Покупатель;
	ПрочийКонтрагент = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	
	СобытияПродажи = Новый Соответствие();
	СобытияПродажи.Вставить("ВозвратОплаты", 	Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю);
	СобытияПродажи.Вставить("Оплата",   		Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем);
	СобытияПродажи.Вставить("Отгрузка",  		Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю);
	СобытияПродажи.Вставить("ВозвратОтгрузки",  Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя);
	
	СобытияПриобретения = Новый Соответствие();
	СобытияПриобретения.Вставить("ВозвратОплаты", 	Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
	СобытияПриобретения.Вставить("Оплата",   		Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
	СобытияПриобретения.Вставить("Отгрузка",		Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика);
	СобытияПриобретения.Вставить("ВозвратОтгрузки",	Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);

	// разобъем таблицу ТаблицаПоСуммамДолга на две - соответственно для взаимоарсчетов по Поставщикам или Покупателям
	ТаблицаПриобретения = ТаблицаПоСуммамДолга.Скопировать();
	
	ТаблицаПриобретения.Колонки.Удалить("СуммаВзаиморасчетов");
	ТаблицаПриобретения.Колонки.СуммаВзаиморасчетовБУ.Имя = "СуммаВзаиморасчетов";
	
	ТаблицаПриобретения.Колонки.Добавить("СуммаНДСПропорционально", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПриобретения.ЗагрузитьКолонку(ТаблицаПриобретения.ВыгрузитьКолонку("СуммаНДСПропорциональноКредит"),"СуммаНДСПропорционально");
	
	ТаблицаПриобретения.Колонки.Добавить("Событие");
	ТаблицаПриобретения.Колонки.Добавить("ДляХозяйственнойДеятельности");
	ТаблицаПриобретения.Колонки.Добавить("РасчетныйДокумент");
	ТаблицаПродажи = ТаблицаПриобретения.Скопировать();
	
	Счетчик = 0;
	Пока Счетчик < ТаблицаПриобретения.Количество() Цикл
		
		Строка = ТаблицаПриобретения[Счетчик];
		
		КорректировкаДолгаМетодомВозврата = Ложь;
		Если (      СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
			   И НЕ СтруктураШапкиДокумента.НеПереноситьНОНК) 
		 ИЛИ  (      СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета
			   И ЭтоОплата(Строка)) Тогда
		
			КорректировкаДолгаМетодомВозврата = Истина;	
		
		КонецЕсли;
		
		СоздаватьУказаннуюЗадолженность = Ложь;
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			СоздаватьУказаннуюЗадолженность = Истина;
		КонецЕсли;
		
		КлючСобытия = "";
		Если  Строка.ВидДоговора    = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			
			Если  СоздаватьУказаннуюЗадолженность
				И Строка.ТипКонтрагента = Поставщик Тогда
			
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "ВозвратОтгрузки";
				Иначе
					КлючСобытия = "Отгрузка";	
				КонецЕсли;				
			
			ИначеЕсли  КорректировкаДолгаМетодомВозврата
				И Строка.ТипКонтрагента = Поставщик Тогда
				
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "Отгрузка";
				Иначе
					КлючСобытия = "ВозвратОтгрузки";	
				КонецЕсли;
			
			ИначеЕсли НЕ КорректировкаДолгаМетодомВозврата
				       И Строка.ТипКонтрагента = Покупатель Тогда	
					   
				// долги закрываются по противоположному регистру - поставщиков
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "ВозвратОтгрузки";
				Иначе
					КлючСобытия = "Отгрузка";	
				КонецЕсли;
					   
			КонецЕсли;
			
		ИначеЕсли    Строка.ТипКонтрагента = Поставщик 
			    И НЕ Строка.ВидДоговора = ПрочийКонтрагент Тогда
			КлючСобытия = ПолучитьКлючСобытияПоНалоговомуУчету(Строка, СоздаватьУказаннуюЗадолженность, КорректировкаДолгаМетодомВозврата);
		КонецЕсли;	
		
		Если КлючСобытия = "" Тогда
			ТаблицаПриобретения.Удалить(Строка);
		Иначе
			Строка.Событие = СобытияПриобретения.Получить(КлючСобытия);
			Счетчик = Счетчик + 1;
		КонецЕсли; 
		
	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < ТаблицаПродажи.Количество() Цикл
		
		Строка = ТаблицаПродажи[Счетчик];
		
		КорректировкаДолгаМетодомВозврата = Ложь;
		Если (      СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
			   И НЕ СтруктураШапкиДокумента.НеПереноситьНОНК) 
		 ИЛИ  (      СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета
			   И ЭтоОплата(Строка)) Тогда
		
			КорректировкаДолгаМетодомВозврата = Истина;	
		
		КонецЕсли;
		
		СоздаватьУказаннуюЗадолженность = Ложь;
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
			СоздаватьУказаннуюЗадолженность = Истина;
		КонецЕсли;
		
		КлючСобытия = "";
		Если  Строка.ВидДоговора    = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			
			Если  СоздаватьУказаннуюЗадолженность
				И Строка.ТипКонтрагента = Покупатель Тогда
			
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "ВозвратОтгрузки";
				Иначе
					КлючСобытия = "Отгрузка";	
				КонецЕсли;				
			
			ИначеЕсли  КорректировкаДолгаМетодомВозврата
				И Строка.ТипКонтрагента = Покупатель Тогда
				
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "Отгрузка";
				Иначе
					КлючСобытия = "ВозвратОтгрузки";	
				КонецЕсли;
			
			ИначеЕсли НЕ КорректировкаДолгаМетодомВозврата
				       И Строка.ТипКонтрагента = Поставщик Тогда	
					   
				// долги закрываются по противоположному регистру - покупателей
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
				    КлючСобытия = "ВозвратОтгрузки";
				Иначе
					КлючСобытия = "Отгрузка";	
				КонецЕсли;
					   
			КонецЕсли;
			
		ИначеЕсли    Строка.ТипКонтрагента = Покупатель 
			    И НЕ Строка.ВидДоговора = ПрочийКонтрагент Тогда
			КлючСобытия = ПолучитьКлючСобытияПоНалоговомуУчету(Строка, СоздаватьУказаннуюЗадолженность, КорректировкаДолгаМетодомВозврата);
		КонецЕсли;	
		
		Если КлючСобытия = "" Тогда
			ТаблицаПродажи.Удалить(Строка);
		Иначе
			Строка.Событие = СобытияПродажи.Получить(КлючСобытия);
			Счетчик = Счетчик + 1;
		КонецЕсли;  
		
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		// Необходимо показать перенос долга на конрагента-получателя
		
		// разобъем таблицу ТаблицаПоСуммамДолга на две - соответственно для взаимоарсчетов по Поставщикам или Покупателям
		ТаблицаПриобретенияКопия = ТаблицаПоСуммамДолга.Скопировать();
		ТаблицаПриобретенияКопия.Колонки.Добавить("Событие");
		ТаблицаПриобретенияКопия.Колонки.Добавить("ДляХозяйственнойДеятельности");
		ТаблицаПриобретенияКопия.Колонки.Добавить("РасчетныйДокумент");

		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, 				"ДоговорКонтрагента");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента.Владелец,     "Контрагент");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента.ВидДоговора, 	"ВидДоговора");
		
		Для каждого СтрокаТаблицы Из ТаблицаПриобретенияКопия Цикл
			
			Если СтрокаТаблицы.ТипКонтрагента = СтруктураШапкиДокумента.ТипКонтрагента Тогда
				Продолжить;	
			КонецЕсли;
			
			// если переносится оплата, например покупателя на поставщика, то новый долг будем считать не отгрузкой, а возвратом оплаты от поставщика
			СтрокаТаблицы.РасчетыВозврат = ?(СтрокаТаблицы.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат, Перечисления.РасчетыВозврат.Расчеты, Перечисления.РасчетыВозврат.Возврат);
			СтрокаТаблицы.ТипКонтрагента = СтруктураШапкиДокумента.ТипКонтрагента;
			
		КонецЦикла;
		
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.СложныйНалоговыйУчет,			"СложныйНалоговыйУчет");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка),"Сделка");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка),"СделкаНУ");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВедениеВзаиморасчетов,			"ВедениеВзаиморасчетов");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетУчетаНДС,					"СчетУчетаНДС");
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный,		"СчетУчетаНДСПодтвержденный");
		
		ТаблицаПриобретенияКопия.ЗаполнитьЗначения(Истина,													"ДобавленнаяСтрокаПереносаЗадолженности");
		
		
		
		ТаблицаПродажиКопия = ТаблицаПриобретенияКопия.Скопировать();
		
		// создадим указанные для переноса долги для нового контрагента
		Счетчик = 0;
		Пока Счетчик < ТаблицаПриобретенияКопия.Количество() Цикл
			
			Строка = ТаблицаПриобретенияКопия[Счетчик];
			
			КлючСобытия = "";
			Если  Строка.ВидДоговора    = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				
				Если (Строка.ТипКонтрагента = Поставщик  И НЕ ЭтоОплата(Строка)) 
				 ИЛИ (Строка.ТипКонтрагента = Покупатель И    ЭтоОплата(Строка)) Тогда
					
					Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
						КлючСобытия = "ВозвратОтгрузки";
					Иначе
						КлючСобытия = "Отгрузка";	
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли    Строка.ТипКонтрагента = Поставщик 
					И НЕ Строка.ВидДоговора = ПрочийКонтрагент Тогда
				Если  ЭтоОплата(Строка) Тогда
					 Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
						 КлючСобытия = "Оплата";
					 Иначе	
						 КлючСобытия = "ВозвратОплаты";
					 КонецЕсли;
				Иначе //отгрузка
					 Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
						 КлючСобытия = "Отгрузка";	
					 Иначе	
						 КлючСобытия = "ВозвратОтгрузки";
					 КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			
			Если КлючСобытия = "" Тогда
				ТаблицаПриобретенияКопия.Удалить(Строка);
			Иначе
				Строка.Событие = СобытияПриобретения.Получить(КлючСобытия);
				Счетчик = Счетчик + 1;
			КонецЕсли;
								
		КонецЦикла;
		
		Счетчик = 0;
		Пока Счетчик < ТаблицаПродажиКопия.Количество() Цикл
			
			Строка = ТаблицаПродажиКопия[Счетчик];
			
			КлючСобытия = "";
			Если  Строка.ВидДоговора    = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				
				Если (Строка.ТипКонтрагента = Покупатель И НЕ ЭтоОплата(Строка)) 
				 ИЛИ (Строка.ТипКонтрагента = Поставщик  И    ЭтоОплата(Строка)) Тогда
					
					Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
						КлючСобытия = "ВозвратОтгрузки";
					Иначе
						КлючСобытия = "Отгрузка";	
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли    Строка.ТипКонтрагента = Покупатель 
					И НЕ Строка.ВидДоговора = ПрочийКонтрагент Тогда
					
				Если  ЭтоОплата(Строка) Тогда
					 Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
						 КлючСобытия = "Оплата";
					 Иначе	
						 КлючСобытия = "ВозвратОплаты";
					 КонецЕсли;
				Иначе //отгрузка
					 Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
						 КлючСобытия = "Отгрузка";	
					 Иначе	
						 КлючСобытия = "ВозвратОтгрузки";
					 КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
			
			Если КлючСобытия = "" Тогда
				ТаблицаПродажиКопия.Удалить(Строка);
			Иначе
				Строка.Событие = СобытияПродажи.Получить(КлючСобытия);
				Счетчик = Счетчик + 1;
			КонецЕсли;

		КонецЦикла;		
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретенияКопия, ТаблицаПриобретения);
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродажиКопия, 	 ТаблицаПродажи);
		
	КонецЕсли;
	
	// Сформируем движения в зависимости от того как ведется налоговый учет
	ТаблицаПродажиСложныйНалоговыйУчет = ТаблицаПродажи.Скопировать();	
	ТаблицаПродажиСложныйНалоговыйУчет.Очистить();
	
	ТаблицаПриобретенияСложныйНалоговыйУчет = ТаблицаПриобретения.Скопировать();
	ТаблицаПриобретенияСложныйНалоговыйУчет.Очистить();
	
	Инд = 0;
	Пока ТаблицаПродажи.Количество() > Инд Цикл
		
		Строка = ТаблицаПродажи[Инд];
		// определеим сделки/расчетные документы
		
		Если Строка.ДобавленнаяСтрокаПереносаЗадолженности = Ложь Тогда
		
			Строка.РасчетныйДокумент = Строка.ДокументРасчетовСКонтрагентом;
			Строка.Сделка = Строка.СделкаНУ;
			
		КонецЕсли;
		
		Если Строка.СложныйНалоговыйУчет Тогда
		    СтрокаСложныйНалоговыйУчет = ТаблицаПродажиСложныйНалоговыйУчет.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСложныйНалоговыйУчет, Строка);
			
			ТаблицаПродажи.Удалить(Строка);
		Иначе
			
			// упрощенный налоговый учет
			Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
				Строка.СуммаНДС = 0;
				Строка.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			КонецЕсли;
				
			Если НЕ Строка.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
				Строка.РасчетныйДокумент = Неопределено;
			КонецЕсли;			
			
			Инд = Инд + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	Инд = 0;
	Пока ТаблицаПриобретения.Количество() > Инд Цикл
		
		Строка = ТаблицаПриобретения[Инд];
		// определим сделки/расчетные документы
		Если Строка.ДобавленнаяСтрокаПереносаЗадолженности = Ложь Тогда
		
			Строка.РасчетныйДокумент = Строка.ДокументРасчетовСКонтрагентом;
			Строка.Сделка = Строка.СделкаНУ;
			
		КонецЕсли;
		
		Строка.ДляХозяйственнойДеятельности = ?(Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
		Если Строка.ВозвратнаяТара Тогда
			Строка.Амортизируется = Ложь;
		КонецЕсли;
		
		Если Строка.СложныйНалоговыйУчет Тогда
		    СтрокаСложныйНалоговыйУчет = ТаблицаПриобретенияСложныйНалоговыйУчет.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСложныйНалоговыйУчет, Строка);
			
			ТаблицаПриобретения.Удалить(Строка);
		Иначе
				
			Если НЕ Строка.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
				Строка.РасчетныйДокумент = Неопределено;
			КонецЕсли;			
			
			Инд = Инд + 1;
			
		КонецЕсли;
	
	КонецЦикла;
	
	// Движения по регистру Продажи налоговый учет
	ТаблицаДвижений = НаборДвиженийПродаж.Выгрузить();
	ТаблицаДвижений.Очистить();
	// данные по договорам со сложным налоговым учетом
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродажиСложныйНалоговыйУчет, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), "СтавкаНДС");				
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "РасчетныйДокумент");				
	ТаблицаДвижений.ЗаполнитьЗначения(0, "СуммаНДС");				
	// данные по договорам с упрощенным налоговым учетом
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродажи, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		НаборДвиженийПродаж.мПериод = СтруктураШапкиДокумента.Дата;
		НаборДвиженийПродаж.мТаблицаДвижений = ТаблицаДвижений;

		НаборДвиженийПродаж.ВыполнитьПриход();
		НаборДвиженийПродаж.Записать();
	КонецЕсли;
	
	// Движения по регистру Приобретения налоговый учет
	ТаблицаДвижений = НаборДвиженийПриобретений.Выгрузить();
	ТаблицаДвижений.Очистить();
		
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретенияСложныйНалоговыйУчет, ТаблицаДвижений);
				
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), "СтавкаНДС");				
	ТаблицаДвижений.ЗаполнитьЗначения(Ложь, "ДляХозяйственнойДеятельности");				
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПустаяСсылка(), "ВидДеятельностиНДС");				
	ТаблицаДвижений.ЗаполнитьЗначения(Ложь, "Амортизируется");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "РасчетныйДокумент");				
	ТаблицаДвижений.ЗаполнитьЗначения(0, "СуммаНДС");				
	ТаблицаДвижений.ЗаполнитьЗначения(0, "СуммаНДСПропорционально");
	// данные по договорам с упрощенным налоговым учетом
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретения, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		НаборДвиженийПриобретений.мПериод          = СтруктураШапкиДокумента.Дата;
		НаборДвиженийПриобретений.мТаблицаДвижений = ТаблицаДвижений;

		НаборДвиженийПриобретений.ВыполнитьПриход();
		НаборДвиженийПриобретений.Записать();
	КонецЕсли;
	
	ПроводкиПоДоговорамСУпрощеннымНалоговымУчетом(СтруктураШапкиДокумента, ТаблицаПродажи, ТаблицаПриобретения);	
	ПроводкиПоДоговорамСоСложнымНалоговымУчетом(СтруктураШапкиДокумента, ТаблицаПродажиСложныйНалоговыйУчет, ТаблицаПриобретенияСложныйНалоговыйУчет);	
	
КонецПроцедуры

Процедура ПроводкиПоДоговорамСоСложнымНалоговымУчетом(СтруктураШапкиДокумента, ТаблицаПродажи, ТаблицаПриобретения)

	// для договоров со сложным нал. учетом
	СтрокиОтгрузок = Новый Массив;
	СтрокиОплат    = Новый Массив;
	
	ОиПНДСПродаж 		= Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	ОиПНДСПриобретений 	= Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	ЭтоСписаниеЗадолженности = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности);
	
	Для каждого Строка Из ТаблицаПродажи Цикл
		Если    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю 
			ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя Тогда
			СтрокиОтгрузок.Добавить(Строка);
		Иначе
			СтрокиОплат.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка Из ТаблицаПриобретения Цикл
		Если    Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика
			ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику Тогда
			СтрокиОтгрузок.Добавить(Строка);
		Иначе
			СтрокиОплат.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;

	Для каждого Строка Из СтрокиОтгрузок Цикл
		
		// продажа или поступление	
		ЭтоПродажа = (    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю
					  ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя);
					  
		ЭтоВозврат = (Строка.Событие     = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя
					  ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
					  
		Если ЭтоПродажа Тогда
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
			КонецЕсли;
		Иначе	
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
			КонецЕсли;
		КонецЕсли;			  
		
		// проводки по регистру ОжидаемыйИПодтвержденныйНДС
		Если    СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
			
			ИЛИ (  СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
			     И    СтруктураШапкиДокумента.НеПереноситьНОНК
				 И НЕ Строка.ДобавленнаяСтрокаПереносаЗадолженности)
				 
			ИЛИ (  СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
			     И НЕ СтруктураШапкиДокумента.НеПереноситьНОНК) 
				 
			ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		
			Если ЭтоПродажа Тогда
				Движение = ОиПНДСПродаж.Добавить();
				Движение.КодОперации 			= Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС;
			Иначе	
				Движение = ОиПНДСПриобретений.Добавить();
				Движение.КодОперации 			= Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
			Движение.ВидДвижения  			= ВидДвиженияНакопления.Приход;
			Движение.Период	 				= СтруктураШапкиДокумента.Дата;
			Движение.Организация 		  	= СтруктураШапкиДокумента.Организация;
			Движение.Сделка				    = Строка.СделкаНУ;
			Движение.БазаНДС  				= Строка.СуммаВзаиморасчетов - Строка.СуммаНДСВал;
			Движение.СуммаНДС    			= Строка.СуммаНДСВал;
			Если НЕ ЭтоПродажа Тогда
				Движение.СуммаНДСПропорционально = Строка.СуммаНДСПропорциональноКредит;	
			КонецЕсли;
			Движение.СобытиеНДС 			= СобытиеНДС;
			
			Если  СтруктураШапкиДокумента.ЕстьНДС 
				И (    СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
				   ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности) Тогда
				   
				СуммаПроводки = Строка.ПроводкиСуммаНДС;
				
				// для возвратов суммы отрицательные													
				Если ЭтоВозврат Тогда
					СуммаПроводки = - СуммаПроводки;
				КонецЕсли;													
				
				Если  СуммаПроводки <> 0 
					И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();

					Проводка.Период                                 = Дата;
					Проводка.Активность                             = Истина;
					Проводка.Организация                            = Организация;
					Проводка.Сумма                                  = СуммаПроводки;
					Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности  Тогда
					    Проводка.Содержание                             = ?(ЭтоПродажа,"НДС: Изменение задолженности: обязательства", "НДС: Изменение задолженности: налоговый кредит") + ?(ЭтоВозврат, ", (сторно) отгрузка", ", отгрузка");
					Иначе//списание	
						Проводка.Содержание                             = ?(ЭтоПродажа,"НДС: Списание задолженности: обязательства", "НДС: Списание задолженности: налоговый кредит") + ?(ЭтоВозврат, ", (сторно) отгрузка", ", отгрузка");
					КонецЕсли;
					
					Проводка.НомерЖурнала                           = "";
					
					Если ЭтоПродажа Тогда
					    Если ЭтоСписаниеЗадолженности Тогда
							Проводка.СчетДт = СтруктураШапкиДокумента.СчетКт;	
						Иначе	
						    Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт;	
						КонецЕсли;
					Иначе		
						Проводка.СчетДт = Строка.СчетУчетаНДС;		
					КонецЕсли;
					
					Если ЭтоПродажа Тогда
						Если ЭтоСписаниеЗадолженности Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтруктураШапкиДокумента.СубконтоКт1, Истина);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,СтруктураШапкиДокумента.СубконтоКт2);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3,СтруктураШапкиДокумента.СубконтоКт3);
						Иначе	
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтруктураШапкиДокумента.СубконтоДт1, Истина);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,СтруктураШапкиДокумента.СубконтоДт2);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3,СтруктураШапкиДокумента.СубконтоДт3);
						КонецЕсли;
					Иначе
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",					  Строка.Контрагент, Истина);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",						  Строка.ДоговорКонтрагента);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами",Строка.СделкаНУ);
					КонецЕсли;
					
					Если ЭтоПродажа Тогда
						Проводка.СчетКт = Строка.СчетУчетаНДС;		
					Иначе		
					    Если ЭтоСписаниеЗадолженности Тогда
							Проводка.СчетКт = СтруктураШапкиДокумента.СчетДт;
							Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
								И СписыватьИзРезерваСомнительныхДолгов Тогда
								Проводка.СчетКт = СтруктураШапкиДокумента.СчетРезерваСомнительныхДолгов;	
							КонецЕсли;
						Иначе	
						    Проводка.СчетКт = СтруктураШапкиДокумента.СчетКт;	
						КонецЕсли;
					КонецЕсли;
					
					Если ЭтоПродажа Тогда
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",					  Строка.Контрагент, Истина);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",						  Строка.ДоговорКонтрагента);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",Строка.СделкаНУ);
					Иначе	
					    Если ЭтоСписаниеЗадолженности Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СтруктураШапкиДокумента.СубконтоДт1, Истина);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,СтруктураШапкиДокумента.СубконтоДт2);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,СтруктураШапкиДокумента.СубконтоДт3);
						Иначе	
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СтруктураШапкиДокумента.СубконтоКт1, Истина);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,СтруктураШапкиДокумента.СубконтоКт2);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,СтруктураШапкиДокумента.СубконтоКт3);
						КонецЕсли;
					КонецЕсли;
					
					Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
						
						Если  СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности
							И СтруктураШапкиДокумента.СчетДт.НалоговыйУчет = Истина Тогда
							
							ЗаписыватьСуммуНУ = НЕ (СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
							
							Если Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт Тогда
								Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
								Если ЗаписыватьСуммуНУ Тогда
									Проводка.СуммаНУДт = Проводка.Сумма;
								КонецЕсли;
							ИначеЕсли Проводка.СчетКт = СтруктураШапкиДокумента.СчетДт Тогда
									Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
									Если ЗаписыватьСуммуНУ Тогда
										Проводка.СуммаНУКт = Проводка.Сумма;
									КонецЕсли;
							КонецЕсли;
							
						ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
							    И ЭтоПродажа 
								И НЕ СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании Тогда
						
							ЗаписыватьСуммуНУ = НЕ (СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
							
							Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
							
							Если ЗаписыватьСуммуНУ Тогда
								Проводка.СуммаНУДт = Проводка.Сумма;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
						ИнвертироватьПроводку(Проводка);
					КонецЕсли;					
				КонецЕсли;		
				
			КонецЕсли;		
			
			Если  СтруктураШапкиДокумента.ЕстьНДС
				И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
				И НЕ Строка.ДобавленнаяСтрокаПереносаЗадолженности Тогда
				СуммаПроводки = Строка.ПроводкиСуммаНДС;
				
				// для возвратов суммы отрицательные													
				Если ЭтоВозврат Тогда
					СуммаПроводки = - СуммаПроводки;
				КонецЕсли;													
				
				Если  СуммаПроводки <> 0 
					И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();

					Проводка.Период                                 = Дата;
					Проводка.Активность                             = Истина;
					Проводка.Организация                            = Организация;
					Проводка.Сумма                                  = СуммаПроводки;
					Проводка.Содержание                             = ?(ЭтоПродажа,"НДС: Перенос задолженности: обязательства", "НДС: Перенос задолженности: налоговый кредит") + ?(ЭтоВозврат, ", (сторно) отгрузка", ", отгрузка");
					Проводка.НомерЖурнала                           = "";
					
					Если ЭтоПродажа Тогда
						ПроводкаСчетДт				 = СтруктураШапкиДокумента.СчетУчетаНДС;
						КонтрагентДт		 = СтруктураШапкиДокумента.КонтрагентКредитор;
						ДоговорКонтрагентаДт = СтруктураШапкиДокумента.ДоговорКонтрагента;
						СделкаДт 			 = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка);
						
						ПроводкаСчетКт				 = Строка.СчетУчетаНДС;
						КонтрагентКт		 = Строка.Контрагент;
						ДоговорКонтрагентаКт = Строка.ДоговорКонтрагента;
						СделкаКт 			 = Строка.СделкаНУ;
					Иначе	
						ПроводкаСчетДт				 = Строка.СчетУчетаНДС;
						КонтрагентДт		 = Строка.Контрагент;
						ДоговорКонтрагентаДт = Строка.ДоговорКонтрагента;
						СделкаДт 			 = Строка.СделкаНУ;
						
						ПроводкаСчетКт				 = СтруктураШапкиДокумента.СчетУчетаНДС;
						КонтрагентКт		 = СтруктураШапкиДокумента.КонтрагентКредитор;
						ДоговорКонтрагентаКт = СтруктураШапкиДокумента.ДоговорКонтрагента;
						СделкаКт 			 = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка);
					КонецЕсли;
					
					Проводка.СчетДт = ПроводкаСчетДт;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",					  КонтрагентДт, Истина);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",						  ДоговорКонтрагентаДт);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами",СделкаДт);
					
					Проводка.СчетКт = ПроводкаСчетКт;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",					 КонтрагентКт, Истина);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",						 ДоговорКонтрагентаКт);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",СделкаКт);
					
				КонецЕсли;		
				
			КонецЕсли;		
				
		КонецЕсли;

	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
       И СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
       // для перенесенной задолженности, если это оплата, нужно сфорировать проводку
	   // по ожидаемому НДС как выписка налоговой накладной, т.к. последующая отгрузка
	   // сделает проводку по этому регистру в любом случае.
	   
	   Для каждого Строка Из СтрокиОплат Цикл
		   
		   Если НЕ Строка.ДобавленнаяСтрокаПереносаЗадолженности Тогда
				Продолжить;			   
		   КонецЕсли;
		   
			// продажа или поступление	
			ЭтоПродажа = (    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем
						  ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю);
						  
			ЭтоВозврат = (Строка.Событие     = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю
						  ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
						  
			Если ЭтоПродажа Тогда
				Если ЭтоВозврат Тогда
				    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
				Иначе	
					СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
				КонецЕсли;
			Иначе	
				Если ЭтоВозврат Тогда
				    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
				Иначе	
					СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
				КонецЕсли;
			КонецЕсли;			  
			
			// проводки по регистру ОжидаемыйИПодтвержденныйНДС
			Если ЭтоПродажа Тогда
				Движение = ОиПНДСПродаж.Добавить();
				Движение.КодОперации 			= Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ПодтвержденныйНДС;
			Иначе	
				Движение = ОиПНДСПриобретений.Добавить();
				Движение.КодОперации 			= Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ПодтвержденныйНДС;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
			Движение.ВидДвижения  			= ВидДвиженияНакопления.Расход;
			Движение.Период	 				= СтруктураШапкиДокумента.Дата;
			Движение.Организация 		  	= СтруктураШапкиДокумента.Организация;
			Движение.Сделка				    = Строка.СделкаНУ;
			Движение.БазаНДС  				= Строка.СуммаВзаиморасчетов - Строка.СуммаНДСВал;
			Движение.СуммаНДС    			= Строка.СуммаНДСВал;
			Если НЕ ЭтоПродажа Тогда
				Движение.СуммаНДСПропорционально = Строка.СуммаНДСПропорциональноКредит;	
			КонецЕсли;
			Движение.СобытиеНДС 			= СобытиеНДС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроводкиПоДоговорамСУпрощеннымНалоговымУчетом(СтруктураШапкиДокумента, ТаблицаПродажи, ТаблицаПриобретения)

	Перем ТаблицаПоВторомуСобытиюНал;
	
	// формируем движения по по регистрам
	НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаУпрощенныйНалоговыйУчет(ЭтотОбъект, ТаблицаПоВторомуСобытиюНал);
	
	ЭтоПереносЗадолженности  = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности);
	ЭтоСписаниеЗадолженности = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности);
	
	Если  ЭтоПереносЗадолженности
		И СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
		// делаем закрывающие движения по регистрам налогового учета - для "нормального" отражения операции в отчетах по проверке сумм НДС
		НаборДвиженийОжидаемыйИПодтвержденныйНДС = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
		НаборДвиженийОжидаемыйИПодтвержденныйНДС.Прочитать();
		Для каждого Движение Из НаборДвиженийОжидаемыйИПодтвержденныйНДС Цикл
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.КодОперации = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.КорректировкаПервичныйДокумент;
		КонецЦикла;
		НаборДвиженийОжидаемыйИПодтвержденныйНДС.Записать(Ложь);
		
		НаборДвиженийОжидаемыйИПодтвержденныйНДС = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
		НаборДвиженийОжидаемыйИПодтвержденныйНДС.Прочитать();
		Для каждого Движение Из НаборДвиженийОжидаемыйИПодтвержденныйНДС Цикл
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.КодОперации = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ПодтвержденныйНДС;
		КонецЦикла;
		НаборДвиженийОжидаемыйИПодтвержденныйНДС.Записать(Ложь);
	
	КонецЕсли;	
	  
	// движения по НДС И ВД/ВР по событиям вида "оплата" формируем аналогично платежным документам
	СтрокиОплат    = Новый Массив;
	// движения по НДС И ВД/ВР по событиям вида "отгрузка" формируем аналогично отгрузочным документам
	СтрокиОтгрузок = Новый Массив;	
	
	Для каждого Строка Из ТаблицаПродажи Цикл
		Если    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем 
			ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю Тогда
			СтрокиОплат.Добавить(Строка);
		Иначе
			СтрокиОтгрузок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из ТаблицаПриобретения Цикл
		Если    Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком
			ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику Тогда
			СтрокиОплат.Добавить(Строка);
		Иначе
			СтрокиОтгрузок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из СтрокиОплат Цикл
		
		Если ЭтоПереносЗадолженности
			И СтруктураШапкиДокумента.НеПереноситьНОНК
			И Строка.ДобавленнаяСтрокаПереносаЗадолженности Тогда
			//Все движения будут сделаны для основной строки
			Продолжить;
		КонецЕсли;			  
			
		ЭтоПродажа = (    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю
					  ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем);
					  
		ЭтоВозврат = (Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОплатыПокупателю
					  ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
					  
		Если ЭтоПродажа Тогда
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
			КонецЕсли;
		Иначе	
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
			КонецЕсли;
		КонецЕсли;			  
		СуммаПроводки = НалоговыйУчет.ПолучитьСуммуПроводкиПоНДС(ТаблицаПоВторомуСобытиюНал, Строка.ПроводкиСуммаНДС, 
												    СобытиеНДС,
													Строка.ДоговорКонтрагента,
													Строка.СделкаНУ,
													Строка.РасчетныйДокумент,
													Строка.ВозвратнаяТара, 
													?(НЕ ЭтоПродажа, Строка.ДляХозяйственнойДеятельности, Неопределено), 
													?(НЕ ЭтоПродажа, Строка.ВидДеятельностиНДС		    , Неопределено),
													?(НЕ ЭтоПродажа, Строка.Амортизируется				, Неопределено));
		// для возвратов суммы отрицательные													
		Если ЭтоВозврат Тогда
			СуммаПроводки = - СуммаПроводки;
		КонецЕсли;													
		
		Если  СуммаПроводки <> 0 
			И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			
			Проводка = Движения.Хозрасчетный.Добавить();

			Проводка.Период                                 = Дата;
			Проводка.Активность                             = Истина;
			Проводка.Организация                            = Организация;
			Проводка.Сумма                                  = СуммаПроводки;
			Проводка.Содержание                             = ?(ЭтоПродажа,"НДС: налоговые обязательства", "НДС: налоговый кредит") + ?(ЭтоВозврат, ", (сторно) оплата", ", оплата");
			Проводка.НомерЖурнала                           = "";
				
			Проводка.СчетДт                           		= ?(ЭтоПродажа, Строка.СчетУчетаНДСПодтвержденный, Строка.СчетУчетаНДС);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",					 Строка.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",						 Строка.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами",Строка.СделкаНУ);
			Если ЭтоПереносЗадолженности
				И СтруктураШапкиДокумента.НеПереноситьНОНК
				И НЕ ЭтоПродажа Тогда
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",					  СтруктураШапкиДокумента.ДоговорКонтрагента.Владелец);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",						  СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами",НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка));
				
			КонецЕсли;	
			
			
			Проводка.СчетКт                           		= ?(ЭтоПродажа, Строка.СчетУчетаНДС, Строка.СчетУчетаНДСПодтвержденный);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",					 Строка.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",						 Строка.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",Строка.СделкаНУ);
			Если ЭтоПереносЗадолженности
				И СтруктураШапкиДокумента.НеПереноситьНОНК
				И ЭтоПродажа Тогда
				
				Проводка.СчетКт = СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",					  СтруктураШапкиДокумента.ДоговорКонтрагента.Владелец);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",						  СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка));
				
			КонецЕсли;	
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Для каждого Строка Из СтрокиОтгрузок Цикл
		
		Если  ЭтоПереносЗадолженности
			И СтруктураШапкиДокумента.НеПереноситьНОНК
			И Строка.ДобавленнаяСтрокаПереносаЗадолженности Тогда
			//Все движения будут сделаны для основной строки
			Продолжить;
		КонецЕсли;			  
		
		ЭтоПродажа = (    Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю
					  ИЛИ Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя);
					  
		ЭтоВозврат = (Строка.Событие = Перечисления.СобытияПродажиНалоговыйУчет.ВозвратОтПокупателя
					  ИЛИ Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
					  
		Если ЭтоПродажа Тогда
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
			КонецЕсли;
		Иначе	
			Если ЭтоВозврат Тогда
			    СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
			Иначе	
				СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
			КонецЕсли;
		КонецЕсли;			  
		
		Если СтруктураШапкиДокумента.ЕстьНДС 
			И Строка.ПроводкиСуммаНДС <> 0 
			//проводки по НДС формируются по основной строке
			И НЕ Строка.ДобавленнаяСтрокаПереносаЗадолженности Тогда
			
			СуммаПроводки = Строка.ПроводкиСуммаНДС;
			// для возвратов суммы отрицательные													
			Если ЭтоВозврат Тогда
				СуммаПроводки = - СуммаПроводки;
			КонецЕсли;				
			
			Проводка = Движения.Хозрасчетный.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СуммаПроводки;
			Проводка.Содержание                 = ?(ЭтоПродажа,"НДС: налоговые обязательства", "НДС: налоговый кредит") + ?(ЭтоВозврат, ", (сторно) отгрузка", ", отгрузка");
			Проводка.НомерЖурнала               = "";
			
			Если ЭтоПродажа Тогда
				
				ПроводкаСчетДт         = СтруктураШапкиДокумента.СчетДт;
				ВидСубконтоДт1 = 1;
				ПроводкаСубконтоДт1    = СтруктураШапкиДокумента.СубконтоДт1;
				ВидСубконтоДт2 = 2;
				ПроводкаСубконтоДт2    = СтруктураШапкиДокумента.СубконтоДт2;
				ВидСубконтоДт3 = 3;
				ПроводкаСубконтоДт3    = СтруктураШапкиДокумента.СубконтоДт3;
				
				Если ЭтоПереносЗадолженности Тогда
					
					Если СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
						
						ПроводкаСчетДт = СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный;
						
					Иначе
						
						ПроводкаСчетДт = СтруктураШапкиДокумента.СчетУчетаНДС;
						
					КонецЕсли;
						
					ВидСубконтоДт1 = "Контрагенты";
					ПроводкаСубконтоДт1    = СтруктураШапкиДокумента.ДоговорКонтрагента.Владелец;
					ВидСубконтоДт2 = "Договоры" ;
					ПроводкаСубконтоДт2    = СтруктураШапкиДокумента.ДоговорКонтрагента;
					ВидСубконтоДт3 = "ДокументыРасчетовСКонтрагентами";
					ПроводкаСубконтоДт3    = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка);
					
				ИначеЕсли ЭтоСписаниеЗадолженности Тогда 	
					
					ПроводкаСчетДт         = СтруктураШапкиДокумента.СчетКт;
					ВидСубконтоДт1 = 1;
					ПроводкаСубконтоДт1    = СтруктураШапкиДокумента.СубконтоКт1;
					ВидСубконтоДт2 = 2;
					ПроводкаСубконтоДт2    = СтруктураШапкиДокумента.СубконтоКт2;
					ВидСубконтоДт3 = 3;
					ПроводкаСубконтоДт3    = СтруктураШапкиДокумента.СубконтоКт3;
					
				КонецЕсли;
				
				ПроводкаСчетКт = Строка.СчетУчетаНДС;
				ВидСубконтоКт1 = "Контрагенты";
				ПроводкаСубконтоКт1    = Строка.ДоговорКонтрагента.Владелец;
				ВидСубконтоКт2 = "Договоры" ;
				ПроводкаСубконтоКт2    = Строка.ДоговорКонтрагента;
				ВидСубконтоКт3 = "ДокументыРасчетовСКонтрагентами";
				ПроводкаСубконтоКт3    = Строка.СделкаНУ;
				
				Если ЭтоПереносЗадолженности Тогда
					
					Если СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
						
						ПроводкаСчетКт = Строка.СчетУчетаНДСПодтвержденный;
						
					Иначе
						
						ПроводкаСчетКт = Строка.СчетУчетаНДС;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ПроводкаСчетДт = Строка.СчетУчетаНДС;
				Если ЭтоПереносЗадолженности Тогда
					
					Если СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
						
						ПроводкаСчетДт = Строка.СчетУчетаНДСПодтвержденный;
						
					Иначе
						
						ПроводкаСчетДт = Строка.СчетУчетаНДС;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ВидСубконтоДт1 = "Контрагенты";
				ПроводкаСубконтоДт1    = Строка.ДоговорКонтрагента.Владелец;
				ВидСубконтоДт2 = "Договоры" ;
				ПроводкаСубконтоДт2    = Строка.ДоговорКонтрагента;
				ВидСубконтоДт3 = "ДокументыРасчетовСКонтрагентами";
				ПроводкаСубконтоДт3    = Строка.СделкаНУ;
				
				ПроводкаСчетКт    = СтруктураШапкиДокумента.СчетКт;
				ВидСубконтоКт1 = 1;
				ПроводкаСубконтоКт1    = СтруктураШапкиДокумента.СубконтоКт1;
				ВидСубконтоКт2 = 2;
				ПроводкаСубконтоКт2    = СтруктураШапкиДокумента.СубконтоКт2;
				ВидСубконтоКт3 = 3;
				ПроводкаСубконтоКт3    = СтруктураШапкиДокумента.СубконтоКт3;
				
				Если ЭтоПереносЗадолженности Тогда
					
					Если СтруктураШапкиДокумента.НеПереноситьНОНК Тогда
						
						ПроводкаСчетКт = СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный;
						
					Иначе	
						
						ПроводкаСчетКт = СтруктураШапкиДокумента.СчетУчетаНДС;
						
					КонецЕсли;
					
					ВидСубконтоКт1 = "Контрагенты";
					ПроводкаСубконтоКт1    = СтруктураШапкиДокумента.ДоговорКонтрагента.Владелец;
					ВидСубконтоКт2 = "Договоры" ;
					ПроводкаСубконтоКт2    = СтруктураШапкиДокумента.ДоговорКонтрагента;
					ВидСубконтоКт3 = "ДокументыРасчетовСКонтрагентами";
					ПроводкаСубконтоКт3    = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка);
					
				ИначеЕсли ЭтоСписаниеЗадолженности Тогда 	
						
					ПроводкаСчетКт    = СтруктураШапкиДокумента.СчетДт;
					
					Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
						И СписыватьИзРезерваСомнительныхДолгов Тогда
						ПроводкаСчетКт    = СтруктураШапкиДокумента.СчетРезерваСомнительныхДолгов;	
					КонецЕсли;
					
					ВидСубконтоКт1 = 1;
					ПроводкаСубконтоКт1    = СтруктураШапкиДокумента.СубконтоДт1;
					ВидСубконтоКт2 = 2;
					ПроводкаСубконтоКт2    = СтруктураШапкиДокумента.СубконтоДт2;
					ВидСубконтоКт3 = 3;
					ПроводкаСубконтоКт3    = СтруктураШапкиДокумента.СубконтоДт3;
					
				КонецЕсли;				
				
			КонецЕсли;
			
			Проводка.СчетДт                     = ПроводкаСчетДт;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, ВидСубконтоДт1, ПроводкаСубконтоДт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, ВидСубконтоДт2, ПроводкаСубконтоДт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, ВидСубконтоДт3, ПроводкаСубконтоДт3);

			Проводка.СчетКт                     = ПроводкаСчетКт;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, ВидСубконтоКт1, ПроводкаСубконтоКт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, ВидСубконтоКт2, ПроводкаСубконтоКт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, ВидСубконтоКт3, ПроводкаСубконтоКт3);
			
			Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности
				   И СтруктураШапкиДокумента.СчетДт.НалоговыйУчет = Истина Тогда
					
					ЗаписыватьСуммуНУ = НЕ (СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
					
					Если Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт Тогда
						Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
						Если ЗаписыватьСуммуНУ Тогда
							Проводка.СуммаНУДт = Проводка.Сумма;
						КонецЕсли;
					ИначеЕсли Проводка.СчетКт = СтруктураШапкиДокумента.СчетДт Тогда
							Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
							Если ЗаписыватьСуммуНУ Тогда
								Проводка.СуммаНУКт = Проводка.Сумма;
							КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
					    И ЭтоПродажа 
						И СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании Тогда
						
					ЗаписыватьСуммуНУ = НЕ (СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
					
					Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
					
					Если ЗаписыватьСуммуНУ Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоПроводок = Движения.Хозрасчетный.Количество();
			
			НалоговыйУчет.РазбитьПроводкуПоНДСНаПервоеВтороеСобытие(ТаблицаПоВторомуСобытиюНал, Движения.Хозрасчетный, Проводка, 
													  ?(НЕ ЭтоПродажа,"Дт","Кт"), Строка.СчетУчетаНДСПодтвержденный, 
													  Строка.ДоговорКонтрагента, 
													  Строка.СделкаНУ, Строка.РасчетныйДокумент,
													  СобытиеНДС,
													  Строка.СтавкаНДС,	
													  ?(НЕ ЭтоПродажа, Строка.ДляХозяйственнойДеятельности, Неопределено), 
													  ?(НЕ ЭтоПродажа, Строка.ВидДеятельностиНДС		  , Неопределено),
													  ?(НЕ ЭтоПродажа, Строка.Амортизируется			  , Неопределено));
													  
			Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
				НовоеКоличествоПроводок = Движения.Хозрасчетный.Количество();
				Для НомерПроводкиПоНДС = КоличествоПроводок По НовоеКоличествоПроводок Цикл
					ПроводкаПоНДС = Движения.Хозрасчетный[НомерПроводкиПоНДС - 1];
					ИнвертироватьПроводку(ПроводкаПоНДС);
				КонецЦикла;
			КонецЕсли;				
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамБухгалтерии(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок, ТаблицаДебиторскойЗадолженности,ТаблицаКредиторскойЗадолженности)
	
	СодержаниеПроводки = "";
	Если СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
		СодержаниеПроводки = "Взаимозачет";
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		СодержаниеПроводки = "Перенос задолженности";
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		СодержаниеПроводки = "Списание безнадежной задолженности";
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		СодержаниеПроводки = "Изменение (формирование) задолженности";
	КонецЕсли; 
	
	КоличествоПроводокПоДебиторке = 0;
	
	Если ТаблицаДебиторскойЗадолженности.Количество()>0 Тогда
		СтруктураШапкиДокумента.Вставить("ВидЗадолженности",Перечисления.ВидыЗадолженности.Дебиторская);
		
		Если не ТаблицаДебиторскойЗадолженности.Найти(Истина,"ЭтоВозврат") = Неопределено Тогда
			Построитель_ТаблицаЗадолженности = Новый построительЗапроса();
			Построитель_ТаблицаЗадолженности.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДебиторскойЗадолженности);
			Построитель_ТаблицаЗадолженности.Отбор.Добавить("ЭтоВозврат");
			
			// Сначала по возвратам пройдемся
			Построитель_ТаблицаЗадолженности.Отбор.ЭтоВозврат.Установить(Истина,Истина);
			СтруктураШапкиДокумента.Вставить("ЭтоВозврат",Истина);
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,Построитель_ТаблицаЗадолженности.Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой))=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
			// Затем отработаем погашение задолженности
			СтруктураШапкиДокумента.Вставить("ЭтоВозврат",Ложь);
			Построитель_ТаблицаЗадолженности.Отбор.ЭтоВозврат.Установить(Ложь,Истина);
			
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,Построитель_ТаблицаЗадолженности.Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой))=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
		
		Иначе
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,ТаблицаДебиторскойЗадолженности)=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если     СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета
			И НЕ СтруктураШапкиДокумента.ИспользоватьВспомогательныйСчет Тогда
			// Выгружаем набор движении для последующей корректировки
			НаборДвиженийДебиторка = Движения.Хозрасчетный.Выгрузить();
			КоличествоПроводокПоДебиторке = Движения.Хозрасчетный.Количество();
			
			Движения.Хозрасчетный.Очистить();
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ТаблицаКредиторскойЗадолженности.Количество()>0 Тогда
		СтруктураШапкиДокумента.Вставить("ВидЗадолженности",Перечисления.ВидыЗадолженности.Кредиторская);
		
		Если не ТаблицаКредиторскойЗадолженности.Найти(Истина,"ЭтоВозврат") = Неопределено Тогда
			Построитель_ТаблицаЗадолженности = Новый построительЗапроса();
			Построитель_ТаблицаЗадолженности.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаКредиторскойЗадолженности);
			Построитель_ТаблицаЗадолженности.Отбор.Добавить("ЭтоВозврат");
			
			// Сначала по возвратам пройдемся
			Построитель_ТаблицаЗадолженности.Отбор.ЭтоВозврат.Установить(Истина,Истина);
			СтруктураШапкиДокумента.Вставить("ЭтоВозврат",Истина);
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,Построитель_ТаблицаЗадолженности.Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой))=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
			// Затем отработаем погашение задолженности
			СтруктураШапкиДокумента.Вставить("ЭтоВозврат",Ложь);
			Построитель_ТаблицаЗадолженности.Отбор.ЭтоВозврат.Установить(Ложь,Истина);
			
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,Построитель_ТаблицаЗадолженности.Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой))=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
		
		Иначе
			Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,ТаблицаКредиторскойЗадолженности)=Ложь тогда
				// Ошибка при списании задолженности
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если     СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета
			И НЕ СтруктураШапкиДокумента.ИспользоватьВспомогательныйСчет Тогда
			// Выгружаем набор движении для последующей корректировки
			НаборДвиженийКредиторка = Движения.Хозрасчетный.Выгрузить();
			
			Движения.Хозрасчетный.Очистить();
		КонецЕсли;
	КонецЕсли; 
	
	Если     СтруктураШапкиДокумента.ВидОперации = перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета
		И НЕ СтруктураШапкиДокумента.ИспользоватьВспомогательныйСчет и КоличествоПроводокПоДебиторке>0 Тогда
		// Сопоставление дебета и кредита проводки
		// Сопоставление производится по сумме регламентированного учета - балансовый реквизит проводки
		ВспомогательныйСчет = ПланыСчетов.Хозрасчетный.Вспомогательный;
		
		Для каждого СтрокаДебиторки Из НаборДвиженийДебиторка Цикл
			Если не СтрокаДебиторки.СчетДт = ВспомогательныйСчет Тогда
				// Суммовые разницы или что-то подобное (проводка не самого взаимозачета)
				Проводка  = Движения.Хозрасчетный.Добавить();
				Проводка.Период			= СтрокаДебиторки.Период;
				Проводка.Организация	= СтрокаДебиторки.Организация;
				Проводка.НомерЖурнала	= СтрокаДебиторки.НомерЖурнала;
				Проводка.Содержание		= СтрокаДебиторки.Содержание;
				Проводка.Сумма			= СтрокаДебиторки.Сумма;
				
				Проводка.СчетДт			= СтрокаДебиторки.СчетДт;
				Для НомерСубконто = 1  По 3 Цикл
					Если Не СтрокаДебиторки["ВидСубконтоДт"+НомерСубконто] = Неопределено Тогда
						ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетДт, Проводка.СубконтоДт, СтрокаДебиторки["ВидСубконтоДт"+НомерСубконто], СтрокаДебиторки["СубконтоДт"+НомерСубконто]);
					КонецЕсли; 
				КонецЦикла; 
				
				Проводка.ВалютаДт		= СтрокаДебиторки.ВалютаДт;
				Проводка.ВалютнаяСуммаДт= СтрокаДебиторки.ВалютнаяСуммаДт;
				
				Проводка.СчетКт			= СтрокаДебиторки.СчетКт;
				Для НомерСубконто = 1  По 3 Цикл
					Если Не СтрокаДебиторки["ВидСубконтоКт"+НомерСубконто] = Неопределено Тогда
						ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетКт, Проводка.СубконтоКт, СтрокаДебиторки["ВидСубконтоКт"+НомерСубконто], СтрокаДебиторки["СубконтоКт"+НомерСубконто]);
					КонецЕсли; 
				КонецЦикла; 
				
				Проводка.ВалютаКт		= СтрокаДебиторки.ВалютаКт;
				Проводка.ВалютнаяСуммаКт= СтрокаДебиторки.ВалютнаяСуммаКт;
				
				Продолжить;
			КонецЕсли;
			
			Для каждого СтрокаКредиторки Из НаборДвиженийКредиторка Цикл
				Если СтрокаДебиторки.Сумма = 0 Тогда
				    Прервать;
				КонецЕсли;
				Если СтрокаКредиторки.Сумма = 0 Тогда
				    Продолжить;
				КонецЕсли;
				
				Если не СтрокаКредиторки.СчетКт = ВспомогательныйСчет Тогда
					// Суммовые разницы или что-то подобное (проводка не самого взаимозачета)
					Проводка  = Движения.Хозрасчетный.Добавить();
					Проводка.Период			= СтрокаКредиторки.Период;
					Проводка.Организация	= СтрокаКредиторки.Организация;
					Проводка.НомерЖурнала	= СтрокаКредиторки.НомерЖурнала;
					Проводка.Содержание		= СтрокаКредиторки.Содержание;
					Проводка.Сумма			= СтрокаКредиторки.Сумма;
					
					Проводка.СчетДт			= СтрокаКредиторки.СчетДт;
					Для НомерСубконто = 1  По 3 Цикл
						Если Не СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто] = Неопределено Тогда
							ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетДт, Проводка.СубконтоДт, СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто], СтрокаКредиторки["СубконтоДт"+НомерСубконто]);
						КонецЕсли; 
					КонецЦикла; 
					
					Проводка.ВалютаДт		= СтрокаКредиторки.ВалютаДт;
					Проводка.ВалютнаяСуммаДт= СтрокаКредиторки.ВалютнаяСуммаДт;
					
					Проводка.СчетКт			= СтрокаКредиторки.СчетКт;
					Для НомерСубконто = 1  По 3 Цикл
						Если Не СтрокаКредиторки["ВидСубконтоКт"+НомерСубконто] = Неопределено Тогда
							ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетКт, Проводка.СубконтоКт, СтрокаКредиторки["ВидСубконтоКт"+НомерСубконто], СтрокаКредиторки["СубконтоКт"+НомерСубконто]);
						КонецЕсли; 
					КонецЦикла; 
					
					Проводка.ВалютаКт		= СтрокаКредиторки.ВалютаКт;
					Проводка.ВалютнаяСуммаКт= СтрокаКредиторки.ВалютнаяСуммаКт;
					
					СтрокаКредиторки.Сумма = 0;
					СтрокаКредиторки.ВалютнаяСуммаДт = 0;
					СтрокаКредиторки.ВалютнаяСуммаКт = 0;
					Продолжить;
				КонецЕсли; 
				
				СуммаСоответствия = мин(СтрокаДебиторки.Сумма,СтрокаКредиторки.Сумма);
				
				Если СуммаСоответствия = 0 Тогда
					продолжить;
				КонецЕсли; 
				
				// Проводка взаимозачета
				Проводка  = Движения.Хозрасчетный.Добавить();
				Проводка.Период			= СтрокаДебиторки.Период;
				Проводка.Организация	= СтрокаДебиторки.Организация;
				Проводка.НомерЖурнала	= СтрокаДебиторки.НомерЖурнала;
				Проводка.Содержание		= СтрокаДебиторки.Содержание;
				Проводка.Сумма			= СуммаСоответствия;
				
				Проводка.СчетДт			= СтрокаКредиторки.СчетДт;
				Для НомерСубконто = 1  По 3 Цикл
					Если Не СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто] = Неопределено Тогда
						ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетДт, Проводка.СубконтоДт, СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто], СтрокаКредиторки["СубконтоДт"+НомерСубконто]);
					КонецЕсли; 
				КонецЦикла; 
				
				Проводка.ВалютаДт		= СтрокаКредиторки.ВалютаДт;
				Проводка.ВалютнаяСуммаДт= Окр(СтрокаКредиторки.ВалютнаяСуммаДт*СуммаСоответствия/СтрокаКредиторки.Сумма,2);
				
				
				Проводка.СчетКт			= СтрокаДебиторки.СчетКт;
				Для НомерСубконто = 1  По 3 Цикл
					Если Не СтрокаДебиторки["ВидСубконтоКт"+НомерСубконто] = Неопределено Тогда
						ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетКт, Проводка.СубконтоКт, СтрокаДебиторки["ВидСубконтоКт"+НомерСубконто], СтрокаДебиторки["СубконтоКт"+НомерСубконто]);
					КонецЕсли; 
				КонецЦикла; 
				
				Проводка.ВалютаКт		= СтрокаДебиторки.ВалютаКт;
				Проводка.ВалютнаяСуммаКт= Окр(СтрокаДебиторки.ВалютнаяСуммаКт*СуммаСоответствия/СтрокаДебиторки.Сумма,2);
				
				
				СтрокаДебиторки.Сумма			= СтрокаДебиторки.Сумма - СуммаСоответствия;
				СтрокаДебиторки.ВалютнаяСуммаКт = СтрокаДебиторки.ВалютнаяСуммаКт - Проводка.ВалютнаяСуммаКт;
			
				СтрокаКредиторки.Сумма			= СтрокаКредиторки.Сумма - СуммаСоответствия;
				СтрокаКредиторки.ВалютнаяСуммаДт = СтрокаКредиторки.ВалютнаяСуммаДт - Проводка.ВалютнаяСуммаДт;
				
			КонецЦикла; 
		КонецЦикла; 
	
		Для каждого СтрокаКредиторки Из НаборДвиженийКредиторка Цикл
			Если СтрокаКредиторки.Сумма = 0 и СтрокаКредиторки.ВалютнаяСуммаДт = 0 и СтрокаКредиторки.ВалютнаяСуммаКт = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Суммовые разницы или что-то подобное (проводка не самого взаимозачета)
			Проводка  = Движения.Хозрасчетный.Добавить();
			Проводка.Период			= СтрокаКредиторки.Период;
			Проводка.Организация	= СтрокаКредиторки.Организация;
			Проводка.НомерЖурнала	= СтрокаКредиторки.НомерЖурнала;
			Проводка.Содержание		= СтрокаКредиторки.Содержание;
			Проводка.Сумма			= СтрокаКредиторки.Сумма;
			
			Проводка.СчетДт			= СтрокаКредиторки.СчетДт;
			Для НомерСубконто = 1  По 3 Цикл
				Если Не СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто] = Неопределено Тогда
					ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетДт, Проводка.СубконтоДт, СтрокаКредиторки["ВидСубконтоДт"+НомерСубконто], СтрокаКредиторки["СубконтоДт"+НомерСубконто]);
				КонецЕсли; 
			КонецЦикла; 
			
			Проводка.ВалютаДт		= СтрокаКредиторки.ВалютаДт;
			Проводка.ВалютнаяСуммаДт= СтрокаКредиторки.ВалютнаяСуммаДт;
			
			Проводка.СчетКт			= СтрокаКредиторки.СчетКт;
			Для НомерСубконто = 1  По 3 Цикл
				Если Не СтрокаКредиторки["ВидСубконтоКт"+НомерСубконто] = Неопределено Тогда
					ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Проводка.СчетКт, Проводка.СубконтоКт, СтрокаКредиторки["ВидСубконтоКт"+НомерСубконто], СтрокаКредиторки["СубконтоКт"+НомерСубконто]);
				КонецЕсли; 
			КонецЦикла; 
			
			Проводка.ВалютаКт		= СтрокаКредиторки.ВалютаКт;
			Проводка.ВалютнаяСуммаКт= СтрокаКредиторки.ВалютнаяСуммаКт;
			
			СтрокаКредиторки.Сумма = 0;
			СтрокаКредиторки.ВалютнаяСуммаДт = 0;
			СтрокаКредиторки.ВалютнаяСуммаКт = 0;
			Продолжить;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
		И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности
		И СчетДт.НалоговыйУчет Тогда
		
		ЗаписыватьСуммуНУ = НЕ (СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
		
		Для каждого Строка Из Движения.Хозрасчетный Цикл
			Если Строка.СчетДт = СчетДт Тогда
				Строка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Если ЗаписыватьСуммуНУ Тогда
					Строка.СуммаНУДт = Строка.Сумма;
				КонецЕсли;
			КонецЕсли;
			
			Если Строка.СчетКт = СчетДт Тогда
				Строка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Если ЗаписыватьСуммуНУ Тогда
					Строка.СуммаНУКт = Строка.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц

КонецПроцедуры

Процедура ДвиженияПоСписаниюЗадолженнстиПоНалоговомуУчету(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок) 
	
	Если  НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		Возврат;
	КонецЕсли; 
	
	Если  НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Строка Из ТаблицаПоСуммамДолга Цикл
		
		// списывается дебиторская задолженность за внесенный и необслуженный аванс поставщику
		// по НУ признается в сумме списания из резерва
		// имеется временная разница по начислению расходов - в БУ в момент формирования резерва
		// по НУ - в момент признания задолженности безнадежной (списания)
		Если  Строка.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская
			И Строка.ТипКонтрагента   = Перечисления.СтатусыКонтрагентов.Поставщик Тогда
			
			Если НЕ СтруктураШапкиДокумента.СписыватьИзРезерваСомнительныхДолгов Тогда
				// в НУ такое списание не признается
				Продолжить;
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.НачислятьРезервСомнительныхДолгов Тогда
				// покажем в БУ начисление резерва сомнительной задолженности
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = Строка.ГривневаяСумма - ?(СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании, Строка.ПроводкиСуммаНДС, 0);
				Проводка.Содержание                             = НСтр("ru = 'Начисление резерва сомнительной задолженности'; uk = 'Начисление резерву сумнінвої заборгованності'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоДт3);
				
				// не признается затратой в НУ
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = 0;
				
				Проводка.СчетКт = СтруктураШапкиДокумента.СчетРезерваСомнительныхДолгов;
			
			КонецЕсли;
			
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				// Проводка по затратам в НУ - только по налоговому учету, не нехоз. деятельность
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Списание на затраты по НУ дебеторской задолженности поставщика'; uk = 'Списання на витрати по ПО дебеторської заборгованості постачальника'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоДт3);
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = Строка.ГривневаяСумма - ?(СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании, Строка.ПроводкиСуммаНДС, 0);
				
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
				
			КонецЕсли;
			

		КонецЕсли;	
		
		// списывается дебиторская задолженность за отгруженный и неоплаченный покупателем товар
		// по НУ признается в сумме списания из резерва
		// имеется временная разница по начислению расходов - в БУ в момент формирования резерва
		// по НУ - в момент признания задолженности безнадежной (списания)
		// также (фактически еще до списания - при признании сомнительной, но мы реализуем в момент списания)
		// необходимо отсторнировать доход и себестоимость по отгрузке. Доход нам известен,
		// а себестоимость нужно вручную указать в ТЧ.
		Если  Строка.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская
			И Строка.ТипКонтрагента   = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
			
			// сторно доходов
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
				И НЕ СтруктураШапкиДокумента.НеСторнироватьДоходыСебестоимостьВНУ = Истина
				Тогда
				
				// Проводка по только по НУ
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Сторно доходов при признании задолжености сомнительной (списании)'; uk = 'Сторно доходів при визнанні заборгованності сумнівною (списанні)'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
				
				Проводка.СчетКт = СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СчетДоходов;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоДоходов1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоДоходов2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоДоходов3);
				
				Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУКт = - (Строка.ГривневаяСумма - Строка.ПроводкиСуммаНДС);
				
			КонецЕсли;
			
			
			// сторно себестоимости 
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
				И НЕ СтруктураШапкиДокумента.НеСторнироватьДоходыСебестоимостьВНУ = Истина
				Тогда
				
				// Проводка по только по НУ
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Сторно себестоимости реализации при признании задолжености сомнительной (списании)'; uk = 'Сторно собівартості реалізації при визнанні заборгованності сумнівною (списанні)'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СчетСебестоимости;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости3);
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = - (Строка.СуммаСебестоимостиНУ);
				
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
					
			КонецЕсли;
			
			Если НЕ СтруктураШапкиДокумента.СписыватьИзРезерваСомнительныхДолгов Тогда
				// в НУ такое списание не признается
				Продолжить;
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.НачислятьРезервСомнительныхДолгов Тогда
				// покажем в БУ начисление резерва сомнительной задолженности
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = Строка.ГривневаяСумма - ?(СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании, Строка.ПроводкиСуммаНДС, 0);
				Проводка.Содержание                             = НСтр("ru = 'Начисление резерва сомнительной задолженности'; uk = 'Начисление резерву сумнінвої заборгованності'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоДт3);
				
				// не признается в НУ
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = 0;
				
				Проводка.СчетКт = СтруктураШапкиДокумента.СчетРезерваСомнительныхДолгов;
			
			КонецЕсли;
			
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				// Проводка по затратам в НУ - только по налоговому учету, не нехоз. деятельность
				
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Списание на затраты по НУ дебеторской задолженности поставщика'; uk = 'Списання на витрати по ПО дебеторської заборгованості постачальника'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоДт3);
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = Строка.ГривневаяСумма - ?(СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании, Строка.ПроводкиСуммаНДС, 0);
				
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
					
			КонецЕсли;
			

		КонецЕсли;	
		
		// списывается кредиторская задолженность полученный и неоплаченный товар от поставщика
		// в НУ доход признается одновременно с БУ. Проводки сформированы выше. 
		// также необходимо отсторнировать себестомиость реализации данного товара только по НУ
		Если  Строка.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
			И Строка.ТипКонтрагента   = Перечисления.СтатусыКонтрагентов.Поставщик Тогда

			// отсторнируем показанные доходы на сумму НДС
			Если  СтруктураШапкиДокумента.НеОтноситьНаВРСуммуНДСПриСписании 
				И Строка.ПроводкиСуммаНДС > 0 Тогда
			
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Сторно расходов по НУ на сумму НДС'; uk = 'Сторно доходів по ПО на суму ПДВ'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
				
				Проводка.СчетКт = СтруктураШапкиДокумента.СчетКт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1, СтруктураШапкиДокумента.СубконтоКт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2, СтруктураШапкиДокумента.СубконтоКт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3, СтруктураШапкиДокумента.СубконтоКт3);
				
				Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУКт = - Строка.ПроводкиСуммаНДС;
				
			КонецЕсли;
			
			// сторно себестоимости 
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
				И НЕ СтруктураШапкиДокумента.НеСторнироватьДоходыСебестоимостьВНУ = Истина
				Тогда
				
				// Проводка по только по НУ
				Проводка = Движения.Хозрасчетный.Добавить();
				
				Проводка.Период                                 = Дата;
				Проводка.Активность                             = Истина;
				Проводка.Организация                            = Организация;
				Проводка.Сумма                                  = 0; //только по НУ
				Проводка.Содержание                             = НСтр("ru = 'Сторно себестоимости реализации при признании задолжености сомнительной (списании)'; uk = 'Сторно собівартості реалізації при визнанні заборгованності сумнівною (списанні)'");
				Проводка.НомерЖурнала                           = "";
				
				Проводка.СчетДт = СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СчетСебестоимости;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.ПараметрыСписанияСебестоимостиНУ.СубконтоСебестоимости3);
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = - (Строка.ГривневаяСумма - Строка.ПроводкиСуммаНДС);
				
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		// списывается кредиторская задолженность за полученный и необслуженный аванс покупателя
		// в НУ доход признается одновременно с БУ. Проводки сформированы выше. дополнительных проводок 
		// не требуется
		Если  Строка.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
			И Строка.ТипКонтрагента   = Перечисления.СтатусыКонтрагентов.Покупатель Тогда
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

//Функция для получения номера субконто "Расчетные документы" по счету учета
//
// Параметры
//  Счет         - счет по которому определяетс номер субконто "Документы расчетов с контрагентами"
// Возвращаемое значение:
//   Число   – номер субконто "Документы расчетов с контрагентами" на счете. Если субконто нет - возвращается 0.
//
Функция ПолучитьНомерСубконтоРД(Счет)
    Если НомераСубконтоРДпоСчету = Неопределено Тогда
	    НомераСубконтоРДпоСчету = Новый Соответствие();
	КонецЕсли; 
	
	НомерСубконтоРД = НомераСубконтоРДпоСчету[Счет];
	
	Если  НомерСубконтоРД = Неопределено Тогда
		НомерСубконтоРД = 0;
		
		// Определим начичие субконто "Документы расчетов с контрагентами" по счету учета.
		ВидыСубконто = Счет.ВидыСубконто;
		СтрокаСубконтоРД = ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто");
		Если не СтрокаСубконтоРД = Неопределено Тогда
			НомераСубконтоРДпоСчету.Вставить(Счет, СтрокаСубконтоРД.НомерСтроки);
			НомерСубконтоРД = СтрокаСубконтоРД.НомерСтроки;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат НомерСубконтоРД;

КонецФункции // ПолучитьНомерСубконтоРД()

// Процедура определяет тип "закрывающего/создающего" указанный долг события по налоговому учету
// Например, для долга вида "Отгрузка" закрывающим событием будет "Оплата", если не указан
// параметр ДелатьВозврат. Если параметр ДелатьВозврат = Истина, то данный долг будет
// закрыт как "Возврат отгрузки".
// Параметры:
//			Строка - Строка таблицы долга
//		    СоздаватьДолг - булево - указанный долг создается (Истина) или погашается (ЛОЖЬ)
//			ДелатьВозврат - булево - определяет метод закрытия долга
Функция ПолучитьКлючСобытияПоНалоговомуУчету(Строка, СоздаватьДолг = Ложь, ДелатьВозврат = Ложь)
	
	Если СоздаватьДолг Тогда
	
		Если ЭтоОплата(Строка) Тогда
			Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
				КлючСобытия = "Оплата";	 
			Иначе	
				КлючСобытия = "ВозвратОплаты";
			КонецЕсли;
		Иначе//отгрузка	
			Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
				КлючСобытия = "Отгрузка";
			Иначе	
				КлючСобытия = "ВозвратОтгрузки";
			КонецЕсли;
		КонецЕсли;
	
	Иначе
	
		Если ЭтоОплата(Строка) Тогда
			Если ДелатьВозврат Тогда
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
					КлючСобытия = "ВозвратОплаты";
				Иначе	
					КлючСобытия = "Оплата";
				КонецЕсли;
			Иначе
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
					КлючСобытия = "Отгрузка";	 
				Иначе	
					КлючСобытия = "ВозвратОтгрузки";
				КонецЕсли;
			КонецЕсли;
		Иначе//отгрузка	
			Если ДелатьВозврат Тогда
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
					КлючСобытия = "ВозвратОтгрузки";	
				Иначе	
					КлючСобытия = "Отгрузка";
				КонецЕсли;
			Иначе
				Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
					КлючСобытия = "Оплата";
				Иначе	
					КлючСобытия = "ВозвратОплаты";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КлючСобытия;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из СуммыДолга Цикл
		
		Если ОтражатьВБухгалтерскомУчете и ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
			// поправим налоговые реквизииты
			Если Строка.ЗаТару Тогда
			
				Строка.СтавкаНДС 		   = Перечисления.СтавкиНДС.НеНДС;
				Строка.СуммаНДС  	       = 0;
				Строка.СчетУчетаНДС 	   = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				Строка.Амортизируется 	   = ЛОЖЬ;
			
			КонецЕсли; 
			
			Если НЕ Строка.НетНалоговойНакладной И Строка.ВзаиморасчетыЗакрыты Тогда
				Строка.ВзаиморасчетыЗакрыты = Ложь;	
			КонецЕсли;
			
		Иначе
			Строка.ВзаиморасчетыЗакрыты = Ложь;	
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ВводНачальныхОстатков Тогда
		Если НЕ ЗначениеЗаполнено(СчетДт) Тогда
			СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("ЭтоВозврат",Ложь);
	СтруктураШапкиДокумента.Вставить("ВидДоговора",ДоговорКонтрагента.ВидДоговора);

	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "ВалютаУправленческогоУчета", "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "КурсВалютыУправленческогоУчета"    , "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                      , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                       , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Внешнеэкономический"                        , "Внешнеэкономический");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"                       , "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                                , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                                , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентом",      "ВестиПоДокументамРасчетовСКонтрагентом");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентомРегл",      "ВестиПоДокументамРасчетовСКонтрагентомРегл");
    Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация", "ДоговорОрганизация");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора" , "ДоговорКонтрагентаВидДоговора");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентом" , "ДоговорКонтрагентаВестиПоДокументамРасчетовСКонтрагентом");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов", "ДоговорКонтрагентаВалютаВзаиморасчетов");
	КонецЕсли;
                        
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
   Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		Если СтруктураШапкиДокумента.ДоговорКонтрагентаВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаДокумента Тогда
			СтруктураШапкиДокумента.Вставить("ДоговорКонтрагентаКурсВзаиморасчетов",      СтруктураШапкиДокумента.КурсДокумента);
			СтруктураШапкиДокумента.Вставить("ДоговорКонтрагентаКратностьВзаиморасчетов", СтруктураШапкиДокумента.КратностьДокумента);
		Иначе
			СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ДоговорКонтрагентаВалютаВзаиморасчетов, СтруктураШапкиДокумента.Дата);
			СтруктураШапкиДокумента.Вставить("ДоговорКонтрагентаКурсВзаиморасчетов",      СтруктураКурса.Курс);
			СтруктураШапкиДокумента.Вставить("ДоговорКонтрагентаКратностьВзаиморасчетов", СтруктураКурса.Кратность);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ИзменениеЗадолженности Тогда
		
		// для общности алгоритмов перенесем данные по вспомогательному счету в счет Кт
		СтруктураШапкиДокумента.Вставить("СчетКт",      СтруктураШапкиДокумента.СчетДт);
		СтруктураШапкиДокумента.Вставить("СубконтоКт1", СтруктураШапкиДокумента.СубконтоДт1);
		СтруктураШапкиДокумента.Вставить("СубконтоКт2", СтруктураШапкиДокумента.СубконтоДт2);
		СтруктураШапкиДокумента.Вставить("СубконтоКт3", СтруктураШапкиДокумента.СубконтоДт3);
	
	КонецЕсли;
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("ВидЗадолженности"                        , "ВидЗадолженности");
	СтруктураПолей.Вставить("ДоговорКонтрагента"                      , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("КонтрагентДоговора"                      , "ДоговорКонтрагента.Владелец");
	СтруктураПолей.Вставить("ВалютаВзаиморасчетов"                    , "ДоговорКонтрагента.ВалютаВзаиморасчетов");
	СтруктураПолей.Вставить("Внешнеэкономический"                     , "ДоговорКонтрагента.Внешнеэкономический");	
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"                    , "ДоговорКонтрагента.СложныйНалоговыйУчет");	
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"                   , "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураПолей.Вставить("ДоговорОрганизация"                      , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("КонтрагентДоговора"                      , "ДоговорКонтрагента.Владелец");
	СтруктураПолей.Вставить("Организация"                      		  , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("ВидДоговора"                             , "ДоговорКонтрагента.ВидДоговора");
	СтруктураПолей.Вставить("ВестиПоДокументамРасчетовСКонтрагентомРегл", "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл");
	СтруктураПолей.Вставить("ВестиПоДокументамРасчетовСКонтрагентом"    , "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом");
	
	СтруктураПолей.Вставить("Сделка"                				  , "Сделка");
	СтруктураПолей.Вставить("ДокументРасчетовСКонтрагентом"			  , "ДокументРасчетовСКонтрагентом");
	СтруктураПолей.Вставить("СделкаВзаиморасчеты"                     , "Сделка");
	СтруктураПолей.Вставить("СделкаРасчеты"                           , "Сделка");
	СтруктураПолей.Вставить("Сумма"              					  , "Сумма");
	СтруктураПолей.Вставить("СуммаВзаиморасчетов"              		  , "СуммаВзаиморасчетов");
	СтруктураПолей.Вставить("СуммаВзаиморасчетовБУ"              	  , "СуммаВзаиморасчетов");
	СтруктураПолей.Вставить("КурсВзаиморасчетов"                      , "КурсВзаиморасчетов");
	СтруктураПолей.Вставить("КратностьВзаиморасчетов"                 , "КратностьВзаиморасчетов");
 	СтруктураПолей.Вставить("СчетОплаты"          					  , "СчетУчетаРасчетов");
	СтруктураПолей.Вставить("СчетАванса"          					  , "СчетУчетаРасчетов");
	
	СтруктураПолей.Вставить("КоррСчет"              				  , "Ссылка.СчетДт");
	СтруктураПолей.Вставить("КоррСубконто1"              			  , "Ссылка.СубконтоДт1");
	СтруктураПолей.Вставить("КоррСубконто2"              			  , "Ссылка.СубконтоДт2");
	СтруктураПолей.Вставить("КоррСубконто3"              			  , "Ссылка.СубконтоДт3");
	
	СтруктураПолей.Вставить("ТипКонтрагента"						  , "ТипКонтрагента");
	
	СтруктураПолей.Вставить("ВозвратнаяТара"          			, "ЗаТару");
	СтруктураПолей.Вставить("РасчетыВозврат"          			, "РасчетыВозврат");
	СтруктураПолей.Вставить("СтавкаНДС"				  			, "СтавкаНДС");
	СтруктураПолей.Вставить("СчетУчетаНДС"						, "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНДСПодтвержденный"		, "СчетУчетаНДСПодтвержденный");
	СтруктураПолей.Вставить("СуммаНДС"						  	, "СуммаНДС");
	СтруктураПолей.Вставить("СуммаНДСПропорциональноКредит"		, "СуммаНДСПропорциональноКредит");
	СтруктураПолей.Вставить("НетНалоговойНакладной"				, "НетНалоговойНакладной");
	СтруктураПолей.Вставить("СхемаНалоговогоУчета"				, "ДоговорКонтрагента.СхемаНалоговогоУчета");
	СтруктураПолей.Вставить("СхемаНалоговогоУчетаПоТаре"		, "ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре");
	СтруктураПолей.Вставить("НалоговоеНазначение"				, "НалоговоеНазначение");
	СтруктураПолей.Вставить("Амортизируется"     				, "Амортизируется");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"		     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("СуммаСебестоимостиНУ"     			, "СуммаСебестоимостиНУ");
	
	СтруктураПолей.Вставить("ВзаиморасчетыЗакрыты"				, "ВзаиморасчетыЗакрыты");
	
	
	СтруктураПолей.Вставить("ДоговорКонтрагентаПредставление"            , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("СделкаПредставление"                        , "Сделка");
	СтруктураПолей.Вставить("ДокументРасчетовСКонтрагентомПредставление" , "ДокументРасчетовСКонтрагентом");
	СтруктураПолей.Вставить("ВалютаВзаиморасчетовПредставление"          , "ДоговорКонтрагента.ВалютаВзаиморасчетов");
	
	РезультатЗапросаПоСуммамДолга = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СуммыДолга", СтруктураПолей);

	// Подготовим таблицы товаров для проведения.
	ТаблицаПоСуммамДолга = ПодготовитьТаблицуСуммДолга(РезультатЗапросаПоСуммамДолга, СтруктураШапкиДокумента);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);
	
	// Проверить заполнение ТЧ 
	ПроверитьЗаполнениеТабличнойЧастиСуммыДолга(ТаблицаПоСуммамДолга, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда

		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоСуммамДолга, Отказ, Заголовок);

	КонецЕсли; 
    	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры	// ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

// Функция используется при вводе остатков взаиморасчетов. Определяет является ли долг - долгом, сформированным
// оплатой контрагента
//
Функция ЭтоОплата(ДанныеПоЗадолженности)

	ЗнакПокупатель 	= ?(ДанныеПоЗадолженности.ТипКонтрагента 	= Перечисления.СтатусыКонтрагентов.Покупатель, 1, -1);
	ЗнакРасчеты		= ?(ДанныеПоЗадолженности.РасчетыВозврат 	= Перечисления.РасчетыВозврат.Расчеты,		   1, -1);
	ЗнакДебет	    = ?(ДанныеПоЗадолженности.ВидЗадолженности	= Перечисления.ВидыЗадолженности.Дебиторская,  1, -1);

	ЗнакОтгрузки = ЗнакПокупатель * ЗнакРасчеты * ЗнакДебет;
	
	Если ЗнакОтгрузки = 1 Тогда
	
		Возврат Ложь;	
		
	Иначе
		
		Возврат Истина;	
		
	КонецЕсли;
	
КонецФункции 

Процедура ИнвертироватьПроводку(Проводка)
	
	// запоминаем данные по Дт
	ДанныеПоДт = Новый Структура();
	ДанныеПоДт.Вставить("СчетДт", 					Проводка.СчетДт);
	
	ДанныеПоДт.Вставить("ВалютаДт", 				Проводка.ВалютаДт);
	ДанныеПоДт.Вставить("НалоговоеНазначениеДт", 	Проводка.НалоговоеНазначениеДт);
	
	ДанныеПоДт.Вставить("ВалютнаяСуммаДт", 			Проводка.ВалютнаяСуммаДт);
	ДанныеПоДт.Вставить("КоличествоДт", 			Проводка.КоличествоДт);
	ДанныеПоДт.Вставить("СуммаНУДт", 				Проводка.СуммаНУДт);
	
	МаксКоличествоСубконто = -1;
	Для Каждого СтрокаСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
		МаксКоличествоСубконто = Проводка.СчетДт.ВидыСубконто.Индекс(СтрокаСубконто);
		
		ДанныеПоДт.Вставить("ВидСубконтоДт" + МаксКоличествоСубконто, СтрокаСубконто.ВидСубконто);
		ДанныеПоДт.Вставить("СубконтоДт"    + МаксКоличествоСубконто, Проводка.СубконтоДт[СтрокаСубконто.ВидСубконто]);
	КонецЦикла;

	// переносим данные из Кт в Дт
	Проводка.СчетДт 				= Проводка.СчетКт;
	
	Проводка.ВалютаДт 				= Проводка.ВалютаКт;
	Проводка.НалоговоеНазначениеДт  = Проводка.НалоговоеНазначениеКт;
	
	Проводка.ВалютнаяСуммаДт 		= - Проводка.ВалютнаяСуммаКт;
	Проводка.КоличествоДт 			= - Проводка.КоличествоКт;
	Проводка.СуммаНУДт				= - Проводка.СуммаНУКт;
	
	Проводка.СубконтоДт.Очистить();
	Для Каждого СтрокаСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
		ТекНомер = Проводка.СчетКт.ВидыСубконто.Индекс(СтрокаСубконто);
		Проводка.СубконтоДт[СтрокаСубконто.ВидСубконто] = Проводка.СубконтоКт[СтрокаСубконто.ВидСубконто];
	КонецЦикла;
	
	// восстанавливаем данные по ДТ в Кт
	Проводка.СчетКт 				= ДанныеПоДт.СчетДт;
	
	Проводка.ВалютаКт 				= ДанныеПоДт.ВалютаДт;
	Проводка.НалоговоеНазначениеКт  = ДанныеПоДт.НалоговоеНазначениеДт;
	
	Проводка.ВалютнаяСуммаКт 		= - ДанныеПоДт.ВалютнаяСуммаДт;
	Проводка.КоличествоКт 			= - ДанныеПоДт.КоличествоДт;
	Проводка.СуммаНУКт				= - ДанныеПоДт.СуммаНУДт;
	
	Проводка.СубконтоКт.Очистить();
	Для ТекНомер = 0 ПО МаксКоличествоСубконто Цикл
		Проводка.СубконтоКт[ДанныеПоДт["ВидСубконтоДт" + ТекНомер]] = ДанныеПоДт["СубконтоДт" + ТекНомер];
	КонецЦикла;
	
	// конвертируем балансовые суммы
	Проводка.Сумма = -Проводка.Сумма;
	
КонецПроцедуры

Процедура РассчитатьПропорциональныйНДС(Строка = Неопределено) Экспорт
	
	ПересчитыватьВсеСтроки = (Строка = Неопределено);
	
	Если мКоэффициентПропорциональногоНДС = Неопределено Тогда
		
		мКоэффициентПропорциональногоНДС = НалоговыйУчет.ПолучитьКоэффициентПропорциональногоНДС(Организация, Дата);
	
	КонецЕсли;
	
	Если   (НЕ мТекущаяСхемаНалогообложения.НДС = Истина)
		ИЛИ НЕ ОтражатьВБухгалтерскомУчете Тогда
		Если ПересчитыватьВсеСтроки Тогда
			Для каждого СтрокаРасшифровки Из СуммыДолга Цикл
				СтрокаРасшифровки.СуммаНДСПропорциональноКредит = 0;
			КонецЦикла;
		Иначе	
			Строка.СуммаНДСПропорциональноКредит = 0;
		КонецЕсли;
		возврат;
	КонецЕсли;
	
	Если ПересчитыватьВсеСтроки Тогда
		Для каждого СтрокаРасшифровки Из СуммыДолга Цикл
			Если НЕ СтрокаРасшифровки.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
			    СтрокаРасшифровки.СуммаНДСПропорциональноКредит = 0;
			Иначе	
				СтрокаРасшифровки.СуммаНДСПропорциональноКредит = СтрокаРасшифровки.СуммаНДС * мКоэффициентПропорциональногоНДС;
			КонецЕсли;
		КонецЦикла;
	Иначе	
		Если НЕ Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
			Строка.СуммаНДСПропорциональноКредит = 0;
		Иначе	
			Строка.СуммаНДСПропорциональноКредит = Строка.СуммаНДС * мКоэффициентПропорциональногоНДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мТекущаяСхемаНалогообложения = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация);
