Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух");

	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	ЕстьАналитикаПоОбособленнымПодразделениям = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);

	мУчетДенежныхСредствПоОбособленнымПодразделениям = Ложь;
	Если мУчетнаяПолитикаБУ.Количество() > 0 Тогда	
		мУчетДенежныхСредствПоОбособленнымПодразделениям = ЕстьАналитикаПоОбособленнымПодразделениям И мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если НЕ ЭтоГруппа И Не ЗначениеЗаполнено(Владелец) Тогда
			Сообщить("Не указана организация.",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
