

Процедура ОбновлениеСтатусовЭкспортированыхОбъектовВИСПеревозчиков() Экспорт
	ОбновлениеСтатустовЭкспортированыхОбъектов();

КонецПроцедуры

Процедура ОбновлениеСтатустовЭкспортированыхОбъектов() Экспорт
	Перем ВыборкаПеревозчиков;
	ВыборкаПеревозчиков = Справочники.Перевозчики.Выбрать();
	Пока ВыборкаПеревозчиков.Следующий() Цикл

		Если ВыборкаПеревозчиков.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		Если ВыборкаПеревозчиков.Идентификатор = "новаяпочта" Тогда
			НоваяПочтаОбновитьСтатусы(ВыборкаПеревозчиков.Ссылка);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры





Функция ПолучитьНастройкиОбменаДанными(Перевозчик) Экспорт
	НастройкиСтруктура = Новый Структура;

	НаборЗаписей = РегистрыСведений.НастройкиОбменаДаннымиСИСПеревозчиков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Перевозчик.Установить(Перевозчик);
	НаборЗаписей.Прочитать();

	Если Не НаборЗаписей.Количество() Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Перевозчик = Перевозчик;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;

	ТаблицаНаборЗаписей = НаборЗаписей.Выгрузить();
	Для каждого Колонка Из ТаблицаНаборЗаписей.Колонки Цикл
		НастройкиСтруктура.Вставить(Колонка.Имя, ТаблицаНаборЗаписей.Получить(0)[Колонка.Имя]);
	КонецЦикла;

	НастройкиОбмена = НастройкиСтруктура;

	Возврат НастройкиОбмена;

КонецФункции




Функция НоваяПочтаОтправитьЗапрос(ФайлXML) Экспорт
	АдресСервераОнлайнПроверки = "orders.novaposhta.ua";
	РесурсНаСервере = "/xml.php";
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервераОнлайнПроверки);
	Исключение
		ОбменДаннымиСИСПеревозчиковРаботаСДиалогами.ВывестиСообщениеОбОшибкеПользователю("Не удалось установить соединение с сервером онлайн-проверки:", ИнформацияОбОшибке().Описание);
		Возврат Неопределено;
	КонецПопытки;

	ФайлРезультата = ПолучитьИмяВременногоФайла();
	Попытка
		Соединение.ОтправитьДляОбработки(ФайлXML, РесурсНаСервере, ФайлРезультата);
		Соединение = Неопределено;
	Исключение
		Сообщить(ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
	КонецПопытки;

	ДеревоXML = НоваяПочтаПрочитатьФайлОтвет(ФайлРезультата);
	Возврат ДеревоXML;
КонецФункции

Функция НоваяПочтаПрочитатьФайлОтвет(ФайлОтвет)
	XMLДокумент = Новый ЧтениеXML;
	XMLДокумент.ОткрытьФайл(ФайлОтвет);

	ДеревоXMLДокумента = Новый ДеревоЗначений;
	ОписаниеСписокАтрибутов = Новый ОписаниеТипов("СписокЗначений");

	ДеревоXMLДокумента.Колонки.Очистить();
	ДеревоXMLДокумента.Колонки.Добавить("ТипУзла");
	ДеревоXMLДокумента.Колонки.Добавить("ИмяXMLЭлементаДанных");
	ДеревоXMLДокумента.Колонки.Добавить("ЗначениеXMLЭлементаДанных");
	ДеревоXMLДокумента.Колонки.Добавить("СписокАтрибутов", ОписаниеСписокАтрибутов);
	НоваяПочтаЗагрузитьРекурсивно(XMLДокумент, ДеревоXMLДокумента.Строки);

	Возврат ДеревоXMLДокумента;

КонецФункции

Процедура НоваяПочтаЗагрузитьРекурсивно(XMLДокумент, СтрокаДерева)
	Пока XMLДокумент.Прочитать() Цикл
		Если XMLДокумент.ТипУзла = ТипУзлаXML.ИнструкцияОбработки Тогда
			НоваяСрокаДерева = СтрокаДерева.Добавить();
			НоваяСрокаДерева.ТипУзла = XMLДокумент.ТипУзла;
			НоваяСрокаДерева.ИмяXMLЭлементаДанных = XMLДокумент.Имя;
			НоваяСрокаДерева.ЗначениеXMLЭлементаДанных = XMLДокумент.Значение;
		ИначеЕсли XMLДокумент.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НоваяСрокаДерева = СтрокаДерева.Добавить();
			НоваяСрокаДерева.ТипУзла = XMLДокумент.ТипУзла;
			НоваяСрокаДерева.ИмяXMLЭлементаДанных = XMLДокумент.Имя;
			НоваяСрокаДерева.ЗначениеXMLЭлементаДанных = XMLДокумент.Значение;
			Пока XMLДокумент.ПрочитатьАтрибут() Цикл
				НоваяСрокаДерева.СписокАтрибутов.Добавить(XMLДокумент.Имя, XMLДокумент.Значение);
			КонецЦикла;
			НоваяПочтаЗагрузитьРекурсивно(XMLДокумент, НоваяСрокаДерева.Строки);
		ИначеЕсли XMLДокумент.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Возврат; Прервать; Прервать;
		ИначеЕсли XMLДокумент.ТипУзла = ТипУзлаXML.Ничего Тогда
			Возврат; Прервать; Прервать;
		ИначеЕсли XMLДокумент.ТипУзла = ТипУзлаXML.Текст Тогда
			Если СтрокаДерева.Количество() = 0 И СтрокаДерева.Родитель <> Неопределено Тогда
				СтрокаДерева.Родитель.ЗначениеXMLЭлементаДанных = XMLДокумент.Значение;
			Иначе
				НоваяСрокаДерева = СтрокаДерева.Добавить();
				НоваяСрокаДерева.ТипУзла = XMLДокумент.ТипУзла;
				НоваяСрокаДерева.ИмяXMLЭлементаДанных = XMLДокумент.Имя;
				НоваяСрокаДерева.ЗначениеXMLЭлементаДанных = XMLДокумент.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура НоваяПочтаОбновитьСтатусы(Перевозчик)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(ТекущаяДата(), - 1));
	Запрос.УстановитьПараметр("КонПериода", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭкспортированныеОбъектыВИСПеревозчиков.Объект,
	|	ЭкспортированныеОбъектыВИСПеревозчиков.НомерДокумента,
	|	ЭкспортированныеОбъектыВИСПеревозчиков.СтатусДокумента
	|ИЗ
	|	РегистрСведений.ЭкспортированныеОбъектыВИСПеревозчиков КАК ЭкспортированныеОбъектыВИСПеревозчиков
	|ГДЕ
	|	(НЕ ЭкспортированныеОбъектыВИСПеревозчиков.СтатусДокумента.НеТребуетДальнейшегоОбновления
	|			ИЛИ ЭкспортированныеОбъектыВИСПеревозчиков.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыОтпарвленныхОбъектовВИСПеревозчика.ПустаяСсылка))
	|	И ЭкспортированныеОбъектыВИСПеревозчиков.ДатаОтправки МЕЖДУ &НачПериода И &КонПериода
	|	И ЭкспортированныеОбъектыВИСПеревозчиков.Перевозчик = &Перевозчик";
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НастройкиОбменаДанными = ПолучитьНастройкиОбменаДанными(Перевозчик);

	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла();
	ОбъектЗапись = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("utf-8", Неопределено, Ложь);
	ОбъектЗапись.ОткрытьФайл(ИмяФайлаЗапроса, ПараметрыЗаписиXML);
	ОбъектЗапись.ЗаписатьОбъявлениеXML();
	ОбъектЗапись.ЗаписатьНачалоЭлемента("file");
	ОбъектЗапись.ЗаписатьНачалоЭлемента("auth");
	ОбъектЗапись.ЗаписатьТекст(НастройкиОбменаДанными.КлючAPI);
	ОбъектЗапись.ЗаписатьКонецЭлемента();
	ОбъектЗапись.ЗаписатьНачалоЭлемента("tracking");
	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		ОбъектЗапись.ЗаписатьНачалоЭлемента("barcode");
		ОбъектЗапись.ЗаписатьТекст(СтрокаТаблицыДанных.НомерДокумента);
		ОбъектЗапись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ОбъектЗапись.ЗаписатьКонецЭлемента();
	ОбъектЗапись.ЗаписатьКонецЭлемента();
	ОбъектЗапись.Закрыть();

	ДеревоXML = НоваяПочтаОтправитьЗапрос(ИмяФайлаЗапроса);
	Если ДеревоXML = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДеревоXML.Строки[0].ИмяXMLЭлементаДанных = "errors" Тогда
		Возврат;
	КонецЕсли;

	Если ДеревоXML.Строки[0].ИмяXMLЭлементаДанных = "file" Тогда

		ТаблицаДанных.Колонки.Добавить("СтатусДокументаНовый");

		Для каждого СтрокаXML Из ДеревоXML.Строки[0].Строки Цикл
			number = СтрокаXML.СписокАтрибутов.НайтиПоЗначению("number");
			status = СтрокаXML.СписокАтрибутов.НайтиПоЗначению("status");
			state_id = СтрокаXML.СписокАтрибутов.НайтиПоЗначению("state_id");
			СтрокаПоnumber = ТаблицаДанных.Найти(number.Представление, "НомерДокумента");
			СтатусИзСправочника = Справочники.СтатусыОтпарвленныхОбъектовВИСПеревозчика.НайтиПоНаименованию(status.Представление);
			Если СтатусИзСправочника = Справочники.СтатусыОтпарвленныхОбъектовВИСПеревозчика.ПустаяСсылка() Тогда
				СтатусИзСправочникаОбъект = Справочники.СтатусыОтпарвленныхОбъектовВИСПеревозчика.СоздатьЭлемент();
				СтатусИзСправочникаОбъект.Владелец = Перевозчик;
				СтатусИзСправочникаОбъект.Наименование = status.Представление;
				НовСтрокаИД = СтатусИзСправочникаОбъект.ИДПеревозчика.Добавить();
				Если state_id <> Неопределено Тогда
					НовСтрокаИД.ИДПеревозчика = state_id.Представление;
				КонецЕсли;
				СтатусИзСправочникаОбъект.Записать();
				СтатусИзСправочника = СтатусИзСправочникаОбъект.Ссылка;
			Иначе
				Если state_id <> Неопределено Тогда
					Если СтатусИзСправочника.ИДПеревозчика.Найти(state_id.Представление, "ИДПеревозчика") = Неопределено Тогда
						СтатусИзСправочникаОбъект = СтатусИзСправочника.ПолучитьОбъект();
						НовСтрокаИД = СтатусИзСправочникаОбъект.ИДПеревозчика.Добавить();
						НовСтрокаИД.ИДПеревозчика = state_id.Представление;
						СтатусИзСправочникаОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			СтрокаПоnumber.СтатусДокументаНовый = СтатусИзСправочника;
		КонецЦикла;

	КонецЕсли;

	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		Если СтрокаТаблицыДанных.СтатусДокументаНовый <> СтрокаТаблицыДанных.СтатусДокумента Тогда
			МенеджерЗаписи = РегистрыСведений.ЭкспортированныеОбъектыВИСПеревозчиков.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = СтрокаТаблицыДанных.Объект;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.СтатусДокумента = СтрокаТаблицыДанных.СтатусДокументаНовый;
			МенеджерЗаписи.Записать();

			МенеджерЗаписи = РегистрыСведений.ИсторияСтатусовЭкспортированныхОбъектовВИСПеревозчиков.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Объект = СтрокаТаблицыДанных.Объект;
			МенеджерЗаписи.СтатусДокумента = СтрокаТаблицыДанных.СтатусДокументаНовый;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры




