Функция НайтиГруппуХарактеристик(Ном,МасХар) Экспорт 
	
	НайденаГруппа = "";
	ВыборкаГрупп = Справочники.ГруппыХарактеристик.Выбрать(,Ном);
	Пока ВыборкаГрупп.Следующий() Цикл
		//проверим все вхождения в группу
		Кол = 0;
		ДЛя Каждого Стр Из МасХар Цикл
			НайденаХарактеристика = ВыборкаГрупп.Характеристики.Найти(Стр,"Характеристика");
			Если НЕ НайденаХарактеристика = Неопределено Тогда
				Кол = Кол+1;
			КонецЕсли;
		КонецЦикла;
		Если Кол = МасХар.Количество() И ВыборкаГрупп.Характеристики.Количество()=МасХар.Количество() Тогда
			НайденаГруппа = ВыборкаГрупп.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат НайденаГруппа;
КонецФункции

Функция СформироватьШтрихКодГруппы(Знач ПрефиксШтучногоТовара = Неопределено, Знач ПрефиксВнутреннегоШтрихкода = Неопределено) Экспорт

	Если ПрефиксШтучногоТовара = Неопределено Тогда
		ПрефиксШтучногоТовара = СокрЛП(Константы.ПрефиксШтучногоТовара.Получить());
	КонецЕсли;

	Если ПрефиксВнутреннегоШтрихкода = Неопределено Тогда
		ПрефиксВнутреннегоШтрихкода = Константы.ПрефиксВнутреннегоШтрихкода.Получить();
	КонецЕсли;

	ПрефиксШтучногоТовара = ?(ПустаяСтрока(ПрефиксШтучногоТовара), "0", ПрефиксШтучногоТовара);
	ПрефиксВнутреннегоШтрихкода = Формат(ПрефиксВнутреннегоШтрихкода, "ЧЦ=2; ЧН=; ЧВН=");

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(РегШтрихКоды.Штрихкод, 5, 8)) КАК Код
	|ИЗ
	|	Справочник.ГруппыХарактеристик КАК РегШтрихКоды
	|ГДЕ
	|	РегШтрихКоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
	|	И РегШтрихКоды.Штрихкод ПОДОБНО ""2" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + "[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]""
	|");

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ТекКод = ?(Выборка.Код = NULL, 1, Мин(Число(Выборка.Код) + 1, 99999999));

	Штрихкод = "2" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + Формат(ТекКод, "ЧЦ=8; ЧВН=; ЧГ=");
	#Если Клиент Тогда
		Штрихкод = Штрихкод + РаботаСТорговымОборудованием.КонтрольныйСимволEAN(ШтрихКод, 13);
	#КонецЕсли

	Возврат Штрихкод;

КонецФункции // СформироватьШтрихКод()

функция ПолучитьГруппыСкладов(КодГруппы) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Группа
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.ЭтоГруппа
	               |	И Номенклатура.Родитель.Код = &Родитель");
	
	Запрос.УстановитьПараметр("Родитель",КодГруппы);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Массив = Рез.ВыгрузитьКолонку("Группа");
	Возврат Массив;	
	
конецФункции       

функция ПолучитьНоменклатуруПо(Номенклатура) Экспорт 		
		
	Если ЗначениеЗаполнено(Номенклатура.Нк) Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		 |	Номенклатура.Ссылка КАК Ссылка
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |ГДЕ
		 |	Номенклатура.Код = &Код"; 
		
		Запрос.УстановитьПараметр("Код",Номенклатура.Нк);
		Возврат Запрос.Выполнить().Выгрузить()[0].Ссылка;		 
	 
	 ИначеЕсли ЗначениеЗаполнено(Номенклатура.ГруппаХарактеристик) Тогда
		 
		Возврат Номенклатура.ГруппаХарактеристик.Ссылка.Владелец;
				
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	    	
КонецФункции


функция ПолучитьКомплектующиеПоШтрихкоду(ШтрихКод) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолучимШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |				Штрихкоды.Штрихкод КАК Штрихкод
	               |			ИЗ
	               |				РегистрСведений.Штрихкоды КАК Штрихкоды) КАК ПолучимШтрихкодыНоменклатуры
	               |			ПО КомплектующиеНоменклатуры.ХарактеристикаКомплектующей = ПолучимШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры
	               |		ПО Штрихкоды.ХарактеристикаНоменклатуры = КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	Штрихкоды.Штрихкод = &Штрихкод
	               |	И Штрихкоды.Владелец.ВидНоменклатуры.Код = ""000000010""";
	
	Запрос.УстановитьПараметр("ШтрихКод",ШтрихКод);  
	
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Штрихкод");
	
	Если Рез.Количество() > 0 Тогда 
		Возврат Рез;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции