// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("Контакт", ПараметрКоманды);
	// Для платформы 8.3.
	// ОткрытьФорму("Обработка.МИКО_стЖурналЗвонков.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка); //.
	
	// Для платформы 8.2.
	ОткрытьФорму("Обработка.МИКО_стЖурналЗвонков.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
// #КонецОбласти