#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Составляет список возможных вариантов отображения
//
// Параметры: 
//  Отчет - объект отчета.
//
// Возвращаемое значение:
//  спиок значений.
//
Функция ПолучитьСписокВариантовОтображенияОтчета() Экспорт

	СписокВариантовОтображения = Новый СписокЗначений;
	СписокВариантовОтображения.Добавить("СводнаяТаблица","Сводная таблица");
	СписокВариантовОтображения.Добавить("Диаграмма","Диаграмма");
	СписокВариантовОтображения.Добавить("Таблица","Таблица");
	Возврат СписокВариантовОтображения

КонецФункции // ПолучитьСписокВариантовОтображенияОтчета

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = "Штатное расписание организации";
	ОтчетДиаграмма.ИмяРегистра = "-";
	ОтчетДиаграмма.мНазваниеОтчета = "Кадровый план";
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.Владелец КАК Организация,
	|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ШтатноеРасписаниеОрганизаций.Должность КАК Должность,
	|	ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
	|	ШтатноеРасписаниеОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
	|	ШтатноеРасписаниеОрганизаций.ВалютаТарифнойСтавки КАК ВалютаТарифнойСтавки,
	|	ШтатноеРасписаниеОрганизаций.КоличествоСтавок КАК КоличествоСтавок,
	|	ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка КАК МинимальнаяТарифнаяСтавка,
	|	ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка КАК МаксимальнаяТарифнаяСтавка,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Работники.ЗанимаемыхСтавок КОНЕЦ КАК ЗанятоСтавок,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL  ТОГДА ШтатноеРасписаниеОрганизаций.КоличествоСтавок ИНАЧЕ ШтатноеРасписаниеОрганизаций.КоличествоСтавок - Работники.ЗанимаемыхСтавок КОНЕЦ КАК Вакантно
	|ИЗ
	|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаАктуальности, ) КАК ШтатноеРасписаниеОрганизаций
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|        (ВЫБРАТЬ
	|			СУММА(Работники.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
	|			Работники.ПодразделениеОрганизации,
	|			Работники.Должность
	|           ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, ) КАК Работники
	|			СГРУППИРОВАТЬ ПО Работники.ПодразделениеОрганизации, Работники.Должность) КАК Работники
	|		ПО ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации = Работники.ПодразделениеОрганизации И ШтатноеРасписаниеОрганизаций.Должность = Работники.Должность
	|		}
	|
	|ГДЕ ШтатноеРасписаниеОрганизаций.КоличествоСтавок <> 0 или ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ Работники.ЗанимаемыхСтавок КОНЕЦ <> 0
	|
	|ИТОГИ СУММА(КоличествоСтавок), СУММА(ЗанятоСтавок), СУММА(Вакантно) ПО
	|	ОБЩИЕ
	|
	|{ВЫБРАТЬ
	|	Организация.* КАК Организация,
	|	ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	Должность.* КАК Должность,
	|	ГрафикРаботы.* КАК ГрафикРаботы,
	|	ВидТарифнойСтавки.* КАК ВидТарифнойСтавки,
	|	ВалютаТарифнойСтавки.* КАК ВалютаТарифнойСтавки,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Работники.ЗанимаемыхСтавок КОНЕЦ КАК ЗанятоСтавок,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL  ТОГДА ШтатноеРасписаниеОрганизаций.КоличествоСтавок ИНАЧЕ ШтатноеРасписаниеОрганизаций.КоличествоСтавок - Работники.ЗанимаемыхСтавок КОНЕЦ КАК Вакантно,
	|	МинимальнаяТарифнаяСтавка,
	|	МаксимальнаяТарифнаяСтавка
	|}
	|
	|{ГДЕ
	|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	ШтатноеРасписаниеОрганизаций.Должность.* КАК Должность,
	|	ШтатноеРасписаниеОрганизаций.ГрафикРаботы.* КАК ГрафикРаботы,
	|	ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки.* КАК ВидТарифнойСтавки,
	|	ШтатноеРасписаниеОрганизаций.ВалютаТарифнойСтавки.* КАК ВалютаТарифнойСтавки,
	|	МинимальнаяТарифнаяСтавка,
	|	МаксимальнаяТарифнаяСтавка,
	|	КоличествоСтавок,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Работники.ЗанимаемыхСтавок КОНЕЦ КАК ЗанятоСтавок,
	|	ВЫБОР КОГДА (Работники.ЗанимаемыхСтавок) ЕСТЬ NULL  ТОГДА ШтатноеРасписаниеОрганизаций.КоличествоСтавок ИНАЧЕ ШтатноеРасписаниеОрганизаций.КоличествоСтавок - Работники.ЗанимаемыхСтавок КОНЕЦ КАК Вакантно
	|}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	ПодразделениеОрганизации.*,
	|	Должность.*,
	|	ГрафикРаботы.*,
	|	ВидТарифнойСтавки.*,
	|	ВалютаТарифнойСтавки.*
	|}
	|
	|{ИТОГИ ПО 
	|	Организация.*,
	|	ПодразделениеОрганизации.*,
	|	Должность.*,
	|	ГрафикРаботы.*,
	|	ВидТарифнойСтавки.*,
	|	ВалютаТарифнойСтавки.*
	|}
	|";
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Должность");
	
	// список показателей и форматы их предстовления
	ОбщийОтчет.ЗаполнитьПоказатели("КоличествоСтавок", "Количество ставок (всего)", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("ЗанятоСтавок", "Занято ставок", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("Вакантно", "Вакантно", Истина, "ЧЦ=15; ЧДЦ=2");
	ОтчетДиаграмма.ЗаполнитьПоказатели("КоличествоСтавок", "Количество ставок (всего)", Истина, "ЧЦ=15; ЧДЦ=2");
	ОтчетДиаграмма.ЗаполнитьПоказатели("ЗанятоСтавок", "Занято ставок", Истина, "ЧЦ=15; ЧДЦ=2");
	ОтчетДиаграмма.ЗаполнитьПоказатели("Вакантно", "Вакантно", Ложь, "ЧЦ=15; ЧДЦ=2");
	
	// представление полей
	СтруктураПредставлениеПолей = Новый Структура();
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение");
	СтруктураПредставлениеПолей.Вставить("ВидТарифнойСтавки", "Вид тарифной ставки");
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботы", "График работы");
	СтруктураПредставлениеПолей.Вставить("ВалютаТарифнойСтавки", "Валюта тарифной ставки");
	СтруктураПредставлениеПолей.Вставить("МинимальнаяТарифнаяСтавка", "Минимальная тарифная ставка");
	СтруктураПредставлениеПолей.Вставить("МаксимальнаяТарифнаяСтавка", "Максимальная тарифная ставка");
	СтруктураПредставлениеПолей.Вставить("ЗанятоСтавок", "Занято ставок");
	СтруктураПредставлениеПолей.Вставить("КоличествоСтавок", "Количество ставок (всего)");
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ПодразделениеОрганизации");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// очистка автозаполненных полей построителя
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	
	// копирование настроек построителя
	ОтчетДиаграмма.ПостроительОтчета.Текст = ПостроительОтчета.Текст;
	ОтчетДиаграмма.ПостроительОтчета.УстановитьНастройки(ПостроительОтчета.ПолучитьНастройки());
	
	// параметры отчета
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	ОбщийОтчет.мРежимВводаПериода = 1; // Дата
	ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("КоличествоСтавок", Новый Структура());
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ЗанятоСтавок", Новый Структура());
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Вакантно", Новый Структура());
	
	ОтчетДиаграмма.мВыбиратьИмяРегистра = Ложь;
	ОтчетДиаграмма.мРежимВводаПериода = 1;
	ОтчетДиаграмма.мВыбиратьИспользованиеСвойств = Ложь;
	ОтчетДиаграмма.мСтруктураСвязиПоказателейИИзмерений.Вставить("КоличествоСтавок", Новый Структура());
	ОтчетДиаграмма.мСтруктураСвязиПоказателейИИзмерений.Вставить("ЗанятоСтавок", Новый Структура());
	ОтчетДиаграмма.мСтруктураСвязиПоказателейИИзмерений.Вставить("Вакантно", Новый Структура());
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаПослеАктуальности", ОбщийОтчет.ДатаКон+ 1);
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

// Выполняет запрос и формирует диаграмму-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьДиаграмму(Диаграмма) Экспорт

	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОтчетДиаграмма.ДатаКон);
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаПослеАктуальности", ОтчетДиаграмма.ДатаКон+ 1);
	ОтчетДиаграмма.СформироватьОтчет(Диаграмма);

КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьСводнуюТаблицу(ДокументРезультат) Экспорт

	ПостроительОтчета = ПолучитьПостроительОтчета();
	
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	ПостроительОтчета.Параметры.Вставить("ДатаПослеАктуальности", ОбщийОтчет.ДатаКон+ 1);

	ПостроительОтчета.Параметры.Вставить("ДатаНач", ОбщийОтчет.ДатаНач);
	Если ОбщийОтчет.ДатаКон <> '00010101000000' Тогда
		Если ОбщийОтчет.мРежимВводаПериода = 1 Тогда
			ПостроительОтчета.Параметры.Вставить("ДатаКон", НачалоДня(ОбщийОтчет.ДатаКон + 60*60*24));
		Иначе
			ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ОбщийОтчет.ДатаКон ));
		КонецЕсли;
	Иначе
		ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
	КонецЕсли;
	
	ПостроительОтчета.Выполнить();
	ДокументРезультат.ИсточникДанных = ПостроительОтчета.Результат;
	ОбновлятьОформлениеСводнойТаблицы = ДокументРезультат.Данные.Количество() = 0 и ДокументРезультат.Строки.Количество() = 0;
	Если ОбновлятьОформлениеСводнойТаблицы Тогда
		Для ИндексПоля = 0 По ДокументРезультат.Поля.Количество() - 1 Цикл
			ПолеТаблицы = ДокументРезультат.Поля[ИндексПоля];
			Если ПолеТаблицы.Ресурс Тогда
				ДокументРезультат.Данные.Добавить(ПолеТаблицы)
			Иначе
				ДокументРезультат.Строки.Добавить(ПолеТаблицы)
			КонецЕсли;
		КонецЦикла;
		ДокументРезультат.Колонки.Добавить(ДокументРезультат.Данные);
	КонецЕсли;
	
КонецПроцедуры


// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет = Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры
#КонецЕсли
