Перем мУдалятьДвижения;
Перем мДлинаСуток;
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//


Процедура Автозаполнение(Регистратор, Сотрудники) Экспорт
	
	
	Отказ = Ложь;
	
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке("ПоРеквизитамДокумента").Выбрать();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям().Выбрать();
	ЗафиксироватьТранзакцию();
	
	// Создадим рабочие наборы записей (
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		Если не Отказ Тогда
			
			Если ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
				// ничего не меняем
				Продолжить;
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
				мПериод = ВыборкаПоНачислениям.ДатаНачала-1;
				мДействует	= Ложь;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
				мПериод = ВыборкаПоНачислениям.ДатаНачала;
				мДействует	= Истина;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				мПериод = ВыборкаПоНачислениям.ДатаНачала;
				мДействует	= Истина;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
				// движеие на вечер предыдущих суток
				мПериод = ВыборкаПоНачислениям.ДатаНачала-1;
				мДействует	= Ложь;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	
	// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
	Если Отказ Тогда
		Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
		Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	КонецЕсли;

	
	АвтозаполнениеНачислений(Регистратор, НачисленияДо, Сотрудники);
	АвтозаполнениеНачислений(Регистратор, НачисленияПосле, Сотрудники);
	
	// Все закончено - удаляем движения
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
    Записать();

КонецПроцедуры

Процедура АвтозаполнениеНачислений(Регистратор, Начисления, Сотрудники)
		//Получим список видов расчета, входящих в базу индексации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.ВидРасчета
		|ИЗ
		|	ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК Начисления
		|ГДЕ
		| Начисления.Ссылка.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты) 
		|";
		
	МассивБазаИндексации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамПериодРегистрации" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамСотрудник",Сотрудники); 
	Запрос.УстановитьПараметр("парамПустойСотрудник",Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("парамНачало" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамКонец" , КонецМесяца(Дата));
	Если Начисления = НачисленияДо Тогда
		Запрос.УстановитьПараметр("парамСрез" , НачалоДня(НачалоМесяца(Дата)-1));
		Запрос.УстановитьПараметр("парамСРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты);
	Иначе	
        Запрос.УстановитьПараметр("парамСрез" , КонецМесяца(Дата));
		Запрос.УстановитьПараметр("парамСРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ПустаяСсылка());
	КонецЕсли;	
	Запрос.УстановитьПараметр("парамБазаИндексации" , МассивБазаИндексации);
	Запрос.УстановитьПараметр("парамРегистратор" , Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);

	МассивДействий = Новый Массив(2);
	МассивДействий[0] = Перечисления.ВидыДействияСНачислением.Изменить;
	МассивДействий[1] = Перечисления.ВидыДействияСНачислением.Начать;
	Запрос.УстановитьПараметр("парамДействиеНачатьИзменить", МассивДействий);
	Запрос.УстановитьПараметр("парамПрекратить", Перечисления.ВидыДействияСНачислением.Прекратить);
	Запрос.УстановитьПараметр("парамПоДням"     , Перечисления.ВидыУчетаВремени.ПоДням);
	
	Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамВалютаУчета" , ?(ОтражатьВРеглУчете,Константы.ВалютаРегламентированногоУчета.Получить(),Константы.ВалютаУправленческогоУчета.Получить()));
	Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты" , ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	Запрос.УстановитьПараметр("Ежемесячно", Перечисления.ХарактерВыплатыПоДоговору.Ежемесячно);
	Запрос.УстановитьПараметр("парамИндивидуальныйПоказатель",Перечисления.ВидыПоказателейСхемМотивации.Индивидуальный);		
	Запрос.УстановитьПараметр("парамПоПодраделению",Перечисления.ВидыПоказателейСхемМотивации.ПоПодразделению);
	
	
	//	ВТСписокРаботникиИЗамены
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка) ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ КАК Сотрудник,
		|	Сотрудники.Ссылка КАК Назначение
		|ПОМЕСТИТЬ ВТСписокРаботникиИЗамены	
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|ГДЕ	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=&парамПустойСотрудник ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ В ( &парамСотрудник )
		|
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Замены.Сотрудник КАК Сотрудник,
		|	Замены.ЗаменаСотрудник КАК Назначение
		|ИЗ Документ.ЗаменыОрганизаций КАК Замены
		|ГДЕ	Замены.Сотрудник В ( &парамСотрудник )
		|	И	НАЧАЛОПЕРИОДА(Замены.ДатаНачала,МЕСЯЦ)<= &парамНачало
		|	И	КОНЕЦПЕРИОДА(Замены.ДатаОкончания,МЕСЯЦ)>= &парамНачало
		|	И	Замены.Проведен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТСписокРаботникиИЗамены = "ВТСписокРаботникиИЗамены";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСписокРаботникиИЗамены";
	
	//	ВТЗамены
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части РаботникиОрганизации которые кого-либо заменяли
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Замены.Сотрудник КАК Сотрудник,
		|	Замены.ЗаменаСотрудник КАК Назначение,
		|	Замены.Ссылка			КАК ДокументОснование,
		|	ВЫБОР КОГДА Замены.ДатаНачала < &парамНачало ТОГДА &парамНачало ИНАЧЕ Замены.ДатаНачала КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР КОГДА Замены.ДатаОкончания > &парамКонец ТОГДА &парамКонец ИНАЧЕ Замены.ДатаОкончания КОНЕЦ КАК ДатаОкончания,
		|	Замены.ВидРасчета					КАК ВидРасчета,
		|	Замены.ЗаменаГрафикРаботы				КАК ГрафикРаботы,
		|	Замены.ЗаменаПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	Замены.ЗаменаПодразделение				КАК ПодразделениеУпр,
		|	Замены.ЗаменаДолжность					КАК Должность
		|ПОМЕСТИТЬ ВТЗамены	
		|ИЗ Документ.ЗаменыОрганизаций КАК Замены
		|
		|ГДЕ	Замены.Сотрудник В ( &парамСотрудник )                             
		|	И	Замены.ДатаНачала <= &парамКонец
		|	И	Замены.ДатаОкончания >= &парамНачало
		|	И	Замены.Проведен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТЗамены = "ВТЗамены";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗамены";
	
	//	ВТСписокРаботники
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части, их внутренние совместительства БЕЗ ЗАМЕН
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=&парамПустойСотрудник ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ КАК Сотрудник,
		|	Сотрудники.Ссылка КАК Назначение
		|ПОМЕСТИТЬ ВТСписокРаботники	
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|ГДЕ	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка) ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ
		|			В ( &парамСотрудник )
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТСписокРаботники = "ВТСписокРаботники";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСписокРаботники";
	
	//	ВТДвиженияРегл
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.Сотрудник					КАК Сотрудник,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|	Работники.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы				КАК ГрафикРаботы,
		|	Работники.Должность					КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияРегл	
		|ИЗ (
		|	ВЫБРАТЬ 
		|		РаботникиОрганизаций.Организация				КАК Организация,
		|		РаботникиОрганизаций.Сотрудник					КАК Сотрудник,
		|		&парамНачало									КАК ДатаНачала,
		|		РаботникиОрганизаций.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамСрез, Организация = &парамОрганизация И Сотрудник В ( ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК СписокРаботников )
		|			) КАК РаботникиОрганизаций
		|	ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.Организация				КАК Организация,
		|		РаботникиОрганизаций.Сотрудник					КАК Сотрудник,
		|		РаботникиОрганизаций.Период						КАК ДатаНачала,
		|		РаботникиОрганизаций.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ		РаботникиОрганизаций.Сотрудник В ( ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК СписокРаботников )
		|		И	РаботникиОрганизаций.Организация = &парамОрганизация
		|		И	НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &парамНачало
		|		И	РаботникиОрганизаций.Период > &парамНачало
		|		И	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|   ) КАК Работники
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Окончания
		|ПО  НАЧАЛОПЕРИОДА(Окончания.Период, МЕСЯЦ) = &парамНачало // все движения за месяц
		|	И	Окончания.Организация = Работники.Организация
		|	И	Окончания.Сотрудник = Работники.Сотрудник
		|	И	Работники.ДатаНачала < Окончания.Период 
		|       
		|СГРУППИРОВАТЬ ПО
		|	Работники.Сотрудник,
		|	Работники.ДатаНачала,
		|	Работники.ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы,
		|	Работники.Должность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ДатаНачала
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияРегл";
	КонецЕсли;
	
	//	ВТДвиженияУпр
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.ФизЛицо					КАК ФизЛицо,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|	Работники.Подразделение				КАК Подразделение,
		|	Работники.ГрафикРаботы				КАК ГрафикРаботы,
		|	Работники.Должность					КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияУпр	
		|ИЗ (
		|	ВЫБРАТЬ 
		|		РаботникиОрганизаций.ФизЛицо					КАК ФизЛицо,
		|		&парамНачало									КАК ДатаНачала,
		|		РаботникиОрганизаций.Подразделение				КАК Подразделение,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.Работники.СрезПоследних(&парамНачало, ФизЛицо В ( ВЫБРАТЬ Назначение.ФизЛицо ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК СписокРаботников )
		|			) КАК РаботникиОрганизаций
		|	ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.ФизЛицо					КАК ФизЛицо,
		|		РаботникиОрганизаций.Период						КАК ДатаНачала,
		|		РаботникиОрганизаций.Подразделение				КАК Подразделение,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.Работники КАК РаботникиОрганизаций
		|	ГДЕ		РаботникиОрганизаций.ФизЛицо В ( ВЫБРАТЬ Назначение.ФизЛицо ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК СписокРаботников )
		|		И	НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &парамНачало
		|		И	РаботникиОрганизаций.Период > &парамНачало
		|		И	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|   ) КАК Работники
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Окончания
		|ПО  НАЧАЛОПЕРИОДА(Окончания.Период, МЕСЯЦ) = &парамНачало // все движения за месяц
		|	И	Окончания.ФизЛицо = Работники.ФизЛицо
		|	И	Работники.ДатаНачала < Окончания.Период 
		|       
		|СГРУППИРОВАТЬ ПО
		|	Работники.ФизЛицо,
		|	Работники.ДатаНачала,
		|	Работники.Подразделение,
		|	Работники.ГрафикРаботы,
		|	Работники.Должность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо,
		|	ДатаНачала
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияУпр";

	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДвиженияУпр";
	
	//	ВТДвиженияРаботников
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Работники.Сотрудник					КАК Сотрудник,
		|	Работники.Назначение				КАК Назначение,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ(Окончание.ДатаОкончания)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТДвижения	
		|ИЗ (
		|	ВЫБРАТЬ
		|		РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|		РаботникиПоДокументу.Назначение		КАК Назначение,
		|		РаботникиРегл.ДатаНачала				КАК ДатаНачала
		|	ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|	ПО РаботникиРегл.Сотрудник = РаботникиПоДокументу.Назначение
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|		РаботникиПоДокументу.Назначение		КАК Назначение,
		|		РаботникиУпр.ДатаНачала				КАК ДатаНачала
		|	ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|	ПО РаботникиУпр.ФизЛицо = РаботникиПоДокументу.Назначение.ФизЛицо
		| ) КАК Работники
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ
		|			РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|			РаботникиПоДокументу.Назначение		КАК Назначение,
		|			РаботникиРегл.ДатаОкончания				КАК ДатаОкончания
		|		ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|		ПО РаботникиРегл.Сотрудник = РаботникиПоДокументу.Назначение
		|
		|		ОБЪЕДИНИТЬ
		|		ВЫБРАТЬ
		|			РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|			РаботникиПоДокументу.Назначение		КАК Назначение,
		|			РаботникиУпр.ДатаОкончания				КАК ДатаОкончания
		|		ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|		ПО РаботникиУпр.ФизЛицо = РаботникиПоДокументу.Назначение.ФизЛицо
		|   ) Окончание
		|   ПО		Работники.Назначение = Окончание.Назначение
		|   	И	Работники.ДатаНачала <= Окончание.ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	Работники.Сотрудник,
		|	Работники.Назначение,
		|	Работники.ДатаНачала
		| ";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();

		
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыДвижения.Сотрудник				КАК Сотрудник,
		|	ДатыДвижения.Назначение				КАК Назначение,
		|	ДатыДвижения.ДатаНачала				КАК ДатаНачала,
		|	ДатыДвижения.ДатаОкончания			КАК ДатаОкончания,
		|	РаботникиРегл.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	РаботникиУпр.Подразделение				КАК ПодразделениеУпр,
		|	ЕСТЬNULL(РаботникиРегл.ГрафикРаботы,РаботникиУпр.ГрафикРаботы)	КАК ГрафикРаботы,
		|	ЕСТЬNULL(РаботникиРегл.Должность,РаботникиУпр.Должность)		КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияРаботников	
		|ИЗ ВТДвижения КАК ДатыДвижения
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|ПО		ДатыДвижения.Назначение = РаботникиРегл.Сотрудник
		|	И	ДатыДвижения.ДатаНачала <= РаботникиРегл.ДатаОкончания 
		|	И	РаботникиРегл.ДатаНачала <= ДатыДвижения.ДатаОкончания 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|ПО		ДатыДвижения.Сотрудник.ФизЛицо = РаботникиУпр.ФизЛицо
		|	И	ДатыДвижения.ДатаНачала <= РаботникиУпр.ДатаОкончания 
		|	И	РаботникиУпр.ДатаНачала <= ДатыДвижения.ДатаОкончания 
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияРаботников";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДвиженияРаботников";
	
	//	ВТПлановыеНачисления
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру ПлановыеНачисленияРаботниковОрганизаций (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|	ВЫБРАТЬ
		|		ПлановыеНачисления.Сотрудник 				КАК Сотрудник,
		|		&парамНачало								КАК ДатаНачала,
		|		КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)			КАК ДатаОкончания,
		|		ПлановыеНачисления.ОсновноеНачисление 		КАК ОсновноеНачисление, 
		|		ПлановыеНачисления.ВидНачисления			КАК ВидНачисления, 
		|		ПлановыеНачисления.ВидРасчета 				КАК ВидРасчета,
		|		ПлановыеНачисления.Действие,
		|		ПлановыеНачисления.ДокументОснование,
		|		ПлановыеНачисления.Показатель1,
		|		ПлановыеНачисления.Показатель2,
		|		ПлановыеНачисления.Показатель3,
		|		ПлановыеНачисления.Показатель4,
		|		ПлановыеНачисления.Показатель5,
		|		ПлановыеНачисления.Показатель6,
		|		ПлановыеНачисления.Валюта1,
		|		ПлановыеНачисления.Валюта2,
		|		ПлановыеНачисления.Валюта3,
		|		ПлановыеНачисления.Валюта4,
		|		ПлановыеНачисления.Валюта5,
		|		ПлановыеНачисления.Валюта6,
		|		ПлановыеНачисления.ВидУчетаВремениДляСредней
		|	ПОМЕСТИТЬ ВТПлановыеНачисления	
		|	ИЗ (
		|		ВЫБРАТЬ
		|			Начисления.Организация			КАК Организация,
		|			Начисления.Сотрудник			КАК Сотрудник,
		|			Начисления.ВидРасчетаИзмерение	КАК ВидРасчетаИзмерение,
		|			Начисления.ВидНачисления		КАК ВидНачисления,
		|			&парамНачало					КАК ДатаНачала,
		|			ВЫБОР	КОГДА Начисления.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ							КАК ОсновноеНачисление, // Оклад
		|			Начисления.ВидРасчета			КАК ВидРасчета,
		|			Начисления.Действие				КАК Действие,
		|			Начисления.ДокументОснование	КАК ДокументОснование,
		|			Начисления.Показатель1	КАК Показатель1,
		|			Начисления.Показатель2	КАК Показатель2,
		|			Начисления.Показатель3	КАК Показатель3,
		|			Начисления.Показатель4	КАК Показатель4,
		|			Начисления.Показатель5	КАК Показатель5,
		|			Начисления.Показатель6	КАК Показатель6,
		|			Начисления.Валюта1		КАК Валюта1,
		|			Начисления.Валюта2		КАК Валюта2,
		|			Начисления.Валюта3		КАК Валюта3,
		|			Начисления.Валюта4		КАК Валюта4,		
		|			Начисления.Валюта5		КАК Валюта5,		
		|			Начисления.Валюта6		КАК Валюта6,		
		|			Начисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|
		|			ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|					&парамСрез, Организация = &парамОрганизация И  
		|			    	Сотрудник В (ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК Работники)
		|				) КАК Начисления
		|	
		|			ГДЕ Начисления.Актуальность
		|	) КАК ПлановыеНачисления		

		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ОсновноеНачисление,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТПлановыеНачисления = "ВТПлановыеНачисления";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПлановыеНачисления";
	
	//	ВТШтатноеРасписание
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру НадбавкиПоШтатномуРасписаниюОрганизаций (по всем подразделениям которые принадлежат организации)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ШтатныеНадбавки.Должность					КАК Должность,
		|		ШтатныеНадбавки.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		ШтатныеНадбавки.ДатаНачала					КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|		ШтатныеНадбавки.ВидНадбавки	КАК ВидРасчета,
		|		ШтатныеНадбавки.Показатель1	КАК Показатель1,
		|		ШтатныеНадбавки.Показатель2	КАК Показатель2,
		|		ШтатныеНадбавки.Показатель3	КАК Показатель3,
		|		ШтатныеНадбавки.Показатель4	КАК Показатель4,		
		|		ШтатныеНадбавки.Показатель5	КАК Показатель5,		
		|		ШтатныеНадбавки.Показатель6	КАК Показатель6,		
		|		ШтатныеНадбавки.Валюта1		КАК Валюта1,
		|		ШтатныеНадбавки.Валюта2		КАК Валюта2,
		|		ШтатныеНадбавки.Валюта3		КАК Валюта3,
		|		ШтатныеНадбавки.Валюта4		КАК Валюта4,		
		|		ШтатныеНадбавки.Валюта5		КАК Валюта5,		
		|		ШтатныеНадбавки.Валюта6		КАК Валюта6		
		|
		|	ПОМЕСТИТЬ ВТШтатноеРасписание	
		|	ИЗ (
		|			ВЫБРАТЬ
		|				Надбавки.Должность					КАК Должность,
		|				Надбавки.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|				Надбавки.ВидНадбавки				КАК ВидНадбавки,
		|				&парамНачало			КАК ДатаНачала,
		|				Надбавки.Показатель1	КАК Показатель1,
		|				Надбавки.Показатель2	КАК Показатель2,
		|				Надбавки.Показатель3	КАК Показатель3,
		|				Надбавки.Показатель4	КАК Показатель4,		
		|				Надбавки.Показатель5	КАК Показатель5,		
		|				Надбавки.Показатель6	КАК Показатель6,		
		|				Надбавки.Валюта1		КАК Валюта1,
		|				Надбавки.Валюта2		КАК Валюта2,
		|				Надбавки.Валюта3		КАК Валюта3,
		|				Надбавки.Валюта4		КАК Валюта4,		
		|				Надбавки.Валюта5		КАК Валюта5,		
		|				Надбавки.Валюта6		КАК Валюта6		
		|			ИЗ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СрезПоследних(&парамНачало, ПодразделениеОрганизации.Владелец = &парамОрганизация) КАК Надбавки
		|			ГДЕ		Надбавки.Показатель1 > 0 
		|				ИЛИ	Надбавки.Показатель2 > 0 
		|				ИЛИ	Надбавки.Показатель3 > 0 		
		|				ИЛИ	Надбавки.Показатель4 > 0
		|
		|			ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ
		|				Надбавки.Должность		КАК Должность,
		|				Надбавки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|				Надбавки.ВидНадбавки	КАК ВидНадбавки,
		|				Надбавки.Период			КАК ДатаНачала,
		|				Надбавки.Показатель1	КАК Показатель1,
		|				Надбавки.Показатель2	КАК Показатель2,
		|				Надбавки.Показатель3	КАК Показатель3,
		|				Надбавки.Показатель4	КАК Показатель4,		
		|				Надбавки.Показатель5	КАК Показатель5,		
		|				Надбавки.Показатель6	КАК Показатель6,		
		|				Надбавки.Валюта1		КАК Валюта1,
		|				Надбавки.Валюта2		КАК Валюта2,
		|				Надбавки.Валюта3		КАК Валюта3,
		|				Надбавки.Валюта4		КАК Валюта4,		
		|				Надбавки.Валюта5		КАК Валюта5,		
		|				Надбавки.Валюта6		КАК Валюта6		
		|			ИЗ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК Надбавки
		|			ГДЕ		НАЧАЛОПЕРИОДА(Надбавки.Период,МЕСЯЦ) = &парамНачало И Надбавки.Период > &парамНачало
		|				И	Надбавки.ПодразделениеОрганизации.Владелец = &парамОрганизация
		|				И	(Надбавки.Показатель1 > 0 
		|				ИЛИ	Надбавки.Показатель2 > 0 
		|				ИЛИ	Надбавки.Показатель3 > 0 		
		|				ИЛИ	Надбавки.Показатель4 > 0)
		|	) КАК ШтатныеНадбавки
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК Окончания
		|	ПО		НАЧАЛОПЕРИОДА(Окончания.Период) = &парамНачало // все движения за месяц
		|		И	Окончания.ПодразделениеОрганизации.Владелец = &парамОрганизация
		|		И	ШтатныеНадбавки.ДатаНачала < Окончания.Период
		|			
		|	СГРУППИРОВАТЬ ПО
		|		ШтатныеНадбавки.Должность,
		|		ШтатныеНадбавки.ПодразделениеОрганизации,
		|		ШтатныеНадбавки.ВидНадбавки,
		|		ШтатныеНадбавки.ДатаНачала,
		|		ШтатныеНадбавки.Показатель1,
		|		ШтатныеНадбавки.Показатель2,
		|		ШтатныеНадбавки.Показатель3,
		|		ШтатныеНадбавки.Показатель4,		
		|		ШтатныеНадбавки.Показатель5,		
		|		ШтатныеНадбавки.Показатель6,		
		|		ШтатныеНадбавки.Валюта1,
		|		ШтатныеНадбавки.Валюта2,
		|		ШтатныеНадбавки.Валюта3,
		|		ШтатныеНадбавки.Валюта4,		
		|		ШтатныеНадбавки.Валюта5,		
		|		ШтатныеНадбавки.Валюта6		
		|";			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТШтатноеРасписание = "ВТШтатноеРасписание";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТШтатноеРасписание";

	//	ВТВсеНачисленияБезИзмененияОкладов
	Если Истина Тогда
		ТекстЗапросаВТ = "
		|// (п.1.2.3.) Оклады по назначениям (основные, совместители) и штатные надбавки
		|	ВЫБРАТЬ
		|		1 КАК НомерЗапроса,
		|		РаботникиОрганизации.Сотрудник,
		|		РаботникиОрганизации.Назначение,
		|		ОсновныеНачисления.ВидРасчета,
		|		ИСТИНА											КАК ОсновноеНачисление,
		|		ВЫБОР КОГДА ДвиженияРаботников.ДатаНачала <= ОсновныеНачисления.ДатаНачала			ТОГДА ОсновныеНачисления.ДатаНачала		ИНАЧЕ ДвиженияРаботников.ДатаНачала		КОНЕЦ КАК ДатаНачала,
		|		ВЫБОР КОГДА ДвиженияРаботников.ДатаОкончания <= ОсновныеНачисления.ДатаОкончания	ТОГДА ДвиженияРаботников.ДатаОкончания	ИНАЧЕ ОсновныеНачисления.ДатаОкончания	КОНЕЦ КАК ДатаОкончания,
		|		ДвиженияРаботников.ПодразделениеОрганизации,
		|		ДвиженияРаботников.ПодразделениеУпр,
		|		ДвиженияРаботников.ГрафикРаботы,
		|		ДвиженияРаботников.Должность,
		|
		|		ОсновныеНачисления.ДокументОснование,
		|		ОсновныеНачисления.Показатель1,
		|		ОсновныеНачисления.Показатель2,
		|		ОсновныеНачисления.Показатель3,
		|		ОсновныеНачисления.Показатель4,
		|		ОсновныеНачисления.Показатель5,
		|		ОсновныеНачисления.Показатель6,
		|		ОсновныеНачисления.Валюта1,
		|		ОсновныеНачисления.Валюта2,
		|		ОсновныеНачисления.Валюта3,
		|		ОсновныеНачисления.Валюта4,		
		|		ОсновныеНачисления.Валюта5,		
		|		ОсновныеНачисления.Валюта6,		
		|		ОсновныеНачисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|ПОМЕСТИТЬ ВТВсеНачисленияБезИзмененияОкладов	
		|	ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников	
		|	ПО		РаботникиОрганизации.Назначение = ДвиженияРаботников.Назначение	
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК ОсновныеНачисления	
		|	ПО		РаботникиОрганизации.Назначение = ОсновныеНачисления.Сотрудник	
		|		И	ОсновныеНачисления.ОсновноеНачисление
		|		И	ДвиженияРаботников.ДатаНачала <= ОсновныеНачисления.ДатаОкончания
		|		И	ОсновныеНачисления.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.2.3.) Оклады заменам
		|	ВЫБРАТЬ
		|		2 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение,
		|		ОсновныеНачисления.ВидРасчета,
		|		ИСТИНА							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|		Замены.ДокументОснование		КАК ДокументОснование,
		|		ОсновныеНачисления.Показатель1,
		|		ОсновныеНачисления.Показатель2,
		|		ОсновныеНачисления.Показатель3,
		|		ОсновныеНачисления.Показатель4,
		|		ОсновныеНачисления.Показатель5,
		|		ОсновныеНачисления.Показатель6,
		|		ОсновныеНачисления.Валюта1,
		|		ОсновныеНачисления.Валюта2,
		|		ОсновныеНачисления.Валюта3,
		|		ОсновныеНачисления.Валюта4,		
		|		ОсновныеНачисления.Валюта5,		
		|		ОсновныеНачисления.Валюта6,		
		|		ОсновныеНачисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|	ИЗ ВТЗамены КАК Замены
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК ОсновныеНачисления	
		|	ПО		Замены.Назначение = ОсновныеНачисления.Сотрудник	
		|		И	ОсновныеНачисления.ОсновноеНачисление
		|       // данные на начало замены
		|		И	Замены.ДатаНачала <= ОсновныеНачисления.ДатаОкончания
		|		И	ОсновныеНачисления.ДатаНачала <= Замены.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Основные, совместители и их штатные надбавки
		|	ВЫБРАТЬ
		|		3 КАК НомерЗапроса,
		|		Штатные.Сотрудник,
		|		Штатные.Назначение,
		|		Штатные.ВидРасчета,
		|		Штатные.ОсновноеНачисление,
		|		Штатные.ДатаНачала,
		|		Штатные.ДатаОкончания,
		|		Штатные.ПодразделениеОрганизации,
		|		Штатные.ПодразделениеУпр,
		|		Штатные.ГрафикРаботы,
		|		Штатные.Должность,
		|
		|		NULL КАК ДокументОснование,
		|		Штатные.Показатель1,
		|		Штатные.Показатель2,
		|		Штатные.Показатель3,
		|		Штатные.Показатель4,
		|		Штатные.Показатель5,
		|		Штатные.Показатель6,
		|		Штатные.Валюта1,
		|		Штатные.Валюта2,
		|		Штатные.Валюта3,
		|		Штатные.Валюта4,		
		|		Штатные.Валюта5,		
		|		Штатные.Валюта6,		
		|		NULL	КАК ВидУчетаВремениДляСредней
		|   ИЗ ( 
		|		ВЫБРАТЬ
		|			РаботникиОрганизации.Сотрудник,
		|			РаботникиОрганизации.Назначение,
		|			ШтатныеНадбавки.ВидРасчета,
		|			ЛОЖЬ											КАК ОсновноеНачисление,
		|
		|			ВЫБОР 
		|				КОГДА ПлановыеНачисления.НомерТочки	ЕСТЬ NULL ИЛИ ПлановыеНачисления.НомерТочки = 1		
		|					ТОГДА	ВЫБОР 
		|							КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала			
		|									ТОГДА ШтатныеНадбавки.ДатаНачала		
		|								ИНАЧЕ ДвиженияРаботников.ДатаНачала 
		|							КОНЕЦ 
		|				ИНАЧЕ // ПлановыеНачисления.НомерТочки = 2
		|					ВЫБОР 
		|						КОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1) >= ШтатныеНадбавки.ДатаНачала			
		|							ИЛИ ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1) >= ДвиженияРаботников.ДатаНачала			
		|							ТОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1)		
		|						КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала			
		|							ТОГДА ШтатныеНадбавки.ДатаНачала		
		|						ИНАЧЕ ДвиженияРаботников.ДатаНачала 
		|					КОНЕЦ 
		|			КОНЕЦ 
		|			КАК ДатаНачала,
		|
		|			ВЫБОР 
		|				КОГДА ПлановыеНачисления.НомерТочки ЕСТЬ NULL ИЛИ ПлановыеНачисления.НомерТочки = 2		
		|					ТОГДА	ВЫБОР 
		|								КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания	
		|									ТОГДА ДвиженияРаботников.ДатаОкончания	
		|								ИНАЧЕ ШтатныеНадбавки.ДатаОкончания	
		|							КОНЕЦ 
 		|				ИНАЧЕ // ПлановыеНачисления.НомерТочки = 1 
		|					ВЫБОР 
		|						КОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1) <= ШтатныеНадбавки.ДатаОкончания			
		|							ИЛИ ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1) <= ДвиженияРаботников.ДатаОкончания			
		|							ТОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1)		
		|						КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания	
		|							ТОГДА ДвиженияРаботников.ДатаОкончания	
		|						ИНАЧЕ ШтатныеНадбавки.ДатаОкончания	
		|					КОНЕЦ 
		|			КОНЕЦ 
		|			КАК ДатаОкончания,
		|
		|			ДвиженияРаботников.ПодразделениеОрганизации,
		|			ДвиженияРаботников.ПодразделениеУпр,
		|			ДвиженияРаботников.ГрафикРаботы,
		|			ДвиженияРаботников.Должность,
		|
		|			ШтатныеНадбавки.Показатель1,
		|			ШтатныеНадбавки.Показатель2,
		|			ШтатныеНадбавки.Показатель3,
		|			ШтатныеНадбавки.Показатель4,
		|			ШтатныеНадбавки.Показатель5,
		|			ШтатныеНадбавки.Показатель6,
		|			ШтатныеНадбавки.Валюта1,
		|			ШтатныеНадбавки.Валюта2,
		|			ШтатныеНадбавки.Валюта3,
		|			ШтатныеНадбавки.Валюта4,		
		|			ШтатныеНадбавки.Валюта5,		
		|			ШтатныеНадбавки.Валюта6		
		|
		|		ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников	
		|		ПО		РаботникиОрганизации.Назначение = ДвиженияРаботников.Назначение	
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШтатноеРасписание + " КАК ШтатныеНадбавки	
		|		ПО		ШтатныеНадбавки.ПодразделениеОрганизации = ДвиженияРаботников.ПодразделениеОрганизации
		|			И	ШтатныеНадбавки.Должность = ДвиженияРаботников.Должность
		|			И	ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаОкончания
		|			И	ШтатныеНадбавки.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|
		|   	// отрезок вытеснения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (	
		|			ВЫБРАТЬ
		|     	      1 КАК НомерТочки,
		|     	      ПлановыеНач.Сотрудник,
		|     	      ПлановыеНач.ОсновноеНачисление,
		|     	      ПлановыеНач.ДатаНачала	КАК ДатаНачала,
		|     	      &парамКонец 			КАК ДатаОкончания,
		|     	      ПлановыеНач.ВидРасчета
		|			ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНач
		|			ГДЕ НЕ ПлановыеНач.ОсновноеНачисление
		|
		|
		|       	ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ
		|       	    2 КАК НомерТочки,
		|       	    ПлановыеНач.Сотрудник,
		|       	    ПлановыеНач.ОсновноеНачисление,
		|        	   &парамКонец					КАК ДатаНачала,
		|        	   ПлановыеНач.ДатаОкончания	КАК ДатаОкончания,
		|        	   ПлановыеНач.ВидРасчета
		|			ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНач
		|			ГДЕ НЕ ПлановыеНач.ОсновноеНачисление
		|
		|			) КАК ПлановыеНачисления	
		|		ПО		РаботникиОрганизации.Назначение = ПлановыеНачисления.Сотрудник	
		|			И	ДвиженияРаботников.ДатаНачала <= ПлановыеНачисления.ДатаОкончания
		|			И	ПлановыеНачисления.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|			И	ШтатныеНадбавки.ВидРасчета = ПлановыеНачисления.ВидРасчета
		|			И	(ВЫБОР КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала ТОГДА ШтатныеНадбавки.ДатаНачала ИНАЧЕ ДвиженияРаботников.ДатаНачала КОНЕЦ
		|				<= ПлановыеНачисления.ДатаНачала
		|			ИЛИ	ПлановыеНачисления.ДатаОкончания
		|				<= ВЫБОР КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания ТОГДА ДвиженияРаботников.ДатаОкончания	ИНАЧЕ ШтатныеНадбавки.ДатаОкончания  КОНЕЦ)
		|
		|   ) КАК Штатные
		|	ГДЕ Штатные.ДатаНачала <= Штатные.ДатаОкончания			
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Замены и их штатные надбавки
		|	ВЫБРАТЬ
		|		4 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение,
		|		ШтатныеНадбавки.ВидРасчета,
		|		ЛОЖЬ							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		NULL,
		|		ШтатныеНадбавки.Показатель1,
		|		ШтатныеНадбавки.Показатель2,
		|		ШтатныеНадбавки.Показатель3,
		|		ШтатныеНадбавки.Показатель4,
		|		ШтатныеНадбавки.Показатель5,
		|		ШтатныеНадбавки.Показатель6,
		|		ШтатныеНадбавки.Валюта1,
		|		ШтатныеНадбавки.Валюта2,
		|		ШтатныеНадбавки.Валюта3,
		|		ШтатныеНадбавки.Валюта4,		
		|		ШтатныеНадбавки.Валюта5,		
		|		ШтатныеНадбавки.Валюта6,		
		|		NULL	КАК ВидУчетаВремениДляСредней
		|	ИЗ ВТЗамены КАК Замены
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШтатноеРасписание + " КАК ШтатныеНадбавки	
		|	ПО		ШтатныеНадбавки.ПодразделениеОрганизации = Замены.ПодразделениеОрганизации
		|		И	ШтатныеНадбавки.Должность = Замены.Должность
		|		И	Замены.ДатаНачала <= ШтатныеНадбавки.ДатаОкончания
		|		И	ШтатныеНадбавки.ДатаНачала <= Замены.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.2.) Прочие плановые начисления по работникам кроме начислений по которым заменяли
		|	ВЫБРАТЬ
		|		5 КАК НомерЗапроса,
		|		РаботникиОрганизации.Сотрудник,
		|		РаботникиОрганизации.Назначение			КАК Назначение,
		|		Начисления.ВидРасчета,
		|		ЛОЖЬ									КАК ОсновноеНачисление,
		|		Начисления.ДатаНачала,
		|		Начисления.ДатаОкончания,
		|   	ДвиженияРаботников.ПодразделениеОрганизации,
		|   	ДвиженияРаботников.ПодразделениеУпр,
		|
		|		ДвиженияРаботников.ГрафикРаботы,
		|		ДвиженияРаботников.Должность,
		|
		|		Начисления.ДокументОснование,
		|		Начисления.Показатель1,
		|		Начисления.Показатель2,
		|		Начисления.Показатель3,
		|		Начисления.Показатель4,
		|		Начисления.Показатель5,
		|		Начисления.Показатель6,
		|		Начисления.Валюта1,
		|		Начисления.Валюта2,
		|		Начисления.Валюта3,
		|		Начисления.Валюта4,		
		|		Начисления.Валюта5,		
		|		Начисления.Валюта6,		
		|		Начисления.ВидУчетаВремениДляСредней
		|
		|	ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК Начисления	
		|	ПО		РаботникиОрганизации.Назначение = Начисления.Сотрудник	
		|		И	НЕ Начисления.ОсновноеНачисление
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (	
		|		ВЫБРАТЬ
		|			ПлановыеНачисления.Сотрудник  КАК Сотрудник,
		|			ПлановыеНачисления.ВидРасчета  КАК ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала  КАК ДатаНачала,
		|			МАКСИМУМ(Движения.ДатаНачала)  КАК АктуальнаяДата
		|		ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНачисления	
		|		ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК Движения
		|   	ПО		Движения.Сотрудник = ПлановыеНачисления.Сотрудник
		|			И	Движения.ДатаНачала <= ПлановыеНачисления.ДатаНачала
		|		ГДЕ	НЕ ПлановыеНачисления.ОсновноеНачисление
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисления.Сотрудник,
		|			ПлановыеНачисления.ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала
		|	) КАК ПериодАктуальногоДвижения
		|	ПО 		ПериодАктуальногоДвижения.Сотрудник = Начисления.Сотрудник
		|		И	ПериодАктуальногоДвижения.ВидРасчета = Начисления.ВидРасчета		
		|		И	ПериодАктуальногоДвижения.ДатаНачала = Начисления.ДатаНачала		
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников
		|	ПО		ДвиженияРаботников.Назначение = РаботникиОрганизации.Назначение
		|		И	ПериодАктуальногоДвижения.АктуальнаяДата = ДвиженияРаботников.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ 
		|// (п.2.) Прочие плановые начисления только по работникам которых заменяли
		|	ВЫБРАТЬ
		|		5 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение			КАК Назначение,
		|		Начисления.ВидРасчета,
		|		ЛОЖЬ									КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|   	Замены.ПодразделениеОрганизации,
		|   	Замены.ПодразделениеУпр,
		|
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		Замены.ДокументОснование,
		|		Начисления.Показатель1,
		|		Начисления.Показатель2,
		|		Начисления.Показатель3,
		|		Начисления.Показатель4,
		|		Начисления.Показатель5,
		|		Начисления.Показатель6,
		|		Начисления.Валюта1,
		|		Начисления.Валюта2,
		|		Начисления.Валюта3,
		|		Начисления.Валюта4,		
		|		Начисления.Валюта5,		
		|		Начисления.Валюта6,		
		|		Начисления.ВидУчетаВремениДляСредней
		|
		|	ИЗ ВТЗамены КАК Замены
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК Начисления	
		|	ПО		Замены.Назначение = Начисления.Сотрудник	
		|		И	Начисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Надбавка)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (	
		|		ВЫБРАТЬ
		|			ПлановыеНачисления.Сотрудник  КАК Сотрудник,
		|			ПлановыеНачисления.ВидРасчета  КАК ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала  КАК ДатаНачала,
		|			МАКСИМУМ(Движения.ДатаНачала)  КАК АктуальнаяДата
		|		ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНачисления	
		|		ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК Движения
		|   	ПО		Движения.Сотрудник = ПлановыеНачисления.Сотрудник
		|			И	Движения.ДатаНачала <= ПлановыеНачисления.ДатаНачала
		|		ГДЕ	ПлановыеНачисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Надбавка) 
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисления.Сотрудник,
		|			ПлановыеНачисления.ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала
		|	) КАК ПериодАктуальногоДвижения
		|	ПО 		ПериодАктуальногоДвижения.Сотрудник = Начисления.Сотрудник
		|		И	ПериодАктуальногоДвижения.ВидРасчета = Начисления.ВидРасчета		
		|		И	ПериодАктуальногоДвижения.ДатаНачала = Начисления.ДатаНачала		
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников
		|	ПО		ДвиженияРаботников.Назначение = Замены.Назначение
		|		И	ПериодАктуальногоДвижения.АктуальнаяДата = ДвиженияРаботников.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Надо вытеснить основной оклад если было Замещение
		|	ВЫБРАТЬ
		|		6 КАК НомерЗапроса,
		|		Замены.Сотрудник КАК Сотрудник,
		|		Замены.Сотрудник КАК Назначение,
		|		Замены.ВидРасчета,
		|		ЛОЖЬ							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		NULL,
		|		NULL КАК Показатель1,
		|		NULL КАК Показатель2,
		|		NULL КАК Показатель3,
		|		NULL КАК Показатель4,
		|		NULL КАК Показатель5,
		|		NULL КАК Показатель6,
		|		&парамВалютаУчета КАК Валюта1,
		|		NULL КАК Валюта2,
		|		NULL КАК Валюта3,
		|		NULL КАК Валюта4,		
		|		NULL КАК Валюта5,		
		|		NULL КАК Валюта6,		
		|		NULL КАК ВидУчетаВремениДляСредней
		|
		|	ИЗ ВТЗамены КАК Замены
		|	
		|	ГДЕ Замены.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Замещение)
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВсеНачисленияБезИзмененияОкладов";
	
	//	ВТОкладТариф
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Начисления.Организация	КАК Организация,
		|	Начисления.Сотрудник	КАК Назначение,
		|	Начисления.ВидРасчета	КАК ВидРасчета,
		|
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ					КАК СпособУчетаВремени,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ					КАК ОкладТариф,
		|
		|	Начисления.Валюта1		КАК Валюта1,
		|	Начисления.Период		КАК ДатаНачала,
		|	МИНИМУМ(Окончания.Период)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТОкладТариф	
		|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
		|ПО Валюты1.Валюта = Начисления.Валюта1 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Окончания
		|ПО Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = Окончания.Сотрудник
		|	И	Начисления.ВидРасчета = Окончания.ВидРасчета
		|	И	Начисления.Период < Окончания.Период
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ(
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|   НаборПоказателей.Ссылка	КАК ВидРасчета,
		|   НаборПоказателей.Показатель	КАК Показатель
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК НаборПоказателей
		|	ГДЕ		НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|) КАК НаборПоказателей
		|ПО Начисления.ВидРасчета = НаборПоказателей.ВидРасчета
		|
		|ГДЕ		Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник В (ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК Работники)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Организация,
		|	Начисления.Сотрудник,
		|	Начисления.ВидРасчета,
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ,
		|
		|	Начисления.Валюта1,
		|	Начисления.Период
 		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОкладТариф";
	
	//	ВТВсеНачисления
	ТекстЗапросаВТ = "
	|	ВЫБРАТЬ 
	|		СписокНачислений1.Сотрудник			КАК Сотрудник,
	|		СписокНачислений1.Назначение		КАК Назначение,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаНачала,СписокНачислений1.ДатаНачала) <= СписокНачислений1.ДатаНачала		ТОГДА СписокНачислений1.ДатаНачала	ИНАЧЕ Оклады1.ДатаНачала		КОНЕЦ			КАК ДатаНачала,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаОкончания,СписокНачислений1.ДатаОкончания) < СписокНачислений1.ДатаОкончания	ТОГДА Оклады1.ДатаОкончания	ИНАЧЕ СписокНачислений1.ДатаОкончания	КОНЕЦ	КАК ДатаОкончания,
	|		СписокНачислений1.ВидРасчета		КАК ВидРасчета,
	|
	|		СписокНачислений1.НомерЗапроса,
	|		СписокНачислений1.ОсновноеНачисление,
	|		СписокНачислений1.ПодразделениеОрганизации,
	|		СписокНачислений1.ПодразделениеУпр,
	|		СписокНачислений1.ГрафикРаботы,
	|		СписокНачислений1.Должность,
	|
	|		СписокНачислений1.ДокументОснование,
	|		СписокНачислений1.Показатель1,
	|		СписокНачислений1.Показатель2,
	|		СписокНачислений1.Показатель3,
	|		СписокНачислений1.Показатель4,
	|		СписокНачислений1.Показатель5,
	|		СписокНачислений1.Показатель6,
	|		СписокНачислений1.Валюта1,
	|		СписокНачислений1.Валюта2,
	|		СписокНачислений1.Валюта3,
	|		СписокНачислений1.Валюта4,		
	|		СписокНачислений1.Валюта5,		
	|		СписокНачислений1.Валюта6,		
	|		СписокНачислений1.ВидУчетаВремениДляСредней,
	|		МАКСИМУМ(Оклады2.ДатаНачала) КАК ДатаНачалаОклада
	|ПОМЕСТИТЬ ВТВсеНачисления	
	|	ИЗ ВТВсеНачисленияБезИзмененияОкладов КАК СписокНачислений1
	|	//-----------------------
	|	// данные о видах показателей
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|	ПО		ТипПоказатель1.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель1.НомерСтроки = 1
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|	ПО		ТипПоказатель2.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель2.НомерСтроки = 2
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|	ПО		ТипПоказатель3.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель3.НомерСтроки = 3
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|	ПО		ТипПоказатель4.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель4.НомерСтроки = 4
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|	ПО		ТипПоказатель5.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель5.НомерСтроки = 5
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|	ПО		ТипПоказатель6.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель6.НомерСтроки = 6
	|	//-----------------------
	|	// данные об окладе
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады1
	|	ПО		СписокНачислений1.Назначение = Оклады1.Назначение
	| 		И  (СписокНачислений1.ДатаНачала <= Оклады1.ДатаОкончания ИЛИ Оклады1.ДатаОкончания ЕСТЬ NULL)
	| 		И  Оклады1.ДатаНачала <= СписокНачислений1.ДатаОкончания
	|		И	(ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель2.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель3.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель4.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель5.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель6.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	СписокНачислений1.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы)
	|		ИЛИ	СписокНачислений1.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы))
	|	//-----------------------
	|	// данные об окладе
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады2
	|	ПО		СписокНачислений1.Назначение = Оклады2.Назначение
	| 		И  (СписокНачислений1.ДатаНачала <= Оклады2.ДатаОкончания ИЛИ Оклады1.ДатаОкончания ЕСТЬ NULL)
	| 		И  Оклады2.ДатаНачала <= СписокНачислений1.ДатаОкончания
	|	СГРУППИРОВАТЬ ПО 
	|		СписокНачислений1.Сотрудник,
	|		СписокНачислений1.Назначение,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаНачала,СписокНачислений1.ДатаНачала) <= СписокНачислений1.ДатаНачала		ТОГДА СписокНачислений1.ДатаНачала	ИНАЧЕ Оклады1.ДатаНачала		КОНЕЦ,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаОкончания,СписокНачислений1.ДатаОкончания) < СписокНачислений1.ДатаОкончания	ТОГДА Оклады1.ДатаОкончания	ИНАЧЕ СписокНачислений1.ДатаОкончания	КОНЕЦ,
	|		СписокНачислений1.ВидРасчета,
	|
	|		СписокНачислений1.НомерЗапроса,
	|		СписокНачислений1.ОсновноеНачисление,
	|		СписокНачислений1.ПодразделениеОрганизации,
	|		СписокНачислений1.ПодразделениеУпр,
	|		СписокНачислений1.ГрафикРаботы,
	|		СписокНачислений1.Должность,
	|
	|		СписокНачислений1.ДокументОснование,
	|		СписокНачислений1.Показатель1,
	|		СписокНачислений1.Показатель2,
	|		СписокНачислений1.Показатель3,
	|		СписокНачислений1.Показатель4,
	|		СписокНачислений1.Показатель5,
	|		СписокНачислений1.Показатель6,
	|		СписокНачислений1.Валюта1,
	|		СписокНачислений1.Валюта2,
	|		СписокНачислений1.Валюта3,
	|		СписокНачислений1.Валюта4,		
	|		СписокНачислений1.Валюта5,		
	|		СписокНачислений1.Валюта6,		
	|		СписокНачислений1.ВидУчетаВремениДляСредней
	|";
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	ТекстЗапросаВТВсеНачисления = "ВТВсеНачисления";
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВсеНачисления";
		
	//	ВТЗначенияПоказателей
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.Сотрудник,
		|	ЗначенияПоказателей.Подразделение,
		|	ЗначенияПоказателей.Показатель,
		|	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|		И НЕ (ЗначенияПоказателей.Валюта В (&парамВалютаУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателей.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателей.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателей
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты
		|ПО Валюты.Валюта = ЗначенияПоказателей.Валюта 
		|	
		|ГДЕ	ЗначенияПоказателей.Организация = &парамОрганизация
		|	И	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) = &парамНачало
		|	И	(ЗначенияПоказателей.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|	ИЛИ	ЗначенияПоказателей.Сотрудник В (ВЫБРАТЬ Назначение ИЗ ВТСписокРаботникиИЗамены КАК Работники))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗначенияПоказателей";
	
	//	ВТПоказатели
	Если Истина Тогда 
		//	Описание:
		// 		
		//		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПодразделенияВПоказателях.Сотрудник КАК Сотрудник,
		|	СотрудникиПодразделенияВПоказателях.Подразделение КАК Подразделение,
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение, Сотрудник ИЗ ВТЗначенияПоказателей КАК ЗначенияПоказателей) КАК СотрудникиПодразделенияВПоказателях
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|	ПО Показатели.Ссылка = Показатели1.Ссылка И Показатели1.НомерСтроки = 1
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|	ПО Показатели.Ссылка = Показатели2.Ссылка И Показатели2.НомерСтроки = 2
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|	ПО Показатели.Ссылка = Показатели3.Ссылка И Показатели3.НомерСтроки = 3
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|	ПО Показатели.Ссылка = Показатели4.Ссылка И Показатели4.НомерСтроки = 4
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|	ПО Показатели.Ссылка = Показатели5.Ссылка И Показатели5.НомерСтроки = 5
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|	ПО Показатели.Ссылка = Показатели6.Ссылка И Показатели6.НомерСтроки = 6
		|	
		|) КАК ПоказателиВидовРасчета
		|ПО ИСТИНА
		|	
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|ПО 	ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей1.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей1.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|ПО		ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей2.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей2.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|ПО		ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей3.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей3.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|ПО		ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей4.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей4.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|ПО		ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей5.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей5.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|ПО		ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей6.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей6.Подразделение
		|
		|ГДЕ	ЗначенияПоказателей1.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей2.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей3.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей4.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей5.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей6.Значение ЕСТЬ НЕ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоказатели";

	//Основной текст запроса
	ОсновнойТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ИСТИНА КАК Авторасчет,
	|	СписокНачислений.Сотрудник		КАК Сотрудник,
	|	СписокНачислений.Назначение		КАК Назначение,
	|	СписокНачислений.ДатаНачала			КАК ДатаНачала,
	|	СписокНачислений.ДатаОкончания		КАК ДатаОкончания,
	|	СписокНачислений.ДатаНачала			КАК БазовыйПериодНачало,
	|	СписокНачислений.ДатаОкончания		КАК БазовыйПериодКонец,
	|	СписокНачислений.ОсновноеНачисление КАК ОсновноеНачисление,
	|	СписокНачислений.ВидРасчета КАК ВидРасчета,
	|	СписокНачислений.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	|	СписокНачислений.Валюта1 КАК Валюта,
	|	СписокНачислений.Валюта2 КАК Валюта2,
	|	СписокНачислений.ДокументОснование	КАК ДокументОснование,
	|
	|	ВЫБОР
	|		КОГДА СписокНачислений.Валюта1 = &парамВалютаУчета
	|				ИЛИ СписокНачислений.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Валюты1.Курс
	|	КОНЕЦ КАК КурсВалюты,		
	|	";
	ТекстПоказатель1 = "
	|			ВЫБОР
	|				КОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|					//СПЕЦИАЛЬНЫЕ
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА	ВЫБОР	КОГДА Оклады.СпособУчетаВремени = ""ЗА МЕСЯЦ"" И ДанныеКалендаря.НормаЧасовЗаМесяц > 0
	|										ТОГДА Оклады.ОкладТариф/ДанныеКалендаря.НормаЧасовЗаМесяц
	|									КОГДА Оклады.СпособУчетаВремени = ""ЗА ДЕНЬ""
	|										ТОГДА Оклады.ОкладТариф/8
	|									ИНАЧЕ Оклады.ОкладТариф
	|							КОНЕЦ
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТариф)   
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА	Оклады.ОкладТариф                                                               
	|				КОГДА СписокНачислений.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
	|						ИЛИ СписокНачислений.Валюта1 = &парамВалютаУчета
	|						ИЛИ СписокНачислений.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|                   // валюту пересчитывать не надо
	|					ТОГДА ЕСТЬNULL(СписокНачислений.Показатель1, 0)
	|				ИНАЧЕ ЕСТЬNULL(СписокНачислений.Показатель1, 0) * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|			КОНЕЦ
	|	";
	ТекстПоказатель2 = СтрЗаменить(ТекстПоказатель1, "1", "2");
	ТекстПоказатель3 = СтрЗаменить(ТекстПоказатель1, "1", "3");
	ТекстПоказатель4 = СтрЗаменить(ТекстПоказатель1, "1", "4");
	ТекстПоказатель5 = СтрЗаменить(ТекстПоказатель1, "1", "5");
	ТекстПоказатель6 = СтрЗаменить(ТекстПоказатель1, "1", "6");
	
	//Некоторые способы расчета имеют "виртуальный" показатель 1 "часовой тариф"
	ТекстПоказатель1 = СтрЗаменить(ТекстПоказатель1, "//СПЕЦИАЛЬНЫЕ", 
	"ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы) 
	|ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)");

	
	ОсновнойТекстЗапроса =  ОсновнойТекстЗапроса + "
	|	" + ТекстПоказатель1 + " КАК Показатель1,
	|	" + ТекстПоказатель2 + " КАК Показатель2,
	|	" + ТекстПоказатель3 + " КАК Показатель3,
	|	" + ТекстПоказатель4 + " КАК Показатель4,
	|	" + ТекстПоказатель5 + " КАК Показатель5,
	|	" + ТекстПоказатель6 + " КАК Показатель6,
	|	СписокНачислений.ВидУчетаВремениДляСредней,
	|	СписокНачислений.ГрафикРаботы		КАК ГрафикРаботы,
	|	ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц,
	|	ЕСТЬNULL(СписокНачислений.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	СписокНачислений.ПодразделениеУпр,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисления.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УжеПроведен,
	|	СписокНачислений.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ " + ТекстЗапросаВТВсеНачисления + " КАК СписокНачислений
	|
	|//-----------------------
	|// курсы валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как ВалютыУчета
	|ПО ВалютыУчета.Валюта = &парамВалютаУчета 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
	|ПО Валюты1.Валюта = СписокНачислений.Валюта1 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты2
	|ПО Валюты2.Валюта = СписокНачислений.Валюта2 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты3
	|ПО Валюты3.Валюта = СписокНачислений.Валюта3 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты4
	|ПО Валюты4.Валюта = СписокНачислений.Валюта4 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты5
	|ПО Валюты5.Валюта = СписокНачислений.Валюта5 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты6
	|ПО Валюты6.Валюта = СписокНачислений.Валюта6 
	|
	|//-----------------------
	|// Выборка сведений о уже выполненных начислениях за отработанное время 
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновныеНачисления.Сотрудник				КАК Сотрудник,
	|		ОсновныеНачисления.Назначение				КАК Назначение,
	|		ОсновныеНачисления.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|		ОсновныеНачисления.ПодразделениеУпр			КАК ПодразделениеУпр
	|	ИЗ РегистрРасчета.Начисления КАК ОсновныеНачисления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК ТаблицаДвиженийРаботников
	|	ПО ОсновныеНачисления.Назначение = ТаблицаДвиженийРаботников.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.Сторнирование КАК Сторнирование
	|	ПО Сторнирование.СторнируемыйДокумент = ОсновныеНачисления.Регистратор
	|	ГДЕ		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|		И	ОсновныеНачисления.ПериодДействияКонец <= &парамКонец
	|		И	ОсновныеНачисления.ПериодДействияНачало >= &парамНачало
	|		И	ОсновныеНачисления.Организация = &парамОрганизация
	|		И	ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|		И	ОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
	|		И	НЕ ОсновныеНачисления.Сторно
	|		И	ОсновныеНачисления.Регистратор <> &парамРегистратор
	|		И	ОсновныеНачисления.Регистратор ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций		
	|		И	ОсновныеНачисления.Организация = &парамОрганизация
 	|		И	Сторнирование.Ссылка ЕСТЬ NULL
	|) КАК ОсновныеНачисления
	|ПО		ОсновныеНачисления.Сотрудник = СписокНачислений.Сотрудник
	|	И	ОсновныеНачисления.ПодразделениеОрганизации = СписокНачислений.ПодразделениеОрганизации		
	|       
	|
	|//-----------------------
	|// данные нормы календаря
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ГрафикиРаботы.ГрафикРаботы                 КАК ГрафикРаботы,
	|		СУММА( ГрафикиРаботы.ОсновноеЗначение  )      КАК НормаДнейЗаМесяц,
	|		СУММА( ГрафикиРаботы.ДополнительноеЗначение ) КАК НормаЧасовЗаМесяц
	|	ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|	ГДЕ		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ ) = &парамНачало 
	|		И	ГрафикиРаботы.ВидУчетаВремени = &парамПоДням 
	|	СГРУППИРОВАТЬ ПО
	|			ГрафикиРаботы.ГрафикРаботы
	|) КАК ДанныеКалендаря
	|ПО		ВЫБОР	КОГДА НЕ СписокНачислений.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику	
	|		     			ТОГДА ДанныеКалендаря.ГрафикРаботы = СписокНачислений.ГрафикРаботы 
	|					ИНАЧЕ ДанныеКалендаря.ГрафикРаботы = СписокНачислений.ГрафикРаботы.ГрафикРаботыНормыВремени
	|		КОНЕЦ 
	|	//И	СписокНачислений.ОсновноеНачисление
	|
	|//-----------------------
	|// данные о видах показателей
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|ПО		ТипПоказатель1.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель1.НомерСтроки = 1
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|ПО		ТипПоказатель2.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель2.НомерСтроки = 2
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|ПО		ТипПоказатель3.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель3.НомерСтроки = 3
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|ПО		ТипПоказатель4.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель4.НомерСтроки = 4
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|ПО		ТипПоказатель5.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель5.НомерСтроки = 5
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|ПО		ТипПоказатель6.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель6.НомерСтроки = 6
	|
	|//-----------------------
	|// данные об окладах
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады
	|ПО		СписокНачислений.Назначение = Оклады.Назначение
	| 	И  Оклады.ДатаНачала = СписокНачислений.ДатаНачалаОклада
	| 	И  Оклады.ВидРасчета = СписокНачислений.ВидРасчета
	|//-----------------------
	|// данные показателей Схем Мотиваций
	|// по конкретным сотрудникам
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоСотруднику
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоСотруднику.ВидРасчета
	|	И	СписокНачислений.Назначение = ПоказателиСхемМотивацийПоСотруднику.Сотрудник
	|
	|// по подразделению
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделению
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоПодразделению.ВидРасчета
	|	И	СписокНачислений.ПодразделениеОрганизации = ПоказателиСхемМотивацийПоПодразделению.Подразделение
	|
	|// по подразделению упр.
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделениюУпр
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоПодразделениюУпр.ВидРасчета
	|	И	СписокНачислений.ПодразделениеУпр = ПоказателиСхемМотивацийПоПодразделениюУпр.Подразделение
	|
	|// организации
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоОрганизации
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоОрганизации.ВидРасчета
	|	И	ПоказателиСхемМотивацийПоОрганизации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	И	ПоказателиСхемМотивацийПоОрганизации.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) 
	|ГДЕ
	|   СписокНачислений.ВидРасчета В (&парамБазаИндексации)
	|   ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = &парамСРИндексация
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование,
	|	СписокНачислений.Сотрудник,
	|	// основные начисления должны быть ввержу, а внутренее совместительство и замены внизу
	|	ВЫБОР КОГДА СписокНачислений.Сотрудник = СписокНачислений.Назначение ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ, 
	|	СписокНачислений.Назначение,
	|	СписокНачислений.ОсновноеНачисление Убыв, // основное начисление должно встретиться в выборке первым
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.ВидРасчета
	|";
	
	Запрос.Текст = ОсновнойТекстЗапроса;
	
	ВыборкаНачисления = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНачисления.Следующий() Цикл
		
		Если  ВыборкаНачисления.УжеПроведен Тогда
			
			// пропускаем такие записи: они уже введены другими документами или соответствуют окончанию назначения работника
			// необходимо сообщить пользователю что работник уже посчитан; 
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока	= Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНачисления);
		Если НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.ГодоваяПремия
			ИЛИ НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.Премия
			ИЛИ НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.ПремияПропорционально
			Тогда
			НоваяСтрока.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(НачалоМесяца(НоваяСтрока.БазовыйПериодНачало),-Мин(НоваяСтрока.ВидРасчета.ЧислоМесяцев, 1)));
			НоваяСтрока.БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(НоваяСтрока.БазовыйПериодНачало),-НоваяСтрока.ВидРасчета.ЧислоМесяцев);
		КонецЕсли;
		

	КонецЦикла;

КонецПроцедуры	

Функция Рассчитать(ТЧ, ИмяТЧ) Экспорт
	
	//массивы для хранения индексов строк табличных частей,
	//используются для расчета по одному сотруднику
	МассивИндексыСтрокНачисления = Новый Массив();
	
	Отказ = Ложь;
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	Прочитать();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке("ПоРеквизитамДокумента").Выбрать();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	Сотрудники = РаботникиОрганизации.ВыгрузитьКолонку("Сотрудник");
	
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениямДоПосле(ИмяТЧ,Сотрудники).Выбрать();
	ЗафиксироватьТранзакцию();
	
	// Создадим рабочие наборы записей
	НаборНачисления = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
	НаборНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл

		//ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоНачислениям, ИмяТЧ, Отказ);  ???
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, НаборНачисления, Истина);
			МассивИндексыСтрокНачисления.Добавить(ВыборкаПоНачислениям.НомерСтроки-1);
			
		КонецЕсли;
		
	КонецЦикла;
	НаборНачисления.Записать();
	
	Если Отказ Тогда
		
		// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
		// Удаляем движения
		НаборНачисления.Очистить();
		НаборНачисления.Записать();
		
		Возврат Не Отказ;
		
	КонецЕсли;
	
	
	
	// рассчитываем записи
	// при этом передаем не только набор записей регистра расчета, но и набор записей регисра 
	// накопления со сведениями об отработанном времени
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("Начисления", 
														НаборНачисления, 
														ТЧ, 
														МассивИндексыСтрокНачисления, 
														Сотрудники, 
														Ложь);
	
	// Удаляем движения
	НаборНачисления.Очистить();
	НаборНачисления.Записать();
	
	Записать();
	
	Возврат Не Отказ;
	

КонецФункции // Рассчитать()	

Функция РассчитатьИндексацию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("СРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(КадровоеПеремещениеОрганизацийНачисленияДо.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыДо
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.НачисленияДо КАК КадровоеПеремещениеОрганизацийНачисленияДо
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(КадровоеПеремещениеОрганизацийНачисленияДо.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыДоБезИндексации
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.НачисленияДо КАК КадровоеПеремещениеОрганизацийНачисленияДо
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Ссылка = &ДокументСсылка
	|	И КадровоеПеремещениеОрганизацийНачисленияДо.ВидРасчета.СпособРасчета <> &СРИндексация
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(КадровоеПеремещениеОрганизацийНачисленияДо.ОплаченоДнейЧасов) КАК Результат
	|ПОМЕСТИТЬ ВТФиксированнаяИндексация
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.НачисленияДо КАК КадровоеПеремещениеОрганизацийНачисленияДо
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Ссылка = &ДокументСсылка
	|	И КадровоеПеремещениеОрганизацийНачисленияДо.ВидРасчета.СпособРасчета = &СРИндексация
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеОрганизацийНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизацийНачисленияПосле.Сотрудник КАК Сотрудник,
	|	СУММА(КадровоеПеремещениеОрганизацийНачисленияПосле.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыПосле
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.НачисленияПосле КАК КадровоеПеремещениеОрганизацийНачисленияПосле
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийНачисленияПосле.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеОрганизацийНачисленияПосле.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизаций.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеОрганизаций.ДатаНачала КАК ДатаНачала,
	|	ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0) КАК ФиксированнаяИндексацияДо,
	|	ЕСТЬNULL(ДоходыДо.Результат, 0) КАК ДоходДо,
	|	ЕСТЬNULL(ДоходыПосле.Результат, 0) КАК ДоходПосле,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) <= ЕСТЬNULL(ДоходыДоБезИндексации.Результат, 0)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ДоходыПосле.Результат, 0) - ЕСТЬNULL(ДоходыДоБезИндексации.Результат, 0)
	|	КОНЕЦ КАК Повышение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) > ЕСТЬNULL(ДоходыДо.Результат, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыДо.Результат, 0) - ЕСТЬNULL(ДоходыПосле.Результат, 0) > ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0)
	|			ТОГДА ЕСТЬNULL(ДоходыДо.Результат, 0) - ЕСТЬNULL(ДоходыПосле.Результат, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0)
	|	КОНЕЦ КАК ФиксированнаяИндексация,
	|	КадровоеПеремещениеОрганизаций.ПодразделениеОрганизации,
	|	КадровоеПеремещениеОрганизаций.Должность,
	|	КадровоеПеремещениеОрганизаций.СпособОтраженияВБухучете,
	|	КадровоеПеремещениеОрганизаций.СпособОтраженияВУпрУчете,
	|	КадровоеПеремещениеОрганизаций.ЗанимаемыхСтавок,
	|	КадровоеПеремещениеОрганизаций.ГрафикРаботы,
	|	КадровоеПеремещениеОрганизаций.ПодразделениеУпр,
	|	КадровоеПеремещениеОрганизаций.ДолжностьУпр,
	|	КадровоеПеремещениеОрганизаций.ТабельныйНомерУпр,
	|	КадровоеПеремещениеОрганизаций.ЗанимаемыхСтавокУпр
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДо КАК ДоходыДо
	|		ПО КадровоеПеремещениеОрганизаций.Сотрудник = ДоходыДо.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоБезИндексации КАК ДоходыДоБезИндексации
	|		ПО КадровоеПеремещениеОрганизаций.Сотрудник = ДоходыДоБезИндексации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированнаяИндексация КАК ТаблицаФиксированнаяИндексация
	|		ПО КадровоеПеремещениеОрганизаций.Сотрудник = ТаблицаФиксированнаяИндексация.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПосле КАК ДоходыПосле
	|		ПО КадровоеПеремещениеОрганизаций.Сотрудник = ДоходыПосле.Сотрудник
	|ГДЕ
	|	КадровоеПеремещениеОрганизаций.Ссылка = &ДокументСсылка";
	
	ТЗРаботникиОрганизации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Работник из ТЗРаботникиОрганизации Цикл
		Если Работник.Повышение <=0 И
			Работник.ФиксированнаяИндексация > 0 Тогда
			//Что делать с фиксированной индексацией в этом случае - не известно
			//Будем считать, что она остается прежней (не увеличивается, не закрывается)
			Работник.ФиксированнаяИндексация = Работник.ФиксированнаяИндексацияДо;
		КонецЕсли;
	КонецЦикла;
	
	РаботникиОрганизации.Загрузить(ТЗРаботникиОрганизации);
		
	Записать();
	
КонецФункции

Функция СформироватьЗапросПоНачислениям() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧНачисления.Сотрудник,
	               |	ТЧНачисления.Действие,
	               |	ТЧНачисления.ВидРасчета,
	               |	ТЧНачисления.Показатель1,
	               |	ТЧНачисления.Валюта1,
	               |	ТЧНачисления.Показатель2,
	               |	ТЧНачисления.Валюта2,
	               |	ТЧНачисления.Показатель3,
	               |	ТЧНачисления.Валюта3,
	               |	ТЧНачисления.Показатель4,
	               |	ТЧНачисления.Валюта4,
	               |	ТЧНачисления.Показатель5,
	               |	ТЧНачисления.Валюта5,
	               |	ТЧНачисления.Показатель6,
	               |	ТЧНачисления.Валюта6,
	               |	ТЧНачисления.СпособОтраженияВБухУчете,
	               |	ТЧНачисления.СпособОтраженияВУпрУчете,
	               |	ТЧНачисления.ВидНачисления,
	               |	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала КАК ДатаНачала
	               |ИЗ
	               |	Документ.КадровоеПеремещениеОрганизаций.Начисления КАК ТЧНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
	               |		ПО ТЧНачисления.Сотрудник = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник
	               |ГДЕ
	               |	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка = &Регистратор
				   |	И ТЧНачисления.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);			   
	Возврат Запрос.Выполнить()				   
КонецФункции // СформироватьЗапросПоНачислениям()

Функция СформироватьЗапросПоНачислениямДоПосле(ИмяТЧ,Сотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
	
	Если НЕ (Сотрудники = Неопределено) Тогда
		Запрос.УстановитьПараметр("парамСотрудники", Сотрудники);
		УсловиеНаФизлицоТекст = " И СтрокиНачисления.Сотрудник В (&парамСотрудники) ";
	Иначе
		УсловиеНаФизлицоТекст="";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// Свойства
	|	&ПериодРегистрации	КАК ПериодРегистрации,
	|	СтрокиНачисления.ДатаНачала					КАК ПериодДействияНачало,
	|	СтрокиНачисления.ДатаОкончания				КАК ПериодДействияКонец,
	|	СтрокиНачисления.БазовыйПериодНачало,
	|	СтрокиНачисления.БазовыйПериодКонец,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.Сторно,
	|
	// Измерения
	|	СтрокиНачисления.Ссылка.Организация КАК организация,
	|	СтрокиНачисления.Сотрудник,
	|	СтрокиНачисления.Назначение,
	|
	// Ресурсы
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.РезультатУпр,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.КалендарныеДни,
	|
	// Реквизиты
	|	СтрокиНачисления.Авторасчет,
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ПодразделениеУпр,
	|	СтрокиНачисления.СпособОтраженияВБухучете,
	|	СтрокиНачисления.СпособОтраженияВУпрУчете,
	|	СтрокиНачисления.ДокументОснование,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.НормаДнейЗаМесяц,
	|	СтрокиНачисления.НормаЧасовЗаМесяц,
	|	СтрокиНачисления.ГрафикРаботы,
	|   ВЫБОР	КОГДА СтрокиНачисления.ГрафикРаботы ССЫЛКА Справочник.ГрафикиРаботы
	|			ТОГДА NULL
	|			ИНАЧЕ СтрокиНачисления.Сотрудник
	|	КОНЕЦ						КАК ГрафикРаботыСотрудник,
	|	СтрокиНачисления.ВидУчетаВремениДляСредней,
	|
	|	СтрокиНачисления.ВидРасчета.СпособРасчета	КАК СпособРасчета,
	|	СтрокиНачисления.ВидРасчета.СчетУчета		КАК СчетУчета,
	|	ЕСТЬNULL(СтрокиНачисления.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	СтрокиНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени	КАК ВидИспользованияРабочегоВремени,
	|
	// Проверки
	|	СтрокиНачисления.ДатаНачала,
	|	СтрокиНачисления.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сотрудник.Организация = СтрокиНачисления.Ссылка.Организация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации
	|ИЗ Документ."+Ссылка.Метаданные().Имя+"."+ИмяТЧ+" КАК СтрокиНачисления
	|
	|
	|
	|ГДЕ СтрокиНачисления.Ссылка = &ДокументСсылка" + УсловиеНаФизлицоТекст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";

	Возврат Запрос.Выполнить();


КонецФункции // СформироватьЗапросПоНачислениямДоПосле()


Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, НаборЗаписей, ОбнулитьРезультат = Ложь)
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
 	Движение.ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоСтрокамДокумента, ВыборкаПоСтрокамДокумента.СуммированныйУчетРабочегоВремени);
	Если ОбнулитьРезультат Тогда
		Движение.Результат = 0;
		Движение.ОплаченоДнейЧасов = 0;
	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()


// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",   Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",  Дата);
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("РеглВалюта",     глЗначениеПеременной("ВалютаРегламентированногоУчета"));

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные 
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	КадровоеПеремещениеОрганизаций.Номер КАК НомерДок,
		|	КадровоеПеремещениеОрганизаций.Дата КАК ДатаДок,
		|	КадровоеПеремещениеОрганизаций.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель) И КадровоеПеремещениеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|
		|ГДЕ
		|	КадровоеПеремещениеОрганизаций.Ссылка = &ДокументСсылка";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда

	    Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.ДатаНачала															КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL 
		|			ТОГДА Док.ФизЛицо.Наименование
		|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
		|	КОНЕЦ 																	КАК Работник,
		|	Док.Сотрудник															КАК Сотрудник,
		|	Док.Сотрудник.ФизЛицо													КАК ФизЛицо,
		|	Док.Сотрудник.Код														КАК ТабельныйНомер,                                    
		|	Док.НомерСтроки 														КАК НомерСтроки,
		|	Док.ПодразделениеОрганизации.Наименование 								КАК НовоеПодразделение,
		|	Док.Должность.Наименование 												КАК НоваяДолжность,
		|	Док.Должность.Категория 												КАК НоваяКатегория,
		|	Работники.ПодразделениеОрганизацииНаименование 							КАК ПрежнееПодразделение,
		|	Работники.ДолжностьНаименование 										КАК ПрежняяДолжность,
		|	Работники.Категория				 										КАК ПрежняяКатегория,
		|	ЕСТЬNULL(КадровоеПеремещениеОрганизацийНачисления.Показатель1, 0) 		КАК ОкладТарифнаяСтавка,
        |	Работники.ДатаПредыдущегоИзменения										КАК ДатаПред
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации 			КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&ДатаДокумента,
		|		ФизЛицо В
		|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		        КадровыеПеремещенияОрганизацийРаботники.Сотрудник.ФизЛицо
		|		    ИЗ
		|		        Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровыеПеремещенияОрганизацийРаботники
		|		    ГДЕ
		|		        КадровыеПеремещенияОрганизацийРаботники.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
		|		ПО Док.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуОрганизацииРаботники
		|			По ПриемНаРаботуОрганизацииРаботники.Сотрудник = Док.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|			РаботникиОрганизации.Должность.Наименование КАК ДолжностьНаименование,
		|			РаботникиОрганизации.Должность.Категория КАК Категория,
		|			СписокДат.ДатаПоследнегоИзменения	КАК ДатаПредыдущегоИзменения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Док
		|					ПО РаботникиВнутри.Сотрудник = Док.Сотрудник
		|						И (РаботникиВнутри.Организация = &ГоловнаяОрганизация)
		|						И РаботникиВнутри.Период < Док.ДатаНачала
		|			ГДЕ
		|				Док.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиВнутри.Сотрудник) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник
		|					И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)
		|					И СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период) КАК Работники
		|		ПО Док.Сотрудник = Работники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.Начисления КАК КадровоеПеремещениеОрганизацийНачисления
		|		ПО Док.Ссылка = КадровоеПеремещениеОрганизацийНачисления.Ссылка
		|			И Док.Сотрудник = КадровоеПеремещениеОрганизацийНачисления.Сотрудник
		|			И КадровоеПеремещениеОрганизацийНачисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Основное)
		|ГДЕ
		|	Док.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати()

# Если Клиент Тогда


Функция ПечатьП5()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещениеОрганизаций_П5";
	
	// получаем данные для печати
	ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);

	// запоминаем области макета
	Макет = ПолучитьМакет("П5_от_09_10_1995");
	ОбластьМакета = Макет.ПолучитьОбласть("Форма");
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл


		ОкладТарифнаяСтавка = ВыборкаРаботники.ОкладТарифнаяСтавка;
		
	    Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Показатель1 КАК Размер	
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамДата, Сотрудник = &парамСотрудник И Организация = &парамОрганизация)
		|ГДЕ
		| ВидРасчета <> ВидРасчетаИзмерение
		|
		|";
		Запрос.УстановитьПараметр("парамДата", НачалоДня(ВыборкаРаботники.ДатаНачала - 1));
		Запрос.УстановитьПараметр("парамСотрудник", ВыборкаРаботники.Сотрудник);
		Запрос.УстановитьПараметр("парамОрганизация", Организация);
		
		ОкладПрежний = Запрос.Выполнить().Выбрать();
		ОкладПрежний.Следующий();
		
		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
		ОбластьМакета.Параметры.НазваниеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ОбластьМакета.Параметры.ЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
		
		// Данные по работнику.
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета.Параметры["ОкладТарифнаяСтавка"] = ОкладТарифнаяСтавка;
		ОбластьМакета.Параметры["ПрежнийОкладТарифнаяСтавка"] = ОкладПрежний.Размер; 
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;
	
		
	Возврат ТабДокумент;
	
КонецФункции // ПечатьП5()

////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьП5();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Кадровое перемещение "), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("П5_от_09_10_1995","Форма П-5 (от 09.10.1995)");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ
Процедура ДобавитьСтрокиНачисленийПоРаботнику(Сотрудник, ДатаАктуальности = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = Дата
	КонецЕсли;
	
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
	ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
	
	ЗапросНачисления.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо 			КАК Физлицо,
	|	Начисления.ВидРасчета 					КАК ВидРасчета,
 	|	Начисления.Показатель1 					КАК Показатель1,
	|	Начисления.Показатель2	 				КАК Показатель2,
	|	Начисления.Показатель3		 			КАК Показатель3,
	|	Начисления.Показатель4 					КАК Показатель4,
	|	Начисления.Показатель5 					КАК Показатель5,
	|	Начисления.Показатель6 					КАК Показатель6,
	|	Начисления.Валюта1 						КАК Валюта1,
	|	Начисления.Валюта2			 			КАК Валюта2,
	|	Начисления.Валюта3						КАК Валюта3,
	|	Начисления.Валюта4						КАК Валюта4,
	|	Начисления.Валюта5						КАК Валюта5,
	|	Начисления.Валюта6						КАК Валюта6,
	|	Начисления.ВидНачисления				КАК ВидНачисления,
	|	Начисления.СпособОтраженияВБухУчете		КАК СпособОтраженияВБухУчете,
	|	Начисления.СпособОтраженияВУпрУчете		КАК СпособОтраженияВУпрУчете
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&Период,
	|		Сотрудник В (&Сотрудник)
	|			И ВидРасчета ССЫЛКА ПланВидовРасчета.Начисления
	|			И Регистратор <> &Регистратор) КАК Начисления
	|ГДЕ
	|	Начисления.Актуальность
	|";

	Выборка = ЗапросНачисления.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета");
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = Начисления.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(Начисления.Добавить(),Выборка);
		
	КонецЦикла;

КонецПроцедуры // ДобавитьСтрокиНачисленийПоРаботнику()


////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровоеПеремещениеОрганизаций.Дата,
	|	КадровоеПеремещениеОрганизаций.Организация,
	|	КадровоеПеремещениеОрганизаций.Организация КАК ГоловнаяОрганизация,
	|	КадровоеПеремещениеОрганизаций.ИндексацияЗаработка,
	|	КадровоеПеремещениеОрганизаций.ОтражатьВУпрУчете,
	|	КадровоеПеремещениеОрганизаций.ОтражатьВРеглУчете,
	|	КадровоеПеремещениеОрганизаций.Ссылка
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
	|
	|ГДЕ
	|	КадровоеПеремещениеОрганизаций.Ссылка = &ДокументСсылка	";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизаций(Режим)

	Запрос = Новый Запрос;

    СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
	СписокСтруктурныхПодразделений.Добавить(Организация);
	
	ПоказыватьПодразделения = Ложь;

	Если ПоказыватьПодразделения Тогда
		// Получим список обособленных подразделений организации
		ПоказыватьПодразделения = ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) или ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация).Количество() > 0
	КонецЕсли;	
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОбособленноеПодразделениеКуда", ОбособленноеПодразделениеКуда);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений", СписокСтруктурныхПодразделений);
   	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("ПоказыватьПодразделения", ПоказыватьПодразделения);

    // Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвиженийКадров": 
    // 1. Выборка "ТЧРаботникиОрганизаций": 
	//		Выбираются строки документа.  
	// 2. Выборка "ПриказыОПриеме"
	//		Присоединяем данные о приказах-приемах на работу с целью проверки соответствия выбранных приказов физлицам и организации.
	// 3. Выборка "ДанныеПоРаботникиДоНазначения": 
	//		Для каждой строки ТЧРаботникиОрганизаций выполняем срез по регистру РаботникиОрганизаций на дату ДатаНачала
	//		для выполнения движений и проверки "Работает ли работник на дату перемещения"
	//		(Использует данные выборки "ДатыПоследнихДвиженийРаботников")
	// 4. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки, имеющие пересекающийся период действия
	//
	// Вторая часть запроса - вид строки запроса "КонфликтныйДокумент" - поиск конфликтных документов: 
	// 1. Выборка "ТЧРаботникиОрганизаций":
	//		Выбираются строки документа 
	// 2. Выборка "РаботникиОрганизации":
	//		Для каждой строки ТЧРаботникиОрганизаций ищем движения по регистру РаботникиОрганизации за период > ДатаНачала
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
	|	ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизаций.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ТЧРаботникиОрганизаций.ДатаНачала КАК ДатаНачала,
	|	ТЧРаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизаций.Должность КАК Должность,
	|	ТЧРаботникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
	|	ТЧРаботникиОрганизаций.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизаций.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	ТЧРаботникиОрганизаций.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
	|	ТЧРаботникиОрганизаций.СпособОтраженияВУпрУчете КАК СпособОтраженияВУпрУчете,
	|	ТЧРаботникиОрганизаций.ПодразделениеУпр КАК ПодразделениеУпр,
	|	ТЧРаботникиОрганизаций.ДолжностьУпр КАК ДолжностьУпр,
	|	ТЧРаботникиОрганизаций.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
	|	ТЧРаботникиОрганизаций.ФиксированнаяИндексация КАК ФиксированнаяИндексация,
	|	ТЧРаботникиОрганизаций.ФиксированнаяИндексация КАК Повышение,
	|	ВЫБОР КОГДА НЕ(ТЧРаботникиОрганизаций.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ВЫБОР КОГДА (НЕ(ТЧРаботникиОрганизаций.ПодразделениеОрганизации.Владелец = (&ОбособленноеПодразделениеКуда))) И (&ПоказыватьПодразделения = ИСТИНА) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОбособленномуПодразделению,
	|	ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации					КАК ПрежнееПодразделение,
	|	ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации.Владелец			КАК ПрежняяОрганизация,
	|	ДанныеПоРаботникуДоНазначения.Должность									КАК ПрежняяДолжность,
	|	ДанныеПоРаботникуДоНазначения.ГрафикРаботы								КАК ПрежнийГрафикРаботы,
	|	ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок							КАК ПрежнееЗанимаемыхСтавок,
	|	ДанныеПоРаботникуДоНазначения.Период									КАК ДатаПоследнегоДвиженияПоРаботнику,
	|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	//|	ПересекающиесяСтрокиТабельныйНомер.КонфликтнаяСтрокаНомер КАК КонфликтнаяСтрокаТабельныйНомер,
	//|	ПересекающиесяСтрокиТабельныйНомерУпр.КонфликтнаяСтрокаНомер КАК КонфликтнаяСтрокаТабельныйНомерУпр,
	//|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник1,
	//|	РаботникиСрезПоследних.ФизЛицо КАК Физлицо2,
	|	NULL КАК КонфликтныйДокумент,
	|	ВЫБОР КОГДА (ПриказыОПриеме.Сотрудник) ЕСТЬ NULL  ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаВПриказеОПриемеНетФизЛица,
	|	ВЫБОР КОГДА НЕ(ПриказыОПриеме.Ссылка.Организация В (&СписокСтруктурныхПодразделений)) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаНеСоответствиеОрганизацииПриказаОПриеме
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриказыОПриеме
	|		ПО ПриказыОПриеме.Сотрудник= ТЧРаботникиОрганизаций.Сотрудник И (ПриказыОПриеме.Ссылка.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ
	|			ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|			МАКСИМУМ(Работники.Период) КАК Период
	|		ИЗ
	|			Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|				ПО ТЧРаботникиОрганизаций.Сотрудник = Работники.Сотрудник И (Работники.Организация = &ГоловнаяОрганизация)  И Работники.Период <= ТЧРаботникиОрганизаций.ДатаНачала
	|		
	|		ГДЕ
	|			ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизаций.НомерСтроки
	|		) КАК ДатыПоследнихДвиженийРаботников
	|		ПО ТЧРаботникиОрганизаций.НомерСтроки = ДатыПоследнихДвиженийРаботников.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|		ПО ДанныеПоРаботникуДоНазначения.Сотрудник = ТЧРаботникиОрганизаций.Сотрудник И (ДанныеПоРаботникуДоНазначения.Организация = &ГоловнаяОрганизация) И ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧРаботникиОрганизаций2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций2
	|				ПО (ТЧРаботникиОрганизаций2.Ссылка = &ДокументСсылка) И ТЧРаботникиОрганизаций.Сотрудник = ТЧРаботникиОрганизаций2.Сотрудник  И ТЧРаботникиОрганизаций.НомерСтроки <> ТЧРаботникиОрганизаций2.НомерСтроки И ТЧРаботникиОрганизаций.ДатаНачала <= ТЧРаботникиОрганизаций2.ДатаНачала
	|		
	|		ГДЕ
	|			ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизаций.НомерСтроки) КАК ПересекающиесяСтроки
	|		ПО ТЧРаботникиОрганизаций.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧРаботникиОрганизаций2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций2
	|				ПО (ТЧРаботникиОрганизаций2.Ссылка = &ДокументСсылка)
	|					И ТЧРаботникиОрганизаций.НомерСтроки > ТЧРаботникиОрганизаций2.НомерСтроки
	|		ГДЕ
	|			ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизаций.НомерСтроки) КАК ПересекающиесяСтрокиТабельныйНомер
	|		ПО ТЧРаботникиОрганизаций.НомерСтроки = ПересекающиесяСтрокиТабельныйНомер.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧРаботникиОрганизаций2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизаций2
	|				ПО (ТЧРаботникиОрганизаций2.Ссылка = &ДокументСсылка)
	|					И ТЧРаботникиОрганизаций.НомерСтроки > ТЧРаботникиОрганизаций2.НомерСтроки
	|		ГДЕ
	|			ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизаций.НомерСтроки) КАК ПересекающиесяСтрокиТабельныйНомерУпр
	|		ПО ТЧРаботникиОрганизаций.НомерСтроки = ПересекающиесяСтрокиТабельныйНомерУпр.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
	|        ПО ТЧРаботникиОрганизаций.Сотрудник <> РаботникиОрганизацийСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&Дата) КАК РаботникиСрезПоследних
	|        ПО ТЧРаботникиОрганизаций.Сотрудник.ФизЛицо <> РаботникиСрезПоследних.ФизЛицо
	|
	|ГДЕ
	|	ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""КонфликтныйДокумент"",
	|	ТЧРаботникиОрганизаций.НомерСтроки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	//|	NULL,
	//|	NULL,
	//|	NULL,
	|	NULL,
	|	NULL,
    |	Работники.Регистратор";
		// Дополнительно используем выборку "ПриказыОПриеме" -
		// присоединяем данные о приказах-приемах на работу с целью проверки соответствия выбранных приказов физлицам и организации.
		ТекстЗапроса = ТекстЗапроса + ",
	|	NULL,
	|	NULL";
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|		ПО Работники.Сотрудник = ТЧРаботникиОрганизаций.Сотрудник И (Работники.Организация = &ГоловнаяОрганизация) И Работники.Период = ТЧРаботникиОрганизаций.ДатаНачала
	|
	|ГДЕ
	|	ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизаций()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизацийСтарыеОтраженияЗП()

	Запрос = Новый Запрос;
	
	// Установим параметры запроса     
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("парамДействие", Перечисления.ВидыДействияСНачислением.Начать);
	Запрос.УстановитьПараметр("пустойВидРасчета", ПланыВидовРасчета.Начисления.ПустаяСсылка());	
	Запрос.УстановитьПараметр("парамОрганизация", Организация);

	ТекстЗапроса = "
	|ВЫБРАТЬ                                    
	|	ТЧРаботникиОрганизаций.НомерСтроки				КАК НомерСтроки,
	|	ТЧРаботникиОрганизаций.ДатаНачала				КАК ДатаНачала,
	|	ТЧРаботникиОрганизаций.Сотрудник					КАК Сотрудник,
	|	СтарыйСпособОтражения.СпособОтраженияВБухучете	КАК СтарыйСпособОтраженияВБухучете,	
	|	ТЧРаботникиОрганизаций.СпособОтраженияВБухучете	КАК СпособОтраженияВБухучете,
	|	ТЧРаботникиОрганизаций.СпособОтраженияВУпручете	КАК СпособОтраженияВУпручете,
	|	&парамДействие		КАК Действие,
	|	&пустойВидРасчета	КАК НовыеНачисления_ВидРасчета,
	|	NULL	КАК Показатель1,
	|	NULL	КАК Показатель2,
	|	NULL	КАК Показатель3,
	|	NULL	КАК Показатель4,
	|	NULL	КАК Показатель5,
	|	NULL	КАК Показатель6,
	|	NULL	КАК Валюта1,
	|	NULL	КАК Валюта2,
	|	NULL	КАК Валюта3,
	|	NULL	КАК Валюта4,
	|	NULL	КАК Валюта5,
	|	NULL	КАК Валюта6

	|		                
	|ИЗ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ(  
	|	ВЫБРАТЬ                                    
	|		СтароеНазначение.Сотрудник					КАК Сотрудник,
	|		МАКСИМУМ(СтароеНазначение.Период)			КАК Период
	|
	|	ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СтароеНазначение
	|
	|	ГДЕ		СтароеНазначение.ВидРасчета = &пустойВидРасчета	
	|		И	СтароеНазначение.Организация = &парамОрганизация 
	|
	|   СГРУППИРОВАТЬ ПО
	|		СтароеНазначение.Сотрудник
	|
	|) КАК СтарыеНачисления
	|ПО		СтарыеНачисления.Сотрудник = ТЧРаботникиОрганизаций.Сотрудник
	|	И	СтарыеНачисления.Период < ТЧРаботникиОрганизаций.ДатаНачала	
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СтарыйСпособОтражения
	|ПО		СтарыйСпособОтражения.Организация = &парамОрганизация 
	|	И	СтарыйСпособОтражения.Сотрудник = ТЧРаботникиОрганизаций.Сотрудник
	|	И	СтарыйСпособОтражения.ВидРасчета = &пустойВидРасчета	
	|	И	СтарыйСпособОтражения.Период = СтарыеНачисления.Период	
	|
	|ГДЕ
	|	ТЧРаботникиОрганизаций.Ссылка = &ДокументСсылка
	|";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизаций()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПроверкаНачисления()

	Запрос = Новый Запрос;

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеИПрежниеНачисления.НомерСтроки,
	|	ТекущиеИПрежниеНачисления.Сотрудник,	
	|	ТекущиеИПрежниеНачисления.ВидРасчета,
	|	ТекущиеИПрежниеНачисления.Действие,
	|	ТекущиеИПрежниеНачисления.ВидНачисления,
	|	ТекущиеИПрежниеНачисления.СпособОтраженияВБухучете,
	|	ТекущиеИПрежниеНачисления.СпособОтраженияВУпручете,
	|	ТекущиеИПрежниеНачисления.Показатель1,
	|	ТекущиеИПрежниеНачисления.Показатель2,
	|	ТекущиеИПрежниеНачисления.Показатель3,
	|	ТекущиеИПрежниеНачисления.Показатель4,
	|	ТекущиеИПрежниеНачисления.Показатель5,
	|	ТекущиеИПрежниеНачисления.Показатель6,
	|	ТекущиеИПрежниеНачисления.Валюта1,
	|	ТекущиеИПрежниеНачисления.Валюта2,
	|	ТекущиеИПрежниеНачисления.Валюта3,
	|	ТекущиеИПрежниеНачисления.Валюта4,
	|	ТекущиеИПрежниеНачисления.Валюта5,
	|	ТекущиеИПрежниеНачисления.Валюта6,
	|	ТекущиеИПрежниеНачисления.ДатаНачала,
	|	ТекущиеИПрежниеНачисления.ОрганизацияПодразделения,
	|	ТекущиеИПрежниеНачисления.ДатаДвижения,
	|	ТекущиеИПрежниеНачисления.Регистратор.Представление КАК КонфликтныйДокумент,
	|	МИНИМУМ(ДвойныеСтроки.НомерСтроки) КАК ДвойнаяСтрока,
	|	ТекущиеИПрежниеНачисления.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыНачислений.НомерСтроки				КАК НомерСтроки,
	|		ДатыНачислений.Сотрудник					КАК Сотрудник,
	|		ДатыНачислений.ВидРасчета				КАК ВидРасчета,
	|		ДатыНачислений.Действие					КАК Действие,
	|		ДатыНачислений.ВидНачисления			КАК ВидНачисления,
	|		ДатыНачислений.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
	|		ДатыНачислений.СпособОтраженияВУпручете КАК СпособОтраженияВУпручете,
	|		ДатыНачислений.Показатель1,
	|		ДатыНачислений.Показатель2,
	|		ДатыНачислений.Показатель3,
	|		ДатыНачислений.Показатель4,
	|		ДатыНачислений.Показатель5,
	|		ДатыНачислений.Показатель6,
	|		ДатыНачислений.Валюта1,
	|		ДатыНачислений.Валюта2,
	|		ДатыНачислений.Валюта3,
	|		ДатыНачислений.Валюта4,
	|		ДатыНачислений.Валюта5,
	|		ДатыНачислений.Валюта6,
	|		ДатыНачислений.ДатаНачала				КАК ДатаНачала,
	|		ДатыНачислений.ОрганизацияПодразделения КАК ОрганизацияПодразделения,
	|		ДатыНачислений.Период					КАК ДатаДвижения,
	|		ПлановыеНачисленияРаботниковОрганизаций.Регистратор			КАК Регистратор,
	|		ДатыНачислений.Ссылка										КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТЧНачисления.НомерСтроки						КАК НомерСтроки,
	|			ТЧНачисления.Ссылка								КАК Ссылка,
	|			ТЧНачисления.Сотрудник							КАК Сотрудник,
	|			ТЧНачисления.ВидРасчета							КАК ВидРасчета,
	|			ТЧНачисления.СпособОтраженияВБухучете			КАК СпособОтраженияВБухучете,
	|			ТЧНачисления.СпособОтраженияВУпручете КАК СпособОтраженияВУпручете,
	|			ТЧНачисления.Показатель1,
	|			ТЧНачисления.Показатель2,
	|			ТЧНачисления.Показатель3,
	|			ТЧНачисления.Показатель4,
	|			ТЧНачисления.Показатель5,
	|			ТЧНачисления.Показатель6,
	|			ТЧНачисления.Валюта1,
	|			ТЧНачисления.Валюта2,
	|			ТЧНачисления.Валюта3,
	|			ТЧНачисления.Валюта4,
	|			ТЧНачисления.Валюта5,
	|			ТЧНачисления.Валюта6,
	|			ТЧНачисления.ДатаНачала							КАК ДатаНачала,
	|			ТЧНачисления.ОрганизацияПодразделения			КАК ОрганизацияПодразделения,
	|			ТЧНачисления.Действие							КАК Действие,
	|			ТЧНачисления.ВидНачисления						КАК ВидНачисления,
	|			МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизаций.Период) КАК Период
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Начисления.Ссылка			КАК Ссылка,
	|				Начисления.НомерСтроки		КАК НомерСтроки,
	|				Начисления.Сотрудник			КАК Сотрудник,
	|				Начисления.Действие			КАК Действие,
	|				Начисления.ВидНачисления	КАК ВидНачисления,
	|				Начисления.ВидРасчета		КАК ВидРасчета,
	|				Начисления.СпособОтраженияВБухучете		КАК СпособОтраженияВБухучете,
	|				Начисления.СпособОтраженияВУпручете		КАК СпособОтраженияВУпручете,
	|				Начисления.Показатель1,
	|				Начисления.Показатель2,
	|				Начисления.Показатель3,
	|				Начисления.Показатель4,
	|				Начисления.Показатель5,
	|				Начисления.Показатель6,
	|				Начисления.Валюта1,
	|				Начисления.Валюта2,
	|				Начисления.Валюта3,
	|				Начисления.Валюта4,
	|				Начисления.Валюта5,
	|				Начисления.Валюта6,
	|				РаботникиОрганизации.ДатаНачала							КАК ДатаНачала,
	|				РаботникиОрганизации.ПодразделениеОрганизации.Владелец	КАК ОрганизацияПодразделения
	|			
	|			ИЗ	Документ.КадровоеПеремещениеОрганизаций.Начисления КАК Начисления
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
	|			ПО Начисления.Сотрудник = РаботникиОрганизации.Сотрудник 
	|				И Начисления.Ссылка = РаботникиОрганизации.Ссылка
	|			
	|			ГДЕ	Начисления.Ссылка = &ДокументСсылка	
    |
	|			) КАК ТЧНачисления
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|		ПО ТЧНачисления.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник 
	|		И (ПлановыеНачисленияРаботниковОрганизаций.Организация = &ГоловнаяОрганизация) 
	|		И ТЧНачисления.ДатаНачала >= ПлановыеНачисленияРаботниковОрганизаций.Период 
	|		И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = ТЧНачисления.ВидРасчета
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧНачисления.Сотрудник,
	|			ТЧНачисления.ДатаНачала,
	|			ТЧНачисления.Ссылка,
	|			ТЧНачисления.НомерСтроки,
	|			ТЧНачисления.ОрганизацияПодразделения,
	|			ТЧНачисления.ВидРасчета,
	|			ТЧНачисления.СпособОтраженияВБухучете,
	|			ТЧНачисления.СпособОтраженияВУпручете,
	|			ТЧНачисления.Показатель1,
	|			ТЧНачисления.Показатель2,
	|			ТЧНачисления.Показатель3,
	|			ТЧНачисления.Показатель4,
	|			ТЧНачисления.Показатель5,
	|			ТЧНачисления.Показатель6,
	|			ТЧНачисления.Валюта1,
	|			ТЧНачисления.Валюта2,
	|			ТЧНачисления.Валюта3,
	|			ТЧНачисления.Валюта4,
	|			ТЧНачисления.Валюта5,
	|			ТЧНачисления.Валюта6,
	|			ТЧНачисления.ДатаНачала,
	|			ТЧНачисления.ОрганизацияПодразделения,
	|			ТЧНачисления.Действие,
	|			ТЧНачисления.ВидНачисления) КАК ДатыНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|			ПО ДатыНачислений.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник И (ПлановыеНачисленияРаботниковОрганизаций.Организация = &ГоловнаяОрганизация)И ДатыНачислений.Период = ПлановыеНачисленияРаботниковОрганизаций.Период И ДатыНачислений.ВидРасчета = ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета) КАК ТекущиеИПрежниеНачисления
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.Начисления КАК ДвойныеСтроки
	|		ПО ТекущиеИПрежниеНачисления.Ссылка = ДвойныеСтроки.Ссылка 
	|			И ТекущиеИПрежниеНачисления.Сотрудник = ДвойныеСтроки.Сотрудник 
	|			И ТекущиеИПрежниеНачисления.ВидРасчета = ДвойныеСтроки.ВидРасчета 
	|			И ТекущиеИПрежниеНачисления.НомерСтроки < ДвойныеСтроки.НомерСтроки
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеИПрежниеНачисления.ДатаДвижения,
	|	ТекущиеИПрежниеНачисления.Регистратор,
	|	ТекущиеИПрежниеНачисления.ОрганизацияПодразделения,
	|	ТекущиеИПрежниеНачисления.ДатаНачала,
	|	ТекущиеИПрежниеНачисления.НомерСтроки,
	|	ТекущиеИПрежниеНачисления.Сотрудник,
	
	|	ТекущиеИПрежниеНачисления.ВидРасчета,
	|	ТекущиеИПрежниеНачисления.Действие,
	|	ТекущиеИПрежниеНачисления.ВидНачисления,
	|	ТекущиеИПрежниеНачисления.СпособОтраженияВБухучете,
	|	ТекущиеИПрежниеНачисления.СпособОтраженияВУпручете,
	|	ТекущиеИПрежниеНачисления.Показатель1,
	|	ТекущиеИПрежниеНачисления.Показатель2,
	|	ТекущиеИПрежниеНачисления.Показатель3,
	|	ТекущиеИПрежниеНачисления.Показатель4,
	|	ТекущиеИПрежниеНачисления.Показатель5,
	|	ТекущиеИПрежниеНачисления.Показатель6,
	|	ТекущиеИПрежниеНачисления.Валюта1,
	|	ТекущиеИПрежниеНачисления.Валюта2,
	|	ТекущиеИПрежниеНачисления.Валюта3,
	|	ТекущиеИПрежниеНачисления.Валюта4,
	|	ТекущиеИПрежниеНачисления.Валюта5,
	|	ТекущиеИПрежниеНачисления.Валюта6,
	|	ТекущиеИПрежниеНачисления.Ссылка,
	|	ТекущиеИПрежниеНачисления.Регистратор.Представление";
	
	Запрос.Текст = ТекстЗапроса;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачисления()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоУдержания()
	Запрос = Новый Запрос;

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Работники.Сотрудник			КАК Сотрудник,
	|	Работники.ДатаНачала		КАК ДатаНачала,
	|	Работники.ВидРасчета		КАК ВидРасчета,
	|	Работники.Период 			КАК Период,
	|	СтУдержания.ВидРасчета		КАК СтНачисления_ВидРасчета,
	|	НовыеУдержания.ВидРасчета 	КАК НовыеНачисления_ВидРасчета,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА &парамДейстсвиеПрекратить 
	|			ИНАЧЕ НовыеУдержания.Действие
	|		КОНЕЦ КАК Действие,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель1 
	|			ИНАЧЕ НовыеУдержания.Показатель1
	|		КОНЕЦ КАК Показатель1,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель2 
	|			ИНАЧЕ НовыеУдержания.Показатель2
	|		КОНЕЦ КАК Показатель2,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель3 
	|			ИНАЧЕ НовыеУдержания.Показатель3
	|		КОНЕЦ КАК Показатель3,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель4 
	|			ИНАЧЕ НовыеУдержания.Показатель4
	|		КОНЕЦ КАК Показатель4,
	|
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель5 
	|			ИНАЧЕ НовыеУдержания.Показатель5
	|		КОНЕЦ КАК Показатель5,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Показатель6 
	|			ИНАЧЕ НовыеУдержания.Показатель6
	|		КОНЕЦ КАК Показатель6,
	|			
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта1 
	|			ИНАЧЕ НовыеУдержания.Валюта1
	|		КОНЕЦ КАК Валюта1,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта2 
	|			ИНАЧЕ НовыеУдержания.Валюта2
	|		КОНЕЦ КАК Валюта2,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта3 
	|			ИНАЧЕ НовыеУдержания.Валюта3
	|		КОНЕЦ КАК Валюта3,
	|
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта4 
	|			ИНАЧЕ НовыеУдержания.Валюта4
	|		КОНЕЦ КАК Валюта4,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта5 
	|			ИНАЧЕ НовыеУдержания.Валюта5
	|		КОНЕЦ КАК Валюта5,
	|
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.Валюта6 
	|			ИНАЧЕ НовыеУдержания.Валюта6
	|		КОНЕЦ КАК Валюта6,
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.СпособОтраженияВБухучете 
	|			ИНАЧЕ НовыеУдержания.СпособОтраженияВБухучете
	|		КОНЕЦ КАК СпособОтраженияВБухучете,
	|		
	|		
	|	ВЫБОР КОГДА НовыеУдержания.ВидРасчета ЕСТЬ NULL 
	|			ТОГДА СтУдержания.СпособОтраженияВУпручете 
	|			ИНАЧЕ НовыеУдержания.СпособОтраженияВУпручете
	|		КОНЕЦ КАК СпособОтраженияВУпручете
	|		
	|		
	|ИЗ (
	|	ВЫБРАТЬ
	|		РаботникиПериоды.Сотрудник					КАК Сотрудник,
	|		РаботникиПериоды.Организация				КАК Организация,
	|		РаботникиПериоды.ДатаНачала					КАК ДатаНачала,
	|		РаботникиПериоды.ВидРасчета					КАК ВидРасчета,
	|		МАКСИМУМ(РаботникиПериоды.Период) 			КАК Период
	|	
	|	ИЗ (
	|		ВЫБРАТЬ
	|			РаботникиОрганизации.Сотрудник					КАК Сотрудник,
	|			РаботникиОрганизации.Ссылка.Организация				КАК Организация,
	|			РаботникиОрганизации.ДатаНачала					КАК ДатаНачала,
	|			АктуальныеУдержания.ВидРасчета					КАК ВидРасчета,
	|			МАКСИМУМ(АктуальныеУдержания.Период) 			КАК Период
	|		ИЗ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
	|		
	|			
	|		ЛЕВОЕ СОЕДИНЕНИЕ(
	|			ВЫБРАТЬ
	|				ПлановыеУдержания.Сотрудник		КАК Сотрудник,
	|				ПлановыеУдержания.Организация	КАК Организация,
	|				ПлановыеУдержания.ВидРасчета	КАК ВидРасчета,
	|				ПлановыеУдержания.Период		КАК Период
	|				
	|			ИЗ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержания		
	|			ГДЕ ПлановыеУдержания.Организация = &ГоловнаяОрганизация
	|			
	|		)КАК АктуальныеУдержания
	|		ПО		АктуальныеУдержания.Сотрудник	= РаботникиОрганизации.Сотрудник 
	|			И	АктуальныеУдержания.Организация	= РаботникиОрганизации.Ссылка.Организация 
	|			И	АктуальныеУдержания.Период	< РаботникиОрганизации.ДатаНачала 
	|	
	|		ГДЕ	РаботникиОрганизации.Ссылка = &ДокументСсылка
 	|		И	АктуальныеУдержания.ВидРасчета <> &пустойВидРасчета
	| 			
	|		СГРУППИРОВАТЬ ПО
	|			РаботникиОрганизации.Сотрудник,
	|			РаботникиОрганизации.Ссылка.Организация,
	|			РаботникиОрганизации.ДатаНачала,
	|			АктуальныеУдержания.ВидРасчета
	| 
	|		ОБЪЕДИНИТЬ
	|	 	ВЫБРАТЬ
	|			РаботникиОрганизации.Сотрудник			КАК Сотрудник,
	|			РаботникиОрганизации.Ссылка.Организация	КАК Организация,
	|			РаботникиОрганизации.ДатаНачала		КАК ДатаНачала,
	|			НовыеУдержания.ВидРасчета			КАК ВидРасчета,
	|			РаботникиОрганизации.ДатаНачала		КАК Период
	|			 		
	|		ИЗ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ  Документ.КадровоеПеремещениеОрганизаций.Удержания КАК НовыеУдержания
	|		ПО		РаботникиОрганизации.Сотрудник = НовыеУдержания.Сотрудник
	|		   И	НовыеУдержания.Ссылка = &ДокументСсылка
    |
	|		ГДЕ	РаботникиОрганизации.Ссылка = &ДокументСсылка
 	|	 	И	НовыеУдержания.ВидРасчета <> &пустойВидРасчета
	|
	|   ) КАК РаботникиПериоды
	|		   
	|   СГРУППИРОВАТЬ ПО
	|		РаботникиПериоды.Сотрудник,
	|		РаботникиПериоды.Организация,
	|		РаботникиПериоды.ДатаНачала,
	|		РаботникиПериоды.ВидРасчета
	|) КАК Работники
	|				
	|ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК СтУдержания
	|ПО		Работники.Сотрудник = СтУдержания.Сотрудник
	|	И	Работники.ВидРасчета = СтУдержания.ВидРасчета
	|	И	Работники.Период = СтУдержания.Период
	|			
	|ЛЕВОЕ СОЕДИНЕНИЕ  Документ.КадровоеПеремещениеОрганизаций.Удержания КАК НовыеУдержания
	|ПО		Работники.Сотрудник = НовыеУдержания.Сотрудник
	|	И	Работники.ВидРасчета = НовыеУдержания.ВидРасчета
	|	И   НовыеУдержания.Ссылка = &ДокументСсылка
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("пустойВидРасчета", ПланыВидовРасчета.Удержания.ПустаяСсылка());	
	Запрос.УстановитьПараметр("парамДейстсвиеПрекратить", Перечисления.ВидыДействияСНачислением.Прекратить);	
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоУдержания()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)
	
	СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табл. части ""Работники"": ", СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда

		// ФизЛицо
		НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
		Если НетСотрудника Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ);
		КонецЕсли;

		// ДатаНачала
		НетДатыНачала = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала);
		Если НетДатыНачала Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указазана дата перемещения!", Отказ);
		КонецЕсли;

		
		Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда			
			// Подразделение
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение (регл), куда переводится работник!", Отказ);
			ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "указано подразделение (регл), принадлежащее другой организации!", Отказ);
			ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОбособленномуПодразделению Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "указано подразделение (регл), принадлежащее другому обособленнму подразделению!", Отказ);
			КонецЕсли;

			// Должность
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана должность (регл), на которую переводится работник!", Отказ);
			КонецЕсли;

			
			Если НетСотрудника ИЛИ НетДатыНачала Тогда
				Возврат; // Дальше не проверяем
			КонецЕсли;
			
			// Приказ о приеме должен принадлежать организации
			Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеОрганизацииПриказаОПриеме Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " указанный приказ о приеме оформлен на другую организацию!", Отказ);
				
			КонецЕсли;
				
				
			//Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник1) Тогда
			//	Сообщить(СтрокаНачалаСообщенияОбОшибке + Локализация.СтрШаблон1("табельный номер (регл) уже используется для работника ¤1¤", ВыборкаПоСтрокамДокумента.Сотрудник1.Наименование), СтатусСообщения.Важное);
			//КонецЕсли;                    

			
		КонецЕсли;
		
		Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете Тогда
						
			// Подразделение
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеУпр) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение (упр), куда переводится работник!", Отказ);
			КонецЕсли;

			// Должность
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДолжностьУпр) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана должность (упр), на которую переводится работник!", Отказ);
			КонецЕсли;

			Если НетСотрудника
				ИЛИ НетДатыНачала Тогда
				Возврат; // Дальше не проверяем
			КонецЕсли;
			
			Уволен = Ложь;
			УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.Сотрудник.ФизЛицо));
			Для каждого Место из УжеРаботает Цикл
				Если Место.ЗанимаемыхСтавок = 0 Тогда
					Уволен = Истина;
				КонецЕсли;
			КонецЦикла;
			Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "работник не принят на работу на предприятие!",Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		
		// Проверка: противоречие другой строке документа
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			СтрокаСообщениеОбОшибке = "период действия назначения пересекается с периодом действия строки " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;
		


	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "КонфликтныйДокумент" Тогда	

		// противоречие другим кадровым приказам
		СтрокаСообщениеОбОшибке = "период действия приказа противоречит кадровому приказу " + Символы.ПС + Символы.Таб + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
	КонецЕсли; 

КонецПроцедуры

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табл. части ""Начисления"": ", СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	// ФизЛицо
 	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
 	Если НетСотрудника Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ);
	КонецЕсли;
		
	// Вид начисления
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидНачисления) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указан вид начисления!");
	КонецЕсли;
    	
	// Вид расчета
 	НетВР = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета);
 	Если НетВР Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ);
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ);
	КонецЕсли;
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.ДатаНачала = NULL Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ);
	КонецЕсли;
	
	// Проверка: противоречие другой строке документа
	Если Не НетВР и Не НетСотрудника и (ВыборкаПоСтрокамДокумента.ДвойнаяСтрока <> NULL) и (ВыборкаПоСтрокамДокумента.ВидНачисления = перечисления.ВидыНачисленийРаботникаОрганизации.Индивидуальное) Тогда
		СтрокаСообщениеОбОшибке = "по работнику не может быть изменено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
	КонецЕсли;	
	
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать
		ИЛИ ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		
		
		Если ОтражатьВРеглУчете Тогда
			
			// Способ отражения в бухучете
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не заполнен ""Способ отражения в бух.учете""!", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОтражатьВУпрУчете Тогда
			
			// Способ отражения в упручете
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете) Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не заполнен ""Способ отражения в упр.учете""!", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать
		   И ВыборкаПоСтрокамДокумента.ВидНачисления = Перечисления.ВидыНачисленийРаботникаОрганизации.Основное Тогда	
			Конфликт = Ложь;
			Действующие = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("Сотрудник,Организация",ВыборкаПоСтрокамДокумента.Сотрудник,ВыборкаПоШапкеДокумента.Организация));
			Для каждого ВР из Действующие Цикл
				Если ВР.ВидНачисления = Перечисления.ВидыНачисленийРаботникаОрганизации.Основное Тогда
					//Проверим, не отменяется ли оно в документе
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Сотрудник", ВыборкаПоСтрокамДокумента.Сотрудник);
					ПараметрыОтбора.Вставить("ВидРасчета", ВР.ВидРасчета);
					ПараметрыОтбора.Вставить("Действие", Перечисления.ВидыДействияСНачислением.Прекратить);
					НайденныеСтроки = Начисления.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество() = 0 Тогда
						Конфликт = Истина;
						Прервать;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			Если Конфликт Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "у работника уже действует основное начисление!",Отказ);
			КонецЕсли;
        КонецЕсли;

		
	КонецЕсли;	
			
КонецПроцедуры		

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		
		Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
			
			// отразим новое место работы
			Движение = Движения.РаботникиОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
						
			// Ресурсы
			Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок;
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
			Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
			Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
			
			// Реквизиты
			//Движение.Организация				= ВыборкаПоСтрокамДокумента.ОрганизацияПодразделения;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.Перемещение;
		КонецЕсли;
		
		// Движения по регистру "КоэффициентыПовышенияОкладов" - отразим факт индексации заработка
		Если ВыборкаПоШапкеДокумента.ИндексацияЗаработка  Тогда //И СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра)
			
			Движение = Движения.КоэффициентыПовышенияОкладов.Добавить();
			
			// Свойства
			Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаНачала;
			
			// Измерения
			Движение.Сотрудник                    = ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация                = ВыборкаПоШапкеДокумента.Организация;
			
			// Ресурсы
			Движение.Коэффициент				= КоэффициентИндексацииЗаработка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете Тогда
		
		Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
			
			// отразим новое место работы
			Движение = Движения.Работники.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала;
			
			// Измерения
			Движение.ФизЛицо					= ВыборкаПоСтрокамДокумента.Сотрудник.ФизЛицо;
			
			// Ресурсы
			Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавокУпр;
			Движение.Подразделение				= ВыборкаПоСтрокамДокумента.ПодразделениеУпр;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.ДолжностьУпр;
			Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
			Движение.СпособОтраженияВУпрУчете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВУпрУчете;
			
			// Реквизиты
			Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.Перемещение;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоВзносамВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Если НЕ ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Возврат;
	КонецЕсли;
		
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
		// ничего не меняем
		Возврат;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать
		ИЛИ ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
		мДействует	= Истина;

	ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
		// движеие на вечер предыдущих суток
		мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия - 1;
		мДействует	= Ложь;

	КонецЕсли;
	
	Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период       = мПериод;
	Движение.Регистратор  = ВыборкаПоШапкеДокумента.Ссылка;
	
	// Измерения
	Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Налог			= ВыборкаПоСтрокамДокумента.Налог;
	
	// Ресурсы
	Движение.Актуальность	= мДействует;
			
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, мПериод, мДействует)
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период						= мПериод;
	
	// Измерения
	Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;

	Движение.ВидРасчета					= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	Если НЕ (ВыборкаПоСтрокамДокумента.ВидНачисления = Перечисления.ВидыНачисленийРаботникаОрганизации.Основное) Тогда
      Движение.ВидРасчетаИзмерение      = ВыборкаПоСтрокамДокумента.ВидРасчета;
	КонецЕсли;
	
	// Ресурсы
	Движение.Актуальность		= мДействует;
	Если мДействует Тогда
		Движение.Показатель1	= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2	= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3	= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4	= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5	= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6	= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.Валюта1		= ВыборкаПоСтрокамДокумента.Валюта1;
		Движение.Валюта2		= ВыборкаПоСтрокамДокумента.Валюта2;
		Движение.Валюта3		= ВыборкаПоСтрокамДокумента.Валюта3;
		Движение.Валюта4		= ВыборкаПоСтрокамДокумента.Валюта4;
		Движение.Валюта5		= ВыборкаПоСтрокамДокумента.Валюта5;
		Движение.Валюта6		= ВыборкаПоСтрокамДокумента.Валюта6;
		Движение.ВидНачисления	= ВыборкаПоСтрокамДокумента.ВидНачисления;
		
		Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
		Движение.СпособОтраженияВУпручете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, мПериод, мДействует)
	
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период			= мПериод;
	
	// Измерения
	Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ВидРасчета		= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	// Ресурсы
	Движение.Актуальность	= мДействует;
	Движение.Показатель1	= ВыборкаПоСтрокамДокумента.Показатель1;
	Движение.Показатель2	= ВыборкаПоСтрокамДокумента.Показатель2;
	Движение.Показатель3	= ВыборкаПоСтрокамДокумента.Показатель3;
	Движение.Показатель4    = ВыборкаПоСтрокамДокумента.Показатель4;
	Движение.Показатель5	= ВыборкаПоСтрокамДокумента.Показатель5;
	Движение.Показатель6	= ВыборкаПоСтрокамДокумента.Показатель6;
	Движение.Валюта1		= ВыборкаПоСтрокамДокумента.Валюта1;
	Движение.Валюта2		= ВыборкаПоСтрокамДокумента.Валюта2;
	Движение.Валюта3		= ВыборкаПоСтрокамДокумента.Валюта3;
	Движение.Валюта4		= ВыборкаПоСтрокамДокумента.Валюта4;
	Движение.Валюта5		= ВыборкаПоСтрокамДокумента.Валюта5;
	Движение.Валюта6		= ВыборкаПоСтрокамДокумента.Валюта6;
	
	Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
	Движение.СпособОтраженияВУпручете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете;

КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоРегистрам(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)
	
	Движение = Движения.ПараметрыФиксированнойИндексации.Добавить();
	Движение.Организация  	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник    	= ВыборкаПоРаботникиОрганизации.Сотрудник;
	Движение.Период       	= ВыборкаПоРаботникиОрганизации.ДатаНачала;
	Движение.Размер			= ВыборкаПоРаботникиОрганизации.ФиксированнаяИндексация;
	
КонецПроцедуры	

// Формирует запрос по таблице "Сотрудники" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса. В запросе данные документа дополняются значениями
//  проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоВзносамСотрудники(Режим)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

    // Описание текста запроса:
	//
    // 1. Выборка "Начисления": 
	//		Объединяются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧВзносы.НомерСтроки,
	               |	ТЧВзносы.Сотрудник,
	               |	ТЧВзносы.Налог,
	               |	ТЧВзносы.Действие,
				   |	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаДействия
				   |ИЗ Документ.КадровоеПеремещениеОрганизаций.Взносы КАК ТЧВзносы
				   |	
				   |ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
				   |ПО		ТЧРаботникиОрганизации.Сотрудник = ТЧВзносы.Сотрудник 
				   |	И	ТЧРаботникиОрганизации.Ссылка = ТЧВзносы.Ссылка
				   |	
				   |ГДЕ ТЧВзносы.Ссылка = &ДокументСсылка
				   |
				   |	
				   |ОБЪЕДИНИТЬ	
				   |ВЫБРАТЬ	
				   |	ТЧВзносыФОТ.НомерСтроки,
				   |	ТЧВзносыФОТ.Сотрудник,
				   |	ТЧВзносыФОТ.Налог,
				   |	ТЧВзносыФОТ.Действие,
				   |	ТЧРаботникиОрганизации.ДатаНачала
				   |ИЗ Документ.КадровоеПеремещениеОрганизаций.ВзносыФОТ КАК ТЧВзносыФОТ
				   |	
				   |ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
				   |ПО		ТЧРаботникиОрганизации.Сотрудник = ТЧВзносыФОТ.Сотрудник 
				   |	И	ТЧРаботникиОрганизации.Ссылка = ТЧВзносыФОТ.Ссылка
				   |
				   |ГДЕ	ТЧВзносыФОТ.Ссылка = &ДокументСсылка
				   |";
			   
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции


////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;

	//структура, содержащая имена регистров накопления по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамНакопления;
    	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	ПрименяетсяФиксированнаяИндексация = (ПроведениеРасчетов.ДатаВвводаФиксированнойИндексации() <= Дата);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			РезультатЗапросаПоРаботники	= 	СформироватьЗапросПоРаботникиОрганизаций(Режим);
			ВыборкаПоСтрокамДокумента 	= 	РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			

			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента, Отказ);

				Если НЕ Отказ Тогда

					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
					Если ИндексацияЗаработка И ПрименяетсяФиксированнаяИндексация И ВыборкаПоСтрокамДокумента.Повышение > 0 Тогда
                    	ДобавитьСтрокуВДвиженияПоРегистрам(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
					КонецЕсли;	
				КонецЕсли;

			КонецЦикла;
			
			// надо закрыть способы расчета по сотрудникам, 
			// если не изменился	- движения не делаем, 
			// если новый пустой	- закрываем, 
			// если другой			- просто записываем новый
			ВыборкаПоСтрокамРаботники = СформироватьЗапросПоРаботникиОрганизацийСтарыеОтраженияЗП().Выбрать();
		
			// плановые начисления
			Если НЕ Отказ Тогда
				// выполним выборку по табличной части основных начислений  
				// ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления().Выбрать();
				ВыборкаПоСтрокамДокумента = СформироватьЗапросПроверкаНачисления().Выбрать();
				
				// обходим строки документа
				Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
					ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ);
					Если не Отказ Тогда
						
						Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
							Продолжить;
						КонецЕсли;
						
						Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
							// ничего не меняем
							Продолжить;
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
							мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала-1;
							мДействует	= Ложь;
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
							мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала;
							мДействует	= Истина;
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
							мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала;
							мДействует	= Истина;
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
							// движеие на вечер предыдущих суток
							мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала - 1;
							мДействует	= Ложь;
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						КонецЕсли;

					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// плановые удержания
			Если НЕ Отказ Тогда
				// выполним выборку по табличной части Удержания
				ВыборкаПоСтрокамДокумента = СформироватьЗапросПоУдержания().Выбрать();
				
				// обходим строки документа
				Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
					
					Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
						// ничего не меняем
						Продолжить;
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
						мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала-1;
						мДействует	= Ложь;
						ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
						мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала;
						мДействует	= Истина;
						ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
						мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала;
						мДействует	= Истина;
						ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
						// движеие на вечер предыдущих суток
						мПериод = ВыборкаПоСтрокамДокумента.ДатаНачала - 1;
						мДействует	= Ложь;
						ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			РезультатЗапросаПоВзносам = СформироватьЗапросПоВзносамСотрудники(Режим);
			ВыборкаПоВзносам = РезультатЗапросаПоВзносам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоВзносам.Следующий() Цикл 
				
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоВзносамВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоВзносам);
				
			КонецЦикла;
	
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
	
		Если Не Основание.ОбособленноеПодразделение.Пустая() Тогда
			Организация = Основание.ОбособленноеПодразделение;
		Иначе
			Организация = Основание.Организация;
		КонецЕсли;
		
		НоваяСтрока = РаботникиОрганизации.Добавить();
		ФормаДокумента = ПолучитьФорму();

		НаборДанных = ПроцедурыУправленияПерсоналом.ПодборДанныхПоСотруднику(ФормаДокумента, ФормаДокумента.ЭлементыФормы.РаботникиОрганизации,Основание, Организация,,глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"));
		НоваяСтрока.Сотрудник = Основание;
		
		НоваяСтрока.ДатаНачала = ТекущаяДата();
		Если НаборДанных <> Неопределено Тогда
			НоваяСтрока.ЗанимаемыхСтавок = НаборДанных.ЗанимаемыхСтавок;
			НоваяСтрока.ЗанимаемыхСтавокУпр = НаборДанных.ЗанимаемыхСтавокУпр;			
			НоваяСтрока.Должность = НаборДанных.Должность;
			НоваяСтрока.ДолжностьУпр = НаборДанных.ДолжностьУпр;
			НоваяСтрока.ГрафикРаботы = НаборДанных.ГрафикРаботы;
			НоваяСтрока.ПодразделениеОрганизации = НаборДанных.ПодразделениеОрганизации;
			НоваяСтрока.ПодразделениеУпр = НаборДанных.ПодразделениеУпр;
			НоваяСтрока.СпособОтраженияВБухУчете = НаборДанных.СпособОтраженияВБухУчете;
			НоваяСтрока.СпособОтраженияВУпрУчете = НаборДанных.СпособОтраженияВУпрУчете;
			НоваяСтрока.ФизЛицо = Основание.ФизЛицо;
		КонецЕсли;
			
		ДобавитьСтрокиНачисленийПоРаботнику(Основание);
		ФормаДокумента.ДобавитьВзносыПостроке(НоваяСтрока);
		ФормаДокумента.ДобавитьУдержанияПоСтроке(НоваяСтрока);

		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мДлинаСуток = 86400;

