#Если Клиент Тогда

// Настройка периода
Перем НП Экспорт;



// Возвращает список алгоритмов основных начислений
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ПФ_Сотр15);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССБезработ_Сотр);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр025);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр05);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр1);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников()


// Возвращает список видов расчетов исполнительных листов
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокСпособовРасчетовИспонителныеЛисты() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнителныйЛистСУчетомОграничения);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокСпособовРасчетовИспонителныеЛисты()


//============================================================================================



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	
	ДатаНач = ОбщийОтчет.ДатаНач;
	ДатаКон = ОбщийОтчет.ДатаКон;

	
	Измерение = Новый Массив(2);
	Измерение[0] = "Сотрудник";
	Измерение[1] = "Организация"; 	
		
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ИзмОсн",Измерение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ИзмБаз",Измерение);
	  
	КонецПериода = КонецДня(КонецМесяца(ОбщийОтчет.ДатаНач));
  
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачалоПериода", ОбщийОтчет.ДатаНач );
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонецПериода", КонецПериода );
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ПериодРегистрации", НачалоМесяца(ОбщийОтчет.ДатаНач));

	СписокСпособовРасчета = ПолучитьСписокСпособовРасчетовИспонителныеЛисты(); 
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокВидовРасчета", 	СписокСпособовРасчета);


	СписокВидовРасчетаПроцентов = Новый СписокЗначений;
	Элемент = ПланыВидовРасчета.Удержания.ПочтовыйСбор;
	СписокВидовРасчетаПроцентов.Добавить(Элемент);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокВидовРасчетаПроцентов", СписокВидовРасчетаПроцентов);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ВидКонтактнойИнформации", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
  
	
	СписокНалоговыхДеклараций =ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников();
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокНалоговыхДеклараций", СписокНалоговыхДеклараций);
	
	ОбщийОтчет.ПостроительОтчета.Макет = Неопределено;
		
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;		
	
	Текст = 
	"ВЫБРАТЬ
	|	УдержанияБаза.РезультатБаза 									КАК НачисленнаяЗП,
	|	УдержанияБаза.ВидРасчета 										КАК ВидРасчета,
	|	УдержанияБаза.Сотрудник											КАК Сотрудник,
	|	УдержанияБаза.ФизЛицо											КАК ФизЛицо,
	|	УдержанияБаза.ДокументОснование 								КАК ДокументОснование,
	|	ИсполнительныйЛист.ВидИсполнительногоДокумента 					КАК ВидИсполнительногоДокумента,
	|	ИсполнительныйЛист.Получатель 									КАК Получатель,
	|	ВзаиморасчетыПоНДФЛОбороты.НалогПриход 							КАК НДФЛ,
	|	ВзносыВФонды.Результат								 			КАК СуммаВзносов,
	|	УдержанияРаботниковОрганизацийПроценты.Результат 				КАК СуммаПроцент,
	|	ВЫБОР
	|		Когда УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL 
	|			Тогда УдержанияРаботниковОрганизаций.Результат
	|		Иначе
	|			УдержанияРаботниковОрганизаций.Результат + УдержанияРаботниковОрганизацийПроценты.Результат
	|		КОНЕЦ 														КАК СуммаПоЛисту,
	|	
	|	ВЫБОР
	|		Когда УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL 
	|			Тогда УдержанияБаза.РезультатБаза - УдержанияРаботниковОрганизаций.Результат - ВзаиморасчетыПоНДФЛОбороты.НалогПриход - ВзносыВФонды.Результат 
	|		Иначе
	|			УдержанияБаза.РезультатБаза - УдержанияРаботниковОрганизаций.Результат - УдержанияРаботниковОрганизацийПроценты.Результат - ВзаиморасчетыПоНДФЛОбороты.НалогПриход - ВзносыВФонды.Результат
	|		КОНЕЦ 														КАК СуммаКВыдаче, 
	|	РаботникиОрганизацииСрезПоследних.Организация					КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации 		КАК Подразделение,
	| РаботникиОрганизацииСрезПоследних.Сотрудник.Код 					КАК ТабельныйНомер,
	| Реквизиты.Счет  													КАК Счет,
	| Реквизиты.НомерСчета 												КАК НомерСчета,
	| Реквизиты.Банк 													КАК Банк,
	| Реквизиты.Адрес 													КАК Адрес
	|
	| {
	| ВЫБРАТЬ 
	|  РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.* КАК Подразделение,
	|  РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|  ИсполнительныйЛист.ВидИсполнительногоДокумента.* КАК ВидИсполнительногоДокумента,
	|  РаботникиОрганизацииСрезПоследних.Сотрудник.Код.* КАК ТабельныйНомер,
	|  Реквизиты.Счет.* КАК Счет,
	|  Реквизиты.НомерСчета.* КАК НомерСчета,
	|  Реквизиты.Банк.* КАК Банк,
	|  Реквизиты.Адрес КАК Адрес  
	| }
	|ИЗ
	|	(
	|   ВЫБРАТЬ
	|		УдержанияБазаОсновныеНРО.РезультатБаза 		КАК РезультатБаза,
	|		УдержанияБазаОсновныеНРО.ВидРасчета 		КАК ВидРасчета,
	|		УдержанияБазаОсновныеНРО.Сотрудник			КАК Сотрудник,
	|		УдержанияБазаОсновныеНРО.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|		УдержанияБазаОсновныеНРО.ДокументОснование 	КАК ДокументОснование,
	|		УдержанияБазаОсновныеНРО.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка
	|	ИЗ
	|		РегистрРасчета.Удержания.БазаНачисления(&ИзмОсн, &ИзмБаз, , ВидРасчета.СпособРасчета В (&СписокВидовРасчета) И ПериодРегистрации = &ПериодРегистрации) КАК УдержанияБазаОсновныеНРО
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		УдержанияБазаДополнительныеНРО.РезультатБаза,
	|		УдержанияБазаДополнительныеНРО.ВидРасчета,
	|		УдержанияБазаДополнительныеНРО.Сотрудник,
	|		УдержанияБазаДополнительныеНРО.Сотрудник.ФизЛицо,
	|		УдержанияБазаДополнительныеНРО.ДокументОснование,
	|		УдержанияБазаДополнительныеНРО.ДокументОснование.Ссылка
	|	ИЗ
	|		РегистрРасчета.Удержания.БазаНачисления(&ИзмОсн, &ИзмБаз, , ВидРасчета В (&СписокВидовРасчета) И ПериодРегистрации = &ПериодРегистрации) КАК УдержанияБазаДополнительныеНРО
	|    ) КАК УдержанияБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Контрагенты.ОсновнойБанковскийСчет КАК Счет,
	|				КонтактнаяИнформация.Представление КАК Адрес,
	|				Контрагенты.Ссылка КАК Контрагент,
	|				Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|				Контрагенты.ОсновнойБанковскийСчет.Банк КАК Банк
	|			ИЗ
	|				Справочник.Контрагенты КАК Контрагенты
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|					ПО КонтактнаяИнформация.Объект = Контрагенты.Ссылка
  	|
	|			ГДЕ
	|				КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации) КАК Реквизиты				
	|			ПО ИсполнительныйЛист.Получатель = Реквизиты.Контрагент
	|		ПО УдержанияБаза.ДокументОснование = ИсполнительныйЛист.Ссылка
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|		ПО	УдержанияБаза.Сотрудник = ВзносыВФонды.Сотрудник
	//|		И	ВзносыВФонды.Организация = УдержанияБаза.Организация
	|		И	ВзносыВФонды.ПериодРегистрации <= &НачалоПериода
  	|       И	ВзносыВФонды.ПериодРегистрации >= &КонецПериода
  	|       И	ВзносыВФонды.СтатьяНалоговойДекларации В (&СписокНалоговыхДеклараций)
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНДФЛ.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВзаиморасчетыПоНДФЛОбороты
	|		ПО УдержанияБаза.Сотрудник = ВзаиморасчетыПоНДФЛОбороты.Сотрудник
	//|		И УдержанияБаза.Организация = УдержанияБаза.Организация
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизацийПроценты
	|			ПО УдержанияРаботниковОрганизаций.ДокументОснование = УдержанияРаботниковОрганизацийПроценты.ДокументОснование
	|			И  УдержанияРаботниковОрганизацийПроценты.ВидРасчета В (&СписокВидовРасчетаПроцентов) 
	|		ПО УдержанияБаза.ВидРасчета = УдержанияРаботниковОрганизаций.ВидРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, ) КАК РаботникиОрганизацииСрезПоследних
	|		ПО УдержанияБаза.Сотрудник = РаботникиОрганизацииСрезПоследних.Сотрудник
	|
	|ГДЕ                                                                               
	//|	УдержанияРаботниковОрганизацийПроценты.ВидРасчета В(&СписокВидовРасчетаПроцентов) И
	|	УдержанияРаботниковОрганизаций.ПериодРегистрации = &ПериодРегистрации
	|И	(УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL ИЛИ УдержанияРаботниковОрганизацийПроценты.ПериодРегистрации = &ПериодРегистрации)
	|	{ГДЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.* КАК Подразделение,
	|	РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|	ИсполнительныйЛист.СпособПеречисления.* КАК ВидОплаты}
	| ИТОГИ СУММА(НачисленнаяЗП),
	|       СУММА(НДФЛ),
	|	      СУММА(СуммаВзносов),
	|	      СУММА(СуммаКВыдаче),
	|	      СУММА(СуммаПроцент),
	|	      СУММА(СуммаПоЛисту)          
	|                           ПО ОБЩИЕ,
	|                              Подразделение, 
	|                              Сотрудник,
	|								ФизЛицо,
	|  						                 Получатель, 
	|											         ВидИсполнительногоДокумента,
	|                              ДокументОснование
	|													  
	|
	|{ИТОГИ ПО
	|	      Организация.*, Подразделение.*, ФизЛицо.*, Получатель.*, ВидИсполнительногоДокумента.* , ДокументОснование.* }
  	|";

			
	
	СтруктураПредставлениеПолей = Новый Структура;
	
	СтруктураПредставлениеПолей.Вставить( "Подразделение",       "Подразделение");
	СтруктураПредставлениеПолей.Вставить( "ФизЛицо",             "ФИО плательщика");
	СтруктураПредставлениеПолей.Вставить( "Получатель",          "ФИО получателя");
  	СтруктураПредставлениеПолей.Вставить( "ВидИсполнительногоДокумента", "Вид исполнительного документа");
  	СтруктураПредставлениеПолей.Вставить( "ДокументОснование",   "Документ основание");
  	СтруктураПредставлениеПолей.Вставить( "ТабельныйНомер", "Табельный Номер");
  	СтруктураПредставлениеПолей.Вставить( "Счет", "Банковский счет получателя");
  	СтруктураПредставлениеПолей.Вставить( "Адрес", "Адрес получателя");
  	СтруктураПредставлениеПолей.Вставить( "НомерСчета", "Номер счета");
  	СтруктураПредставлениеПолей.Вставить( "Банк", "Наименование банка");

  	
	ПостроительОтчета.Текст = Текст;
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	

	ОбщийОтчет.ЗаполнитьПоказатели( "НачисленнаяЗП",       "Начисленная З/П",                Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "НДФЛ",                "НДФЛ",                           Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаВзносов",        "Сумма взносов",                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаПоЛисту",        "Удержания по исполнительному листу",  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаПроцент",        "Процент почты",                  Истина, "ЧЦ=15; ЧДЦ=2");	
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаКВыдаче",        "Сумма к выдаче",                 Истина, "ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ВидОплаты");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок = Новый Структура("Общие")
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

ОбщийОтчет.ИмяРегистра          = "-";
ОбщийОтчет.мНазваниеОтчета      = "Общая ведомость по исполнительным документам";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.РаскрашиватьИзмерения = Истина;
ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
ОбщийОтчет.мРежимВводаПериода = 2; // Период в месяц

#КонецЕсли
