#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// РАБОЧЕЕ МЕСТО МЕНЕДЖЕРА ПО ПРОДАЖАМ

Процедура ДобавитьСтрокуВТабличнуюЧастьЗаказа(СтруктураДанныхДобавления, ИмяТЧ, ЭтотОбъект, ЭтаФорма) Экспорт

	// Спросим про добавляемое количество
	КоличествоДобавления = 1;
	Если НЕ ВвестиЧисло(КоличествоДобавления, "Введите количество", 15, 3) Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоДобавления = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	// Ищем выбранную позицию в таблице подобранной номенклатуры.
	//  Если найдем - увеличим количество; не найдем - добавим новую строку.
	СтруктураОтбора = Новый Структура();

	СтруктураОтбора.Вставить("Номенклатура", СтруктураДанныхДобавления.Номенклатура);
	Если ИмяТЧ = "Товары" Тогда
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтруктураДанныхДобавления.ХарактеристикаНоменклатуры);
		СтруктураОтбора.Вставить("ЕдиницаИзмерения", СтруктураДанныхДобавления.ЕдиницаЦены);
	КонецЕсли;

	СтрокаТабличнойЧасти = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ЭтотОбъект[ИмяТЧ], СтруктураОтбора);
	Если СтрокаТабличнойЧасти <> Неопределено Тогда

		Если ИмяТЧ = "Товары" Тогда

			// Нашли, увеличиваем количество в первой найденной строке.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + КоличествоДобавления;
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			//РассчитатьСуммуСоСкидкамиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		ИначеЕсли ИмяТЧ = "ВозвратнаяТара" Тогда

			// Нашли, увеличиваем количество в первой найденной строке.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + КоличествоДобавления;

			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
		ИначеЕсли ИмяТЧ = "Услуги" Тогда

			// Нашли, увеличиваем количество в первой найденной строке.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + КоличествоДобавления;

			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			//РассчитатьСуммуСоСкидкамиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		КонецЕсли;
	Иначе

		// Не нашли - добавляем новую строку.
		СтрокаТабличнойЧасти = ЭтотОбъект[ИмяТЧ].Добавить();
		СтрокаТабличнойЧасти.Номенклатура     = СтруктураДанныхДобавления.Номенклатура;

		Если ИмяТЧ = "Товары" Тогда

			СтрокаТабличнойЧасти.Количество       = КоличествоДобавления;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанныхДобавления.ЕдиницаЦены;
			СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтруктураДанныхДобавления.ХарактеристикаНоменклатуры;

			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

			// Пересчитаем цену в валюту документа.
			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СтруктураДанныхДобавления.ЦенаНоменклатуры, СтруктураДанныхДобавления.ВалютаЦены, ЭтотОбъект.ВалютаДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЭтотОбъект.Дата);

			СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,,
			                                                 ЭтотОбъект.ТипЦен.ЦенаВключаетНДС,
			                                                 ЭтотОбъект.УчитыватьНДС,
			                                                 ЭтотОбъект.СуммаВключаетНДС,
			                                                 УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			// Рассчитываем плановую себестоимость.
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета);

		ИначеЕсли ИмяТЧ = "ВозвратнаяТара" Тогда

			СтрокаТабличнойЧасти.Количество       = КоличествоДобавления;

			// Пересчитаем цену в валюту документа.
			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СтруктураДанныхДобавления.ЦенаНоменклатуры, СтруктураДанныхДобавления.ВалютаЦены, ЭтотОбъект.ВалютаДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЭтотОбъект.Дата);

			// Если цену заполнили из регистра, то ее надо пересчитывать по флагам налогообложения.
			// Считаем, что оценочную стоимость возвратной тары всегда задают с НД
			// ставки берутся из номенклатуры.
			СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,,
			                                     ЭтотОбъект.ТипЦен.ЦенаВключаетНДС,
			                                     ЭтотОбъект.УчитыватьНДС,
			                                     Истина,
			                                     УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС));

			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
		ИначеЕсли ИмяТЧ = "Услуги" Тогда

			СтрокаТабличнойЧасти.Количество       = КоличествоДобавления;

			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

			// Пересчитаем цену в валюту документа.
			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СтруктураДанныхДобавления.ЦенаНоменклатуры, СтруктураДанныхДобавления.ВалютаЦены, ЭтотОбъект.ВалютаДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета), ЭтотОбъект.Дата);

			СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,,
			                                                 ЭтотОбъект.ТипЦен.ЦенаВключаетНДС,
			                                                 ЭтотОбъект.УчитыватьНДС,
			                                                 ЭтотОбъект.СуммаВключаетНДС,
			                                                 УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура перехватывает событие начала выбора прочего контактного лица
//
// Параметры
//  Элемент - элемент управления, выбора контактного лица контрагента
//  СтандартнаяОбработка - булево
//  СтандартнаяОбработка - булево
//  Контрагент - СправочникСсылка.Контрагенты, ,контрагент контактного лица
//
Процедура НачалоВыбораПрочегоКонтактногоЛица(Элемент, СтандартнаяОбработка, Пользователь = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.КонтактныеЛица.ПолучитьФормуВыбора(, Элемент);
	Если ФормаВыбора.Открыта() Тогда
		ФормаВыбора.Отбор.Сбросить();
	КонецЕсли; 
	
	ФормаВыбора.Отбор.ВидКонтактногоЛица.Значение      = Перечисления.ВидыКонтактныхЛиц.ПрочееКонтактноеЛицо;
	ФормаВыбора.Отбор.ВидКонтактногоЛица.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидКонтактногоЛица.Доступность = Ложь;
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Пользователь) Тогда
		ФормаВыбора.Отбор.ОбъектВладелец.Значение      = Пользователь;
		ФормаВыбора.Отбор.ОбъектВладелец.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ОбъектВладелец.Доступность = Ложь;
	КонецЕсли;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.Колонки.ВидКонтактногоЛица.Видимость = Ложь;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.Колонки.ОбъектВладелец.ТекстШапки = "Ответственный";
	
	ФормаВыбора.Заголовок = "Справочник Прочие контактные лица";
	
	ФормаВыбора.Открыть();

КонецПроцедуры

// Процедура перехватывает событие начала выбора прочего контактного лица
//
// Параметры
//  Элемент - элемент управления, выбора контактного лица контрагента
//  СтандартнаяОбработка - булево
//  СтандартнаяОбработка - булево
//  Контрагент - СправочникСсылка.Контрагенты, ,контрагент контактного лица
//
Процедура НачалоВыбораЛичныхКонтактов(Элемент, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.КонтактныеЛица.ПолучитьФормуВыбора(, Элемент);
	Если ФормаВыбора.Открыта() Тогда
		ФормаВыбора.Отбор.Сбросить();
	КонецЕсли; 
	
	ФормаВыбора.Отбор.ВидКонтактногоЛица.Значение      = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
	ФормаВыбора.Отбор.ВидКонтактногоЛица.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидКонтактногоЛица.Доступность = Ложь;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.Колонки.ВидКонтактногоЛица.Видимость = Ложь;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.Колонки.ОбъектВладелец.ТекстШапки = "Ответственный";
	ФормаВыбора.ЭлементыФормы.СправочникСписок.Колонки.ОбъектВладелец.Видимость = Ложь;
	
	ФормаВыбора.Заголовок = "Справочник Личные контакты";
	
	ФормаВыбора.Открыть();

КонецПроцедуры

// Процедура обрабатывает событие ПередНачаломДобавления в форме списка
// справочника КонтактныеЛицаКонтрагентов
//
Процедура ПередНачаломДобавленияКонтактногоЛица(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, СправочникСписок, ЭтаФорма) Экспорт

	Если НЕ ЭтоГруппа
	   И НЕ Копирование
	   И ((СправочникСписок.Отбор.ОбъектВладелец.Использование И СправочникСписок.Отбор.ОбъектВладелец.ВидСравнения = ВидСравнения.Равно)
	 ИЛИ (СправочникСписок.Отбор.ВидКонтактногоЛица.Использование И СправочникСписок.Отбор.ВидКонтактногоЛица.ВидСравнения = ВидСравнения.Равно)) Тогда
	
		Отказ = Истина;
		
		НовыйОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
		Если СправочникСписок.Отбор.ОбъектВладелец.Использование Тогда
			НовыйОбъект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
			НовыйОбъект.ОбъектВладелец     = СправочникСписок.Отбор.ОбъектВладелец.Значение;
		Иначе
			НовыйОбъект.ВидКонтактногоЛица = СправочникСписок.Отбор.ВидКонтактногоЛица.Значение;
		КонецЕсли; 
		
		НовыйОбъект.ПолучитьФорму(, ЭтаФорма).Открыть();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли