// #Область СлужебныеПроцедурыИФункции

///
// Обработчики формы

&НаСервере
// Начальное заполнение.
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь")<>Неопределено Тогда
		ТекущийПользователь = Вычислить("ПараметрыСеанса.ТекущийПользователь");
	КонецЕсли;
	Элементы.отборЗвонкиТекущегоПользователя.Видимость = ЗначениеЗаполнено(ТекущийПользователь);
	
	фВнутренние = Истина;
	фВходящие 	= Истина;
	фИсходящие  = Истина;
	
	Обновить = Истина;
	
	Если Параметры.Свойство("Контакт", ОбъектОтбора) Тогда
		Элементы.ОбъектОтбора.Видимость = ЗначениеЗаполнено(ОбъектОтбора);
		Элементы.грОтборыПоВидуКонтакта.Видимость = Ложь;
		
		Обновить = Ложь;
	Иначе
		Элементы.ОбъектОтбора.Видимость = Ложь;
		ОбъектОтбора = Справочники.Пользователи.ПустаяСсылка(); 
	КонецЕсли;
	Параметры.Свойство("МоиНомера", МоиНомера);	
	// 
	ЕстьСпрПартнеры 	= НЕ Метаданные.Справочники.Найти("Партнеры") 		= Неопределено;
	ЕстьСпрКонтрагенты  = НЕ Метаданные.Справочники.Найти("Контрагенты") 	= Неопределено;
	ЕстьСпрПользователи = НЕ Метаданные.Справочники.Найти("Пользователи") 	= Неопределено;
	
	Элементы.ПоПартнеру.Видимость 				= ЕстьСпрПартнеры;
	Элементы.ПоКонтрагенту.Видимость 			= ЕстьСпрКонтрагенты;
	Элементы.ПоПользователю.Видимость 			= ЕстьСпрПользователи;
	// 
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	Элементы.представениеПериод.Заголовок 			= Период;
	Если Обновить = Истина Тогда
		ОбновитьНаСервере();
	КонецЕсли; 
	
	Хост		 = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера();
	Порт 		 = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера();

	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	// Видимость элементов формы
	MIKO_Asterisk_Подключена = Метаданные.Обработки.Найти("MIKO_Asterisk")<>Неопределено;
	МИКО_ПанельТелефонииДля1С_Подключена = Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С")<>Неопределено;
	ПанельТелефонииЕсть = (MIKO_Asterisk_Подключена ИЛИ МИКО_ПанельТелефонииДля1С_Подключена);
		
	Элементы.дПрослушатьЗапись.Видимость	= ПанельТелефонииЕсть;
	Элементы.дСкачатьЗапись.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ОткрытьСобытие.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ДобавитьНомерКонтакту.Видимость= ПанельТелефонииЕсть;
	Элементы.дПрослушатьЗапись1.Видимость	= ПанельТелефонииЕсть;
	Элементы.дСкачатьЗапись1.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ОткрытьСобытие1.Видимость 		= ПанельТелефонииЕсть;
	Элементы.Позвонить.Видимость 			= ПанельТелефонииЕсть;

	Элементы.ПозвонитьКоманда.Видимость 	= ПанельТелефонииЕсть;
	Элементы.ДобавитьНомерКонтакту1.Видимость= ПанельТелефонииЕсть;	
	Элементы.ТаблицаИсторииКонтекстноеМенюСоздатьДополнительныйСтикер.Видимость = ПанельТелефонииЕсть;

	нФильтрВнутренние 	= Элементы.фВнутренние.Заголовок;
	нФильтрПропущенные  = Элементы.фПропущенные.Заголовок;
	нФильтрВходящие 	= Элементы.фВходящие.Заголовок;
	нФильтрИсходящие	= Элементы.фИсходящие.Заголовок;
	
	// Сформируем текст запроса отбора по объектам метаданных
	ТекстЗапросаОтбора = ПолучитьТекстЗапросаОтбора(); 
	
	// Заполним список типов справочников для элементов отбора
	ЗаполнитьСписокТиповОбъектовОтбора();
	ВосстановитьНастройки();
	
	СтанцияMyPBX = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX();
	
КонецПроцедуры 

&НаКлиенте
// Начальное заполнение.
// 
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ОбъектОтбора) Тогда
		УстановитьЗначенияПоУмолчанию(Неопределено, Ложь);
		УстановитьЭлементОтбора(ОбъектОтбора);
	Иначе
		УстановитьЗначенияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка получение оповещений.
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьСобытие" Тогда 
		врИстория = Объект.ТаблицаИстории.НайтиСтроки(Новый Структура("ИдентификаторЗвонка", Параметр.id));	
		Если врИстория.Количество()>0 Тогда
			врИстория[0].ЕстьСобытие = ПрикрепитьСобытиеКЗвонку(врИстория[0].Звонок, Параметр.Ссылка);
		КонецЕсли; 
	ИначеЕсли ИмяСобытия = "ПрисвоенНомерТелефона" Тогда 
		ЗаполнитьВладельцаНомера(Параметр);
		ПередатьИсториюЗвонковВПанельТелефонии();
	ИначеЕсли ИмяСобытия = "ЗапроситьИсториюЗвонков" Тогда 
		Если ВладелецФормы <> Неопределено 
			 И (	ВладелецФормы.ИмяФормы = "Обработка.MIKO_Asterisk.Форма.Форма" 
			 	ИЛИ ВладелецФормы.ИмяФормы = "Обработка.МИКО_ПанельТелефонииДля1С.Форма.Форма") Тогда
			 ОбновитьНаСервере(Ложь);
			 ПередатьИсториюЗвонковВПанельТелефонии();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЖС_ПолучитьЗвонкиПоНомеру"Тогда
		
		Если (ТекущаяДата() - ВремяПредыдущегоЗапроса) < 1 Тогда
			Возврат;
		Иначе	
			ВремяПредыдущегоЗапроса = ТекущаяДата();
		КонецЕсли;
		
		// Контакты за последние 30 дней.
		НачалоПериода 	 = НачалоДня(Параметр) - 60*60*24*30;
		ОкончаниеПериода = КонецДня (Параметр);
		ТаблицаИстории = ПолучитьИсториюЗвонковПоНомеруТелефона(Источник, НачалоПериода, ОкончаниеПериода);
		Оповестить("ЖЗ_Refresh1CHistory_partner_", ТаблицаИстории, Источник);
	ИначеЕсли ИмяСобытия = "ОповеститьЖЗ_ЗаписьРазговора" Тогда	
		Если ОжидаемЗапись = Истина Тогда
			ОжидаемЗапись = Ложь;
			врЭлемент = ?(Параметр.ТипОперации = "СкачатьЗапись", Элементы.дСкачатьЗапись, Элементы.дПрослушатьЗапись);
			Если ВерсияПлатформы = "8.3" Тогда
				ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработкаВыбораФайлаЗаписи"", ЭтаФорма, Параметр)");
				Попытка
					Выполнить("ПоказатьВыборИзМеню(ОписаниеОповещения,Параметр.спИменаФайлов, врЭлемент)");
				Исключение
					Возврат;
				КонецПопытки; 
			Иначе	
				Попытка
					врЗначение = Вычислить("ВыбратьИзМеню(Параметр.спИменаФайлов, врЭлемент)");	
				Исключение
					Возврат;
				КонецПопытки; 
				ОбработкаВыбораФайлаЗаписи(врЗначение, Параметр)
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Подготовка / отправка истории звонков в панель телефонии.
// 
Процедура ПередатьИсториюЗвонковВПанельТелефонии()

	врТаблицаИстории = Новый Массив;
	Для каждого СтрокаИстории Из Объект.ТаблицаИстории Цикл
		врДанные = Новый Структура;
		врДанные.Вставить("Id", 						СтрокаИстории.ИдентификаторЗвонка);
		врДанные.Вставить("Начало", 					СтрокаИстории.ВремяЗвонка);
		врДанные.Вставить("ПродолжительностьРазговора", СтрокаИстории.ДлительностьРазговора);
		врДанные.Вставить("Пропущен", 					СтрокаИстории.Пропущенный);
		
		Если Строка(СтрокаИстории.Направление) = "Внутренний" Тогда	
			Входящий = НЕ ЭтоНащНомер(СтрокаИстории.НомерКто);
		Иначе
			Входящий =  Строка(СтрокаИстории.Направление) = "Входящий";	
		КонецЕсли; 
		
		Если Входящий = Истина Тогда
			Организация 	= СтрокаИстории.КонтактКто;
			НомерТелефона 	= СтрокаИстории.НомерКто;
		Иначе	
			Организация 	= СтрокаИстории.КонтактКому;
			НомерТелефона 	= СтрокаИстории.НомерКому;
		КонецЕсли; 
		
		врДанные.Вставить("Входящий", 					Входящий = Истина);
		врДанные.Вставить("Организация", 				Организация);
		врДанные.Вставить("Абонент", 					"");
		врДанные.Вставить("НомерТелефона", 				НомерТелефона);
		врДанные.Вставить("ЕстьЗапись", 				СтрокаИстории.ЕстьЗапись);

		врТаблицаИстории.Добавить(врДанные);
	КонецЦикла; 
	Оповестить("ОбновитьЖурналЗвонковЗаСегодня",врТаблицаИстории,Неопределено); 

КонецПроцедуры // ПередатьИсториюЗвонковВПанельТелефонии()

&НаКлиенте
Процедура ИспользоватьПолнотекстовыйПоискПриИзменении(Элемент)
	СохранитьНастройки();	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
    Настройки    = Новый Структура;
	Настройки.Вставить("ИспользоватьПолнотекстовыйПоиск", ИспользоватьПолнотекстовыйПоиск);
    ХранилищеОбщихНастроек.Сохранить("MIKO",  "ЖурналЗвонков", Настройки, , ИмяПользователя());	
КонецПроцедуры
&НаСервере
Процедура ВосстановитьНастройки()

	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("MIKO","ЖурналЗвонков",,ИмяПользователя());
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек);
	КонецЕсли;

КонецПроцедуры
 

///
// Прочие процедуры и функции

&НаКлиенте
// Установка периода.
// 
Процедура УстановитьПериод(Команда)
	
	Если ВерсияПлатформы = "8.3" Тогда
		
		Если НЕ ИспользоватьРежимМодальности Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""УстановитьПериодНаФорме"", ЭтаФорма)");
			Попытка
				Выполнить("ОткрытьФорму(""ОбщаяФорма.МИКО_стВыборСтандартногоПериода"",,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОписаниеОповещения)");
			Исключение
				Возврат;
			КонецПопытки; 
		Иначе	
			вПериод = ОткрытьФормуМодально("ОбщаяФорма.МИКО_стВыборСтандартногоПериода");
			УстановитьПериодНаФорме(вПериод);
		КонецЕсли; 
		
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		
		вПериод = ОткрытьФормуМодально("ОбщаяФорма.МИКО_стВыборСтандартногоПериода");
	
		УстановитьПериодНаФорме(вПериод);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура отборЗвонкиЗаСегодняНажатие(Элемент)
	
	Период.Вариант = ВариантСтандартногоПериода.Сегодня;
    УстановитьПериодНаФорме(Период);

КонецПроцедуры

&НаКлиенте
Процедура отборЗвонкиЗаНеделюНажатие(Элемент)
	
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
    УстановитьПериодНаФорме(Период);

КонецПроцедуры


&НаКлиенте
Процедура отборЗвонкиТекущегоПользователяНажатие(Элемент)
	
	УстановитьЭлементОтбора(ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
// Выбор периода.
// 
Процедура УстановитьПериодНаФорме(Результат, ДопПараметры = Неопределено) Экспорт

	Если НЕ Результат = Неопределено Тогда
		Период = Результат;
		Элементы.представениеПериод.Заголовок 			= ""+Период;
		Обновить(Неопределено);
	КонецЕсли; 

КонецПроцедуры // УстановитьПериодНаФорме()

&НаКлиенте
// Открытие объекта отбора.
// 
Процедура ТаблицаИсторииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	дОткрытьРасшифровку(Неопределено);
КонецПроцедуры

&НаКлиенте
// Обновление отображения журнала.
// 
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	ОбновитьОтображениеДанных();
	ОбработкаОповещения("ЗапроситьИсториюЗвонков", Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
// Обновление отображения журнала.
// 
Процедура ОбъектОтбораПриИзменении(Элемент)
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
// Возвращает Истина, если это номер текущего пользователя.
// 
Функция ЭтоНащНомер(пНомерТелефона)
	
	Если МоиНомера = Неопределено Тогда
	 	Возврат Истина; 
	Иначе	
		врНомер = Прав(пНомерТелефона, 9);		
		Результат = (Найти(МоиНомера, врНомер + Символы.ПС)>0);
	КонецЕсли; 

	Возврат Результат;
КонецФункции // ЭтоНащНомер()

&НаСервере
Процедура ОбновитьНаСервере(ЭтаФормаОткрыта = Истина)
	ДатаНачала 	 = Период.ДатаНачала; 	  
	ДатаОкончания= Период.ДатаОкончания; 
		
	ОбъектыОтбора = ПолучитьОбъектыОтбора();
	Если ЗначениеЗаполнено(ОбъектОтбора) 
		 И ЭтаФормаОткрыта = Ложь И ОбъектыОтбора.СправочникиОтбор.Найти(ОбъектОтбора)=Неопределено Тогда
		ОбъектыОтбора.СправочникиОтбор.Добавить(ОбъектОтбора);
	    ОбъектыОтбора.НомерОтбор.Очистить();
	    ОбъектыОтбора.SkypeОтбор.Очистить();
	    ОбъектыОтбора.НаименованиеОтбор.Очистить();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстОсновногоЗапроса();
	Если фПропущенные = Истина Тогда
	 	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//Пропущенный//","");
	КонецЕсли; 	
	МассивОбъектов 	= ОбъектыОтбора.СправочникиОтбор;
	МассивТелефонов = ОбъектыОтбора.НомерОтбор;
	МассивSkype		= ОбъектыОтбора.SkypeОтбор;
	МассивНаим		= ОбъектыОтбора.НаименованиеОтбор;
	
	УсловиеОтбораПоОбъекту1 = "";
	УсловиеОтбораПоОбъекту2 = "";
	УсловиеОтбораПоОбъекту3 = "";
	
	// Найдем контактные лица объекта отбора.
	ПолныйМассивОбъектов = Новый Массив;
	Для к=0 По МассивОбъектов.Количество()-1 Цикл
		КонтактыОбъектОтбора = МИКО_стОбработкаКонтактнойИнформации.ПолучитьКонтактыПоПартнеру(МассивОбъектов[к]);
		Для каждого ЭлемКонтакт Из КонтактыОбъектОтбора Цикл
			ПолныйМассивОбъектов.Добавить(ЭлемКонтакт);
		КонецЦикла; 
	КонецЦикла; 
	
	ШаблонУсловие1 = "";
	ШаблонУсловие2 = "";
	ШаблонУсловие3 = "";
	
	ПервыйОтбор = Истина;
	
	Если ПолныйМассивОбъектов.Количество() > 0 Тогда
		ШаблонУсловие1 = "
		|		МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Dst_Ссылка В (&ОбъектОтбора)
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Src_Ссылка В (&ОбъектОтбора)
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Ссылка В (&ОбъектОтбора)
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Ссылка В (&ОбъектОтбора)";
		ШаблонУсловие2 = "
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Dst_Ссылка В (&ОбъектОтбора)";
		ШаблонУсловие3 = "
		|		МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка В (&ОбъектОтбора)
		|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Src_Ссылка В (&ОбъектОтбора)";
		
		Запрос.УстановитьПараметр("ОбъектОтбора", ПолныйМассивОбъектов);
		ПервыйОтбор = Ложь;
	КонецЕсли; 
	
	Если МассивТелефонов.Количество() > 0 Тогда
		
		Если ПервыйОтбор Тогда
			ШаблонУсловие1 = "
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_ID В (&НомерТелефона)";
			ШаблонУсловие2 = "
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_ID В (&НомерТелефона)";
			ШаблонУсловие3 = "
			|	МИКО_стЗаписьИсторииЗвонков.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst_ID В (&НомерТелефона)";
		
		Иначе
			ШаблонУсловие1 = ШаблонУсловие1 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_ID В (&НомерТелефона)";
			ШаблонУсловие2 = ШаблонУсловие2 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_ID В (&НомерТелефона)";
			ШаблонУсловие3 = ШаблонУсловие3 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Src_ID В (&НомерТелефона)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst_ID В (&НомерТелефона)";
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("НомерТелефона", МассивТелефонов);
		ПервыйОтбор = Ложь;
	КонецЕсли; 
	
	Если МассивSkype.Количество() > 0 Тогда
		Если ПервыйОтбор Тогда
			ШаблонУсловие1 = "
			|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst В (&SkypeОтбор)";
			ШаблонУсловие2 = "
			|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst В (&SkypeОтбор)";
			ШаблонУсловие3 = "
			|	МИКО_стЗаписьИсторииЗвонков.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst В (&SkypeОтбор)";
		
		Иначе
			ШаблонУсловие1 = ШаблонУсловие1 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst В (&SkypeОтбор)";
			ШаблонУсловие2 = ШаблонУсловие2 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst В (&SkypeОтбор)";
			ШаблонУсловие3 = ШаблонУсловие3 + "
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Src В (&SkypeОтбор)
			|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst В (&SkypeОтбор)";
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("SkypeОтбор", МассивSkype);
		ПервыйОтбор = Ложь;
	КонецЕсли;
	
	Если МассивНаим.Количество() > 0 Тогда
		
		УсловиеПоНаим1 = "";
		УсловиеПоНаим2 = "";
		УсловиеПоНаим3 = "";
		
		ШаблонУсловиеПоНаим1 = "
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Ссылка.Наименование ПОДОБНО &НаименованиеОтбор//Итератор//
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Ссылка.Наименование ПОДОБНО &НаименованиеОтбор//Итератор//";
		
		ШаблонУсловиеПоНаим2 = "
		|	ИЛИ МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Dst_Ссылка.Наименование ПОДОБНО &НаименованиеОтбор//Итератор//";
		
		ШаблонУсловиеПоНаим3 = "
		|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Src_Ссылка.Наименование ПОДОБНО &НаименованиеОтбор//Итератор//
		|	ИЛИ МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка.Наименование ПОДОБНО &НаименованиеОтбор//Итератор//";
		
		Для к=1 По МассивНаим.Количество() Цикл
		
			УсловиеПоНаим1 = УсловиеПоНаим1+СтрЗаменить(ШаблонУсловиеПоНаим1, "//Итератор//", к);
			УсловиеПоНаим2 = УсловиеПоНаим2+СтрЗаменить(ШаблонУсловиеПоНаим2, "//Итератор//", к);
			УсловиеПоНаим3 = УсловиеПоНаим3+СтрЗаменить(ШаблонУсловиеПоНаим3, "//Итератор//", к);
			
			Запрос.УстановитьПараметр("НаименованиеОтбор"+к,"%"+МассивНаим[к-1]+"%");
		КонецЦикла; 
		
		Если ПервыйОтбор Тогда
			ШаблонУсловие1 = Сред(УсловиеПоНаим1, Найти(УсловиеПоНаим1, "ИЛИ ")+4);
			ШаблонУсловие2 = Сред(УсловиеПоНаим2, Найти(УсловиеПоНаим2, "ИЛИ ")+4);
			ШаблонУсловие3 = Сред(УсловиеПоНаим3, Найти(УсловиеПоНаим3, "ИЛИ ")+4);
		
		Иначе
			ШаблонУсловие1 = ШаблонУсловие1 + УсловиеПоНаим1;
			ШаблонУсловие2 = ШаблонУсловие2 + УсловиеПоНаим2;
			ШаблонУсловие3 = ШаблонУсловие3 + УсловиеПоНаим3;
		КонецЕсли; 
		
		ПервыйОтбор = Ложь;
	КонецЕсли; 
	
	ШаблонУсловие1 = ?(ЗначениеЗаполнено(ШаблонУсловие1),"И ("+ШаблонУсловие1+")","");
	ШаблонУсловие2 = ?(ЗначениеЗаполнено(ШаблонУсловие2),"И ("+ШаблонУсловие2+")","");
	ШаблонУсловие3 = ?(ЗначениеЗаполнено(ШаблонУсловие3),"И ("+ШаблонУсловие3+")","");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеОтбораПоОбъекту1//",ШаблонУсловие1);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеОтбораПоОбъекту2//",ШаблонУсловие2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеОтбораПоОбъекту3//",ШаблонУсловие3);
	
	Направления = Новый Массив;
	Если фВходящие И фВнутренние И фИсходящие Тогда
		// нет отбора	
	Иначе
		Если фВнутренние Тогда
		  	Направления.Добавить(ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний"));
		КонецЕсли;
		Если фВходящие Тогда
		  	Направления.Добавить(ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий"));
		КонецЕсли;
		Если фИсходящие Тогда
		  	Направления.Добавить(ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий"));
		КонецЕсли;
		
		Если Направления.Количество()>0 Тогда
	 		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//Направления//","");
			Запрос.УстановитьПараметр("Направления", Направления);
		КонецЕсли; 
	КонецЕсли; 

	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КУдалению = РезультатЗапроса.НайтиСтроки(Новый Структура("Направление,НомерКому", ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний"), "PLAYBACK"));
	Для каждого ТекСтрока Из КУдалению Цикл
	  	РезультатЗапроса.Удалить(ТекСтрока);
	КонецЦикла; 
	
	// Отметим истинно пропущенные.
	впПропущенныеБезПК = Обработки.МИКО_стАнализПропущенныхВызовов.ПолучитьПропущенные(ДатаНачала, Ложь, Истина);
	РезультатЗапроса.Колонки.Добавить("ПропущенныйБезПК", Новый ОписаниеТипов("Булево"));	
	Для каждого ТекПропущенный Из впПропущенныеБезПК Цикл
		Если ТекПропущенный.КоличествоОтвеченных > 0 Тогда
		  	Продолжить;
		КонецЕсли; 
		//  =  КонтактКто = ТекПропущенный.НомерТелефона 
		ОтборПропущенных = Новый Структура("ВремяЗвонка,НомерКто,НетСоединений", ТекПропущенный.ДатаПропущенного, ТекПропущенный.НомерТелефона, Истина);
		врСтроки = РезультатЗапроса.НайтиСтроки(ОтборПропущенных);
		Если врСтроки.Количество()=0 Тогда
			врСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Звонок", ТекПропущенный.СсылкаНаПропущенный));
		КонецЕсли; 

		Для каждого текВызов Из врСтроки Цикл
			текВызов.ПропущенныйБезПК = Истина;
		КонецЦикла; 
	КонецЦикла; 
	
	Объект.ТаблицаИстории.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстОсновногоЗапроса()
		
	Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка
		|ПОМЕСТИТЬ ДокИсторииЗаПериод
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МИКО_стЗаписьИсторииЗвонковДокументыСобытие.Событие) КАК Количество,
		|	МИКО_стЗаписьИсторииЗвонковДокументыСобытие.Ссылка КАК ДокументЗвонок
		|ПОМЕСТИТЬ КоличествоСобытий
		|ИЗ
		|	ДокИсторииЗаПериод КАК ДокИсторииЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МИКО_стЗаписьИсторииЗвонков.ДокументыСобытие КАК МИКО_стЗаписьИсторииЗвонковДокументыСобытие
		|		ПО ДокИсторииЗаПериод.Ссылка = МИКО_стЗаписьИсторииЗвонковДокументыСобытие.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стЗаписьИсторииЗвонковДокументыСобытие.Ссылка;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Направление,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_ID, 
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_ID,  
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.OutLine,  
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Start КАК ВремяЗвонка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src КАК НомерКто,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst КАК НомерКому,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Billsec КАК ДлительностьРазговора,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.НетСоединений КАК Пропущенный,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка КАК Звонок,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Ссылка КАК КонтактКто,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Ссылка КАК КонтактКому,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.recordingfile,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.ЕстьЗапись,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Duration - МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Billsec) КАК ВремяОжидания,
		|	НАЧАЛОПЕРИОДА(МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Start, ДЕНЬ) КАК НачалоДня,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСобытие,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.linkedid КАК ИдентификаторЗвонка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.id_pbx
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков.ДетализацияCEL КАК МИКО_стЗаписьИсторииЗвонковДетализацияCEL
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСобытий КАК КоличествоСобытий
		|		ПО МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка = КоличествоСобытий.ДокументЗвонок
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Eventtime МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	//УсловиеОтбораПоОбъекту1//
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Направление,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_ID,   
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_ID,     
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.OutLine,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Start,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Billsec,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Пропущенный,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.recordingfile,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.ЕстьЗапись,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.НетСоединений,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.linkedid,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.НетСоединений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Направление,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_ID,    
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_ID,  
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.OutLine,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Start,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Billsec,
		|	ИСТИНА,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.НетСоединений,
		|	"""" Как recordingfile,
		|	ЛОЖЬ,
		|	МАКСИМУМ(МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Duration - МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Billsec),
		|	НАЧАЛОПЕРИОДА(МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Start, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.linkedid,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.id_pbx
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков.CDR_ПропустившиеЗвонок КАК МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСобытий КАК КоличествоСобытий
		|		ПО МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка = КоличествоСобытий.ДокументЗвонок
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	//УсловиеОтбораПоОбъекту2//
		|	И МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.НетСоединений = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Направление,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_ID,  
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_ID,   
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.OutLine,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Start,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Billsec,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.Dst_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.НетСоединений,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МИКО_стЗаписьИсторииЗвонковCDR_ПропустившиеЗвонок.Ссылка.linkedid
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонков.Направление,
		|	МИКО_стЗаписьИсторииЗвонков.Src_ID,  
		|	МИКО_стЗаписьИсторииЗвонков.Dst_ID,    
		|	МИКО_стЗаписьИсторииЗвонков.OutLine,
		|	МИКО_стЗаписьИсторииЗвонков.Start,
		|	МИКО_стЗаписьИсторииЗвонков.Src,
		|	МИКО_стЗаписьИсторииЗвонков.Dst,
		|	МИКО_стЗаписьИсторииЗвонков.Billsec,
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонков.recordingfile,       
		|	МИКО_стЗаписьИсторииЗвонков.Duration - МИКО_стЗаписьИсторииЗвонков.Billsec КАК ВремяОжидания,
		|	НАЧАЛОПЕРИОДА(МИКО_стЗаписьИсторииЗвонков.Start, ДЕНЬ) КАК НачалоДня,
		|	МИКО_стЗаписьИсторииЗвонков.ЕстьЗапись,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МИКО_стЗаписьИсторииЗвонков.linkedid,
		|	МИКО_стЗаписьИсторииЗвонков.id_pbx
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСобытий КАК КоличествоСобытий
		|		ПО МИКО_стЗаписьИсторииЗвонков.Ссылка = КоличествоСобытий.ДокументЗвонок
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	//УсловиеОтбораПоОбъекту3//
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоСобытий.Количество, 0) <> 0
		|				И КоличествоСобытий.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МИКО_стЗаписьИсторииЗвонков.linkedid,
		|	МИКО_стЗаписьИсторииЗвонков.Направление,
		|	МИКО_стЗаписьИсторииЗвонков.Src_ID,  
		|	МИКО_стЗаписьИсторииЗвонков.Dst_ID,  
		|	МИКО_стЗаписьИсторииЗвонков.OutLine,
		|	МИКО_стЗаписьИсторииЗвонков.Start,
		|	МИКО_стЗаписьИсторииЗвонков.Src,
		|	МИКО_стЗаписьИсторииЗвонков.Dst,
		|	МИКО_стЗаписьИсторииЗвонков.Billsec,
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Dst_Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src_Владелец_Ссылка,           
		|	МИКО_стЗаписьИсторииЗвонков.Dst_Владелец_Ссылка,               
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений,
		|	МИКО_стЗаписьИсторииЗвонков.recordingfile,
		|	МИКО_стЗаписьИсторииЗвонков.Duration - МИКО_стЗаписьИсторииЗвонков.Billsec,
		|	МИКО_стЗаписьИсторииЗвонков.ЕстьЗапись
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Направление,
		|	ВТ.OutLine,
		|	ВТ.ВремяЗвонка,
		|	ВТ.НомерКто,
		|	ВТ.НомерКому,
		|	ВТ.ДлительностьРазговора,
		|	ВТ.Пропущенный,
		|	ВТ.Звонок,
		|	ВЫБОР
		|		КОГДА ВТ.Src_Владелец_Ссылка = Неопределено 
		|			ТОГДА ВТ.КонтактКто
		|		ИНАЧЕ ВТ.Src_Владелец_Ссылка
		|	КОНЕЦ КАК КонтактКто,
		|	ВЫБОР
		|		КОГДА ВТ.Dst_Владелец_Ссылка = Неопределено 
		|			ТОГДА ВТ.КонтактКому
		|		ИНАЧЕ ВТ.Dst_Владелец_Ссылка
		|	КОНЕЦ КАК КонтактКому,
		|	ВТ.НетСоединений,
		|	МАКСИМУМ(ВТ.recordingfile) КАК recordingfile,
		|	МАКСИМУМ(ВТ.ЕстьЗапись) КАК ЕстьЗапись,
		|	МАКСИМУМ(ВТ.ВремяОжидания) КАК ВремяОжидания,
		|	МАКСИМУМ(ВТ.ЕстьСобытие) КАК ЕстьСобытие,
		|	МАКСИМУМ(ВТ.ИдентификаторЗвонка) КАК ИдентификаторЗвонка,
		|	ЕСТЬNULL(МИКО_ДополнительныеАТС.Наименование, ""Основная АТС"") КАК НаименованиеАТС
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МИКО_ДополнительныеАТС КАК МИКО_ДополнительныеАТС
		|		ПО ВТ.id_pbx = МИКО_ДополнительныеАТС.id_pbx
		|ГДЕ
		|	Истина
		|	//Направления// И ВТ.Направление В(&Направления)
		|	//Пропущенный// И ВТ.Пропущенный = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Направление,
		|	ВТ.OutLine,
		|	ВТ.ВремяЗвонка,
		|	ВТ.НомерКто,
		|	ВТ.НомерКому,
		|	ВТ.Src_Владелец_Ссылка,
		|	ВТ.Dst_Владелец_Ссылка,
		|	ВТ.ДлительностьРазговора,
		|	ВТ.Пропущенный,
		|	ВТ.Звонок,
		|	ВТ.КонтактКто,
		|	ВТ.КонтактКому,
		|	ВТ.НетСоединений,
		|	ЕСТЬNULL(МИКО_ДополнительныеАТС.Наименование, ""Основная АТС"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.ВремяЗвонка УБЫВ";

	Возврат Текст;
КонецФункции // ПолучитьТекстЗапроса()

&НаКлиенте
// Выбор варианта отбора
// 
Процедура ВидОтобораПриИзменении(Элемент)
	ЗаполнитьОбъектОтбора(Элемент.Имя);
КонецПроцедуры

&НаСервере
// Выбор варианта отбора (контрагент / партнер / пользователь)
// 
Процедура ЗаполнитьОбъектОтбора(Имя)
	Для каждого ТекЭл Из Элементы.грОтборыПоВидуКонтакта.ПодчиненныеЭлементы Цикл
		Если НЕ ТипЗнч(ТекЭл.Вид) = Тип("ВидКнопкиФормы") Тогда
		   	Продолжить;
		КонецЕсли; 
		ТекЭл.Пометка = Ложь;
		ТекЭл.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	КонецЦикла; 	
	
	Элементы[Имя].Пометка = Истина;
	Элементы[Имя].ЦветФона = WebЦвета.Перламутровый;
	
	Элементы.ОбъектОтбора.ВыбиратьТип = Ложь;
	Если Имя = "ПоПартнеру" Тогда
		ОбъектОтбора = Справочники["Партнеры"].ПустаяСсылка();  	
	ИначеЕсли Имя = "ПоКонтрагенту" Тогда	
		ОбъектОтбора = Справочники["Контрагенты"].ПустаяСсылка();  	
	ИначеЕсли Имя = "ПоПользователю" Тогда	
		ОбъектОтбора = Справочники.Пользователи.ПустаяСсылка();  	
	Иначе 	
		Элементы.ОбъектОтбора.ВыбиратьТип = Истина;
		ОбъектОтбора = Null;  	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
// Открыть карточку звонка
// Расшифровка звонка
Процедура дОткрытьРасшифровку(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если ВерсияПлатформы = "8.3" Тогда
		
			Если НЕ ИспользоватьРежимМодальности Тогда
				Попытка
					Выполнить("ПоказатьЗначение(,ТекущиеДанные.Звонок)");
				Исключение
					Возврат;
				КонецПопытки; 
			Иначе	
				ОткрытьЗначение(ТекущиеДанные.Звонок);
			КонецЕсли; 

		ИначеЕсли ВерсияПлатформы = "8.2" Тогда
			ОткрытьЗначение(ТекущиеДанные.Звонок);
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Запуск обратного звонка для воспроизведения файла
// 
Процедура дПрослушатьЗапись(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	ИмяФайлаЗаписиРазговора = ТекущиеДанные.recordingfile;
	
	Если ИмяФайлаЗаписиРазговора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	 
	ЗвонокИД = ?(СтанцияMyPBX, ИмяФайлаЗаписиРазговора, ТекущиеДанные.ИдентификаторЗвонка);
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		Если СтанцияMyPBX = Истина Тогда
			Оповестить("ВоспроизвестиЗаписьПоИмениФайла", ТекущиеДанные.recordingfile, ЭтаФорма);
		Иначе	
			Оповестить("ВоспроизвестиЗапись", ЗвонокИД, ЭтаФорма);
		КонецЕсли; 
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.ПрослушатьЗаписьРазговора(ЗвонокИД);
		Исключение
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Панель телефонии не подключена! Нет возможности прослушать запись.");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Запуск процесса скачивания файла записи. 
//
Процедура дСкачатьЗапись(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	ИмяФайлаЗаписиРазговора = ТекущиеДанные.recordingfile;
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		Если СтанцияMyPBX = Истина Тогда
			врПараметры = Новый Структура();
			врПараметры.Вставить("uniqueid1c", 	ТекущиеДанные.ИдентификаторЗвонка);
			врПараметры.Вставить("filename", 	ТекущиеДанные.recordingfile);
			врПараметры.Вставить("fpath", 		"");
			
			Оповестить("СкачатьЗаписьПоИмениФайла", врПараметры, ЭтаФорма);
		Иначе	
			Оповестить("СкачатьЗапись", ТекущиеДанные.ИдентификаторЗвонка, ЭтаФорма);
		КонецЕсли; 
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СкачатьЗаписьРазговора(ТекущиеДанные);
		Исключение
			// 	
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности скачать запись.");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Обработка выбора имени файла из списка для прослушивания / скачивания.
// 
Процедура ОбработкаВыбораФайлаЗаписи(ВыбранныйЭлемент, врПараметры) Экспорт 
    Если ВыбранныйЭлемент = Неопределено  Тогда
	 	Возврат;
	КонецЕсли; 
	
	Если врПараметры.ТипОперации = "СкачатьЗапись" Тогда
		врПараметры = Новый Структура("filename,fpath",ВыбранныйЭлемент.Значение,врПараметры.ДопПараметры);
		Оповестить("СкачатьЗаписьПоИмениФайла", врПараметры, ЭтаФорма);		
	ИначеЕсли врПараметры.ТипОперации = "ВоспроизвестиЗапись" Тогда
		Оповестить("ВоспроизвестиЗаписьПоИмениФайла", ВыбранныйЭлемент.Значение, ЭтаФорма); 
	КонецЕсли; 	
КонецПроцедуры // ОбработкаВыбораФайлаЗаписи()

///
// Прочие функции панели телефонии.

&НаКлиенте
// Задействует механизм панели телефонии по созданию документа "Событие".
// 
Процедура СоздатьСтикер(Команда)
	ТекДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекДанные.ЕстьСобытие Тогда
		Событие = ПолучитьСсылкуНаСобытие(ТекДанные.Звонок);
		Если Событие <> Неопределено Тогда
			Попытка
				Выполнить("ОткрытьЗначение(Событие)");
				Возврат;
			Исключение
			КонецПопытки;
			
			Попытка
				Выполнить("ПоказатьЗначение(,Событие)");				
				Возврат;
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	Иначе
		Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
		Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекДанные.Звонок) = Ложь Тогда
			// Внутренний вызов.
			Возврат;
		КонецЕсли;
		// Управляемое приложение.
		Вызов.Вставить("UniqueID",		ТекДанные.ИдентификаторЗвонка);
		Вызов.Вставить("ВремяЗвонка",	ТекДанные.ВремяЗвонка);
		Вызов.Вставить("Длительность",	ТекДанные.ДлительностьРазговора);
		
		// Обычное приложение.
		Вызов.Вставить("ИдентификаторЗвонка",	ТекДанные.ИдентификаторЗвонка);
		Вызов.Вставить("Когда",					ТекДанные.ВремяЗвонка);
		Вызов.Вставить("СекундДлился",			ТекДанные.ДлительностьРазговора);
		Вызов.Вставить("ВходящийЗвонок",		Вызов.Входящий);
		Вызов.Вставить("ПропущенныйЗвонок",		ТекДанные.НетСоединений);
		Вызов.Вставить("ДокументСобытие",		Неопределено);
		Вызов.Вставить("ИмяФайла",				"");         
		Вызов.Вставить("Контрагент",			Вызов.Партнер);         
		Вызов.Вставить("КонтактноеЛицо",		Вызов.Абонент);         
		Вызов.Вставить("ИзИстории",				Истина);
		
		// Найдем в какой глобальной переменной определена панель телефонии.
		Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
		сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
		
		Если сфпФормаТелефон <> Неопределено Тогда
			врДанные = Новый Структура("Вызов,Пропущенный", Вызов, ТекДанные.НетСоединений);
			Оповестить("СоздатьСтикер",врДанные,ЭтаФорма);
		ИначеЕсли Miko_Ajam	<> Неопределено Тогда
			Попытка
				Miko_Ajam.ОткрытьСоздатьСобытие(Вызов.ИдентификаторЗвонка, Вызов);	
			Исключение
			КонецПопытки;
		Иначе
			МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности создать документ ""Событие"".");	
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
// Вспомогательная функция, получает данные по документу "МИКО_стЗаписьИсторииЗвонков".
// 
Функция ЗаполнитьПоДокументуИсторииЗвонков(Вызов, СсылкаНаДокумент)
	Если СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний") Тогда
		Возврат Ложь;	
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Src_Владелец_Ссылка,Src_Ссылка,Src");
		Партнер				= врДанные.Src_Владелец_Ссылка;	
		Абонент 			= врДанные.Src_Ссылка;
		Вызов.НомерТелефона = врДанные.Src;
		Вызов.Входящий 		= Истина;
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Dst_Владелец_Ссылка,Dst_Ссылка,Dst");
		Партнер 			= врДанные.Dst_Владелец_Ссылка;	
		Абонент 			= врДанные.Dst_Ссылка;
		Вызов.НомерТелефона = врДанные.Dst;
		Вызов.Входящий 		= Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Вызов.Партнер = Партнер;	
		Вызов.Абонент = Абонент;	
	Иначе
		Вызов.Партнер = Абонент;	
	КонецЕсли;
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ИменаФайлов");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ИменаФайлов 		= РезульатЗапроса.Выгрузить();
		Вызов.ЕстьЗапись 	= Истина;
		Вызов.recordingfile = ИменаФайлов[0].ИмяФайла;
	Иначе	
		Вызов.ЕстьЗапись    = Ложь;
		Вызов.recordingfile = "";
	КонецЕсли; 
	
	Возврат Истина;	
КонецФункции

// Вспомогательная функция, получает ссылку на первый документ "Событие".
// 
Функция ПолучитьСсылкуНаСобытие(СсылкаНаДокумент)
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ДокументыСобытие");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ДокументыСобытие = РезульатЗапроса.Выгрузить();
		Событие = ДокументыСобытие[0].Событие;
	Иначе	
	    Событие = Неопределено;
	КонецЕсли; 
	
	Возврат Событие;
КонецФункции // ПолучитьСсылкуНаСобытие()

&НаКлиенте
Процедура ДобавитьНомерКонтакту(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;

	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	врПараметры = Новый Структура;
	врПараметры.Вставить("НомерТелефона", 		Вызов.НомерТелефона);
	врПараметры.Вставить("КонтактКНазначению",  Вызов.Партнер);
	врПараметры.Вставить("Абонент", 			Вызов.Абонент);
		
	Если сфпФормаТелефон <> Неопределено Тогда
		// Управляемое приложение.
		Оповестить("ДобавитьНомерКонтакту",врПараметры,ЭтаФорма);
		Возврат;
	КонецЕсли;	
	
	врПараметры.Вставить("Контрагент", 		 	Вызов.Партнер);
	врПараметры.Вставить("КонтактноеЛицо", 		Вызов.Абонент);
	// Обычное приложение.
	ОбъектКИ = Неопределено;
	Если ЗначениеЗаполнено(врПараметры.КонтактноеЛицо) Тогда
	 	ОбъектКИ = врПараметры.КонтактноеЛицо;
	ИначеЕсли ЗначениеЗаполнено(врПараметры.Контрагент) 
		 	  И ТипЗнч(врПараметры.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектКИ = врПараметры.Контрагент;
	Иначе
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// Сперва предложим пользователю выбрать контрагента.
		ФормаВыбораКонтрагента = Вычислить("Справочники.Контрагенты.ПолучитьФормуВыбора()");
		ОбъектКИ 			   = ФормаВыбораКонтрагента.ОткрытьМодально();
		#КонецЕсли 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СоздатьНомерКИ(Неопределено, ОбъектКИ, Неопределено, Вызов.НомерТелефона);	
		Исключение
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности назначить номер контакту.");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;
	// Найдем в какой глобальной переменной определена панель телефонии
	
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	
	Если Miko_Ajam <> Неопределено Тогда
		Miko_Ajam.НабратьНомер(Вызов.НомерТелефона);	
	Иначе
		врДанные = Новый Структура("ОснованиеЗвонка", ТекущиеДанные.Звонок);
		Оповестить("Позвонить", Вызов.НомерТелефона, врДанные);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДополнительныйСтикер(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	  	Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;

	// заполняем реквизиты
	Настройки = Новый Структура; 
	Настройки.Вставить("Входящий",				Вызов.Входящий);
	Настройки.Вставить("LongUniqueID",			ТекущиеДанные.ИдентификаторЗвонка);
	Настройки.Вставить("UniqueID",				ТекущиеДанные.ИдентификаторЗвонка);
	Настройки.Вставить("НомерТелефона",			Вызов.НомерТелефона);
	Настройки.Вставить("Партнер",				Вызов.Партнер);
	Настройки.Вставить("Абонент",				Вызов.Абонент);
	Настройки.Вставить("Пропущенный",			Ложь);
	Настройки.Вставить("ЗвонокЗавершен",		Истина);
	Настройки.Вставить("ОбъектВызова",			ПолучитьСсылкуНаСобытие(ТекущиеДанные.Звонок));
	Настройки.Вставить("ВремяЗвонка",			ТекущаяДата());
	Настройки.Вставить("Длительность",			ТекущиеДанные.ДлительностьРазговора);
	Настройки.Вставить("ЕстьЗапись",			Ложь);               
	Настройки.Вставить("ИзИстории",				Истина);
	
	Настройки.Вставить("НЕФиксироватьIDЗвонка",	Истина);
	Оповестить("СоздатьДополнительныйСтикер", Настройки, ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрикрепитьСобытиеКЗвонку(ЗвонокСсылка, СобытиеСсылка)

	РезульатЗапроса  = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗвонокСсылка, "ДокументыСобытие");
	ДокументыСобытие = РезульатЗапроса.Выгрузить();
	
	Если ДокументыСобытие.Найти(СобытиеСсылка, "Событие") <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ДокументОбъект = ЗвонокСсылка.ПолучитьОбъект();
	СобытиеСтр 			= ДокументОбъект.ДокументыСобытие.Добавить();
	СобытиеСтр.Событие 	= СобытиеСсылка;
	Попытка
		ДокументОбъект.Записать();
	Исключение
		Возврат Ложь;		
	КонецПопытки;
	
	Возврат Истина;	
КонецФункции // ПрикрепитьСобытиеКЗвонку()

&НаСервере
Функция ЗаполнитьВладельцаНомера(врПараметры)

	Для каждого ТекСтрока Из Объект.ТаблицаИстории Цикл
		ТекСсылка = ТекСтрока.Звонок;
		Если ТекСсылка.Dst <> врПараметры.Номер И ТекСсылка.Src <> врПараметры.Номер Тогда
			Продолжить;		
		КонецЕсли; 
		
		врОбъект = ТекСсылка.ПолучитьОбъект();
		Если врОбъект.Dst = врПараметры.Номер Тогда
			Если ЗначениеЗаполнено(врПараметры.Абонент) Тогда
			 	врОбъект.Dst_Ссылка = врПараметры.Абонент;
				врОбъект.Dst_Владелец_Ссылка = врПараметры.Организация;
			Иначе
			 	врОбъект.Dst_Ссылка = врПараметры.Организация;
			КонецЕсли;
			ТекСтрока.КонтактКому = врПараметры.Организация;
		КонецЕсли; 
		Если врОбъект.Src = врПараметры.Номер Тогда
			Если ЗначениеЗаполнено(врПараметры.Абонент) Тогда
			 	врОбъект.Src_Ссылка = врПараметры.Абонент;
				врОбъект.Src_Владелец_Ссылка = врПараметры.Организация;
			Иначе
			 	врОбъект.Src_Ссылка  = врПараметры.Организация;
			КонецЕсли;
			ТекСтрока.КонтактКто = врПараметры.Организация;
		КонецЕсли; 
		
		Попытка
			врОбъект.Записать();
		Исключение
		КонецПопытки; 
	КонецЦикла; 
КонецФункции // ЗаполнитьВладельцаНомера()

&НаКлиенте
Процедура КомуПринадлежитНомер(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;
	                 
	ПараметрыФормы = Новый Структура("НомерТелефона", Вызов.НомерТелефона);
	ОткрытьФорму("Обработка.МИКО_стКомуПринадлежитНомер.Форма", ПараметрыФормы);          
	
КонецПроцедуры

/// 
// История звонкво в стикере.

// Получаем таблицу истории звонков по номеру телефону. Кто последний говорил с клиентом.
// 
&НаСервереБезКонтекста  
Функция ПолучитьИсториюЗвонковПоНомеруТелефона(Знач НомерТелефона, Знач НачалоПериода, Знач ОкончаниеПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка,
		|	МИКО_стЗаписьИсторииЗвонков.Src_ID,
		|	МИКО_стЗаписьИсторииЗвонков.Dst_ID
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.НетСоединений = ЛОЖЬ
		|	И МИКО_стЗаписьИсторииЗвонков.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.Дата КАК Начало,
		|	ВЫБОР
		|		КОГДА &Num_ID = МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum_ID
		|			ТОГДА МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Dst_Ссылка
		|		ИНАЧЕ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Src_Ссылка
		|	КОНЕЦ КАК Абонент,
		|	ВЫБОР
		|		КОГДА &Num_ID = МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum_ID
		|			ТОГДА МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Peer
		|		ИНАЧЕ МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum
		|	КОНЕЦ КАК НомерТелефона,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка КАК Ссылка,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Длительность КАК ПродолжительностьВызова,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.linkedid КАК id,
		|	ВЫБОР
		|		КОГДА &Num_ID = МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Cidnum_ID
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Входящий,
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка.НетСоединений КАК Пропущен
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков.ДетализацияCEL КАК МИКО_стЗаписьИсторииЗвонковДетализацияCEL
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонковДетализацияCEL.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ВТ КАК ВТ
		|			ГДЕ
		|				(ВТ.Src_ID = &Num_ID
		|					ИЛИ ВТ.Dst_ID = &Num_ID))
		|ИТОГИ ПО
		|	Ссылка";
	
		
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	Num_ID = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(НомерТелефона,КоличествоХранимыхЦифрТелефона);
	
	Запрос.УстановитьПараметр("Num_ID", Num_ID);
	Запрос.УстановитьПараметр("НачалоПериода", 	  НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаИстории = Новый Массив;
	Пока ВыборкаСсылка.Следующий() Цикл
	    Данные = Новый Структура("ЕстьЗапись,Начало,Входящий,Пропущен,Абонент,НомерТелефона,Ссылка,ПродолжительностьВызова,id,Документ,ЕстьДокумент");
		Выборка = ВыборкаСсылка.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Данные.Начало = Неопределено Тогда
			 	ЗаполнитьЗначенияСвойств(Данные, Выборка);
			ИначеЕсли МАКС(Данные.ПродолжительностьВызова,Выборка.ПродолжительностьВызова) = Выборка.ПродолжительностьВызова  Тогда	
			 	ЗаполнитьЗначенияСвойств(Данные, Выборка);
			КонецЕсли; 
		КонецЦикла;
		
		Если НЕ Данные.Начало = Неопределено Тогда
			
			РезульатЗапроса  = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Ссылка, "ДокументыСобытие");
			ДокументыСобытие = РезульатЗапроса.Выгрузить();
			
			РезульатЗапроса  = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Ссылка, "ИменаФайлов");
			ИменаФайлов 	 = РезульатЗапроса.Выгрузить();

			Данные.ЕстьЗапись= ИменаФайлов.Количество()>0;
			Если (ДокументыСобытие.Количество()>0) Тогда
		  		Данные.ЕстьДокумент = Истина;
				Данные.Документ 	= ДокументыСобытие[0].Событие; 
			Иначе	
		  		Данные.ЕстьДокумент = Ложь;
			КонецЕсли; 
		    ТаблицаИстории.Добавить(Данные);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаИстории;
КонецФункции

&НаКлиенте
Процедура ТаблицаИсторииПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		нКлиентПредставление 		  = "";
		// Внутренний вызов.
		Возврат;
	КонецЕсли;
	//
	Если ЗначениеЗаполнено(Вызов.Партнер) Тогда
		ПредставлкениеКлиент = "" + Вызов.Партнер + " (" + Вызов.НомерТелефона + ")"; 	
	ИначеЕсли ЗначениеЗаполнено(Вызов.Абонент) Тогда
		ПредставлкениеКлиент = "" + Вызов.Абонент + " (" + Вызов.НомерТелефона + ")"; 	
	Иначе
		ПредставлкениеКлиент = "" + Вызов.НомерТелефона + ""; 	
	КонецЕсли; 	
	нКлиентПредставление = ПредставлкениеКлиент;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализПропущенного(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		Возврат;
	КонецЕсли;

	врПараметры = Новый Структура;
	врПараметры.Вставить("НомерТелефона", 	Вызов.НомерТелефона);	
	врПараметры.Вставить("Клиент", 			Вызов.Партнер);	
	врПараметры.Вставить("ДатаОтсчета", 	ТекущиеДанные.ВремяЗвонка);	
	
	ОткрытьФорму("Обработка.МИКО_стАнализПропущенныхВызовов.Форма.Форма", врПараметры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНомеру(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		Возврат;
	КонецЕсли;
	НомерТелефона = Вызов.НомерТелефона;
	УстановитьЭлементОтбора(НомерТелефона);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКлиенту(Команда)
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		Возврат;
	КонецЕсли;
	УстановитьЭлементОтбора(Вызов.Партнер);
КонецПроцедуры

&НаКлиенте
Процедура нКлиентПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		Возврат;
	КонецЕсли;
	Клиент = Вызов.Партнер;
	
	ОткрытьЗначениеКлиент(Клиент);
КонецПроцедуры

// Открывает значение. 
//
&НаКлиенте
Процедура ОткрытьЗначениеКлиент(Клиент)

	Если ЗначениеЗаполнено(Клиент) Тогда
		Попытка
			Выполнить("ОткрытьЗначение(Клиент)");
			Возврат;
		Исключение
		КонецПопытки;
		
		Попытка
			Выполнить("ПоказатьЗначение(,Клиент)");				
			Возврат;
		Исключение
		КонецПопытки; 
	КонецЕсли; 

КонецПроцедуры // ОткрытьЗначениеКлиент()

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ИспользоватьПолнотекстовыйПоиск И ЗначениеЗаполнено(Текст) Тогда
		ДанныеВыбора = Новый СписокЗначений;
	    ДанныеВыбора.Добавить("МИКО_ПолнотекстовыйПоиск"+СокрЛП(Текст), "Искать: " + СокрЛП(Текст));
		Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(Текст) Тогда
			ДанныеВыбора.Добавить(Текст, "Номер телефона: "+Текст);
		Иначе
			ДанныеВыбора.Добавить(Текст, "Skype: "+Текст);
		КонецЕсли; 
	Иначе	
		ДанныеВыбора = ПолучитьОбъектыПоиска(СокрЛП(Текст), ТекстЗапросаОтбора);
	КонецЕсли; 		
	
КонецПроцедуры

// Выполняет поиск по объектам с наименованием
//
&НаСервереБезКонтекста 
Функция ПолучитьОбъектыПоиска(СтрПоиска, ТекстЗапросаОтбора)

	СписокОтбора = Новый СписокЗначений;
	Если СтрДлина(СтрПоиска)<3 Тогда
		Возврат СписокОтбора; 	
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапросаОтбора;
	
	СтрокаНомерТелефона = СтрЗаменить(СтрПоиска,"""","""""");
	
	Запрос = Новый Запрос;	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Наименование", "%"+СтрПоиска+"%");			   
	
	Результат = Запрос.Выполнить();
	РезультатТЗ = Результат.Выгрузить();
	
	Для каждого ВариантОтбора Из РезультатТЗ Цикл
	 
		СписокОтбора.Добавить(ВариантОтбора.Ссылка, ВариантОтбора.Представление+": "+ВариантОтбора.Наименование);
	
	КонецЦикла; 
	
	Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(СтрПоиска) Тогда
		// Поиск по номеру телефона.
		СписокОтбора.Добавить(СтрПоиска, "Номер телефона: "+СтрПоиска);
	Иначе	
		// Это не номер телефона. Возможно skype или наименование
		Если ВСловеТолькоЛатиница(СтрПоиска) Тогда
			СписокОтбора.Добавить(СтрПоиска,"Skype: "+СтрПоиска);
		КонецЕсли;
	КонецЕсли; 
		
	Возврат СписокОтбора;

КонецФункции // ПолучитьОбъектыПоиска()

// Возвращает соответствие со списком справочников, в которых хранится контактная информация, и их приоритет.
// Ключ - приоритет, значение - имя объекта метаданных.
// 
&НаСервереБезКонтекста
Функция ПолучитьОбъектыКИ()

	СоответствиеОбъектов = Новый Соответствие;
	
	Если Метаданные.Справочники.Найти("Пользователи") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Пользователь";
		СтруктураОбъекта.Имя			= "Пользователи";
		
		СоответствиеОбъектов.Вставить(1, СтруктураОбъекта);
	ИначеЕсли Метаданные.Справочники.Найти("Организации") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Организация";
		СтруктураОбъекта.Имя			= "Организации";
		
		СоответствиеОбъектов.Вставить(5, СтруктураОбъекта);
	КонецЕсли;
	Если Метаданные.Справочники.Найти("Партнеры") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Партнер";
		СтруктураОбъекта.Имя			= "Партнеры";
		
		СоответствиеОбъектов.Вставить(2, СтруктураОбъекта);
	КонецЕсли;
	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Контрагент";
		СтруктураОбъекта.Имя			= "Контрагенты";
		
		СоответствиеОбъектов.Вставить(3, СтруктураОбъекта);
	КонецЕсли;	
	Если Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Контактное лицо";
		СтруктураОбъекта.Имя			= "КонтактныеЛицаКонтрагентов";
		
		СоответствиеОбъектов.Вставить(6, СтруктураОбъекта);
	КонецЕсли;	
	Если Метаданные.Справочники.Найти("КонтактныеЛицаПартнеров") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Контактное лицо";
		СтруктураОбъекта.Имя			= "КонтактныеЛицаПартнеров";
		
		СоответствиеОбъектов.Вставить(4, СтруктураОбъекта);
	КонецЕсли;	
	Если Метаданные.Справочники.Найти("Корреспонденты") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Корреспондент";
		СтруктураОбъекта.Имя			= "Корреспонденты";
		
		СоответствиеОбъектов.Вставить(7, СтруктураОбъекта);
	КонецЕсли;	
	Если Метаданные.Справочники.Найти("ФизическиеЛица") <> Неопределено Тогда
		СтруктураОбъекта = Новый Структура("Представление, Имя");
		СтруктураОбъекта.Представление	= "Физлицо";
		СтруктураОбъекта.Имя			= "ФизическиеЛица";
		
		СоответствиеОбъектов.Вставить(21, СтруктураОбъекта);
	КонецЕсли; 

	Возврат СоответствиеОбъектов;
	
КонецФункции // ПолучитьОбъектыКИ()

// На основании объектов метаданных формирует текст запроса для универсального отбора.
// 
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаОтбора()
	
	ТекстЗапроса = "";
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ {РАЗРЕШЕННЫЕ} ПЕРВЫЕ 3
		|	{Имя}.Ссылка,
		|	{Имя}.Наименование КАК Наименование,
		|	{Вес} КАК Вес,
		|	{Представление} КАК Представление
		|//{ПОМЕСТИТЬ} ВТ
		|ИЗ
		|	Справочник.{Имя} КАК {Имя}
		|ГДЕ
		|	 {Имя}.Наименование ПОДОБНО &Наименование";
				   
				   
	СоответствиеОбъектовКонтактов = ПолучитьОбъектыКИ();
	
	Для каждого ОбъектКИ Из СоответствиеОбъектовКонтактов Цикл
	
		Если Не ТекстЗапроса = "" Тогда
		  	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "");
		Иначе
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "РАЗРЕШЕННЫЕ");
			врЗапрос = СтрЗаменить(врЗапрос, "//{ПОМЕСТИТЬ}", "ПОМЕСТИТЬ");
		КонецЕсли; 
		врЗапрос = СтрЗаменить(врЗапрос, "{Имя}", 			""+ОбъектКИ.Значение.Имя);
		врЗапрос = СтрЗаменить(врЗапрос, "{Вес}", 			""+ОбъектКИ.Ключ);
		врЗапрос = СтрЗаменить(врЗапрос, "{Представление}", """"+ОбъектКИ.Значение.Представление+"""");
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + врЗапрос + Символы.ПС;
		
	КонецЦикла; 			   
	
	// Дополним запрос для отбора по номеру телефона.
	
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";
											   |ВЫБРАТЬ
	                                           |	ВТ.Ссылка,
	                                           |	ВТ.Наименование,
	                                           |	ВТ.Вес,
											   |	ВТ.Представление
	                                           |ИЗ
	                                           |	ВТ КАК ВТ
											   |
											   |УПОРЯДОЧИТЬ ПО Вес ВОЗР";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаОтбора()

&НаКлиенте
Процедура СтрокаПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьЭлементОтбора(ВыбранноеЗначение);
	ВыбранноеЗначение = "";
	
КонецПроцедуры

// Устанавливает элемент отбора по заполненному полю поиска.
// 
&НаКлиенте
Процедура УстановитьЭлементОтбора(ЭлементОтбора=Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ЭлементОтбора) Тогда
		Возврат;
	КонецЕсли; 

	сч = 1;
	Пока Элементы.Найти("дСтрокаОтбора" + Формат(сч,"ЧГ=")) <> Неопределено Цикл
		id = Формат(сч,"ЧГ="); сч = сч + 1;
		Если ЭтаФорма["ЭлементОтбора" + id] = ЭлементОтбора Тогда
			// Такой отбор уже установлен.
			Возврат;
		КонецЕсли; 
	КонецЦикла; 

	ТипЭлемента = ТипЗнч(ЭлементОтбора);
	ПредставлениеОтбора = ПолучитьПредставлениеОтбора(ЭлементОтбора);
	
	сч = 1;
	Пока Элементы.Найти("дСтрокаОтбора" + Формат(сч,"ЧГ=")) <> Неопределено Цикл
		id = Формат(сч,"ЧГ=");
		сч = сч + 1;
		Если ЗначениеЗаполнено(ЭтаФорма["ЭлементОтбора"+id]) Тогда
		 	Продолжить;
		КонецЕсли; 
		ЭтаФорма["ЭлементОтбора"+id] = ЭлементОтбора;
		// Установим представление.
		Элементы["дСтрокаОтбора"+id].Заголовок = ПредставлениеОтбора;
		Элементы["дСтрокаОтбора"+id].Видимость = Истина;
		ОбновитьНаСервере();
		Прервать;
	КонецЦикла; 

	Элементы.грОтбора.Видимость = Истина;
	
КонецПроцедуры // УстановитьЭлементОтбора()
&НаКлиенте
Функция ПолучитьПредставлениеОтбора(ОбъектОтбора)

	Если ОбъектОтбора = Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	ТипОтбора = СписокТиповОбъектовОтбора.НайтиПоЗначению(ТипЗнч(ОбъектОтбора));
	
	Если ТипОтбора <> Неопределено Тогда
		Возврат ТипОтбора.Представление+": " + ОбъектОтбора;
	КонецЕсли; 

	Если ТипЗнч(ОбъектОтбора) = Тип("Строка") Тогда		
	    КомандаПоиска = "МИКО_ПолнотекстовыйПоиск";
		Если Найти(ОбъектОтбора, КомандаПоиска)>0 Тогда
		 	Значение = СтрЗаменить(ОбъектОтбора,КомандаПоиска, "");
			Возврат "(п.п.)Наименование: " + Значение;			
		КонецЕсли; 
		
		Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(ОбъектОтбора) Тогда
			Возврат "Номер телефона: " + ОбъектОтбора;
		КонецЕсли; 
		
		Если ВСловеТолькоЛатиница(ОбъектОтбора) Тогда
			Возврат "Skype: " + ОбъектОтбора;
		КонецЕсли; 
		
		Возврат "Наименование: " + ОбъектОтбора;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьПредставлениеОтбора()
&НаКлиенте
Процедура дСтрокаОтбора1Нажатие(Элемент)
	ДействиеСтрокаОтбора(Элемент);
КонецПроцедуры

// Обрабатывает нажатие на гиперссылку строки отбора
&НаКлиенте
Процедура ДействиеСтрокаОтбора(ЭлементФормы)

	ЭлементыМеню = Новый СписокЗначений();
	Если НЕ ЗначениеОтбораСтрока(ЭлементФормы) Тогда
		ЭлементыМеню.Добавить("ОткрытьКарточку",  "Открыть карточку",,БиблиотекаКартинок.Найти);
	КонецЕсли; 
	ЭлементыМеню.Добавить("Очистить", "Удалить текущий отбор",,БиблиотекаКартинок.Удалить);
	// ЭлементыМеню.Добавить("ОчиститьВсеОтборы", "Удалить все отборы",,БиблиотекаКартинок.Удалить);
		
	Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
		
		ВыбранныйЭлемент = ВыбратьИзМеню(ЭлементыМеню, ЭлементФормы);
		
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		ИначеЕсли ВыбранныйЭлемент.Значение = "Очистить" Тогда
			УстановитьЗначенияПоУмолчанию(ЭлементФормы);
		ИначеЕсли ВыбранныйЭлемент.Значение = "ОчиститьВсеОтборы" Тогда
			УстановитьЗначенияПоУмолчанию();	
		ИначеЕсли ВыбранныйЭлемент.Значение = "ОткрытьКарточку" Тогда
    		ИмяРеквизита = СтрЗаменить(ЭлементФормы.Имя, "дСтрокаОтбора", "ЭлементОтбора");
			ОткрытьЗначениеКлиент(ЭтаФорма[ИмяРеквизита]);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Выполнить("ПоказатьВыборИзМеню(
			|Новый ОписаниеОповещения(""ПослеВыбораЭлементаМеню"", ЭтаФорма,Новый Структура(""ЭлементФормы"",ЭлементФормы)),
			|ЭлементыМеню,
			|ЭлементФормы)");
			
	КонецЕсли;

КонецПроцедуры // ДействиеСтрокаОтбора()

&НаКлиенте
Процедура УстановитьЗначенияПоУмолчанию(ЭлементФормы = Неопределено, ОбновитьНаСервере=Истина)

	Если ЭлементФормы = Неопределено Тогда
		// Уберем видимость у группы отбора
		Элементы.грОтбора.Видимость = Ложь;
		сч = 1;
		Пока Элементы.Найти("дСтрокаОтбора" + Формат(сч,"ЧГ=")) <> Неопределено Цикл
			id = Формат(сч,"ЧГ="); сч = сч + 1;
			УстановитьЗначениеЭлементаПоУмолчанию(Элементы["дСтрокаОтбора" + id]);
		КонецЦикла; 
		Если ОбновитьНаСервере=Истина Тогда
			ОбновитьНаСервере();
		КонецЕсли; 
		Возврат;
	КонецЕсли; 
	
	УстановитьЗначениеЭлементаПоУмолчанию(ЭлементФормы);
	
	Если ОбновитьНаСервере=Истина Тогда
		ОбновитьНаСервере();
	КонецЕсли; 
	
	сч = 1; ОтборУстановлен = Ложь;
	Пока Элементы.Найти("дСтрокаОтбора" + Формат(сч,"ЧГ=")) <> Неопределено Цикл
		id = Формат(сч,"ЧГ="); сч = сч + 1;
		Если ЗначениеЗаполнено(ЭтаФорма["ЭлементОтбора"+id]) Тогда
		 	ОтборУстановлен = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	Элементы.грОтбора.Видимость = ОтборУстановлен;
	
КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

&НаКлиенте
Процедура УстановитьЗначениеЭлементаПоУмолчанию(ЭлементФормы)

    ИмяРеквизита = СтрЗаменить(ЭлементФормы.Имя, "дСтрокаОтбора", "ЭлементОтбора");
	Если ОбъектОтбора = ЭтаФорма[ИмяРеквизита] Тогда
		ОбъектОтбора = Неопределено;	
	КонецЕсли; 
	ЭтаФорма[ИмяРеквизита] = Неопределено;
	
	ЭлементФормы.Видимость = Ложь;
	ЭлементФормы.Заголовок = СтрЗаменить(ЭлементФормы.Имя, "дСтрокаОтбора", "#Отбор");

КонецПроцедуры // УстановитьЗначениеЭлементаПоУмолчанию()
// Проверяет, является ли значение отбора строкой.
//
&НаКлиенте
Функция ЗначениеОтбораСтрока(ЭлементФормы)

    ИмяРеквизита = СтрЗаменить(ЭлементФормы.Имя, "дСтрокаОтбора", "ЭлементОтбора");
	Если ТипЗнч(ЭтаФорма[ИмяРеквизита]) = Тип("Строка") Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;	
КонецФункции // ЗначениеОтбораНеСтрока()
&НаКлиенте
Процедура ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	
	Элемент = Неопределено;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
	ИначеЕсли ВыбранныйЭлемент.Значение = "Очистить" И Параметры.Свойство("ЭлементФормы", Элемент) Тогда
		УстановитьЗначенияПоУмолчанию(Элемент);
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОткрытьКарточку" И Параметры.Свойство("ЭлементФормы", Элемент) Тогда
		ИмяРеквизита = СтрЗаменить(Элемент.Имя, "дСтрокаОтбора", "ЭлементОтбора");
		ОткрытьЗначениеКлиент(ЭтаФорма[ИмяРеквизита]);
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОчиститьВсеОтборы" И Параметры.Свойство("ЭлементФормы", Элемент) Тогда

		УстановитьЗначенияПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру с элементами отбора.
//
&НаСервере
Функция ПолучитьОбъектыОтбора()

	СтруктураОтбора 	= Новый Структура("СправочникиОтбор, НомерОтбор, НаименованиеОтбор, SkypeОтбор");
	МассивСпрОтбор 		= Новый Массив;
	МассивТелОтбор		= Новый Массив;
	МассивНаимОтбор		= Новый Массив;
	МассивSkypeОтбор	= Новый Массив;
	
	сч = 1;
	Пока Элементы.Найти("дСтрокаОтбора" + Формат(сч,"ЧГ=")) <> Неопределено Цикл
		id = Формат(сч,"ЧГ="); сч = сч + 1;
		ЗаполнитьМассивОтбора(ЭтаФорма["ЭлементОтбора"+id], МассивСпрОтбор, МассивТелОтбор, МассивНаимОтбор, МассивSkypeОтбор);
	КонецЦикла; 
		
	СтруктураОтбора.СправочникиОтбор 	= МассивСпрОтбор;
	СтруктураОтбора.НомерОтбор 			= МассивТелОтбор;
	СтруктураОтбора.НаименованиеОтбор 	= МассивНаимОтбор;
	СтруктураОтбора.SkypeОтбор 			= МассивSkypeОтбор;
	
	Возврат СтруктураОтбора;
	
КонецФункции // ПолучитьОбъектыОтбора()
&НаСервере
Процедура ЗаполнитьМассивОтбора(ЭлементОтбора, МассивСпрСсылка, МассивТел, МассивНаим, МассивSkype)

	Если ЭлементОтбора <> Неопределено И Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементОтбора)) Тогда
		МассивСпрСсылка.Добавить(ЭлементОтбора);
	ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("Строка") Тогда
		
	    КомандаПоиска = "МИКО_ПолнотекстовыйПоиск";
		Если Найти(ЭлементОтбора, КомандаПоиска)>0 Тогда
			РезультатПоискаСсылок = НайтиПоНаименованию(СтрЗаменить(ЭлементОтбора,КомандаПоиска, ""));
			Для каждого ТекЗначение Из РезультатПоискаСсылок Цикл
				Если МассивСпрСсылка.Найти(ТекЗначение) = Неопределено Тогда
					МассивСпрСсылка.Добавить(ТекЗначение);
				КонецЕсли; 
			КонецЦикла; 
			Возврат;			
		КонецЕсли; 

		// Если строку отбора можно преобразовать в число, то будем считать ее отбором по телефону.
		Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(ЭлементОтбора) Тогда
			ЧислоЦифрДляХранения = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
			НомерТел = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(ЭлементОтбора, ЧислоЦифрДляХранения);
			МассивТел.Добавить(НомерТел);
			Возврат;
		КонецЕсли; 
				
		// Если в строке отбора только латиница, будем считать, что это skype.
		Если ВСловеТолькоЛатиница(ЭлементОтбора) Тогда
			МассивSkype.Добавить(ЭлементОтбора);
		Иначе
			МассивНаим.Добавить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСтруктуруОтбора()
&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;
	Если ИспользоватьПолнотекстовыйПоиск И ЗначениеЗаполнено(Текст) Тогда
		ДанныеВыбора = Новый СписокЗначений;
	    ДанныеВыбора.Добавить("МИКО_ПолнотекстовыйПоиск"+СокрЛП(Текст), "Искать: " + СокрЛП(Текст));
		Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(Текст) Тогда
			ДанныеВыбора.Добавить(Текст, "Номер телефона: "+Текст);
		Иначе
			ДанныеВыбора.Добавить(Текст, "Skype: "+Текст);
		КонецЕсли; 
	Иначе	
		ДанныеВыбора = ПолучитьОбъектыПоиска(СокрЛП(Текст), ТекстЗапросаОтбора);
		Если ДанныеВыбора.Количество()=0 Тогда
		 	ДанныеВыбора.Добавить(Текст);
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры
&НаКлиенте
Процедура УдалитьВсеОтборы(Команда)
	УстановитьЗначенияПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюОткрытьКарточку(Команда)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаИстории.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.Звонок) = Ложь Тогда
		Возврат;
	КонецЕсли;
	Клиент = Вызов.Партнер;
	
	ОткрытьЗначениеКлиент(Клиент);
КонецПроцедуры

// Заполняет список типов объектов отбора для последующего формирования представления объекта отбора.
// 
&НаСервере
Процедура ЗаполнитьСписокТиповОбъектовОтбора()

	Если Метаданные.Справочники.Найти("Партнеры") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.Партнеры")), "Партнер");
	КонецЕсли;

	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.Контрагенты")), "Контрагент");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("КонтактныеЛицаПартнеров") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.КонтактныеЛицаПартнеров")), "Контактное лицо");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.КонтактныеЛицаКонтрагентов")), "Контактное лицо");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Корреспонденты") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.Корреспонденты")), "Корреспондент");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Пользователи") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.Пользователи")), "Пользователь");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("ФизическиеЛица") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.ФизическиеЛица")), "Физ. лицо");
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Организации") <> Неопределено Тогда
		СписокТиповОбъектовОтбора.Добавить(Тип(("СправочникСсылка.Организации")), "Организация");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСписокТиповОбъектовОтбора()

&НаКлиентеНаСервереБезКонтекста
// Проверка на латинские символы
// 
Функция ВСловеТолькоЛатиница(знач Слово)
	НовоеСлово= "";
	спТранслит = Новый ("Соответствие");
	
	спТранслит.Вставить("i","i"); 
	спТранслит.Вставить("q","q");
	спТранслит.Вставить("w","w");
	спТранслит.Вставить("e","e");
	спТранслит.Вставить("r","r");
	спТранслит.Вставить("t","t");
	спТранслит.Вставить("y","y");
	спТранслит.Вставить("u","u");
	спТранслит.Вставить("i","i");
	спТранслит.Вставить("o","o");
	спТранслит.Вставить("p","p");
	спТранслит.Вставить("a","a");
	спТранслит.Вставить("s","s");
	спТранслит.Вставить("d","d");
	спТранслит.Вставить("f","f");
	спТранслит.Вставить("g","g");
	спТранслит.Вставить("h","h");
	спТранслит.Вставить("j","j");
	спТранслит.Вставить("k","k");
	спТранслит.Вставить("l","l");
	спТранслит.Вставить("z","z");
	спТранслит.Вставить("x","x");
	спТранслит.Вставить("c","c");
	спТранслит.Вставить("v","v");
	спТранслит.Вставить("b","b");
	спТранслит.Вставить("n","n");
	спТранслит.Вставить("m","m");
	
	спТранслит.Вставить("-","-");
	спТранслит.Вставить("_","_");
	спТранслит.Вставить(".",".");
	
	спТранслит.Вставить("!","!"); 
	спТранслит.Вставить("?","?"); 
	
	спТранслит.Вставить("$","$"); 
	спТранслит.Вставить("%","%"); 
	спТранслит.Вставить("@","@"); 
	спТранслит.Вставить("&","&"); 
	спТранслит.Вставить("=","="); 
	спТранслит.Вставить("+","+"); 
	
	спТранслит.Вставить("(","(");
	спТранслит.Вставить(")",")");  
	спТранслит.Вставить("[","["); 
	спТранслит.Вставить("]","]");  
	спТранслит.Вставить("}","}"); 
	спТранслит.Вставить("{","{");
	спТранслит.Вставить("0","0");
	спТранслит.Вставить("1","1");
	спТранслит.Вставить("2","2");
	спТранслит.Вставить("3","3");
	спТранслит.Вставить("4","4");
	спТранслит.Вставить("5","5");
	спТранслит.Вставить("6","6");
	спТранслит.Вставить("7","7");
	спТранслит.Вставить("8","8");  
	спТранслит.Вставить("9","9");
	
	Для а=1 по СтрДлина(Слово) Цикл
		Если спТранслит.Получить(НРЕГ(Сред(Слово,а,1))) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;
КонецФункции

/// ПОЛНОТЕКСТОВЫЙ ПОИСК

&НаСервере 
Функция НайтиПоНаименованию(СтрокаПоиска)
	
	НайденныеСсылки = Новый Массив; МассивОтбор = Новый Массив(); СинонимыРеквизитов = Новый Массив;
	ДобавитьОтборЕслиВозможно("Пользователи",				МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("Партнеры",					МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("Сотрудники",					МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("Контрагенты",				МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("КонтактныеЛица", 			МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("Кореспонденты",				МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("Организации",				МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("КонтактныеЛицаПартнеров",	МассивОтбор,СинонимыРеквизитов);	
	ДобавитьОтборЕслиВозможно("КонтактныеЛицаКонтрагентов", МассивОтбор,СинонимыРеквизитов);	
	
	РазмерПорции = 300;
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	СписокПоиска.ПорогНечеткости = 10;
	СписокПоиска.ОбластьПоиска = МассивОтбор;
	Попытка
		СписокПоиска.ПерваяЧасть();
	Исключение
	 	Возврат НайденныеСсылки;
	КонецПопытки;
	
	КоличествоНайденных = СписокПоиска.ПолноеКоличество();
	ТекущаяПозиция = 0;
	Пока Истина Цикл
		Для каждого ТекущаяСтрока Из СписокПоиска Цикл
			Для каждого ИмяРеквизита Из СинонимыРеквизитов Цикл
				Если Лев(ТекущаяСтрока.Описание,СтрДлина(ИмяРеквизита)) = ИмяРеквизита
					 И НайденныеСсылки.Найти(ТекущаяСтрока.Значение) = Неопределено Тогда
				    НайденныеСсылки.Добавить(ТекущаяСтрока.Значение);
				КонецЕсли; 		
			КонецЦикла; 
		КонецЦикла; 
		
		ТекущаяПозиция = ТекущаяПозиция + РазмерПорции;
		Если КоличествоНайденных < ТекущаяПозиция Тогда
			Прервать;	
		КонецЕсли; 
		// СписокПоиска.СледующаяЧасть();
	КонецЦикла; 
	
	Возврат НайденныеСсылки;
КонецФункции
&НаСервере 
Процедура ДобавитьОтборЕслиВозможно(Знач ИмяСправочника, МассивОтбор, СинонимыРеквизитов)
	
	Справочник = Метаданные.Справочники.Найти(ИмяСправочника);
	Если Справочник = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	Если МассивОтбор.Найти(Справочник) = Неопределено Тогда
		МассивОтбор.Добавить(Справочник);
	КонецЕсли; 	
	Если СинонимыРеквизитов.Найти(Справочник.СтандартныеРеквизиты.Наименование.Синоним)=Неопределено Тогда
		СинонимыРеквизитов.Добавить(Справочник.СтандартныеРеквизиты.Наименование.Синоним); 
	КонецЕсли; 
		
КонецПроцедуры

// #КонецОбласти 
