Перем мВалютаРегламентированногоУчета Экспорт;

// Валюта курс и кратность для пересчета регламентированных сумм
Перем мВалютаУпрУчета Экспорт;
Перем мКурсУпрУчета Экспорт;
Перем мКратностьУпрУчета Экспорт;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;
Перем ВестиУчетПоДопРазрезамРегл;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Артикул";
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Код";
		ТекстКодАртикул = "Код";
	Иначе
		ВыводитьКоды    = Ложь;
		Колонка         = "";
		ТекстКодАртикул = "Код";
	КонецЕсли;

	Если ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	Запрос = Новый Запрос;
	
	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаПечати = мВалютаРегламентированногоУчета;
	Иначе
		ВалютаПечати = мВалютаУпрУчета;
	КонецЕсли;

	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидСкладаНТТ",    Перечисления.ВидыСкладов.НТТ);
	Запрос.УстановитьПараметр("ВалютаПечати",    ВалютаПечати);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|	Организация КАК Поставщик,	
	|	Склад,	
	|	Склад.Представление КАК Склад,
	|	Ответственный.ФизЛицо.Наименование 	КАК Выписал,
    |	ПредседательКомиссии.Наименование	КАК ПредседательКомиссии,
    |	ПервыйЧленКомиссии.Наименование		КАК ПервыйЧленКомиссии,
    |	ВторойЧленКомиссии.Наименование		КАК ВторойЧленКомиссии,
    |	ТретийЧленКомиссии.Наименование 	КАК ТретийЧленКомиссии,
	|   &ВалютаПечати КАК Валюта,
	|	Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|		ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|		Количество                      КАК Количество,
	|		КоличествоУчет                  КАК КоличествоПоУчету,
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление  КАК ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА ЦенаВРознице
	|			ИНАЧЕ Цена
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА Количество * ЦенаВРознице
	|			ИНАЧЕ Сумма
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА КоличествоУчет *ЦенаВРознице
	|			ИНАЧЕ СуммаУчет
	|		КОНЕЦ КАК СуммаПоУчету,
	|		ХарактеристикаНоменклатуры      КАК Характеристика,
	|		NULL							КАК Серия
	|	)
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	| 	Товары.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИнвентаризацияТоваровНаСкладе";

	Макет = ПолучитьМакет("ИнвентаризацияТоваровНаСкладе");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Инвентаризация товаров на складе';uk='Інвентаризація товарів на складі'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
  
	// Выводим дополнительно информацию о складе
	СписокДополнительныхПараметров = "Склад,Валюта,";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	// Выводим шапку таблицы
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = Колонка;
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета    = Макет.ПолучитьОбласть(ОбластьСтроки);
	ИтогСуммы        = 0;
	ИтогСуммыПоУчету = 0;

	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = СокрП(ВыборкаСтрокТовары.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);

		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТовары.КодАртикул;
		КонецЕсли;

		ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.Сумма;
		ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.СуммаПоУчету;

		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	// Вывести Итого
	ОбластьМакета                        = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего        = ОбщегоНазначения.ФорматСумм(ИтогСуммы);
	ОбластьМакета.Параметры.ВсегоПоУчету = ОбщегоНазначения.ФорматСумм(ИтогСуммыПоУчету);
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = ИтогСуммы;
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ВыборкаСтрокТовары.Количество() + "," +
											 НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, ВалютаПечати) + ".";
											 
	ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим подписи к документу
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// ТекстОписания
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
Функция ПечатьМ21()

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяСтрока",   "                ");
	Запрос.УстановитьПараметр("Дата",  Дата);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Номер 				КАК Номер,
	|	ИнвентаризацияТоваровНаСкладе.Дата					КАК Дата,
	|	ИнвентаризацияТоваровНаСкладе.Организация 			КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад.Представление	КАК ПредставлениеСклада,
	|	ИнвентаризацияТоваровНаСкладе.Склад 				КАК Склад,
	|   ИнвентаризацияТоваровНаСкладе.Склад.ВидСклада		КАК ВидСклада,
	|	&ПустаяСтрока										КАК ДолжностьМатериальноОтветственного,
	|	&ПустаяСтрока       								КАК ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.Наименование 					КАК ПредседательКомиссии,
	|	ПервыйЧленКомиссии.Наименование 					КАК ПервыйЧленКомиссии,
	|	ВторойЧленКомиссии.Наименование 					КАК ВторойЧленКомиссии,
	|	ТретийЧленКомиссии.Наименование 					КАК ТретийЧленКомиссии,
	|	ОтветственныеЛица.ФизическоеЛицо.Наименование 		КАК МатериальноОтветственный
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе,
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, СтруктурнаяЕдиница = &Склад) КАК ОтветственныеЛица
	|   ПО ИСТИНА
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент
	|";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерСтроки,
	|	Номенклатура,
	|	Номенклатура.Код				КАК НоменклатурныйНомер,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|	Количество                      КАК Количество,
	|	ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмерения,
	|	ЦенаРегл						КАК ЦенаРегл,
	|	ЦенаВРознице					КАК ЦенаВРознице,
	|	ХарактеристикаНоменклатуры      КАК Характеристика,	
	|	NULL 							КАК Серия
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК ИнвентаризацияТоваровНаСкладе
	|
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|   НомерСтроки
	|";
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИнвентаризационнаяОпись_М21";

	Макет = ПолучитьМакет("ИнвентаризационнаяОпись_М21");

	// Выводим данные об организации и складе
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НазваниеОрганизации 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,"	, Ложь);
	ОбластьМакета.Параметры.ЕДРПОУОрганизации  	 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "КодПоЕДРПОУ,"			, Ложь);
	
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим шапку таблицы
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	КоличествоНаименований = 0;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = СокрП(ВыборкаСтрокТовары.Товар);
        
		// Для НТТ цену товара покажем равной розничной цене.
		Если Шапка.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			
			ОбластьМакета.Параметры.ЦенаРегл =  ВыборкаСтрокТовары.ЦенаВРознице;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		КоличествоНаименований = КоличествоНаименований + 1;
		
	КонецЦикла;

	// Вывести строку Итого и подписи (подвал)
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.КоличествоНаименований = КоличествоНаименований;
	// число прописью без десятичных знаков
	ОбластьМакета.Параметры.КоличествоНаименованийПрописью = СокрП(ЧислоПрописью(КоличествоНаименований, , ",,,,,,,,0"));
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьМ21()

/// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	Если ИмяМакета = "Акт" Тогда

		// Печать упр. формы документа
		ТабДокумент = ПечатьДокумента();
	ИначеЕсли ИмяМакета = "М21" тогда

		// Печать униф. формы М-21
		ТабДокумент = ПечатьМ21();
		
	КонецЕсли; 

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Акт,М21","Акт инвентаризации товаров на складе","Инвентаризационная опись (М-21)");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьНачальныеНастройки(ПостроительОтчета) Экспорт

	ПостроительОтчета.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,","") + "
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	|			0 
	|		ИНАЧЕ
	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	|	КОНЕЦ                                  КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад)
	|КАК ОстаткиТоваров
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|ПО
	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры
	|	И ОстаткиТоваров.Качество = ОстаткиПартий.Качество
	|
	|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество";
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Номенклатура");
	МассивОтбора.Добавить("НоменклатурнаяГруппа");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

КонецПроцедуры

// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;

КонецПроцедуры // ПриИзмененииОрганизации()

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Заполняет документ по остаткам на складе
// 
Процедура ЗаполнитьПоОстаткамНаСкладеУпр(ПостроительОтчета, ТолькоУчетные = Ложь) Экспорт

	Если РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ВестиПартионныйУчетПоСкладам Тогда
		ВремСклад = Склад;
	Иначе
		ВремСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	ВалютаУпрУчета    = глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса    = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУпрУчета, Дата);
	КурсУпрУчета      = СтруктураКурса.Курс;
	КратностьУпрУчета = СтруктураКурса.Кратность;

	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда

		ПостроительОтчета.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
		|	ОстаткиТоваров.ЦенаВРознице,
		|	ВЫБОР
		|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
		|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
		|			0 
		|		ИНАЧЕ
		|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
		|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
		|	КОНЕЦ                                   КАК Сумма,
		|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВНТТ.Остатки(&МоментДокумента,
		|	                                                   Склад = &Склад
		|//	                                                 И ЦенаВРознице > 0
		|) КАК ОстаткиТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
		|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
		|ПО
		|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
		|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
		+?(УчитыватьСерии, "
		|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
		|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
		|
		|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
		|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.ЦенаВРознице";
	Иначе

		Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
			РегОстатки = "ТоварыНаСкладах";
		Иначе
			РегОстатки = "ТоварыВРознице";
		КонецЕсли;
		
		ПостроительОтчета.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
		|	ОстаткиТоваров.Качество,
		|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
		|	ВЫБОР
		|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
		|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
		|			0 
		|		ИНАЧЕ
		|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
		|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
		|	КОНЕЦ                                  КАК Сумма
		|ИЗ
		|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад)
		|КАК ОстаткиТоваров
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
		|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
		|ПО
		|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
		|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
		+?(УчитыватьСерии, "
		|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
		|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
		|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
		|
		|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
		|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.Качество";

	КонецЕсли;

	Запрос = ПостроительОтчета.ПолучитьЗапрос();

	Запрос.УстановитьПараметр("Склад",           Склад);
	Запрос.УстановитьПараметр("ПартионныйСклад", ВремСклад);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("МоментДокумента", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = Товары.Добавить();

		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.КоличествоУчет   = Выборка.Количество;
		СтрокаТабличнойЧасти.Количество       = ?(ТолькоУчетные, 0, СтрокаТабличнойЧасти.КоличествоУчет);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = Выборка.ЕдиницаХранения;
		СтрокаТабличнойЧасти.Коэффициент      = Выборка.КоэффициентЕдиницыХранения;
		СтрокаТабличнойЧасти.СуммаУчет        = Выборка.Сумма;
		СтрокаТабличнойЧасти.Сумма            = ?(ТолькоУчетные, 0, Выборка.Сумма);
		СтрокаТабличнойЧасти.Цена             = ?(СтрокаТабличнойЧасти.КоличествоУчет = 0, 0, СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.КоличествоУчет);

		Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			СтрокаТабличнойЧасти.ЦенаВРознице = Выборка.ЦенаВРознице;
		Иначе
			СтрокаТабличнойЧасти.Качество     = Выборка.Качество;
		КонецЕсли;

		// сумма регл. будет заполнена по данным бух учета 
		//СтрокаТабличнойЧасти.СуммаРегл        = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, ВалютаУпрУчета,
		//																   мВалютаРегламентированногоУчета, КурсУпрУчета, 1, КратностьУпрУчета, 1);

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		Если УчитыватьСерии Тогда
			СтрокаТабличнойЧасти.СерияНоменклатуры = Выборка.СерияНоменклатуры;
		КонецЕсли;

	КонецЦикла;
	
	// рассчитаем сумму по регл. учету
	ПерезаполнитьУчетныеКоличестваРегл(ПостроительОтчета, Истина);
	
КонецПроцедуры // ЗаполнитьПоОстаткамНаСкладе()

// Процедура перезаполняет учетные количества в документе
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Процедура ПерезаполнитьУчетныеКоличестваУпр(ПостроительОтчета, ЗаполнениеПоДаннымРеглУчета = Ложь) Экспорт
	
	Если ЗаполнениеПоДаннымРеглУчета Тогда
		// требуется только заполнение учетных сумм по упр. учету. 	
		// необходимо записать документ
		Если ЭтоНовый() Тогда
			Дата = ТекущаяДата();
		КонецЕсли;
		Записать(РежимЗаписиДокумента.Запись);
	Иначе    
#Если Клиент Тогда
		Если Товары.Количество() > 0 Тогда
			ТекстВопроса = "Перезаполнить учетные количества и суммы?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли; 
		Иначе
			Возврат;
		КонецЕсли;

		// Документ должен быть записан, чтобы этот запрос сработал.
		Если Модифицированность() Тогда
			ТекстВопроса = "Перед заполнением следует записать документ.
			               |Продолжить?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
			Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
#КонецЕсли
	КонецЕсли;

	Если РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ВестиПартионныйУчетПоСкладам Тогда
		ВремСклад = Склад;
	Иначе
		ВремСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	Если Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
		
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
			РегОстатки = "ТоварыНаСкладах";
		Иначе
			РегОстатки = "ТоварыВРознице";
		КонецЕсли;

		ПостроительОтчета.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,"
		+?(ЗаполнениеПоДаннымРеглУчета, "","
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,","") + "
		|	ОстаткиТоваров.Качество,")+"
		|	СУММА(ОстаткиТоваров.КоличествоОстаток)                         КАК Количество,
		|	ВЫБОР
		|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
		|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
		|			0 
		|		ИНАЧЕ
		|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
		|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
		|	КОНЕЦ                                                           КАК Сумма
		|ИЗ
		|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, 
		|	                Номенклатура в (ВЫБРАТЬ Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &Склад)
		|КАК ОстаткиТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
		|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &ПартионныйСклад) КАК ОстаткиПартий
		|ПО
		|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
		|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
		+?(УчитыватьСерии, "
		|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
		|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
		|	И ОстаткиТоваров.Качество = ОстаткиПартий.Качество
		|
		|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
		|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура"
		+?(ЗаполнениеПоДаннымРеглУчета, "",",
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.Качество")+ "
		|";

	Иначе

		ПостроительОтчета.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,"
		+?(ЗаполнениеПоДаннымРеглУчета, "","
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,","") + "
		|	ОстаткиТоваров.ЦенаВРознице,")+"
		|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
		|	ВЫБОР
		|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
		|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
		|			0 
		|		ИНАЧЕ
		|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
		|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
		|	КОНЕЦ                                                           КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВНТТ.Остатки(&МоментДокумента,
		|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &Склад) КАК ОстаткиТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
		|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &ПартионныйСклад) КАК ОстаткиПартий
		|ПО
		|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
		|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
		+?(УчитыватьСерии, "
		|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
		|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
		|
		|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
		|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура"
		+?(ЗаполнениеПоДаннымРеглУчета, "",",
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.ЦенаВРознице")+ "
		|";

	КонецЕсли;

	Запрос = ПостроительОтчета.ПолучитьЗапрос();

	Запрос.УстановитьПараметр("Склад",           Склад);
	Запрос.УстановитьПараметр("ПартионныйСклад", ВремСклад);
	Запрос.УстановитьПараметр("ДокументСсылка",  Ссылка);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("МоментДокумента", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	КонецЕсли;

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

	Для каждого СтрокаТабличнойЧасти ИЗ Товары Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               СтрокаТабличнойЧасти.Номенклатура);
		Если НЕ ЗаполнениеПоДаннымРеглУчета Тогда		
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
			Если УчитыватьСерии Тогда
				СтруктураПоиска.Вставить("СерияНоменклатуры",      СтрокаТабличнойЧасти.СерияНоменклатуры);
			КонецЕсли;
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда	
				СтруктураПоиска.Вставить("ЦенаВРознице", СтрокаТабличнойЧасти.ЦенаВРознице);
			Иначе
				СтруктураПоиска.Вставить("Качество",     СтрокаТабличнойЧасти.Качество);
			КонецЕсли;
		КонецЕсли;
		
		МассивСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);

		Если НЕ ЗаполнениеПоДаннымРеглУчета Тогда
			
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаТабличнойЧасти.КоличествоУчет = 0;
				СтрокаТабличнойЧасти.СуммаУчет      = 0;
				Продолжить;
			КонецЕсли;

			СтрокаТабличнойЧасти.КоличествоУчет = ?(СтрокаТабличнойЧасти.Коэффициент = 0, 0,
			                                      МассивСтрок[0].Количество * МассивСтрок[0].КоэффициентЕдиницыХранения
			                                      / СтрокаТабличнойЧасти.Коэффициент);
			СтрокаТабличнойЧасти.СуммаУчет      = МассивСтрок[0].Сумма;
			СтрокаТабличнойЧасти.Цена           = ?(СтрокаТабличнойЧасти.КоличествоУчет = 0, 0,
			                                      СтрокаТабличнойЧасти.СуммаУчет / СтрокаТабличнойЧасти.КоличествоУчет);
												  
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			// сумма регл не изменяется
			//СтрокаТабличнойЧасти.СуммаРегл      = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, мВалютаУпрУчета, 
			//						мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
									
		Иначе						
			
			// только заполним учетную сумму по упр. учету
			// и пересчитаем СуммуРегл
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаТабличнойЧасти.СуммаУчет = 0;
				СтрокаТабличнойЧасти.Сумма = 0;
				Продолжить;
			КонецЕсли;

			КоличествоУпр	= ?(СтрокаТабличнойЧасти.Коэффициент = 0, 0,
			                                      МассивСтрок[0].Количество * МассивСтрок[0].КоэффициентЕдиницыХранения
												  / СтрокаТабличнойЧасти.Коэффициент);
			
			СуммаУпр 		= МассивСтрок[0].Сумма;												  
			ЦенаУпр         = ?(КоличествоУпр = 0, 0, СуммаУпр / КоличествоУпр);
			
			СтрокаТабличнойЧасти.Цена			= ЦенаУпр;
			СтрокаТабличнойЧасти.СуммаУчет	  	= СтрокаТабличнойЧасти.КоличествоУчет * СтрокаТабличнойЧасти.Цена;
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
		КонецЕсли;							
									
	КонецЦикла;
КонецПроцедуры  // ПерезаполнитьУчетныеКоличества()

// Заполняет документ по остаткам на складе
// 
Процедура ЗаполнитьПоОстаткамНаСкладеРегл(ПостроительОтчета) Экспорт

	ПостроительОтчета.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваров.Счет КАК Счет,
	|	ОстаткиТоваров.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ВЫРАЗИТЬ(ОстаткиТоваров.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ОстаткиТоваров.Субконто1.БланкСтрогогоУчета КАК БланкСтрогогоУчета,
	|	ОстаткиТоваров.Субконто1.УчитываетсяПоНоминальнойСтоимости КАК УчитываетсяПоНоминальнойСтоимости,
	|	ОстаткиТоваров.Субконто1.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Субконто1.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Субконто2 КАК Склад,"
	+ ?(ВестиУчетПоДопРазрезамРегл, "
	|	ОстаткиТоваров.Субконто3 КАК НоменклатурнаяПозиция,", "") + "
	|	ОстаткиТоваров.СуммаОстаток КАК Сумма,
	|	ОстаткиТоваров.КоличествоОстаток КАК Количество,
	|	ХозрасчетныйОстаткиСумма.СуммаОстаток КАК СуммаВсего,
	|	ХозрасчетныйОстаткиСумма.КоличествоОстаток КАК КоличествоВсего
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|											&КонецПериода,
	|											Счет В
	|		    										(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        										Хозрасчетный.Ссылка
	|		    										ИЗ
	|		        										ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		    										ГДЕ
	|		        										Хозрасчетный.ВидыСубконто.ВидСубконто = &ВидСубконто),
	|											&ПорядокСубконто,
	|											Организация В (&Организация)
	|		    								И Субконто2 В (&Склад)) КАК ОстаткиТоваров
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|											&КонецПериода,
	|											Счет В
	|		    										(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        										Хозрасчетный.Ссылка
	|		    										ИЗ
	|		        										ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		    										ГДЕ
	|		        										Хозрасчетный.ВидыСубконто.ВидСубконто = &ВидСубконто),
	|											&ПорядокСубконто,
	|											Организация В (&Организация)) КАК ХозрасчетныйОстаткиСумма
	|		ПО ОстаткиТоваров.Счет = ХозрасчетныйОстаткиСумма.Счет
	|			И ОстаткиТоваров.Субконто1 = ХозрасчетныйОстаткиСумма.Субконто1
	|
	|{ГДЕ ВЫРАЗИТЬ(ОстаткиТоваров.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура, 
	|     ОстаткиТоваров.Субконто1.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТоваров.Счет.Порядок";
	
	Запрос = ПостроительОтчета.ПолучитьЗапрос();

	ПорядокСубконто = Новый Массив();
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Если ВестиУчетПоДопРазрезамРегл Тогда
		ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции);
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад",           Склад);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("КонецПериода", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("ВидСубконто",     ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	
	
	Выборка   = Запрос.Выполнить().Выбрать();

	ЭтоНТТ   = (Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ);
	ВедетсяСуммовойУчет = УправлениеЗапасамиПартионныйУчет.ВедетсяСуммовойУчетПоСкладам(Планысчетов.Хозрасчетный.ТоварыНаСкладе);
	ДатаДока  = Дата;
	ТипЦен    = Склад.ТипЦенРозничнойТорговли;

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ВедетсяСуммовойУчет) И Выборка.КоличествоВсего = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.БланкСтрогогоУчета 
			И (    (Выборка.УчитываетсяПоНоминальнойСтоимости И НЕ Выборка.СчетЗабалансовый)
			   ИЛИ (НЕ Выборка.УчитываетсяПоНоминальнойСтоимости И Выборка.СчетЗабалансовый)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ВедетсяСуммовойУчет) И Выборка.КоличествоВсего <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = Товары.Добавить();

		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		
		Если ВестиУчетПоДопРазрезамРегл Тогда
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.НоменклатурнаяПозиция.ХарактеристикаНоменклатуры;
			Если УчитыватьСерии Тогда
				СтрокаТабличнойЧасти.СерияНоменклатуры = Выборка.НоменклатурнаяПозиция.СерияНоменклатуры;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Количество       = Выборка.Количество;
		СтрокаТабличнойЧасти.КоличествоУчет   = СтрокаТабличнойЧасти.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = Выборка.ЕдиницаХранения;
		СтрокаТабличнойЧасти.Коэффициент      = Выборка.КоэффициентЕдиницыХранения;
		
		Если ВедетсяСуммовойУчет Тогда
			СтрокаТабличнойЧасти.СуммаРегл = Выборка.Сумма;
		Иначе
			СтрокаТабличнойЧасти.СуммаРегл = Выборка.СуммаВсего;
		КонецЕсли;

		Если СтрокаТабличнойЧасти.КоличествоУчет <> 0 Тогда										 
			
			СтрокаТабличнойЧасти.ЦенаРегл = СтрокаТабличнойЧасти.СуммаРегл / СтрокаТабличнойЧасти.КоличествоУчет;											 
			
		Иначе
			
			СтрокаТабличнойЧасти.ЦенаРегл = СтрокаТабличнойЧасти.СуммаРегл;
			
		КонецЕсли;
		
		Если ЭтоНТТ Тогда

			СтрокаТабличнойЧасти.ЦенаВРознице = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, ,
			                                    						ТипЦен, ДатаДока, Выборка.ЕдиницаХранения, мВалютаРегламентированногоУчета, 1, 1);
        Иначе
			
			СтрокаТабличнойЧасти.Качество     = Справочники.Качество.Новый;

		КонецЕсли;

	КонецЦикла;
	
	// теперь заполним упр. сумму
	ПерезаполнитьУчетныеКоличестваУпр(ПостроительОтчета, Истина)
	
КонецПроцедуры // ЗаполнитьПоОстаткамНаСкладе()

// Процедура перезаполняет учетные количества в документе
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Процедура ПерезаполнитьУчетныеКоличестваРегл(ПостроительОтчета, ЗаполнениеПоДаннымУпрУчета = Ложь) Экспорт

	Если ЗаполнениеПоДаннымУпрУчета Тогда
		// требуется только заполнение учетных сумм по регл. учету. 	
		// необходимо записать документ
		Если ЭтоНовый() Тогда
			Дата = ТекущаяДата();
		КонецЕсли;
		Записать(РежимЗаписиДокумента.Запись);	
	Иначе	
# Если Клиент Тогда

		Если Товары.Количество() > 0 Тогда
			ТекстВопроса = "Перезаполнить учетные количества и суммы?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли; 
		Иначе
			Возврат;
		КонецЕсли;

		// Документ должен быть записан, чтобы этот запрос сработал.
		Если Модифицированность() Тогда

			ТекстВопроса = "Перед заполнением следует записать документ."
"Продолжить?";

			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);

			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;

			Записать(РежимЗаписиДокумента.Запись);

		КонецЕсли;

#КонецЕсли
     КонецЕсли;
	
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Счет              КАК Счет,
	|	ОстаткиТоваров.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ВЫРАЗИТЬ(ОстаткиТоваров.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ОстаткиТоваров.Субконто1.БланкСтрогогоУчета КАК БланкСтрогогоУчета,
	|	ОстаткиТоваров.Субконто1.УчитываетсяПоНоминальнойСтоимости КАК УчитываетсяПоНоминальнойСтоимости,
	|	ОстаткиТоваров.Субконто1.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Субконто1.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Субконто2         КАК Склад,"
	+ ?(ВестиУчетПоДопРазрезамРегл, "
	|	ЕстьNULL(ОстаткиТоваров.Субконто3.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕстьNULL(ОстаткиТоваров.Субконто3.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.СуммаОстаток      КАК Сумма,
	|	ОстаткиТоваров.КоличествоОстаток КАК Количество,
	|	ХозрасчетныйОстаткиСумма.СуммаОстаток КАК СуммаВсего,
	|	ХозрасчетныйОстаткиСумма.КоличествоОстаток КАК КоличествоВсего
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода,
	|											Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|														Хозрасчетный.Ссылка
	|													ИЗ
	|														ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|													ГДЕ
	|														Хозрасчетный.ВидыСубконто.ВидСубконто = &ВидСубконто ),
	|											&ПорядокСубконто,
	|											Организация В (&Организация) И Субконто2 В (&Склад) И
	|											Субконто1 В (ВЫБРАТЬ
	|															Номенклатура 
	|														ИЗ 
	|															Документ.ИнвентаризацияТоваровНаСкладе.Товары
	|														ГДЕ 
	|															Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
	|											) КАК ОстаткиТоваров
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|											&КонецПериода,
	|											Счет В
	|		    										(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        										Хозрасчетный.Ссылка
	|		    										ИЗ
	|		        										ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		    										ГДЕ
	|		        										Хозрасчетный.ВидыСубконто.ВидСубконто = &ВидСубконто),
	|											&ПорядокСубконто,
	|											Организация В (&Организация) И
	|											Субконто1 В (ВЫБРАТЬ
	|															Номенклатура 
	|														ИЗ 
	|															Документ.ИнвентаризацияТоваровНаСкладе.Товары
	|														ГДЕ 
	|															Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
	|											) КАК ХозрасчетныйОстаткиСумма
	|		ПО ОстаткиТоваров.Счет = ХозрасчетныйОстаткиСумма.Счет
	|		 И ОстаткиТоваров.Субконто1 = ХозрасчетныйОстаткиСумма.Субконто1
	|
	|{ГДЕ ВЫРАЗИТЬ(ОстаткиТоваров.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура, 
	|     ОстаткиТоваров.Субконто1.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТоваров.Счет.Порядок";
	
	ПостроительОтчета.Отбор.Добавить("Номенклатура");
	
	Запрос = ПостроительОтчета.ПолучитьЗапрос();
	
	ПорядокСубконто = Новый Массив();
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Если ВестиУчетПоДопРазрезамРегл Тогда
		ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции);
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад",           Склад);
	Запрос.УстановитьПараметр("КонецПериода",    Дата);
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("ВидСубконто",     ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	Запрос.УстановитьПараметр("ДокументСсылка",  Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ЭтоНТТ  = (Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ);
	ВедетсяСуммовойУчет = УправлениеЗапасамиПартионныйУчет.ВедетсяСуммовойУчетПоСкладам(Планысчетов.Хозрасчетный.ТоварыНаСкладе);

	Для каждого СтрокаТабличнойЧасти ИЗ Товары Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		Если ВестиУчетПоДопРазрезамРегл Тогда
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
			Если УчитыватьСерии Тогда
				СтруктураПоиска.Вставить("СерияНоменклатуры", СтрокаТабличнойЧасти.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;

		Выборка.Сбросить();
		
		СтрокаТабличнойЧасти.ЦенаРегл = 0;
		СтрокаТабличнойЧасти.СуммаРегл = 0;
		
		СтрокаНайдена = Ложь;
		
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			Если Выборка.БланкСтрогогоУчета 
				И (    (Выборка.УчитываетсяПоНоминальнойСтоимости И НЕ Выборка.СчетЗабалансовый)
				   ИЛИ (НЕ Выборка.УчитываетсяПоНоминальнойСтоимости И Выборка.СчетЗабалансовый)) Тогда
				   Продолжить;
			Иначе
				СтрокаНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаНайдена = Ложь Тогда
		    Продолжить;
		КонецЕсли;
		
		Если (НЕ ВедетсяСуммовойУчет) И Выборка.КоличествоВсего = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗаполнениеПоДаннымУпрУчета Тогда		
			
			СтрокаТабличнойЧасти.КоличествоУчет = ?(СтрокаТабличнойЧасти.Коэффициент = 0, 0,
			                                      Выборка.Количество * Выборка.КоэффициентЕдиницыХранения / СтрокаТабличнойЧасти.Коэффициент);
														  
			// упр. цену не меняем, просто пересчитываем упр. сумму.									  
			СтрокаТабличнойЧасти.СуммаУчет = СтрокаТабличнойЧасти.КоличествоУчет * СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.Сумма	   = СтрокаТабличнойЧасти.Количество 	 * СтрокаТабличнойЧасти.Цена;
												  
			СуммаРегл = Выборка.Сумма;
			СтрокаТабличнойЧасти.ЦенаРегл = ?(СтрокаТабличнойЧасти.КоличествоУчет = 0, 0, СуммаРегл / СтрокаТабличнойЧасти.КоличествоУчет);
			
			СтрокаТабличнойЧасти.СуммаРегл      = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРегл;
			
		Иначе
			
			// только заполним сумму регл. учета
			
			КоличествоРегл = ?(СтрокаТабличнойЧасти.Коэффициент = 0, 0,
			                                      Выборка.Количество * Выборка.КоэффициентЕдиницыХранения / СтрокаТабличнойЧасти.Коэффициент);
			СуммаРегл = Выборка.Сумма;
			СтрокаТабличнойЧасти.ЦенаРегл = ?(КоличествоРегл = 0, 0, СуммаРегл / КоличествоРегл);
			
			СтрокаТабличнойЧасти.СуммаРегл      =  СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРегл;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПерезаполнитьУчетныеКоличества()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);

	ОбработкаТабличныхЧастей.ЗаполнитьКачествоПоУмолчанию(Товары, Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ);
	
	Если НЕ Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
		
			СтрокаТЧ.ЦенаВРознице = 0;
		
		КонецЦикла; 
	
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУпрУчета                 = глЗначениеПеременной("ВалютаУправленческогоУчета");
СтруктураКурса                  = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаУпрУчета, Дата);
мКурсУпрУчета                   = СтруктураКурса.Курс;
мКратностьУпрУчета              = СтруктураКурса.Кратность;

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
