 
// Проверяет правильность заполнения реквизитов вида расчета 
// для некуоторых случаев выдает сообщение об бошибке
// для некоторых - возвращает текст сообщения
// 	Параметры:
//		ВидРасчета - объект Вид расчета
//		Отказ - признак отказа (проверка не прошла)
//	Возвращаемое значение:
//		ТекстСообщения - текст сообщения о результате проверки
Функция ПроверитьНастройкуВидаРасчетаВзносы(ВидРасчета, Отказ) Экспорт

	МетаданныеВидаРасчета = ВидРасчета.Метаданные();
	
	Если НЕ ЗначениеЗаполнено(ВидРасчета.Наименование) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Необходимо задать имя расчета!", Отказ);
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(ВидРасчета.Код) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Необходимо задать код расчета!", Отказ);
	КонецЕсли; 
	

	Если Отказ Тогда
	    Возврат "";
	КонецЕсли; 
	
КонецФункции
