
//&НаСервере
//Функция ПолучитьПараметрыДляФормы(Контрагент)
//	Новый Структура("Контрагент", Контрагент);
//КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда
		Для Каждого ТекЭл Из Список.Отбор.Элементы Цикл
			Если ТекЭл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент") и ТекЭл.Использование И ТекЭл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
				////ПараметрыДляФормы = ПолучитьПараметрыДляФормы();
				Ф = ПолучитьФорму("Справочник.ЛМ_Контрагенты.Форма.ФормаЭлемента", Новый Структура("Контрагент",ТекЭл.ПравоеЗначение));
				Ф.Открыть();
				Отказ = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
