
Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 
	
	ТипЦены                   = Константы.ТипЦенПром                          .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс                    .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиПром                 .Получить();
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	

	ИсключитьГруппыНоменклатр = Новый Массив;	
	//ИсключитьГруппыНоменклатр = Справочники.Номенклатура.ПолучитьГруппыСкладов("000000047");	
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,,ИсключитьГруппыНоменклатр);
	Остатки = ОстаткиКВыгрузке.Остатки;
	Комплектующие = ОстаткиКВыгрузке.Комплектующие;	
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");
	Если СтрДлина(Врем)= 7 Тогда
		Врем  = Лев(Врем,4);
	Иначе
		Врем  = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 
	|<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+"""> 
	|<shop>
	|<name>Cvetkov</name>
	|<url>https://www.cvetkovtm.com/</url>
	|<currencies>
	|<currency id=""UAH"" rate=""1""/>
	|</currencies>");
	
	 // Категории
    ВыборкаКатегорий = Справочники.КатегорииРозетка.Выбрать();
	ТД.ЗаписатьСтроку("<categories>");
	Пока ВыборкаКатегорий.Следующий() Цикл
		Категория = ВыборкаКатегорий.Пром;
		Если Категория.ПометкаУдаления ИЛИ Категория.Наименование = "нет" Тогда Продолжить; КонецЕсли;
		
		Код = ОбщегоНазначения.УбратьНоликиСлева(Категория.Код);	
		ТД.ЗаписатьСтроку("<category id="""+Код+""">"+Категория.Наименование+"</category>");
		
	КонецЦикла;
	ТД.ЗаписатьСтроку("</categories>");
	
	ТД.ЗаписатьСтроку("<offers>");
	
	Контрагент =  Справочники.Контрагенты.НайтиПоКоду("000011035");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000010895");
	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияРозетка", ПроверятьРазбитиеРостовок, ВариантВыгрузки,,,,Контрагент,Договор);	
	
	Для Каждого Стр из ТаблицаХарактеристик Цикл 		
		ЗаписатьНоменклатуру(Стр, ТД);
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>
	|</shop>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, ТД)
	
	// Из Строки 
	Цена                 = Стр.Цена;	
	СпрГруппыЦветов	     = Стр.ГруппаЦвета;
	Номенклатура         = Стр.Номенклатура;	
	Характеристика       = Стр.Характеристика;
	Ид                   = Стр.ИД;
	ИдГуппы              = Стр.ИдГуппы;
	Доступна             = Стр.Доступна;
	ШтрихКод             = Стр.ШтрихКод;
	Скидка               = Стр.Скидка;
	Ростовка             = Стр.Ростовка;		
	ОстатокРозница       = Стр.Остаток;	
	Предзаказ            = Стр.Предзаказ;
	Наценка = Стр.Наценка;		
	ПерваяЦена           = стр.ПерваяЦена;



	
	// Доп информация
	ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
	НоменклатураОбъект   = Номенклатура.ПолучитьОбъект();	
	
	РусскийЯзык = Истина; Переводить = Ложь;

	
	//ОстатокОпт      = ХарактеристикаОбъект.СвободныйОстаток(МассивСкладаОпт);
	СкладРозы       = Справочники.Склады.НайтиПоКоду("");
	Доступна        = (Доступна Или Предзаказ); 
	available       = ?(Доступна,"true","false");	

	
	РознНаличие 	= ?(Доступна,?(ХарактеристикаОбъект.Остаток(СкладРозы)>0,"true","false"),"false");
	//ОптНаличие      = ?(Доступна,?(ХарактеристикаОбъект.СвободныйОстаток(СкладРозы)>0,"true","false"),"");
	
	ЦветРус         = ХарактеристикаОбъект.ЦветХарактеристики(РусскийЯзык, Переводить);
	ЦветУкр         = ХарактеристикаОбъект.ЦветХарактеристики(НЕ РусскийЯзык, Переводить); 
	Категория       = Номенклатура.КатегорияРозетка.Пром;
	
	Название        = НоменклатураОбъект.Наименование(Истина);
	ЦенаСтрока      = формат(Цена,"ЧГ=");
	
	ТипИзделия = НоменклатураОбъект.ПолучитьТипИзделия(Истина);	
	
	////////////////////////////////////////////////////////////////////////////////
	ТД.ЗаписатьСтроку("<offer id="""+Ид+""" available="""+available+""" in_stock="""+РознНаличие+""" type=""vendor.model"" selling_type=""r"" group_id= """+ИдГуппы+""">");	

		
	ТД.ЗаписатьСтроку("<typePrefix>"+ ТипИзделия +"</typePrefix>");
	//ТД.ЗаписатьСтроку("<categoryId>null</categoryId>");
	//ТД.ЗаписатьСтроку("<portal_category_url>"+ Категория.Код +"</portal_category_url>");
		
	ТД.ЗаписатьСтроку("<categoryId>"+ Категория.Код +"</categoryId>");
	ТД.ЗаписатьСтроку("<portal_category_id>"+ Категория.Код +"</portal_category_id>");
	
	
	// Скидка и цена
	Если Скидка>0 Или Наценка < 70 Тогда
		ТД.ЗаписатьСтроку("<oldprice>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</oldprice>");
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</price>");
	Иначе
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");
	КонецЕсли;
	//ТД.ЗаписатьСтроку("<discount>"+ + "</discount>");
	
	ТД.ЗаписатьСтроку("<quantity_in_stock>" + ОстатокРозница + "</quantity_in_stock>");
	ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
	
	//фото
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов, Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			Если Фот.НеВыгружать ИЛИ Фот.НеВыгружатьРозница Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяФото = Фот.Наименование;
			
			ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
			
		КонецЦикла;
		
	КонецЕсли;

	ТД.ЗаписатьСтроку("<vendor>Cvetkov</vendor>");
	 
	ТД.ЗаписатьСтроку("<model>" + Название + " "+ ЦветРус +"</model>");
	ТД.ЗаписатьСтроку("<vendorCode>"+ ШтрихКод +"</vendorCode>");
	
	//Где_находится_товар
	ТД.ЗаписатьСтроку("<regions>");
		ТД.ЗаписатьСтроку("<region>Харків</region>");
		ТД.ЗаписатьСтроку("<region>194020000</region>");
	ТД.ЗаписатьСтроку("</regions>");	
	
	/// Рус Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Истина);	
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>","-");
	ТД.ЗаписатьСтроку("<description>"+Описание+"</description>");
	
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Ложь);
	Если ОписаниеМодели <> "" Тогда
		Описание = "<![CDATA["+ОписаниеМодели+"]]>";
		ТД.ЗаписатьСтроку("<description_ua>"+Описание+"</description_ua>");
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<country>Украина</country>");
	
	//Параметры
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Пром");
	Категория = Номенклатура.КатегорияРозетка.Пром;
	ИсключениеСвойств = Неопределено;
	Свойтва = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Категория, Характеристика,"name","paramid","valueid",ИсключениеСвойств);
    ТД.ЗаписатьСтроку(Свойтва);

	//<attribute id="12971" nameRU="Состав" type="free" nameUK="Склад"/>
	//<attribute id="9681" nameRU="Подкладка" type="bool" nameUK="Підкладка"/>
	//<attribute id="8608" nameRU="Съемная подкладка" type="bool" nameUK="Знімна підкладка"/>
	//<attribute id="8607" nameRU="Пропитка швов" type="bool" nameUK="Просочення швів"/>	

	
		
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры

