
&НаКлиенте
Процедура ЗаполнитьВидыОбратнойДоставки(Команда)
	ЗаполнитьВидыОбратнойДоставкиСервер()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОбратнойДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуВидовОбратнойДоставки();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаСервере
Процедура СохранитьВидыОбратнойДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьВидыОбратнойДоставки() Тогда
		Сообщить("Не заполнена таблица видов обратной доставки");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВидыОбратнойДоставки(Команда)
	СохранитьВидыОбратнойДоставкиСервер()
КонецПроцедуры

&НаСервере
Процедура СохранитьКлюч()
	Константы.ЛМ_КлючAPI.Установить(Объект.КлючAPI);
КонецПроцедуры	

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.КлючAPI) Тогда
		Если Вопрос("Ключ API был изменен. Сохранить новое значение?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СохранитьКлюч();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьКлюч()
	Объект.КлючAPI = Константы.ЛМ_КлючAPI.Получить();
КонецПроцедуры	

&НаСервере
Процедура ВосстановитьЯзык()
	ЯзыкИнтерфейсаОбмена = Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Получить();
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВосстановитьКлюч();
	ВосстановитьЯзык();
	ВосстановитьСохраненныеЗначенияСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыГрузовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуВидовГруза();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВидыГрузов(Команда)
	ЗаполнитьВидыГрузовСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьВидыГрузовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьВидыГрузов() Тогда
		Сообщить("Не заполнена таблица видов грузов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВидыГрузов(Команда)
	СохранитьВидыГрузовСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписанияГрузовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуОписанийГруза();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьОписанияГрузов(Команда)
	ЗаполнитьОписанияГрузовСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьОписанияГрузовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьОписанияГрузов() Тогда
		Сообщить("Не заполнена таблица описания грузов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьОписанияГрузов(Команда)
	СохранитьОписанияГрузовСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыДокументовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуСтатусовДокументов();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСтатусыДокументов(Команда)
	ЗаполнитьСтатусыДокументовСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьСтатусыДокументовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьСтатусыДокументов() Тогда
		Сообщить("Не заполнена таблица статусов документов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьСтатусыДокументов(Команда)
	СохранитьСтатусыДокументовСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормыСобственностиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуФормСобственности();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьФормыСобственности(Команда)
	ЗаполнитьФормыСобственностиСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьФормыСобственностиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьФормыСобственности() Тогда
		Сообщить("Не заполнена таблица форм собственности");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьФормыСобственности(Команда)
	СохранитьФормыСобственностиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоддоныСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуПоддонов();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПоддоны(Команда)
	ЗаполнитьПоддоныСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьПоддоныСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьПоддоны() Тогда
		Сообщить("Не заполнена таблица поддонов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьПоддоны(Команда)
	СохранитьПоддоныСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормыОплатыСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуФормОплаты();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьФормыОплаты(Команда)
	ЗаполнитьФормыОплатыСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьФормыОплатыСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьФормыОплаты() Тогда
		Сообщить("Не заполнена таблица форм оплаты");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьФормыОплаты(Команда)
	СохранитьФормыОплатыСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТехнологииДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуТехнологийДоставки();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьТехнологииДоставки(Команда)
	ЗаполнитьТехнологииДоставкиСервер();
КонецПроцедуры


&НаСервере
Процедура СохранитьТехнологииДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьТехнологииДоставки() Тогда
		Сообщить("Не заполнена таблица технологий доставки");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьТехнологииДоставки(Команда)
	СохранитьТехнологииДоставкиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШиныИДискиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуШинИДисков();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьШиныИДиски(Команда)
	ЗаполнитьШиныИДискиСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьШиныИДискиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьШиныИДиски() Тогда
		Сообщить("Не заполнена таблица шин и дисков");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьШиныИДиски(Команда)
	СохранитьШиныИДискиСервер()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКонтрагентовОтправителейСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуТиповКонтрагентовОтправителей();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьТипыКонтрагентовОтправителей(Команда)
	ЗаполнитьТипыКонтрагентовОтправителейСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьТипыКонтрагентовОтправителейСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьТипыКонтрагентовОтправителей() Тогда
		Сообщить("Не заполнена таблица типов контрагентов отправителей");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьТипыКонтрагентовОтправителей(Команда)
	СохранитьТипыКонтрагентовОтправителейСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыПлательщиковСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуВидовПлательщиков();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВидыПлательщиков(Команда)
	ЗаполнитьВидыПлательщиковСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьВидыПлательщиковСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьВидыПлательщиков() Тогда
		Сообщить("Не заполнена таблица видов плательщиков");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВидыПлательщиков(Команда)
	СохранитьВидыПлательщиковСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыПлательщиковОбратнойДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуВидовПлательщиковОбратнойДоставки();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВидыПлательщиковОбратнойДоставки(Команда)
	ЗаполнитьВидыПлательщиковОбратнойДоставкиСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьВидыПлательщиковОбратнойДоставкиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьВидыПлательщиковОбратнойДоставки() Тогда
		Сообщить("Не заполнена таблица видов плательщиков обратной доставки");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВидыПлательщиковОбратнойДоставки(Команда)
	СохранитьВидыПлательщиковОбратнойДоставкиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбластиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуОбластей();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьОбласти(Команда)
	ЗаполнитьОбластиСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьОбластиСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьОбласти() Тогда
		Сообщить("Не заполнена таблица областей");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьОбласти(Команда)
	СохранитьОбластиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГородаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуГородов();
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьГорода(Команда)
	ЗаполнитьГородаСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьГородаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьГорода() Тогда
		Сообщить("Не заполнена таблица городов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьГорода(Команда)
	СохранитьГородаСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтделенияСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуОтделений();
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьОтделения(Команда)
	ЗаполнитьОтделенияСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьОтделенияСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьОтделения() Тогда
		Сообщить("Не заполнена таблица отделений");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьОтделения(Команда)
	СохранитьОтделенияСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУлицыСервер()
	Если Не ЗначениеЗаполнено(ГородДляУлиц) тогда
		Сообщить("Не указан город для загрузки улиц");
		Возврат;
	КонецЕсли;	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуУлиц(ГородДляУлиц);
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьУлицы(Команда)
	ЗаполнитьУлицыСервер()
КонецПроцедуры

&НаСервере
Процедура СохранитьУлицыСервер() 
	Если Не ЗначениеЗаполнено(ГородДляУлиц) тогда
		Сообщить("Не указан город для загрузки улиц");
		Возврат;
	КонецЕсли;	
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьУлицы(ГородДляУлиц) Тогда
		Сообщить("Не заполнена таблица улиц");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьУлицы(Команда)
	СохранитьУлицыСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВременныеИнтервалыСервер()
	Если Не ЗначениеЗаполнено(ГородДляВременныхИнтервалов) тогда
		Сообщить("Не указан город для загрузки временных интервалов");
		Возврат;
	КонецЕсли;	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуВременныхИнтервалов(ГородДляВременныхИнтервалов);
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВременныеИнтервалы(Команда)
	ЗаполнитьВременныеИнтервалыСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьВременныеИнтервалыСервер()
   Если Не ЗначениеЗаполнено(ГородДляВременныхИнтервалов) тогда
		Сообщить("Не указан город для загрузки временных интервалов");
		Возврат;
	КонецЕсли;	
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьВременныеИнтервалы(ГородДляВременныхИнтервалов) Тогда
		Сообщить("Не заполнена таблица временных интервалов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВременныеИнтервалы(Команда)
	СохранитьВременныеИнтервалыСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуКонтрагентов();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКонтрагентов(Команда)
	ЗаполнитьКонтрагентовСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьКонтрагентовСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьКонтрагентов() Тогда
		Сообщить("Не заполнена таблица контрагентов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьКонтрагентов(Команда)
	СохранитьКонтрагентовСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактныеЛицаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуКонтактныхЛиц();
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры 	

&НаКлиенте
Процедура ЗаполнитьКонтактныеЛица(Команда)
	ЗаполнитьКонтактныеЛицаСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьКонтактныеЛицаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьКонтактныеЛица() Тогда
		Сообщить("Не заполнена таблица контактных лиц");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьКонтактныеЛица(Команда)
	СохранитьКонтактныеЛицаСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьТаблицуАдресов();
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьАдреса(Команда)
	ЗаполнитьАдресаСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьАдресаСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Если НЕ Об.СохранитьАдреса() Тогда
		Сообщить("Не заполнена таблица адресов");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьАдреса(Команда)
	СохранитьАдресаСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьЯзык()
	Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Установить(ЯзыкИнтерфейсаОбмена);
КонецПроцедуры	

&НаКлиенте
Процедура ЯзыкИнтерфейсаОбменаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЯзыкИнтерфейсаОбмена) Тогда
		Если Вопрос("Язык интерфеса обмена был изменен. Сохранить новое значение?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СохранитьЯзык();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияПоУмолчаниюСервер()
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Отправитель", ОтправительПоУмолчанию);
	СтруктураНастройки.Вставить("КонтактноеЛицоОтправителя", КонтактноеЛицоОтправителяПоУмолчанию);
	СтруктураНастройки.Вставить("СкладОтправителя", СкладОтправителяПоУмолчанию);
	СтруктураНастройки.Вставить("АдресОтправителя", АдресОтправителяПоУмолчанию);
	СтруктураНастройки.Вставить("ТехнологияДоставки", ТехнологияДоставкиПоУмолчанию);
	СтруктураНастройки.Вставить("ТипГруза", ТипГрузаПоУмолчанию);
	СтруктураНастройки.Вставить("ОписаниеГруза", ОписаниеГрузаПоУмолчанию);
	СтруктураНастройки.Вставить("ФормаОплаты", ФормаОплатыПоУмолчанию);
	СтруктураНастройки.Вставить("ПлательщикДоставки", ПлательщикДоставкиПоУмолчанию);
	СтруктураНастройки.Вставить("ВидОбратнойДоставки", ВидОбратнойДоставкиПоУмолчанию);
	СтруктураНастройки.Вставить("ПлательщикОбратнойДоставки", ПлательщикОбратнойДоставкиПоУмолчанию);
	Константы.ЛМ_НастройкиЗаполненияЭкспрессНакладнойПоУмолчанию.Установить(Новый ХранилищеЗначения(СтруктураНастройки));
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьЗначенияПоУмолчанию(Команда)
	СохранитьЗначенияПоУмолчаниюСервер();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеЗначенияСервер()
	СтруктураНастройки = Константы.ЛМ_НастройкиЗаполненияЭкспрессНакладнойПоУмолчанию.Получить().Получить();
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура") Тогда
		Если СтруктураНастройки.Свойство("Отправитель") Тогда
			ОтправительПоУмолчанию = СтруктураНастройки.Отправитель;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("КонтактноеЛицоОтправителя") Тогда
			КонтактноеЛицоОтправителяПоУмолчанию = СтруктураНастройки.КонтактноеЛицоОтправителя;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("СкладОтправителя") Тогда
			СкладОтправителяПоУмолчанию = СтруктураНастройки.СкладОтправителя;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("АдресОтправителя") Тогда
			АдресОтправителяПоУмолчанию = СтруктураНастройки.АдресОтправителя;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ТехнологияДоставки") Тогда
			ТехнологияДоставкиПоУмолчанию = СтруктураНастройки.ТехнологияДоставки;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ТипГруза") Тогда
			ТипГрузаПоУмолчанию = СтруктураНастройки.ТипГруза;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ОписаниеГруза") Тогда
			ОписаниеГрузаПоУмолчанию = СтруктураНастройки.ОписаниеГруза;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ФормаОплаты") Тогда
			ФормаОплатыПоУмолчанию = СтруктураНастройки.ФормаОплаты;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ПлательщикДоставки") Тогда
			ПлательщикДоставкиПоУмолчанию = СтруктураНастройки.ПлательщикДоставки;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ВидОбратнойДоставки") Тогда
			ВидОбратнойДоставкиПоУмолчанию = СтруктураНастройки.ВидОбратнойДоставки;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ПлательщикОбратнойДоставки") Тогда
			ПлательщикОбратнойДоставкиПоУмолчанию = СтруктураНастройки.ПлательщикОбратнойДоставки;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ВосстановитьСохраненныеЗначения(Команда)
	ВосстановитьСохраненныеЗначенияСервер();
КонецПроцедуры

Функция ГородОтправителя()
	Если ЗначениеЗаполнено(ОтправительПоУмолчанию.Город) Тогда
		Возврат ОтправительПоУмолчанию.Город;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции 	

&НаКлиенте
Процедура СкладОтправителяПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ГородОтправителя = ГородОтправителя();
	Если НЕ ГородОтправителя = Неопределено ТОгда
		СтандартнаяОбработка = Ложь;
		Форма_ = ПолучитьФорму("Справочник.ЛМ_Отделения.Форма.ФормаВыбора",,Элемент);
		Эл = Форма_.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Эл.правоеЗначение = ГородОтправителя;
		Эл.Использование = Истина;
		Форма_.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	
	ЗаполнитьВидыОбратнойДоставкиСервер();
	СохранитьВидыОбратнойДоставкиСервер();
	ЗаполнитьОписанияГрузовСервер();
	СохранитьОписанияГрузовСервер();
	ЗаполнитьВидыГрузовСервер();
	СохранитьВидыГрузовСервер();
	ЗаполнитьСтатусыДокументовСервер();
	СохранитьСтатусыДокументовСервер();
	ЗаполнитьФормыСобственностиСервер();
	СохранитьФормыСобственностиСервер();
	ЗаполнитьПоддоныСервер();
	СохранитьПоддоныСервер();
	ЗаполнитьФормыОплатыСервер();
	СохранитьФормыОплатыСервер();
	ЗаполнитьТехнологииДоставкиСервер();
	СохранитьТехнологииДоставкиСервер();
	ЗаполнитьШиныИДискиСервер();
	СохранитьШиныИДискиСервер();
	ЗаполнитьТипыКонтрагентовОтправителейСервер();
	СохранитьТипыКонтрагентовОтправителейСервер();
	ЗаполнитьВидыПлательщиковСервер();
	СохранитьВидыПлательщиковСервер();
	ЗаполнитьВидыПлательщиковОбратнойДоставкиСервер();
	СохранитьВидыПлательщиковОбратнойДоставкиСервер();
	ЗаполнитьГородаСервер();
	СохранитьГородаСервер();
	Сообщить("Выполняется заполнение списка отделений. эта процедура может занять продолжительное время!");
	ЗаполнитьОтделенияСервер();
	СохранитьОтделенияСервер();
	Сообщить("Список отделений заполнен.");
	ЗаполнитьОбластиСервер();
	СохранитьОбластиСервер();
	ЗаполнитьКонтрагентовСервер();
	СохранитьКонтрагентовСервер();
	ЗаполнитьКонтактныеЛицаСервер();
	СохранитьКонтактныеЛицаСервер();
	
КонецПроцедуры







