Перем мУдалятьДвижения;
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

	
Функция КурсККратности(Курс, Валюта) 

	Если ЗначениеЗаполнено(Валюта) Тогда
		Кратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Кратность;
		Если Кратность <> 0 И Кратность <> 1 Тогда
			Возврат Курс / Кратность;
		Иначе
			Возврат Курс;
		КонецЕсли; 
	Иначе
		Возврат Курс;
	КонецЕсли;	

КонецФункции 
 	
Функция ПечатьПокупка()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаПокупкуПродажуВалюты_Покупка";
	
	Макет = ПолучитьМакет("ЗаявкаНаПокупку");
	Обл   = Макет.ПолучитьОбласть("Шапка");
	
    Обл.Параметры.Номер = Номер;
	Обл.Параметры.Дата  = Дата;
	
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	Обл.Параметры.Организация = СведенияОбОрганизации.ПолноеНаименование;
	Обл.Параметры.Адрес = СведенияОбОрганизации.ЮридическийАдрес;
	Обл.Параметры.Телефоны = СведенияОбОрганизации.Телефоны;
	Обл.Параметры.Банк = Банк.НаименованиеПолное + ", " + УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Банк,"Юридический");
	
	Обл.Параметры.Сотрудник = Сотрудник.Наименование;
	
	Обл.Параметры.Основание = Основание;
	
	Обл.Параметры.Комиссионные = Комиссионные;
	
	Обл.Параметры.Валюта = Валюта.НаименованиеПолное + ", " + Строка(Валюта.Код);
	Обл.Параметры.СуммаВалютная = СуммаВалютная;
	Обл.Параметры.Курс = ?(Курс = 0, "за  курсом уповноваженого банку", КурсККратности(Курс, Валюта));
	Обл.Параметры.СуммаГривневая = ?(СуммаГривневая = 0, " ", СуммаГривневая);
	
	Обл.Параметры.СчетБанкаНомер = СчетБанка.НомерСчета;
	Обл.Параметры.СчетБанкаБанк  = СчетБанка.Банк;
	Обл.Параметры.СчетБанкаКод   = СчетБанка.Банк.Код;
	
	Обл.Параметры.СчетВалютныйНомер = СчетВалютный.НомерСчета;
	Обл.Параметры.СчетВалютныйБанк  = СчетВалютный.Банк;
	Обл.Параметры.СчетВалютныйКод   = СчетВалютный.Банк.Код;
	
	Обл.Параметры.СчетВозвратаНомер = СчетВозврата.НомерСчета;
	Обл.Параметры.СчетВозвратаБанк  = СчетВозврата.Банк;
	Обл.Параметры.СчетВозвратаКод   = СчетВозврата.Банк.Код;
	
	Руководители = ОбщегоНазначения.ОтветственныеЛица(Организация, Дата);
	Обл.Параметры.ФИОГлавногоБухгалтера = Руководители.ГлавныйБухгалтер;
	Обл.Параметры.ФИОРуководителя = Руководители.Руководитель;

	ТабДокумент.Вывести(Обл);

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьПродажа()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаПокупкуПродажуВалюты_Продажа";
	
	Макет = ПолучитьМакет("ЗаявкаНаПродажу");
	Обл   = Макет.ПолучитьОбласть("Шапка");
	
    Обл.Параметры.Номер = Номер;
	Обл.Параметры.Дата  = Дата;
	
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	Обл.Параметры.Организация = СведенияОбОрганизации.ПолноеНаименование;
	Обл.Параметры.Адрес = СведенияОбОрганизации.ЮридическийАдрес;
	Обл.Параметры.Телефоны = СведенияОбОрганизации.Телефоны;
	Обл.Параметры.Банк = Банк.НаименованиеПолное + ", " + УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Банк,"Юридический");
	
	Обл.Параметры.Сотрудник = Сотрудник.Наименование;
	
	Обл.Параметры.Комиссионные = Комиссионные;
	
	Обл.Параметры.Валюта = Валюта.НаименованиеПолное + ", " + Строка(Валюта.Код);
	Обл.Параметры.СуммаВалютная = СуммаВалютная;
	Обл.Параметры.Курс = ?(Курс = 0, "за  курсом уповноваженого банку", КурсККратности(Курс, Валюта));
	Обл.Параметры.СуммаГривневая = ?(СуммаГривневая = 0, " ", СуммаГривневая);
	
	Обл.Параметры.СчетБанкаНомер = СчетБанка.НомерСчета;
	Обл.Параметры.СчетБанкаБанк  = СчетБанка.Банк;
	Обл.Параметры.СчетБанкаКод   = СчетБанка.Банк.Код;
	
	Обл.Параметры.СчетВалютныйНомер = СчетВалютный.НомерСчета;
	Обл.Параметры.СчетВалютныйБанк  = СчетВалютный.Банк;
	Обл.Параметры.СчетВалютныйКод   = СчетВалютный.Банк.Код;
	
	Обл.Параметры.СчетГривневыйНомер = СчетГривневый.НомерСчета;
	Обл.Параметры.СчетГривневыйБанк  = СчетГривневый.Банк;
	Обл.Параметры.СчетГривневыйКод   = СчетГривневый.Банк.Код;
	
	Обл.Параметры.СчетВозвратаНомер = СчетВозврата.НомерСчета;
	Обл.Параметры.СчетВозвратаБанк  = СчетВозврата.Банк;
	Обл.Параметры.СчетВозвратаКод   = СчетВозврата.Банк.Код;
	
	Руководители = ОбщегоНазначения.ОтветственныеЛица(Организация, Дата);
	Обл.Параметры.ФИОГлавногоБухгалтера = Руководители.ГлавныйБухгалтер;
	Обл.Параметры.ФИОРуководителя = Руководители.Руководитель;

	ТабДокумент.Вывести(Обл);

	Возврат ТабДокумент;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если ИмяМакета = "Покупка" Тогда
		ТабДокумент = ПечатьПокупка();
	ИначеЕсли ИмяМакета = "Продажа" Тогда
		ТабДокумент = ПечатьПродажа();
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), Ссылка);
	
КонецПроцедуры //Печать()	

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
		Возврат Новый Структура("Покупка","Заявка на покупку валюты");
	Иначе
		Возврат Новый Структура("Продажа","Заявка на продажу валюты");
	КонецЕсли

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция СтруктураОбязательныхПолейШапки()

	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация","Не указана организация!");
	СтруктураПолей.Вставить("СчетГривневый","Не указан гривневый счет организации!");
	СтруктураПолей.Вставить("СчетВалютный","Не указан валютный счет организации!");
	СтруктураПолей.Вставить("СчетВозврата","Не указан счет организации для возврата денежных средств!");
	
	СтруктураПолей.Вставить("Банк","Не указан уполномоченный банк!");
	СтруктураПолей.Вставить("СчетБанка","Не указан счет уполномоченного банка!");
	
	СтруктураПолей.Вставить("Валюта","Не указана валюта документа!");
	СтруктураПолей.Вставить("СуммаВалютная","Не указана валютная сумма!");
	
	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейШапки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолейШапки(), Отказ, Заголовок);
    	
	// Движения по документу
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
