Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнительныйЛист.Дата,
	               |	ИсполнительныйЛист.Организация,
	               |	ИсполнительныйЛист.Сотрудник,
	               |	ИсполнительныйЛист.ДатаДействия,
	               |	ИсполнительныйЛист.ДатаОкончания,
	               |	ИсполнительныйЛист.Размер,
	               |	ИсполнительныйЛист.Предел,	               
	               |	ИсполнительныйЛист.СпособРасчетаИЛ,
	               |	ИсполнительныйЛист.Получатель,
	               |	ИсполнительныйЛист.ВидИсполнительногоДокумента,
	               |	ИсполнительныйЛист.Ссылка
	               |ИЗ
	               |	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
	               |
	               |ГДЕ
	               |	ИсполнительныйЛист.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указан работник!", Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаДействия) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана дата действия удержания!", Отказ);
	КонецЕсли;
	
	// Получатель
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Получатель) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указан получатель!", Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента)

	// Движения регистра ПлановыеУдержанияРаботниковОрганизаций
	
	// Определим вид расчета
	Если ВыборкаПоШапкеДокумента.ВидИсполнительногоДокумента = "Исполнительный лист"
		И ВыборкаПоШапкеДокумента.СпособРасчетаИЛ = 1 Тогда
		// Процентом
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.Удержания.ИЛПроцентом;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.Удержания.ИЛПроцентомДоПредела;
		КонецЕсли; 
		
	ИначеЕсли ВыборкаПоШапкеДокумента.ВидИсполнительногоДокумента = "Исполнительный лист" Тогда
		// Фикс суммой	
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.Удержания.ИЛФиксированнойСуммой;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.Удержания.ИЛФиксированнойСуммойДоПредела;
		КонецЕсли; 
		
	ИначеЕсли ВыборкаПоШапкеДокумента.СпособРасчетаИЛ = 1 Тогда
		// Алименты Процентом
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.Удержания.АлиментыПроцентом;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.Удержания.АлиментыПроцентомДоПредела;
		КонецЕсли; 
		
	Иначе
		// АлиментыФикс суммой	
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммой;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммойДоПредела;
		КонецЕсли; 
		
	КонецЕсли;  
	
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	// свойства
	Движение.Период             = ВыборкаПоШапкеДокумента.ДатаДействия;

	// измерения
	Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник		= ВыборкаПоШапкеДокумента.Сотрудник;
	Движение.ВидРасчета		= ВидРасчета;
	
	Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;

	// ресурсы
	Движение.Актуальность = Истина;
	Движение.Действие 					= Перечисления.ВидыДействияСНачислением.Начать;
	Движение.Показатель1				= ВыборкаПоШапкеДокумента.Размер;
	Движение.СпособОтраженияВБухучете	= ВидРасчета.СпособОтраженияВБухучете;
	Движение.СпособОтраженияВУпрУчете	= ВидРасчета.СпособОтраженияВУпрУчете;
	
	// Если у документа указана дата окончания его действия, то закроем датой окончания это удержание
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		// свойства
		Движение.Период             = КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);

		// измерения
		Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник		= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ВидРасчета		= ВидРасчета;
		
		Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;

		// ресурсы
		Движение.Актуальность	= Ложь;
		Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить;
	КонецЕсли;
	
	Если (СпособПеречисления=Перечисления.СпособыПеречисленияСуммПоИсполнительнымЛистам.ПочтовымПереводом) И (ТарифПочты<>Неопределено) Тогда
		
		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		// свойства
		Движение.Период             = ВыборкаПоШапкеДокумента.ДатаДействия;
		
		// измерения
		Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник			= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ВидРасчета         = ПланыВидовРасчета.Удержания.ПочтовыйСбор;
		
		Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
		Движение.СпособОтраженияВБухучете	= Движение.ВидРасчета.СпособОтраженияВБухучете;
		Движение.СпособОтраженияВУпрУчете	= Движение.ВидРасчета.СпособОтраженияВУпрУчете;
		
		
		// ресурсы
		Движение.Актуальность = Истина;
		Движение.Действие 					= Перечисления.ВидыДействияСНачислением.Начать;
		
		// Если у документа указана дата окончания его действия, то закроем и "почтовые тарифы"
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			// свойства
			Движение.Период             = КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);;
			
			// измерения
			Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
			Движение.Сотрудник			= ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ВидРасчета         = ПланыВидовРасчета.Удержания.ПочтовыйСбор;
			
			Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
			
			// ресурсы
			Движение.Актуальность	= Ложь;
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента);
			КонецЕсли;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицо(ЭтотОбъект);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
