// Переменные в которые помещаются параметры учетной политики
Перем мУчетнаяПолитикаБух;
Перем мУчетнаяПолитикаНал Экспорт;

Перем мПорядокСписанияПартий; // (Общ)

Перем ДвиженияВыпускПродукцииУслугБУ;
Перем ТаблицаДвиженийВыпускБУ;

Перем ТаблицаДвиженийПартииТоваровНаСкладахНУ;

Перем Заголовок;
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мВалютаУправленческогоУчета Экспорт;

Перем ПартионныйУчетБУ;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;


Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

Перем мУдалятьДвижения;

Перем мСтруктураПараметровВзаиморасчетов Экспорт;

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует печатную форму документа
//
Функция ПечатьНакладная()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Ответственный.ФизЛицо.Наименование КАК Получил,
	|	Организация,
	|	Организация КАК Поставщик,
	|	ПодразделениеОрганизации КАК Подразделение
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
	|
	|ГДЕ
	|	ПоступлениеИзПереработки.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК Товар,
	|	СерияНоменклатуры КАК Серия,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	Номенклатура.Код КАК Код,
	|	Количество,
	|	ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|   НомерСтроки
	|ИЗ 
	|	(ВЫБРАТЬ
	|		Номенклатура         КАК Номенклатура,
	|		ХарактеристикаНоменклатуры         КАК ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры    КАК СерияНоменклатуры,
	|		ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|		СУММА(Количество)    КАК Количество,
	|		МИНИМУМ(НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		Документ.ПоступлениеИзПереработки.Продукция КАК ПоступлениеИзПереработки
	|
	|	ГДЕ
	|		ПоступлениеИзПереработки.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры
	|	) КАК ВложенныйЗапросПоТоварам
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеИзПереработки_Накладная";
	
	// Вывод заголовка
	Макет = ПолучитьМакет("Накладная");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Приходная накладная (из переработки)';uk='Прибуткова накладна (з переробки)'",КодЯзыкаПечать),КодЯзыкаПечать);

	ТабДокумент.Вывести(ОбластьМакета);

	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);	
	ОбластьМакета.Параметры.РеквизитыПоставщика =     ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,",,КодЯзыкаПечать);
    ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим дополнительно информацию о договоре и сделке
	СписокДополнительныхПараметров = "Подразделение,";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	// Вывести табличную часть
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	// Вывести Итого
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьТребованиеНакладная()

// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Накладная" Тогда
			ТабДокумент = ПечатьНакладная();
			
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		
	КонецПроцедуры // Печать
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Накладная", "Приходная накладная");
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента)
	
	Если ЗаполнятьБУ = Истина Тогда

		Если ИмяТабЧасти = "Продукция" Тогда
			СтрокаТЧ.Счет  = СчетаУчета.СчетУчетаБУ;

		ИначеЕсли ИмяТабЧасти = "ВозвратнаяТара" Тогда
			СтрокаТЧ.СчетУчетаБУ  = СчетаУчета.СчетУчетаБУ;

		ИначеЕсли ИмяТабЧасти = "Услуги" Тогда
			
		ИначеЕсли ИмяТабЧасти = "ИспользованныеМатериалы" Тогда
			СтрокаТЧ.СчетУчетаБУ  = СчетаУчета.СчетПередачиБУ;
		ИначеЕсли ИмяТабЧасти = "ВозвращенныеМатериалы" Тогда
			СтрокаТЧ.СчетУчетаБУ  = СчетаУчета.СчетПередачиБУ; 
			СтрокаТЧ.СчетПередачиБУ  = СчетаУчета.СчетУчетаБУ;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначение;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаБУ", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Счет", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетПередачиБУ", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетПередачиБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли; 
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли; // Если ЗаполнятьБУ = Истина Тогда	
	
КонецПроцедуры // ЗаполнитьСчетаБУ()

// Заполняет счета БУ и НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Если ТипЗнч(СкладОрдер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Склад = СкладОрдер.Склад;
	Иначе	
		Склад = СкладОрдер;
	КонецЕсли;

	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);
	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	
	ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части документа
//
Процедура ЗаполнитьСчетаУчетаВТабличнойЧастиРегл(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

Процедура ОбновитьПараметрыУчетнойПолитики() Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;	
	мУчетнаяПолитикаБух = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), УчетнаяПолитикаНеЗадана, Организация, "Бух");
	
	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНал = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), УчетнаяПолитикаНеЗадана, Организация, "Нал");

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок) Экспорт

	мУчетнаяПолитика   = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ);
	ТабУчетнаяПолитика = УправлениеЗапасамиПартионныйУчет.ПолучитьУчетнуюПолитику(Дата);
	
	мПорядокСписанияПартий = Новый Структура("Упр,Бух,Нал");
	
	Если ОтражатьВУправленческомУчете Тогда
		ПодготовитьПараметрыУчетнойПолитикиУпр(ТабУчетнаяПолитика, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Процедура определяет параметры упр. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиУпр(ТабУчетнаяПолитика, Отказ, Заголовок)

	// Получим метод списания партий FIFO / LIFO / По средней
	СтрокаУчетнойПолитики = ТабУчетнаяПолитика[0];
	мПорядокСписанияПартий.Вставить("Упр", СтрокаУчетнойПолитики.СпособОценкиМПЗУпр);

КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиУпр()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, СкладОрдер, ВидПоступления, НоменклатурнаяГруппа,
												  |ВалютаДокумента, КурсВзаиморасчетов, КратностьВзаиморасчетов,
	                             				  |Контрагент, ДоговорКонтрагента");
												  
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		СтруктураОбязательныхПолей.Вставить( "Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
			|Заполните поле ""Заказ поставщику""!");
	ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		СтруктураОбязательныхПолей.Вставить( "Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
			|Заполните поле ""Счет поставщика""!");
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("Подразделение");
	КонецЕсли;	
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("ПодразделениеОрганизации");	
		СтруктураОбязательныхПолей.Вставить("СчетЗатрат");
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
			
		Если ВозвратнаяТара.Количество() > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре");
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.УчитыватьНДС Тогда
			Если СтруктураШапкиДокумента.ЕстьНДС И СтруктураШапкиДокумента.УчитыватьНДС Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
			КонецЕсли;
			Если СтруктураШапкиДокумента.СложныйНалоговыйУчет = Ложь Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДСПодтвержденный");
			КонецЕсли;
		КонецЕсли;
	Иначе
	КонецЕсли;
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);
	
	// Если склад указывается в ТЧ, то в шапке он может быть не заполнен или указан неправильно,
	// это ни на что не влияет, потому что при проведении используется склад в ТЧ.
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И НЕ СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Документ не может осуществлять поступление на не оптовый склад!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвратнаяТара";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТара();

	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, , СтруктураОбязательныхПолей);
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");

		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара",СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда	
		
		Для каждого СтрокаТЧ из ТаблицаПоТаре Цикл

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Возвратная тара"": ", СокрЛП(СтрокаТЧ.НомерСтроки));

			Если СтрокаТЧ.СчетУчетаБУ.Забалансовый Тогда

				СтрокаСообщения = "указан забалансовый счет!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);

			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
				Если СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					СтрокаСообщения = " указно налоговое назначение по нехозяйственной деятельности!";
											
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
					СтрокаСообщения = " указно налоговое назначение по пропорциональному НДС!";
											
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				
			КонецЕсли;
            						
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Услуги";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Количество, Сумма, Содержание");

	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, , СтруктураОбязательныхПолей);
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// построчная проверка
	ПроверитьТабЧастьУслугиПоСтрочно(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетТоваров(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда	
	
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			//Проверяем соответствует ли аналитика затрат налоговым назначениям в ТЧ Услуги
			ОбщегоНазначения.ПроверитьСоответствиеАналитикиЗатратНалоговомуНазначению(ЭтотОбъект, "Услуги", Отказ, Заголовок);
		КонецЕсли;	
		
		
		Если НЕ Отказ  
			 И  СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			 
			Для каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
				
				ХарактерЗатрат = СтрокаТаблицы.ХарактерЗатратНУ;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат) Тогда
					
					Если ХарактерЗатрат = "Затраты" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" не указано налоговое назначение затрат!'; uk = 'Для послуги в рядку ""¤1¤"" не зазначено податкове призначення витрат!'"), СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "Строительство" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" не указано налоговое назначение для объекта строительства или НМА!'; uk = 'Для послуги в рядку ""¤1¤"" не зазначено податкове призначення для об''єкта будівництва або НМА!'"), СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "Производство" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" не указано налоговое назначение в производстве для номенклатурной группы!'; uk = 'Для послуги в рядку ""¤1¤"" не зазначено податкове призначення у виробрництві для номенклатурної групи!'"), СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "РБП" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" не указано налоговое назначение для расходов будущих периодов!'; uk = 'Для послуги в рядку ""¤1¤"" не зазначено податкове призначення для витрат майбутніх періодів!'"), СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					Иначе
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" невозможно определить налоговое назначение затрат для указанного счета затрат!'; uk = 'Для послуги в рядку ""¤1¤"" неможливо визначити податкое призначення витрат для вказанного рахунку витрат!'"), СтрокаТаблицы.НомерСтроки);
						Сообщить(СтрокаСообщения);			
					КонецЕсли;
					
				КонецЕсли;
				
				// нельзя по НДС указывать нехоз. деятельность, а по НП - хоз. деятельность
				Если НЕ Отказ  
					И  СтруктураШапкиДокумента.ЕстьНДС Тогда
					
					НехозДеятельностьНДС = (СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
					НехозДеятельностьНКУ = (СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
					
					Если НЕ СтрокаТаблицы.НалоговоеНазначение = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат  
						  И НехозДеятельностьНДС <> НехозДеятельностьНКУ Тогда 
						СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" нельзя указывать нехозяйственное налоговое назначение и одновременно хозяйственную деятельность по затратам (и наоборот)!'; uk = 'Для послуги в рядку ""¤1¤"" не можна зазначати негосподарське податкове призначення по НДВ і одночасно господарську діяльність по витратам (та навпаки)!'"), СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

Процедура ПроверитьТабЧастьУслугиПоСтрочно(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Для Каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Услуги"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
		Если СтрокаТЧ.ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			СтрокаСообщения = "В этом документе может быть выбрана статья затрат с характером только ""Производственные затраты""!";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры 	

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПродукция(ТаблицаПоПродукции, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Продукция";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда

		СтруктураОбязательныхПолей.Вставить("Счет");
		СтруктураОбязательныхПолей.Вставить("ПлановаяСтоимость");
		
	КонецЕсли; 

	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("ПлановаяСтоимостьУпр");	
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Продукция", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Продукция", ТаблицаПоПродукции, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Продукция", ТаблицаПоПродукции, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Продукция", ТаблицаПоПродукции, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Продукция", ТаблицаПоПродукции, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиИспользованныеМатериалы(ТаблицаПоМатериалам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "ИспользованныеМатериалы";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения, СтатьяЗатрат");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда

		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		
	КонецЕсли; 

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ИспользованныеМатериалы", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ИспользованныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ИспользованныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ИспользованныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ИспользованныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

Процедура ПроверитьЗаполнениеТабличнойЧастиВозвращенныеМатериалы(ТаблицаПоМатериалам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвращенныеМатериалы";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда

		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("СчетПередачиБУ");
		
	КонецЕсли; 

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвращенныеМатериалы", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвращенныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
    
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвращенныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвращенныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ВозвращенныеМатериалы", ТаблицаПоМатериалам, Отказ, Заголовок);
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();

	ТаблицаТары.Колонки.Добавить("Склад");
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладПриходногоОрдера, "Склад");
	Иначе	
		ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОрдер, "Склад");
	КонецЕсли;
	
	// Порядок вызова в данном случае важен
	ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ТаблицаТары.Колонки.Добавить("СтавкаНДС");
	ТаблицаТары.Колонки.Добавить("НДС");
	ТаблицаТары.Колонки.Добавить("ДляХозяйственнойДеятельности");	
	ТаблицаТары.Колонки.Добавить("СделкаБУ");
	ТаблицаТары.Колонки.Добавить("СделкаНУ");
	
	ТаблицаТары.ЗаполнитьЗначения(Перечисления.СтавкиНДС.НеНДС	, "СтавкаНДС");
	ТаблицаТары.ЗаполнитьЗначения(0								, "НДС");
	Для каждого Строка Из ТаблицаТары Цикл
		Строка.СделкаБУ = УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка,Сделка); 
		Строка.СделкаНУ = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка); 
		
		Строка.ДляХозяйственнойДеятельности = Истина;
		Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая;
		
	КонецЦикла; 
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления,Истина);
	
КонецПроцедуры // ПодготовитьТаблицуТарыРегл()	

Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)

	// Переименуем колонку "Сумма" в "Стоимость" (как в регистрах).
	ТаблицаТары.Колонки.Сумма.Имя = "Стоимость";

	ТаблицаТары.Колонки.Добавить("ЦенаВВалютеЗаказа"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТары.Колонки.Добавить("СуммаУпр"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	// Надо расчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		// Счиатем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;

		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
			                                  КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);

		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
			                             СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			                             СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                             ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
			                             СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);


	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

Функция ПодготовитьТаблицуМатериалов(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)
	
	ТаблицаМатериалов = РезультатЗапросаПоТоварам.Выгрузить();
	
	
	ПодготовитьТаблицуМатериаловРегл(ТаблицаМатериалов, СтруктураШапкиДокумента);	
	ПодготовитьТаблицуМатериаловУпр(ТаблицаМатериалов, СтруктураШапкиДокумента);
	
	Возврат ТаблицаМатериалов;
	
КонецФункции 

Процедура ПодготовитьТаблицуМатериаловРегл(ТаблицаМатериалов, СтруктураШапкиДокумента)

	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ3");	
	ТаблицаМатериалов.Колонки.Добавить("НалоговоеНазначениеНовое");
	
	ТаблицаМатериалов.Колонки.Добавить("ДокументОприходования");
	ТаблицаМатериалов.Колонки.Добавить("Регистратор");
	ТаблицаМатериалов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаМатериалов.Колонки.Добавить("Организация");
	ТаблицаМатериалов.Колонки.Добавить("ДоговорКонтрагента");
	
	ТаблицаМатериалов.Колонки.Добавить("ХарактерЗатратНУ");
	
	ТаблицаМатериалов.ЗаполнитьЗначения(СчетЗатрат,    "КорСчетСписанияБУ");
	
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПодразделениеОрганизации, "КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.НоменклатурнаяГруппа,     "КорСубконтоСписанияБУ2");
		
	Для Каждого Строка Из ТаблицаМатериалов Цикл
		Строка.КорСубконтоСписанияБУ3  = Строка.СтатьяЗатрат;
		
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(Строка, Строка.КорСчетСписанияБУ, Строка.ХарактерЗатратНУ,
														       	Строка.НалоговоеНазначениеНовое, ,                                                                
																Строка.НалоговоеНазначение, Строка.НалоговоеНазначениеНовое, "КорСубконтоСписанияБУ", Ложь, Ложь,Дата);
		
	КонецЦикла;
	
	ТаблицаМатериалов.ЗаполнитьЗначения(ЭтотОбъект,    		"Регистратор");
	ТаблицаМатериалов.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаМатериалов.ЗаполнитьЗначения(Организация, 		"Организация");

КонецПроцедуры

Функция ПодготовитьТаблицуВозвращенныхМатериалов(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)
	
	ТаблицаМатериалов = РезультатЗапросаПоТоварам.Выгрузить();

	ПодготовитьТаблицуВозвращенныхМатериаловРегл(ТаблицаМатериалов, СтруктураШапкиДокумента);	
	Возврат ТаблицаМатериалов;
	
КонецФункции 

Процедура ПодготовитьТаблицуВозвращенныхМатериаловРегл(ТаблицаМатериалов, СтруктураШапкиДокумента)

	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ3");
	
	ТаблицаМатериалов.Колонки.Добавить("ДокументОприходования");
	ТаблицаМатериалов.Колонки.Добавить("Регистратор");
	ТаблицаМатериалов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаМатериалов.Колонки.Добавить("Организация");
	ТаблицаМатериалов.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияНУ");
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладПриходногоОрдера, "Склад");
	Иначе	
		ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОрдер, "Склад");
	КонецЕсли;

	ТаблицаМатериалов.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаМатериалов.ЗагрузитьКолонку(ТаблицаМатериалов.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");	
	
	//Из БУ
	Для Каждого Строка Из ТаблицаМатериалов Цикл
		Строка.КорСчетСписанияБУ = Строка.СчетПередачиБУ;		
		Строка.КорСубконтоСписанияБУ1  = Строка.Номенклатура;	
		Строка.КорСубконтоСписанияБУ2  = Строка.Номенклатура;	
	КонецЦикла; 
	
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОрдер, "КорСубконтоСписанияБУ3");
    ТаблицаМатериалов.ЗаполнитьЗначения(ПланыСчетов.Налоговый.Запасы,       "КорСчетСписанияНУ");

	
	ТаблицаМатериалов.ЗаполнитьЗначения(ЭтотОбъект,    		"Регистратор");
	ТаблицаМатериалов.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаМатериалов.ЗаполнитьЗначения(Организация, 		"Организация");
	
КонецПроцедуры

Процедура ПодготовитьТаблицуМатериаловУпр(ТаблицаМатериалов, СтруктураШапкиДокумента)

	
КонецПроцедуры

Функция ПодготовитьТаблицуПродукции(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();	
	
	ТаблицаТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладПриходногоОрдера, "Склад");
	Иначе	
		ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОрдер, "Склад");
	КонецЕсли;
	
	// Создаем колонку "Цена" и копируем в нее колонку "ПлановаяСтоимость"
	ТаблицаТоваров.Колонки.Добавить("Цена", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("ПлановаяСтоимость") , "Цена");
	
	// Создаем колонку "Стоимость" и копируем в нее колонку "СуммаПлановая"
	ТаблицаТоваров.Колонки.Добавить("Стоимость", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("СуммаПлановая") , "Стоимость");
	
	ТаблицаТоваров.Колонки.Добавить("КоличествоМинус", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	
	ПодготовитьТаблицуПродукцииРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуПродукцииУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ПодготовитьТаблицуПродукцииРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТоваров.Колонки.Добавить("СуммаПлановаяРегл");
	
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаНУ");
	ТаблицаТоваров.ЗаполнитьЗначения(ПланыСчетов.Налоговый.Запасы, "СчетУчетаНУ");
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Если СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаПлановаяРегл = СтрокаТаблицы.СуммаПлановая;
		Иначе
			СтрокаТаблицы.СуммаПлановаяРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаПлановая, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
												СтруктураШапкиДокумента.КурсДокумента, 1,
												СтруктураШапкиДокумента.КратностьДокумента, 1,
												, ПогрешностиОкругления, "СуммаПлановаяРегл");
		КонецЕсли;

		
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТаблицуПродукцииУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаТоваров.Колонки.Добавить("ЦенаВВалютеЗаказа"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));

	ЕстьЦена = Не ТаблицаТоваров.Колонки.Найти("Цена") = Неопределено;
	
	ТаблицаТоваров.Колонки.Добавить("ПлановыйНДСУпр", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаПлановаяУпрБезНДС", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// ставку НДС берем из номенклатурной группы
	СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(СтруктураШапкиДокумента.НоменклатурнаяГруппа.СтавкаНДС);
	
	// Надо расчитать нужные колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		// Считаем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;

		СтрокаТаблицы.КоличествоМинус = - СтрокаТаблицы.Количество;
		
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		ПлановыйНДСУпр = УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СуммаПлановаяУпр, Истина, Истина, СтавкаНДС);
		СтрокаТаблицы.ПлановыйНДСУпр = ПлановыйНДСУпр;
		СтрокаТаблицы.СуммаПлановаяУпрБезНДС = СтрокаТаблицы.СуммаПлановаяУпр - СтрокаТаблицы.ПлановыйНДСУпр;
										 
	КонецЦикла;

КонецПроцедуры

Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ТаблицаПоУслугам = РезультатЗапросаПоУслугам.Выгрузить();
	
	// Создаем колонку "Стоимость" и копируем в нее колонку "Сумма"
	ТаблицаПоУслугам.Колонки.Добавить("Стоимость", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаПоУслугам.ЗагрузитьКолонку(ТаблицаПоУслугам.ВыгрузитьКолонку("Сумма") , "Стоимость");
	
	ПодготовитьТаблицуУслугРегл(ТаблицаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуУслугУпр(ТаблицаПоУслугам, СтруктураШапкиДокумента);
	
	Возврат ТаблицаПоУслугам;
	
КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуУслугРегл(ТаблицаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления)

	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаПоУслугам.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаПоУслугам.ЗаполнитьЗначения(0                            , "НДС");
	КонецЕсли;
	
	ТаблицаПоУслугам.Колонки.Добавить("ДляХозяйственнойДеятельности", Новый ОписаниеТипов("Булево"));
	ТаблицаПоУслугам.Колонки.Добавить("НалоговоеНазначениеДоходовИЗатрат");
	
	Для каждого Строка Из ТаблицаПоУслугам Цикл
		Если Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			Строка.ДляХозяйственнойДеятельности = Ложь;
		Иначе
			Строка.ДляХозяйственнойДеятельности = Истина;
		КонецЕсли; 
	КонецЦикла;
	
	ТаблицаПоУслугам.Колонки.Добавить("Амортизируется");
	ТаблицаПоУслугам.Колонки.Добавить("Субконто1");
	ТаблицаПоУслугам.Колонки.Добавить("Субконто2");
	ТаблицаПоУслугам.Колонки.Добавить("Субконто3");
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		
		СтрокаТаблицы.Амортизируется = Ложь;
		
		СтрокаТаблицы.Субконто1 = СтруктураШапкиДокумента.ПодразделениеОрганизации;
		СтрокаТаблицы.Субконто2 = СтруктураШапкиДокумента.НоменклатурнаяГруппа;
		СтрокаТаблицы.Субконто3 = СтрокаТаблицы.СтатьяЗатрат;
		
	КонецЦикла;
	
	ТаблицаПоУслугам.Колонки.Добавить("СделкаБУ");
	ТаблицаПоУслугам.Колонки.Добавить("СделкаНУ");
	ТаблицаПоУслугам.Колонки.Добавить("ХарактерЗатратНУ");
	
	Для каждого Строка Из ТаблицаПоУслугам Цикл
		Строка.СделкаБУ = УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка,Сделка); 
		Строка.СделкаНУ = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка); 
		
		// заполним характер затрат, признак Амортизируется и НалоговоеНазначениеДоходовИЗатрат
		
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(Строка, Строка.СчетЗатрат, Строка.ХарактерЗатратНУ,
														       	Строка.НалоговоеНазначениеДоходовИЗатрат, Строка.Амортизируется,                    
																Строка.НалоговоеНазначение, Строка.НалоговоеНазначениеДоходовИЗатрат, , Ложь, Ложь, Дата);
		
	КонецЦикла; 
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, Истина);

КонецПроцедуры

Процедура ПодготовитьТаблицуУслугУпр(ТаблицаПоУслугам, СтруктураШапкиДокумента)

	ТаблицаПоУслугам.Колонки.Добавить("ЦенаВВалютеЗаказа"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаПоУслугам.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоУслугам.Колонки.Добавить("СуммаУпр"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоУслугам.Колонки.Добавить("НДСУпр"             , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	ЕстьЦена = Не ТаблицаПоУслугам.Колонки.Найти("Цена") = Неопределено;
	
	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	ПогрешностьРасчетаНДС = 0;
	
	// Надо расчитать нужные колонки.
	Для каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		
		// Считаем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;

		СтоимостьСНДС  = СтрокаТаблицы.Стоимость + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
		                                 КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);

		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			
			Если СтруктураШапкиДокумента.УчитыватьНДС = Ложь Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
					СуммаНДСВалУпр = 0;
				Иначе	
					СуммаНДСВалУпр = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, ПогрешностьРасчетаНДС);
				КонецЕсли;			
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;
						
		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
										 
		// Цена нужна для проведения по заказам поставщиков, поэтому ее необходимо пересчитать в валюту заказа
		Если ЕстьЦена И ЗначениеЗаполнено(СтруктураШапкиДокумента.Сделка) 
			И (ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
			СтруктураКурсаВалютыЗаказа = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаЗаказа, Дата);
			СтрокаТаблицы.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаЗаказа,
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураКурсаВалютыЗаказа.Курс, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураКурсаВалютыЗаказа.Кратность);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

// Процедура выполняет заполнение табличной части неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьПродукциюПоОстаткамУпр() Экспорт

	мКурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	мКратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров.ВПереработку);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Товар",        Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                                     КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаХранения,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу)                 КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению)                    КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение                                       КАК Размещение,
	|	ВложенныйЗапрос.ЕдиницаИзмерения                                 КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент                                      КАК Коэффициент
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	Остатки.Номенклатура                 КАК Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры   КАК ХарактеристикаНоменклатуры,
	|	Остатки.ЕдиницаИзмерения             КАК ЕдиницаИзмерения,
	|	Остатки.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	Остатки.КоличествоОстаток            КАК КоличествоОстатокПоЗаказу,
	|	0                                    КАК КоличествоПоРазмещению,
	|	Неопределено                         КАК Размещение
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ДоговорКонтрагента = &Договор
	|	                                              И ЗаказПоставщику  = &Сделка
	|	                                              И СтатусПартии     = &СтатусПартии) КАК Остатки
	|
	|ГДЕ
	|	НЕ Остатки.Номенклатура.Услуга И Остатки.КоличествоОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Размещение.Номенклатура               КАК Номенклатура,
	|	Размещение.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		Размещение.Номенклатура.ЕдиницаХраненияОстатков,
	  |	Размещение.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	0                                     КАК КоличествоОстатокПоЗаказу,
	|	Размещение.КоличествоОстаток          КАК КоличествоПоРазмещению,
	|	Размещение.ЗаказПокупателя            КАК Размещение
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПоставщику = &Сделка И ТоварТара = &Товар) КАК Размещение
	|	
	|
	|ГДЕ
	|	НЕ Размещение.Номенклатура.Услуга  И Размещение.КоличествоОстаток > 0
	|
	|) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент
	|
	|";

	РезультатЗапроса = Запрос.Выполнить();

	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоОстатокПоЗаказу");

	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;

		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               СтрокаБезЦен.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаБезЦен.ХарактеристикаНоменклатуры);

		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);

		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;

			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;

			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;

				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;

				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано + СписатьПоРазмещению;

				Если КолвоПоРазмещению > 0 Тогда
					СтрокаТабличнойЧасти = Продукция.Добавить();
					СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
					СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
					СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
					СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
					//СтрокаТабличнойЧасти.СтавкаНДС                  = СтрокаЗаказа.СтавкаНДС;
					СтрокаТабличнойЧасти.ЗаказПокупателя            = СтрокаРазмещения.Размещение;
					СтрокаТабличнойЧасти.Количество                 = СписатьПоРазмещению * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
																      /СтрокаЗаказа.Коэффициент;
					СтрокаТабличнойЧасти.Спецификация     = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, Дата);
					УправлениеПроизводством.РассчитатьПлановуюСебестоимостьВСтрокеТабЧастиПроизводство(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета, Ложь, Истина, мВалютаУправленческогоУчета);
					ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти, Истина);
					
					ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Продукция", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
					
                   	СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
					
				КонецЕсли;

			КонецЦикла;

			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано  + СписатьПоЗаказу;

			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = Продукция.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.ЗаказПокупателя            = Неопределено;
				СтрокаТабличнойЧасти.Количество                 = СписатьПоЗаказу * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
																  /СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.Спецификация     = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, Дата);
				УправлениеПроизводством.РассчитатьПлановуюСебестоимостьВСтрокеТабЧастиПроизводство(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета, Ложь, Истина, мВалютаУправленческогоУчета);
				ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти, Истина);
				ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Продукция", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
								
				
			КонецЕсли;

			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьТоварыПоОстаткамУпр()

// Заполняет регл. реквизиты после упр. заполнения
// Процедура выполняет заполнение возвратной тары неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьВозвратнуюТаруПоОстаткамУпр() Экспорт

	мКурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	мКратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;
	ИмяТЧ  = "ЗаказПоставщику.ВозвратнаяТара";

	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	Запрос.УстановитьПараметр("Тара",         Перечисления.ТоварТара.Тара);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                     КАК Номенклатура,
	|	ВложенныйЗапрос.Цена                             КАК Цена,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу) КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению)    КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение                       КАК Размещение
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	Остатки.Номенклатура      КАК Номенклатура,
	|	Остатки.Цена              КАК Цена,
	|	Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу,
	|	0                         КАК КоличествоПоРазмещению,
	|	Неопределено              КАК Размещение
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ДоговорКонтрагента = &Договор
	|	                                              И ЗаказПоставщику  = &Сделка
	|	                                              И СтатусПартии     = &СтатусПартии) КАК Остатки
	|
	|ГДЕ
	|	НЕ Остатки.Номенклатура.Услуга И Остатки.КоличествоОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Размещение.Номенклатура      КАК Номенклатура,
	|	0                            КАК Цена,
	|	0                            КАК КоличествоОстатокПоЗаказу,
	|	Размещение.КоличествоОстаток КАК КоличествоПоРазмещению,
	|	Размещение.ЗаказПокупателя   КАК Размещение
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПоставщику = &Сделка И ТоварТара = &Тара) КАК Размещение
	|
	|ГДЕ
	|	НЕ Размещение.Номенклатура.Услуга И Размещение.КоличествоОстаток > 0
	|
	|) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.Цена
	|
	|";

	РезультатЗапроса = Запрос.Выполнить();

	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура", "КоличествоОстатокПоЗаказу");

	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;

		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаБезЦен.Номенклатура);

		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);

		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;

			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;

			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;

				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;

				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано + СписатьПоРазмещению;

				Если КолвоПоРазмещению > 0 Тогда
					СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
					СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
					СтрокаТабличнойЧасти.ЗаказПокупателя = СтрокаРазмещения.Размещение;
					СтрокаТабличнойЧасти.Количество      = СписатьПоРазмещению;

					СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
					                            Сделка.ВалютаДокумента, ВалютаДокумента,
					                            ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), мКурсДокумента,
					                            ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), мКратностьДокумента);

					ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					
                    ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
					
					СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
				КонецЕсли;
			КонецЦикла;

			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано  + СписатьПоЗаказу;

			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
				СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ЗаказПокупателя = Неопределено;
				СтрокаТабличнойЧасти.Количество      = СписатьПоЗаказу;

				СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				                            Сделка.ВалютаДокумента, ВалютаДокумента,
				                            ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), мКурсДокумента,
				                            ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), мКратностьДокумента);

				ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
							
			КонецЕсли;

			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьВозвратнуюТаруПоОстаткамУпр()

// Процедура выполняет заполнение услуг неполученными услугами по заказу поставщику.
//
Процедура ЗаполнитьУслугиПоОстаткамУпр() Экспорт

	мКурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	мКратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Товар",   Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",  Сделка);
	Запрос.УстановитьПараметр("ВозвратнаяТара", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура               КАК Номенклатура,
	|	Остатки.Номенклатура.СтавкаНДС     КАК СтавкаНДС,
	|	Остатки.Цена,
	|	Остатки.КоличествоОстаток          КАК КоличествоОстатокПоЗаказу
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ДоговорКонтрагента = &Договор И ЗаказПоставщику = &Сделка И СтатусПартии <> &ВозвратнаяТара) КАК Остатки
	|
	|ГДЕ Остатки.Номенклатура.Услуга
	|
	|";

	РезультатЗапроса = Запрос.Выполнить();

	ЗапросСодержаний = Новый Запрос;
	ЗапросСодержаний.УстановитьПараметр("Сделка",  Сделка);
	ЗапросСодержаний.Текст = "
	|ВЫБРАТЬ 
	|	Док.Номенклатура, 
	|	Док.Содержание 
	|ИЗ 
	|	Документ.ЗаказПоставщику.Услуги КАК Док
	|
	|ГДЕ Док.Ссылка = &Сделка";

	ТабСодержаний = ЗапросСодержаний.Выполнить().Выгрузить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаУслуг = Услуги.Добавить();
		СтрокаУслуг.Номенклатура = Выборка.Номенклатура;
		СтрокаУслуг.Количество   = Выборка.КоличествоОстатокПоЗаказу;
		СтрокаУслуг.СтавкаНДС    = Выборка.СтавкаНДС;

		СтрокаСодержания = ТабСодержаний.Найти(Выборка.Номенклатура, "Номенклатура");

		Если СтрокаСодержания = Неопределено Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(СтрокаУслуг, ЭтотОбъект);
		Иначе
			СтрокаУслуг.Содержание = СтрокаСодержания.Содержание;
		КонецЕсли;

		СтрокаУслуг.СтатьяЗатрат         = СтрокаУслуг.Номенклатура.СтатьяЗатрат;
		
		СтрокаУслуг.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена,
		                   Сделка.ВалютаДокумента, ВалютаДокумента,
		                   ЗаполнениеДокументов.КурсДокумента(Сделка,     мВалютаРегламентированногоУчета),
		                   мКурсДокумента,
		                   ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета),
		                   мКратностьДокумента);

		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаУслуг, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаУслуг, ЭтотОбъект);
        ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаУслуг, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
				
	КонецЦикла;

КонецПроцедуры // ЗаполнитьУслугиПоОстаткамУпр()

// Процедура выполняет заполнение табличной части "Материалы".
//
Процедура ЗаполнитьМатериалыПоОстаткамУпр(ТабличнаяЧасть) Экспорт  
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Сообщить("Не указан контрагент! Заполнение невозможно.", СтатусСообщения.Важное);
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			Сообщить("Не указан договор контрагента! Заполнение невозможно.", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		УсловиеПоЗаказу = "";
	Иначе
		УсловиеПоЗаказу = " И Сделка = &Заказ ";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РегТоварыПереданные.Номенклатура 					        КАК Номенклатура,
	|	РегТоварыПереданные.ХарактеристикаНоменклатуры              КАК ХарактеристикаНоменклатуры,
	|	РегТоварыПереданные.СерияНоменклатуры                       КАК СерияНоменклатуры,
	|	РегТоварыПереданные.Номенклатура.СтатьяЗатрат 				КАК СтатьяЗатрат,
	|	СУММА(РегТоварыПереданные.КоличествоОстаток)                КАК КолКонОст,
	|	СУММА(РегТоварыПереданные.СуммаВзаиморасчетовОстаток)       КАК СумКонОст
	|ИЗ
	|	РегистрНакопления.ТоварыПереданные.Остатки(, 
	|											   ДоговорКонтрагента = &ДоговорКонтрагента
	|											   " + УсловиеПоЗаказу + "
	|											   И СтатусПередачи = &СтатусПередачи
	|											   ) КАК РегТоварыПереданные
	|
	|СГРУППИРОВАТЬ ПО
	|	РегТоварыПереданные.Номенклатура,
	|	РегТоварыПереданные.ХарактеристикаНоменклатуры,
	|	РегТоварыПереданные.СерияНоменклатуры
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр( "Заказ", ?(НЕ ЗначениеЗаполнено( Сделка), Неопределено, Сделка));
	Запрос.УстановитьПараметр( "ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр( "СтатусПередачи", Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТабличнаяЧасть.Очистить(); 
	
	Обход = РезультатЗапроса.Выбрать();
	Пока Обход.Следующий() Цикл
		НоваяСтрока = ТабличнаяЧасть.Добавить(); 		
		НоваяСтрока.Номенклатура               = Обход.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Обход.ХарактеристикаНоменклатуры;
		НоваяСтрока.СерияНоменклатуры 		   = Обход.СерияНоменклатуры;
		Если ТабличнаяЧасть = ИспользованныеМатериалы Тогда
		    НоваяСтрока.СтатьяЗатрат 		  	   = Обход.СтатьяЗатрат; 	
		КонецЕсли;  
		
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуТабЧасти   ( НоваяСтрока, ЭтотОбъект);
		ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти( НоваяСтрока, ЭтотОбъект);
		
		НоваяСтрока.Количество                 = Обход.КолКонОст;
						   
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьМатериалыПоОстаткам()

// Процедура выполняет заполнение табличной части по приходному ордеру товаров.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание (приходный ордер товаров).
//
Процедура ЗаполнитьТоварыПоОснованиюУпр(ДокументОснование, ТабличнаяЧасть) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Если ТабличнаяЧасть = ВозвратнаяТара Тогда
		ИмяТабличнойЧасти = "ВозвратнаяТара";
	Иначе
		ИмяТабличнойЧасти = "Товары";
	КонецЕсли;
	
	ДополнительныеРеглПоляОбщ		= "";
	ДополнительныеРеглПоляТовары 	= "";
	
	Запрос.УстановитьПараметр("ТипЦен",       ТипЦен);
	Запрос.УстановитьПараметр("ПустойТипЦен", Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад",        ДокументОснование.Склад);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокТовары.Номенклатура,
	|	ДокТовары.Номенклатура.БланкСтрогогоУчета,
	|	ДокТовары.Номенклатура.СтавкаНДС                            КАК СтавкаНДС,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаХранения,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения," +
		ДополнительныеРеглПоляОбщ +"
	|	СУММА(ДокТовары.Количество)                        КАК КоличествоПоДокументу,
	|	NULL                                               КАК ЦенаВРознице, " + 
	?(ТабличнаяЧасть = Продукция, "
	|	ДокТовары.СерияНоменклатуры," +
		ДополнительныеРеглПоляТовары +"
	|	ДокТовары.ХарактеристикаНоменклатуры, ", "") + 
	?(ИмяТабличнойЧасти = "Товары", "
	|   СУММА(ДокТовары.Количество*ДокТовары.Коэффициент/ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК КоличествоПоСерии, ", "СУММА(ДокТовары.Количество) КАК КоличествоПоСерии, ") + "
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                КАК КоличествоОстатокКомпании,
	|   МАКСИМУМ(ВЫБОР КОГДА &ТипЦен = &ПустойТипЦен ТОГДА
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков
	|   ИНАЧЕ
	|       ВЫБОР КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
	|           Остатки.Номенклатура.ЕдиницаХраненияОстатков
	|       ИНАЧЕ
	|           ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения 
	|       КОНЕЦ
	|   КОНЕЦ)                                                   КАК ЕдиницаИзмерения,
	|   МАКСИМУМ(ВЫБОР КОГДА &ТипЦен = &ПустойТипЦен ТОГДА
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|   ИНАЧЕ
	|       ВЫБОР КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
	|           Остатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|       ИНАЧЕ
	|           ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения.Коэффициент 
	|       КОНЕЦ
	|   КОНЕЦ)                                                   КАК Коэффициент
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары." + ИмяТабличнойЧасти + " КАК ДокТовары
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(, ДокументПолучения = &ДокументОснование И Склад = &Склад) КАК Остатки
	|ПО
	|	ДокТовары.Номенклатура = Остатки.Номенклатура" + 
	?(ТабличнаяЧасть = Продукция, "
	| И ДокТовары.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	| И ДокТовары.СерияНоменклатуры          = Остатки.СерияНоменклатуры	", "") + " 
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|   ПО ДокТовары.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура " + 
	?(ТабличнаяЧасть = Продукция, "
	|      И ДокТовары.ХарактеристикаНоменклатуры = ЦеныНоменклатурыКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры ", "") + "
	|
	|ГДЕ
	|	ДокТовары.Ссылка = &ДокументОснование
	|	И Остатки.КоличествоОстаток > 0  
	|	И ДокТовары.Номенклатура.БланкСтрогогоУчета = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТовары.Номенклатура" +
	?(ТабличнаяЧасть = Продукция, ",
	|	ДокТовары.СерияНоменклатуры,
	|	ДокТовары.ХарактеристикаНоменклатуры", "");
	
	РезультатЗапроса = Запрос.Выполнить();

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ТабличнаяЧасть = Продукция Тогда

			СтрокаТабличнойЧасти = Продукция.Добавить();

			СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество                 = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);
			СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент                = Выборка.Коэффициент;
			//СтрокаТабличнойЧасти.СтавкаНДС                  = Выборка.СтавкаНДС;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
			

			ОбработкаТабличныхЧастей.ЗаполнитьЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
			
			ТипЦенПлановойСебестоимости   = Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
			СтрокаТабличнойЧасти.ПлановаяСтоимость =
								Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
														ТипЦенПлановойСебестоимости, Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
														ВалютаДокумента, КурсДокумента, КратностьДокумента);
									
			ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти);
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Продукция", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
			
			
		Иначе

			СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();

			СтрокаТабличнойЧасти.Номенклатура = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество   = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);

			ОбработкаТабличныхЧастей.ЗаполнитьЦенуВозвратнойТарыТабЧастиПоступление(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета);
			ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти , ЭтотОбъект);
            ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
			
		КонецЕсли;

	КонецЦикла; // Выборка.Следующий()

КонецПроцедуры // ЗаполнитьТоварыПоОснованию()

Процедура ЗаполнитьДокументПоОснованиюУпр(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ОтражатьВУправленческомУчете = Истина;
		Ответственный = Основание.Ответственный;
		
		Сделка = Основание;
		
		Если ЗначениеЗаполнено(Сделка) И Сделка.Проведен Тогда
			
			СкладОрдер     = Основание.Склад;
			ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
			
			// Заполним табличные части неполученными ТМЦ по заказу поставщику.
			ЗаполнитьПродукциюПоОстаткамУпр();
			ЗаполнитьВозвратнуюТаруПоОстаткамУпр();
			ЗаполнитьУслугиПоОстаткамУпр();
			ЗаполнитьМатериалыПоОстаткамУпр(ИспользованныеМатериалы);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Ответственный                = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
		ОтражатьВУправленческомУчете = Истина;
		СкладОрдер                   = Основание;
		ВидПоступления               = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
		ДоговорКонтрагента           = Контрагент.ОсновнойДоговорКонтрагента;
		
		Если    ДоговорКонтрагента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
			ИЛИ ДоговорКонтрагента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			
		КонецЕсли;
		
		ТипЦен                       = ДоговорКонтрагента.ТипЦен;
		УчитыватьНДС                 = Истина;
		СуммаВключаетНДС             = ТипЦен.ЦенаВключаетНДС;
		ВалютаДокумента              = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		СтруктураКурса               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВзаиморасчетов           = СтруктураКурса.Курс;
		КратностьВзаиморасчетов      = СтруктураКурса.Кратность;
		
		Если Основание.Проведен Тогда
			
			// Заполним табличную часть по приходному ордеру на товары.
			ЗаполнитьТоварыПоОснованиюУпр(Основание, Продукция);
			ЗаполнитьТоварыПоОснованиюУпр(Основание, ВозвратнаяТара);
			
		КонецЕсли;
    ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаТоваров") Тогда
	
		Если Основание.ВидОперации = Перечисления.ВидыОперацийПередачаТоваров.ИзПереработки Тогда
			Возврат; 		
		КонецЕсли; 
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание); 		 
		СчетУчетаРасчетовПоТаре      = Основание.СчетУчетаРасчетовПоТаре;
		ВидПоступления               = ?( Основание.ВидПередачи = Перечисления.ВидыПередачиТоваров.ПоОрдеру,
		                               Перечисления.ВидыПоступленияТоваров.ПоОрдеру,
		                               Перечисления.ВидыПоступленияТоваров.НаСклад);
		СкладОрдер                   = Основание.Склад;
		Сделка                   	 = Основание.Сделка;  	
		
		Для Каждого СтрокаТабличнойЧасти Из Основание.ВозвратнаяТара Цикл 			
			НоваяСтрока = ВозвратнаяТара.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти)		
		КонецЦикла; 
		
		Для Каждого СтрокаТабличнойЧасти Из Основание.Товары Цикл 			
			НоваяСтрока = ИспользованныеМатериалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);				
			НоваяСтрока.СтатьяЗатрат = НоваяСтрока.Номенклатура.СтатьяЗатрат;
		КонецЦикла;  
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", Основание.Метаданные()) Тогда
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
	Иначе
		ОтражатьВУправленческомУчете = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НеОтражатьДокументыВУправленческомУчете");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", Основание.Метаданные()) Тогда
		ОтражатьВБухгалтерскомУчете = Основание.ОтражатьВБухгалтерскомУчете;
	Иначе
		ОтражатьВБухгалтерскомУчете = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НеОтражатьДокументыВБухгалтерскомУчете");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияРегл(Основание)
	
	ЗаполнитьСчетаУчетаВТабличнойЧастиРегл(Продукция	 , 			"Продукция"     , 			ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	ЗаполнитьСчетаУчетаВТабличнойЧастиРегл(ВозвратнаяТара, 			"ВозвратнаяТара", 			ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	ЗаполнитьСчетаУчетаВТабличнойЧастиРегл(Услуги, 					"Услуги", 					ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	ЗаполнитьСчетаУчетаВТабличнойЧастиРегл(ИспользованныеМатериалы, "ИспользованныеМатериалы", 	ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
    
КонецПроцедуры // ОбработкаЗаполненияРегл()

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
                              ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
							  ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок) 

	ДвижениеПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента,
                           ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
						   ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок); 
						   
							
	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента);							  
						   
	
	ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, 
										ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок);
    
    ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, 
	                          			ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок, СтруктураШапкиДокумента);
												
										
	ТаблицаПоВторомуСобытиюНал = ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоТаре, Отказ);
											
	ДвижениеПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоПродукции, 
									ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоТаре, 
									ТаблицаПоВторомуСобытиюНал,
									Отказ, Заголовок);
	
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить 
	// корректировку списания
	Если ОтражатьВУправленческомУчете
		И (ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру 
		   ИЛИ ТаблицаПоМатериалам.Количество() > 0) Тогда

		Движения.ПартииТоваровНаСкладах.Записать();

		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);

		Если УчетнаяПолитика.СписыватьПартииПриПроведенииДокументов Тогда

			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

			ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
			ЗаписьРегистрации.Период      = Дата;

		Иначе

			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
				УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Ссылка, СтруктураШапкиДокумента.Организация);
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ДвижениеПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
								 ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
								 ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок) 

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ТабИмен = Неопределено;
	
	УправлениеВзаиморасчетами.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
	                         мСтруктураПараметровВзаиморасчетов, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                         ВидДвиженияНакопления.Расход, Отказ, Заголовок);


	// ПРОДУКЦИЯ ПО РЕГИСТРУ ТоварыНаСкладах.
	// ПРОДУКЦИЯ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоПродукции, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок, СтруктураШапкиДокумента); 

	// ТАРА ПО РЕГИСТРУ ТоварыПолученные.
	Если ОтражатьВУправленческомУчете Тогда
		
		НаборДвижений = Движения.ТоварыПолученные;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Организация		, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Контрагент		, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,,, Истина),"Сделка");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара,"СтатусПолучения");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ТоварыПолученные.ВыполнитьПриход();
		КонецЕсли;

	КонецЕсли;
		
	// Если в реквизите Сделка указан внешний заказ поставщику, то проводится 
	// по регистру ЗаказыПоставщикам
	Если ЗначениеЗаполнено(Сделка) 
	   И (ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")) Тогда

		НаборДвижений = Движения.ЗаказыПоставщикам;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийЗаказыПоставщикам = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийЗаказыПоставщикам.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента			, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Сделка						, "ЗаказПоставщику");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС	, "СтавкаНДС");
        ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку, "СтатусПартии"); 		

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ЗаказыПоставщикам.ВыполнитьРасход();
		КонецЕсли;

		ТаблицаДвижений.Очистить();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Сделка,"ЗаказПоставщику");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,"СтатусПартии");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ЗаказыПоставщикам.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;

	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТоварамЗаказамПокупателей = ТаблицаПоПродукции.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамЗаказамПокупателей.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
		   И  СтрокаТаблицы.ЗаказПокупателя.Заказчик = Ссылка.СкладОрдер) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТоварамЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
		
	Если ТаблицаПоТоварамЗаказамПокупателей.Количество() > 0 Тогда

		ТаблицаПоТоварамЗаказамПокупателей.Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";

		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийРезервы = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийРезервы.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамЗаказамПокупателей, ТаблицаДвижений);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		
		Если Не Отказ Тогда
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
		КонецЕсли;

	КонецЕсли;

	// Товары по регистру "Размещение заказов покупателей"
	ТаблицаПоТоварамРазмещение = ТаблицаПоПродукции.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРазмещение.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРазмещение.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ НЕ ЗначениеЗаполнено(Сделка) ИЛИ (ТипЗнч(Сделка) <> Тип("ДокументСсылка.ЗаказПоставщику")) Тогда
			ТаблицаПоТоварамРазмещение.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаПоТоварамРазмещение.Количество() > 0 Тогда
		
		// По регистру РазмещениеЗаказовПокупателей
		НаборДвижений = Движения.РазмещениеЗаказовПокупателей;

		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРазмещение, ТаблицаДвижений);

		ТаблицаДвижений.ЗаполнитьЗначения(Сделка,"ЗаказПоставщику");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ТоварТара.Товар, "ТоварТара");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		НаборДвижений.мПериод            = Дата;
		
		
		Движения.РазмещениеЗаказовПокупателей.ВыполнитьРасход();

	КонецЕсли;

	// Теперь зарезервируем возвратную тару
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТареЗаказамПокупателей = ТаблицаПоТаре.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТареЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТареЗаказамПокупателей.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
		   И  СтрокаТаблицы.ЗаказПокупателя.Заказчик = Ссылка.СкладОрдер) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТареЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаПоТареЗаказамПокупателей.Количество() > 0 Тогда

		ТаблицаПоТареЗаказамПокупателей.Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";

		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийРезервы = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийРезервы.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТареЗаказамПокупателей, ТаблицаДвижений);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

				
		Если Не Отказ Тогда
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
		КонецЕсли;

	КонецЕсли;
		
	// Тара по регистру "Размещение заказов покупателей"
	ТаблицаПоТареРазмещение = ТаблицаПоТаре.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТареРазмещение.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТареРазмещение.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ НЕ ЗначениеЗаполнено(Сделка) ИЛИ (ТипЗнч(Сделка) <> Тип("ДокументСсылка.ЗаказПоставщику")) Тогда
			ТаблицаПоТареРазмещение.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаПоТареРазмещение.Количество() > 0 Тогда

		// По регистру РазмещениеЗаказовПокупателей
		НаборДвижений = Движения.РазмещениеЗаказовПокупателей;

		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТареРазмещение, ТаблицаДвижений);

		ТаблицаДвижений.ЗаполнитьЗначения(Сделка,"ЗаказПоставщику");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ТоварТара.Тара, "ТоварТара");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		НаборДвижений.мПериод            = Дата;

				
		Движения.РазмещениеЗаказовПокупателей.ВыполнитьРасход();

	КонецЕсли;

	// Погашение внутренних заказов в случае Заказчик = Склад поступления
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить( "СтатусПартии", Перечисления.СтатусыПартийТоваров.Купленный);

	ДопПараметры.Вставить( "РежимПроведения",       РежимПроведения);
	ДопПараметры.Вставить( "ИмяРеквизитаЗаказ",     "ЗаказПокупателя");
	ДопПараметры.Вставить( "ЗаказВШапке",           Истина);
	ДопПараметры.Вставить( "ИмяТабЧасти",           "Продукция");
	
	ТабИсходная = ТаблицаПоПродукции.Скопировать();
	Сч = 0;
	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			  И СтрокаТаблицы.ЗаказПокупателя.Заказчик = Ссылка.СкладОрдер Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.ЗаказПокупателя, 
																   СтрокаТаблицы.Количество, 
																   СтрокаТаблицы.Номенклатура, 
																   СтрокаТаблицы.ХарактеристикаНоменклатуры, 
																   ДопПараметры.СтатусПартии);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;
	
	ТабИсходная.Очистить();
	ТабИсходная = ТаблицаПоТаре.Скопировать();
	Сч = 0;
	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			  И СтрокаТаблицы.ЗаказПокупателя.Заказчик = Ссылка.СкладОрдер Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.ЗаказПокупателя, 
																   СтрокаТаблицы.Количество, 
																   СтрокаТаблицы.Номенклатура, , 
																   Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ДопПараметры.Вставить( "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	ДопПараметры.Вставить( "ИмяТабЧасти",  "ВозвратнаяТара");
	
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;
	
	// Контроль превышения остатков по заказам.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Движения.ТоварыВРезервеНаСкладах.КонтрольПревышенияОбъемаЗаказа(Ссылка, "Продукция", СтруктураШапкиДокумента, Отказ, Заголовок);
    КонецЕсли;

	// МАТЕРИАЛЫ ПО РЕГИСТРУ ТоварыПереданные.
	НаборДвижений = Движения.ТоварыПереданные;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоМатериалам, ТабИмен, "Сумма", "СуммаВзаиморасчетов");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМатериалам, ТаблицаДвижений);
    ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоМатериалам, ТабИмен);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация		, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент		, "Контрагент");
	ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,"Сделка",,Истина), "Сделка");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку, "СтатусПередачи");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	// Проверка остатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
    	НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ИспользованныеМатериалы", СтруктураШапкиДокумента, Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку, Отказ, Заголовок);
	КонецЕсли;	
	
	Если Не Отказ Тогда
		Движения.ТоварыПереданные.ВыполнитьРасход();
	КонецЕсли;
	
	// Выпуск продукции
	
	// ПРОДУКЦИЯ ПО РЕГИСТРУ ВыпускПродукцииУслуг.
	НаборДвижений = Движения.ВыпускПродукцииУслуг;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "ЗаказПокупателя", "Заказ");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "СуммаПлановаяУпрБезНДС", "ПлановаяСтоимость");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "ПлановыйНДСУпр", "ПлановыйНДС");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "Номенклатура", "Продукция");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "ХарактеристикаНоменклатуры", "ХарактеристикаПродукции");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "Склад", "СкладПолучатель");
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, ТаблицаДвижений);
	
	ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоПродукции, ТабИмен);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументВыпуска");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксНаСклад, "КодОперации");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.НоменклатурнаяГруппа, "НоменклатурнаяГруппа");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Подразделение");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Движения.ВыпускПродукцииУслуг.ДобавитьДвижение();
	
	
	// Спишем из НЗП плановую стоимость и плановый НДС по выпуску продукции
	
	НаборДвижений = Движения.НезавершенноеПроизводство;
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "СуммаПлановаяУпрБезНДС", "Стоимость");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "ПлановыйНДСУпр", "НДС");
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоПродукции, ТабИмен, "Номенклатура", "Продукция");
	
	ТаблицаПоПродукции.Колонки.Количество.Имя = "ПродукцияКоличество";	
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, ТаблицаДвижений);
	
	ТаблицаПоПродукции.Колонки.ПродукцияКоличество.Имя = "Количество";	

	ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоПродукции, ТабИмен);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.НоменклатурнаяГруппа, "НоменклатурнаяГруппа");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Подразделение");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеНЗПРегламент, "КодОперации");	
	
	Движения.НезавершенноеПроизводство.ВыполнитьРасход();
	Движения.НезавершенноеПроизводство.Записать(Ложь); // при списании материалов будут еще движения прихода в НЗП
	
	
	// Услуги
	
	// УСЛУГИ в НЗП
	
	НаборДвижений = Движения.НезавершенноеПроизводство;
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоУслугам, ТабИмен, "НДСУпр", "НДС");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаДвижений);
	ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоУслугам, ТабИмен);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.НоменклатурнаяГруппа, "НоменклатурнаяГруппа");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийНезавершенноеПроизводство.УслугиКонтрагентаНаПроизводство, "КодОперации");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Движения.НезавершенноеПроизводство.ВыполнитьПриход();
	Движения.НезавершенноеПроизводство.Записать(Ложь); // при списании материалов будут еще движения прихода в НЗП
	
	// УСЛУГИ по регистру Закупки
	НаборДвижений = Движения.Закупки;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоУслугам, ТабИмен,   "НДСУпр", "НДС");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
		// В этом случае таблицы документа обрабатываются особым образом
		ТаблицаДвиженийУслуги       = ТаблицаДвижений.Скопировать();
			
		УправлениеПроектами.ОтразитьДвиженияПоПроектам(ТаблицаПоУслугам,       ТаблицаДвиженийУслуги,       Проект, Дата, "Закупки");
			
		// Вставляем уже подготовленные таблицы движений
		ТаблицыДанныхДокумента = Новый Структура;
		ТаблицыДанныхДокумента.Вставить("ТаблицаПоУслугам",      ТаблицаДвиженийУслуги);
	Иначе
						
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоУслугам",      ТаблицаПоУслугам);

		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.Закупки, СтруктТаблицДокумента);
						
	КонецЕсли;
	
	ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоУслугам, ТабИмен);
	
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",       Перечисления.СтатусыПартийТоваров.Купленный);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументЗакупки",    Ссылка);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Подразделение",      Подразделение);
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка);
	КонецЕсли;

	ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.Закупки, Неопределено, ТаблицыДанныхДокумента, Дата);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;

	УправлениеВзаиморасчетами.ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаПоВзаиморасчетам, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

// Проводит табличные части "Продукция" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоПродукции,ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок, СтруктураШапкиДокумента) 

	Если НЕ ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// Определим код операции движений по регистру партий
	КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ВыпускПоОперацииСтоимость;
	
	// ПО РЕГИСТРУ ТоварыНаСкладах.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда

		НаборДвижений = Движения.ТоварыНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, 	 ТаблицаДвижений);
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВозвращеннымМатериалам,  ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ТоварыНаСкладах.ВыполнитьПриход();
		КонецЕсли;
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицаДвижений, "Склад", СклаОтправитель);

		// Выполняем расход.
		Если Не Отказ Тогда
		    Движения.ТоварыНаСкладах.ВыполнитьРасход();
		КонецЕсли;

	Иначе // Приход по ордеру

		// ТОВАРЫ
		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыКПолучению = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыКПолучению.Скопировать();

		// Заполним таблицу движений по товарам.
		ТаблицаКПолучению = ТаблицаПоПродукции.Скопировать();
		ТаблицаКПолучению.Колонки.Добавить("ДокументРезерва");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКПолучению, ТаблицаДвижений);
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВозвращеннымМатериалам,  ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОрдер, "ДокументПолучения");

		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Продукция", СтруктураШапкиДокумента, Отказ, Заголовок);
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвращенныеМатериалы", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движения.ТоварыКПолучениюНаСклады.ВыполнитьРасход();
		КонецЕсли;
			
	КонецЕсли;
	
	// ПРОДУКЦИЯ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	НаборДвижений = Движения.ПартииТоваровНаСкладах;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвиженийПартииТоваровНаСкладах = НаборДвижений.ВыгрузитьКолонки();
	ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();

	ТаблицаПоПродукции.Колонки.ПлановыйНДСУпр.Имя = "НДС";
	ТаблицаПоПродукции.Колонки.Стоимость.Имя = "Сумма";
    ТаблицаПоПродукции.Колонки.СуммаПлановаяУпрБезНДС.Имя = "Стоимость";
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, ТаблицаДвижений);

	ТаблицаПоПродукции.Колонки.НДС.Имя = "ПлановыйНДСУпр";
	ТаблицаПоПродукции.Колонки.Стоимость.Имя = "СуммаПлановаяУпрБезНДС";
	ТаблицаПоПродукции.Колонки.Сумма.Имя = "Стоимость"; 	
	
	
	// Недостающие поля.
	ЗаполнитьПоляПартииТоваровНаСкладахПоТоварамУпр(ТаблицаПоПродукции, ТаблицаДвижений,
													Перечисления.СтатусыПартийТоваров.Продукция, СтруктураШапкиДокумента);
	
	// Код операции
	ТаблицаДвижений.ЗаполнитьЗначения(КодОперацииПартииТоваров, "КодОперации");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
	КонецЕсли;
	
		
	// При поступлении по ордеру нужно сторнировать партию ордера
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда

		ТаблицаДвижений.Очистить();
		
		ТаблицаПартииПоОрдерам = ТаблицаПоПродукции.Скопировать();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВозвращеннымМатериалам, ТаблицаПартииПоОрдерам);

		ТаблицаПартииПоОрдерам.Колонки.Добавить("ДокументОприходования");
		
		Сч = 0;
		Пока Сч < ТаблицаПартииПоОрдерам.Количество() Цикл
			СтрокаТаблицы = ТаблицаПартииПоОрдерам.Получить(Сч);
			// Документ оприходования - приходный ордер
			СтрокаТаблицы.ДокументОприходования = СтруктураШапкиДокумента.СкладОрдер;
				
			// Если партионный учет по сериям не ведется, то надо очистить серию
			Если  НЕ СтрокаТаблицы.ВестиПартионныйУчетПоСериям Тогда
				СтрокаТаблицы.СерияНоменклатуры = Неопределено;
			КонецЕсли;
				
			Сч = Сч + 1;
		КонецЦикла;
		
		Если ТаблицаПартииПоОрдерам.Количество() > 0 Тогда

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПартииПоОрдерам, ТаблицаДвижений);
			
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ПоОрдеру, "СтатусПартии");
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
			

			Для каждого Строка Из ТаблицаДвижений Цикл
				Строка.Количество = - Строка.Количество;
			КонецЦикла;

			ТаблицаДвижений.ЗаполнитьЗначения(0, "Стоимость");
			ТаблицаДвижений.ЗаполнитьЗначения(0, "НДС");
		
			// Код операции - поступление по ордеру (сторно)
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПоступлениеПоОрдеру, "КодОперации");

			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда

		НаборДвижений = Движения.ТоварыНаСкладах;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ТоварыНаСкладах.ВыполнитьПриход();
		КонецЕсли;

	Иначе // по ордеру

		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;
		ТаблицаДвиженийТоварыКПолучению = НаборДвижений.ВыгрузитьКолонки();

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = ТаблицаДвиженийТоварыКПолучению.Скопировать();

		// Заполним таблицу движений.
		ТаблицаКПолучению = ТаблицаПоТаре.Скопировать();
		ТаблицаКПолучению.Колонки.Добавить("ДокументРезерва");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКПолучению, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движения.ТоварыКПолучениюНаСклады.ВыполнитьРасход();
		КонецЕсли;

	КонецЕсли;

	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.

	НаборДвижений = Движения.ПартииТоваровНаСкладах;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

	// Недостающие поля.
	ЗаполнитьПоляПартииТоваровНаСкладахПоТоварамУпр(ТаблицаПоТаре, ТаблицаДвижений, 
													Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, СтруктураШапкиДокумента);
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	// Код операции
	ТаблицаДвижений.ЗаполнитьЗначения(КодОперацииПартииТоваров, "КодОперации");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
	КонецЕсли;

	// При поступлении по ордеру нужно сторнировать партию ордера
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда

		ТаблицаДвижений.Очистить();
		
		ТаблицаПартииПоОрдерам = ТаблицаПоТаре.Скопировать();
		ТаблицаПартииПоОрдерам.Колонки.Добавить("ДокументОприходования");
		
		// Документ оприходования - приходный ордрер
		Для каждого СтрокаТаблицы из ТаблицаПартииПоОрдерам Цикл
			СтрокаТаблицы.ДокументОприходования = СтруктураШапкиДокумента.СкладОрдер;
		КонецЦикла;
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПартииПоОрдерам, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ПоОрдеру, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		Для каждого Строка Из ТаблицаДвижений Цикл
			Строка.Количество = - Строка.Количество;
		КонецЦикла;

		ТаблицаДвижений.ЗаполнитьЗначения(0, "Стоимость");
		ТаблицаДвижений.ЗаполнитьЗначения(0, "НДС");
		
		// Код операции - поступление по ордеру (сторно)
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПоступлениеПоОрдеру, "КодОперации");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартийУпр()

// Заполняет в таблице движений по регитстру ПартииТоваровНаСкладах нестандартные поля.
//
// Параметры:
//  ТаблицаТЧ       - таблица значений, соответствующая табличной части документа
//  ТаблицаДвижений - таблица значений, соответствующая набору записей регистра,
//  СтатусПартии    - значение перечисления статусов партий. 
//
Процедура ЗаполнитьПоляПартииТоваровНаСкладахПоТоварамУпр(ТаблицаТЧ, ТаблицаДвижений, СтатусПартии, СтруктураШапкиДокумента)

	Для каждого СтрокаДвижений Из ТаблицаДвижений Цикл

		Если Не мПорядокСписанияПартий.Упр = Перечисления.СпособыОценки.ПоСредней Тогда
			СтрокаДвижений.ДокументОприходования = Ссылка;
		КонецЕсли;
		
		СтрокаТЧ = ТаблицаТЧ.Найти(СтрокаДвижений.НомерСтроки, "НомерСтроки");
		
		СтрокаДвижений.СтатусПартии = СтатусПартии;

		// Заказ заполняем если его указали в документе и по договору ведется обособленный учет товаров по заказам.
		ОбособленныйУчет = СтрокаТЧ.ОбособленныйУчетТоваровПоЗаказамПокупателей;
		СтрокаДвижений.Заказ = ?(ОбособленныйУчет <> NULL И ОбособленныйУчет 
								И Не (НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗаказПокупателя)), СтрокаТЧ.ЗаказПокупателя, Неопределено);
				
		Если НЕ СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
			СтрокаДвижений.Склад = Неопределено;
		КонецЕсли;
			
		// Если партионный учет по сериям не ведется, то надо очистить серию
		Если  СтатусПартии <> Перечисления.СтатусыПартийТоваров.ВозвратнаяТара И НЕ СтрокаТЧ.ВестиПартионныйУчетПоСериям Тогда
			СтрокаДвижений.СерияНоменклатуры = Неопределено;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоляПартииТоваровНаСкладах()

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок) 
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Инд = 0;
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить корректировку списания
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		
		// ПО РЕГИСТРУ СписанныеТовары: формируем запись с указанием приходного ордера, которая будет обрабатываться при списании
		НаборДвижений = Движения.СписанныеТовары;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		НоваяСтрока = ТаблицаДвижений.Добавить();
		НоваяСтрока.ПоступлениеПриходныйОрдер = СкладОрдер;

		// Недостающие поля.
		Для каждого Строка Из ТаблицаДвижений Цикл
			Инд = Инд+1;
			Строка.НомерСтрокиДокумента = Инд;
		КонецЦикла;

		ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");  		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.СписанныеТовары.ВыполнитьДвижения();
		КонецЕсли;

	КонецЕсли;
	
	// ИспользованныеМатериалы ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ТаблицаПоМатериалам.Колонки.ЗаказПокупателя.Имя = "ЗаказСписания";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМатериалам, ТаблицаДвижений);
	ТаблицаПоМатериалам.Колонки.ЗаказСписания.Имя = "ЗаказПокупателя";
	
	// Недостающие поля.
	Для каждого Строка Из ТаблицаДвижений Цикл

		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;

	КонецЦикла; 

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	ТаблицаДвижений.ЗаполнитьЗначения(?(ЗначениеЗаполнено(Сделка), Сделка, Неопределено), "ЗаказПартии");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку,"ДопустимыйСтатусПередачи");
   	Если ТаблицаПоВозвращеннымМатериалам.Количество() = 0 Тогда 
	    ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.СписаниеПартийПереданныхВПроизводство, "КодОперацииПартииТоваров");
	КонецЕсли; 	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку, "ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,    "ДопустимыйСтатус2");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция,    "ДопустимыйСтатус3");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(НоменклатурнаяГруппа, "НоменклатурнаяГруппа");

	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	
	// Данные для заполнения отчетов комитенту
	ТаблицаДвижений.ЗаполнитьЗначения(ВалютаДокумента, "ВалютаДокумента");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КурсДокумента, "КурсДокумента");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.КратностьДокумента, "КратностьДокумента");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры										

Процедура ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре, Отказ, Заголовок, СтруктураШапкиДокумента) 
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// Продукция ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ТаблицаПоПродукции.Колонки.Счет.Имя = "СчетУчетаБУ";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПродукции, ТаблицаДвижений);
	ТаблицаПоПродукции.Колонки.СчетУчетаБУ.Имя = "Счет";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
    ТаблицаПоВозвращеннымМатериалам.Колонки.СчетУчетаБУ.Имя = "Счет";   	
	ТаблицаПоВозвращеннымМатериалам.Колонки.СчетПередачиБУ.Имя = "СчетУчетаБУ";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВозвращеннымМатериалам, ТаблицаДвижений);
	ТаблицаПоВозвращеннымМатериалам.Колонки.СчетУчетаБУ.Имя = "СчетПередачиБУ"; 
	ТаблицаПоВозвращеннымМатериалам.Колонки.Счет.Имя = "СчетУчетаБУ";

	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
			
	//// Материалы ПО РЕГИСТРУ ТоварыОрганизаций.
	//
	//ТаблицаДвижений = НаборДвижений.Выгрузить();
	//ТаблицаДвижений.Очистить();

	//// Заполним таблицу движений.
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМатериалам, ТаблицаДвижений);

	//// Недостающие поля.
	//ТаблицаДвижений.ЗаполнитьЗначения(Организация,"Организация");
	//ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Комиссионер");
	//ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	//
	//Если Не ВестиУчетПоДопРазрезамРегл Тогда
	//	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
	//	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
	//	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	//КонецЕсли;
	//	
	//Если Не ВестиСкладскойУчетБУ Тогда
	//	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	//КонецЕсли;
	//
	//НаборДвижений.мПериод          = Дата;
	//НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	//// Проверка осатков при оперативном проведении.
	//Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
	//	НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ИспользованныеМатериалы", СтруктураШапкиДокумента, Отказ, Заголовок);
	//КонецЕсли;

	//Если Не Отказ Тогда
	//	Движения.ТоварыОрганизаций.ВыполнитьРасход();
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДвижениеПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоПродукции, 
									ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоТаре, 
									ТаблицаПоВторомуСобытиюНал,
									Отказ, Заголовок)
		
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ПартионныйУчетБУ = УправлениеЗапасами.ВедетсяПартионныйУчет(ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Бух"));
	ПроводкиБУ = Движения.Хозрасчетный;
	
	// Проводки по взаиморасчетам - авансы
	ТаблицыДокумента = Новый Структура();
	ТаблицыДокумента.Вставить("ТаблицаПоУслугам", ТаблицаПоУслугам);

	Если  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда  
		
	   ВсегоКЗачету = СуммаДокумента;
		
	   ТаблицаСделок = ДокументыРасчетовСКонтрагентом.Выгрузить(,"ДокументРасчетовСКонтрагентом,Сумма,ДатаОплаты,ВозвратнаяТара");
	   ТаблицаСделок.Свернуть("ДокументРасчетовСКонтрагентом,ДатаОплаты,ВозвратнаяТара", "Сумма");
	   ТаблицаСделок.Сортировать("ДатаОплаты");
	   
	   Для каждого СтрокаПредоплаты Из ТаблицаСделок Цикл
			
			Если СтрокаПредоплаты.ВозвратнаяТара Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаПредоплаты   = СтрокаПредоплаты.Сумма;
			РасчетныйДокумент = СтрокаПредоплаты.ДокументРасчетовСКонтрагентом;
			
			//Если СуммаПредоплаты > ВсегоКЗачету Тогда
			//
			//	Сообщить(Локализация.СтрШаблон1("Сумма предоплаты по документу ¤1¤, указанная на закладке ""Предоплата"" (¤2¤),
			//								   |    превышает возможную сумму предоплаты на ¤3¤ (¤4¤) (с учетом предыдущих документов предоплаты)",
			//								   СтрокаПредоплаты.ДокументРасчетовСКонтрагентом,
			//								   СуммаПредоплаты,
			//								   Мин(СуммаПредоплаты,СуммаПредоплаты - ВсегоКЗачету),
			//								   ВалютаДокумента));
			//
			//КонецЕсли;
			
			Если ВсегоКЗачету > 0 Тогда
			
				// зачтем аванс в размере указанной суммы на закладке предоплата
				ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ"
																	   ,,, ,, РасчетныйДокумент, Мин(ВсегоКЗачету,СуммаПредоплаты));	
							
			КонецЕсли;
																   
			ВсегоКЗачету = ВсегоКЗачету - ТаблицаАвансов.Итог("СуммаВал");
			
		КонецЦикла;
		
		
	Иначе
		// обычный зачет аванса и корректировка сумм при расчетах в валюте
		ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ");
				
	КонецЕсли;
		
	// Проводки по взаиморасчетам за тару - авансы
	ТаблицыДокумента = Новый Структура();
	ТаблицыДокумента.Вставить("ТаблицаПоТаре",ТаблицаПоТаре);
    	
	Если  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда  
		
	   ВсегоКЗачету = СуммаДокумента;
		
	   ТаблицаСделок = ДокументыРасчетовСКонтрагентом.Выгрузить(,"ДокументРасчетовСКонтрагентом,Сумма,ДатаОплаты,ВозвратнаяТара");
	   ТаблицаСделок.Свернуть("ДокументРасчетовСКонтрагентом,ДатаОплаты,ВозвратнаяТара", "Сумма");
	   ТаблицаСделок.Сортировать("ДатаОплаты");
	   
	   Для каждого СтрокаПредоплаты Из ТаблицаСделок Цикл
			
			Если НЕ СтрокаПредоплаты.ВозвратнаяТара Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаПредоплаты   = СтрокаПредоплаты.Сумма;
			РасчетныйДокумент = СтрокаПредоплаты.ДокументРасчетовСКонтрагентом;
			
			//Если СуммаПредоплаты > ВсегоКЗачету Тогда
			//
			//	Сообщить(Локализация.СтрШаблон1("Сумма предоплаты по документу ¤1¤, указанная на закладке ""Предоплата"" (¤2¤),
			//								   |    превышает возможную сумму предоплаты на ¤3¤ (¤4¤) (с учетом предыдущих документов предоплаты)",
			//								   СтрокаПредоплаты.ДокументРасчетовСКонтрагентом,
			//								   СуммаПредоплаты,
			//								   Мин(СуммаПредоплаты,СуммаПредоплаты - ВсегоКЗачету),
			//								   ВалютаДокумента));
			//
			//КонецЕсли;
			
			Если ВсегоКЗачету > 0 Тогда
			
				// зачтем аванс в размере указанной суммы на закладке предоплата
				ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ"
																	   ,,, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТареПоАвансам
																	   , РасчетныйДокумент, Мин(ВсегоКЗачету,СуммаПредоплаты));	
			КонецЕсли;
																   
			ВсегоКЗачету = ВсегоКЗачету - ТаблицаАвансов.Итог("СуммаВал");
			
		КонецЦикла;
		
		
	Иначе
		// обычный зачет аванса и корректировка сумм при расчетах в валюте
		ТаблицаАвансовПоТаре = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок,"АВ",,,СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТареПоАвансам);
		
	КонецЕсли;
	
	МассивРасчетныхДокументов = Неопределено;
	Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		МассивРасчетныхДокументов = ДокументыРасчетовСКонтрагентом.ВыгрузитьКолонку("ДокументРасчетовСКонтрагентом");
		УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивРасчетныхДокументов);
	КонецЕсли;
	
	ДвиженияПоТабличнойЧастиПродукцияРегл(ТаблицаПоПродукции, СтруктураШапкиДокумента);
	ДвиженияПоТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, ТаблицаПоВторомуСобытиюНал, МассивРасчетныхДокументов, СтруктураШапкиДокумента);
		
	ЕстьНалоговыйУчетПартий = (СтруктураШапкиДокумента.ЕстьНДС ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль);
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоМатериалам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ);
		
	Если ТаблицаПоПродукции.Количество() <> 0 Или ТаблицаПоУслугам.Количество() <> 0 Тогда
		ДвиженияВыпускПродукцииУслугБУ.ДобавитьДвижение();	
	КонецЕсли;
		

	Для Каждого СтрокаТаблицы Из ТаблицаПоТаре Цикл
			
		// Бухгалтерский учет
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период                  = Дата;
		Проводка.Организация             = СтруктураШапкиДокумента.Организация;
			
		Проводка.Содержание              = "Возвратная тара";
		Проводка.Сумма                   = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			
		Проводка.СчетДт                  = СтрокаТаблицы.СчетУчетаБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
			
		Если (ПартионныйУчетБУ) Тогда 
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", Ссылка, Истина, Заголовок);
		КонецЕсли;
			
		Проводка.КоличествоДт            = СтрокаТаблицы.Количество;
						
		Проводка.СчетКт                  = СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина, Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.СделкаБУ);
			
		Если СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре.Валютный Тогда
			Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.СуммаБезНДСВал;
		КонецЕсли;
		
		Проводка.НалоговоеНазначениеДт   = СтрокаТаблицы.НалоговоеНазначение;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И
			СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
			СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			
			Проводка.СуммаНУДт = НалоговыйУчет.УчестьСуммуАвансаДо01042011(СтруктураШапкиДокумента, СтрокаТаблицы.ПроводкиСуммаБезНДСРегл);
			
		КонецЕсли;
					
	КонецЦикла; // Проводки по таре
		
КонецПроцедуры

// Процедура формирует движения регистров по табличной части Продукция
////
Процедура ДвиженияПоТабличнойЧастиПродукцияРегл(ТаблицаПоПродукции, СтруктураШапкиДокумента)
	
	Если Продукция.Количество() = 0 И Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОперацияБУ = Движения["Хозрасчетный"];
	ДвиженияВыпускПродукцииУслугБУ = Движения["ВыпускПродукцииУслугБухгалтерскийУчет"];
	ТаблицаДвиженийВыпускБУ        = ДвиженияВыпускПродукцииУслугБУ.Выгрузить();
		
	Для Каждого Строка Из ТаблицаПоПродукции Цикл
		
		ДвиженияПоВыпускуПродукцииОтходовРегл(СтруктураШапкиДокумента, Строка, ОперацияБУ, ТаблицаДвиженийВыпускБУ, Истина);
				
	КонецЦикла;
	
	ДвиженияВыпускПродукцииУслугБУ.мПериод = Дата;
	ДвиженияВыпускПродукцииУслугБУ.мТаблицаДвижений = ТаблицаДвиженийВыпускБУ;
		
КонецПроцедуры // ДвиженияПоТабличнойЧастиПродукцияРегл()

// Процедура формирует движения регистров по табличной части Услуги
////
Процедура ДвиженияПоТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, ТаблицаПоВторомуСобытиюНал, МассивРасчетныхДокументов, СтруктураШапкиДокумента)
	
	Если ТаблицаПоУслугам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроводкиБУ = Движения["Хозрасчетный"];
	
	ДатаДока = СтруктураШапкиДокумента.Дата;
	
	Для каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = Дата;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание   = "Услуги";
		Проводка.Сумма        = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
		
		Проводка.СчетДт       = СтрокаТаблицы.СчетЗатрат;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.Субконто3);
		
		Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",СтруктураШапкиДокумента.Контрагент, Истина, Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",СтруктураШапкиДокумента.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",СтрокаТаблицы.СделкаБУ);
		
		Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И
			СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
			СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат  <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			
			Проводка.СуммаНУДт = НалоговыйУчет.УчестьСуммуАвансаДо01042011(СтруктураШапкиДокумента, СтрокаТаблицы.ПроводкиСуммаБезНДСРегл);
			
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.Валютный Тогда
			Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаБезНДСВал;
		КонецЕсли;
		
		// Проводка по НДС
		Если СтруктураШапкиДокумента.УчитыватьНДС И СтрокаТаблицы.ПроводкиСуммаНДСРегл > 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период       = Дата;
			Проводка.Организация  = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма        = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			Проводка.Содержание   = "НДС - налоговый кредит (услуги)";
			
			Проводка.СчетДт       = СтруктураШапкиДокумента.СчетУчетаНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.СделкаНУ);
			
			Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",СтруктураШапкиДокумента.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами",СтрокаТаблицы.СделкаБУ);
			Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаНДСВал;
			КонецЕсли;
			
			НалоговыйУчет.РазбитьПроводкуПоНДСНаПервоеВтороеСобытие(ТаблицаПоВторомуСобытиюНал, ПроводкиБУ, Проводка, 
													   "Дт", СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный, 
													  СтруктураШапкиДокумента.ДоговорКонтрагента, 
													  СтрокаТаблицы.СделкаНУ, МассивРасчетныхДокументов,
													  Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление,
													  СтрокаТаблицы.СтавкаНДС, СтрокаТаблицы.ДляХозяйственнойДеятельности, СтрокаТаблицы.ВидДеятельностиНДС, ?(Дата < '20080101', Ложь, СтрокаТаблицы.Амортизируется),
													  СтрокаТаблицы.ПроводкиСуммаНДСВал);
			
		КонецЕсли; // Проводка по НДС
				
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоТабличнойЧастиУслуги()

// Процедура формирует движения по выпуску продукции.
//
Процедура ДвиженияПоВыпускуПродукцииОтходовРегл(СтруктураШапкиДокумента, Строка, Операция, ТаблицаДвиженийВыпуск = Неопределено, БухгалтерскийУчет = Истина)
	
	Если БухгалтерскийУчет Тогда
		Счет                = Строка.Счет;
		СчетЗатратТекущий   = СчетЗатрат;
		УчетнаяПолитика     = мУчетнаяПолитикаБух;
		
		// Сформируем проводку.
		Если НЕ ЗначениеЗаполнено(Счет)
			ИЛИ НЕ ЗначениеЗаполнено(СчетЗатратТекущий) Тогда
			Возврат;
		КонецЕсли;
		
		НоваяПроводка = Операция.Добавить();
		
		НоваяПроводка.Организация = Организация;
		НоваяПроводка.Период      = Дата;
		
		НоваяПроводка.СчетДт = Счет;
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Номенклатура", Строка.Номенклатура);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеПозиции", Строка.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Склады",       Строка.Склад);
		
		// Если способ оценки ФИФО или ЛИФО и на счете ведется партионный учет,
		// то в проводке указываем в качестве партии текущий документ.
		Если УправлениеЗапасами.ВедетсяПартионныйУчет(УчетнаяПолитика) Тогда
			ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Партии",       Ссылка);
		КонецЕсли; 
		
		НоваяПроводка.Содержание = "Выпуск продукции";
		
		НоваяПроводка.СчетКт = СчетЗатратТекущий;
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        ПодразделениеОрганизации);
		ОбщегоНазначения.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "НоменклатурныеГруппы", НоменклатурнаяГруппа);
		
		НоваяПроводка.КоличествоДт = ?(НоваяПроводка.СчетДТ.Количественный, Строка.Количество, 0);
		НоваяПроводка.Сумма        = Строка.СуммаПлановаяРегл;
		
		НоваяПроводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
		НоваяПроводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
			И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			НоваяПроводка.СуммаНУДт = Строка.СуммаПлановаяРегл;
			НоваяПроводка.СуммаНУКт = Строка.СуммаПлановаяРегл;
		КонецЕсли;
		
		// Отражения выпуска в регистре накопления ВыпускПродукцииУслуг
		СтрокаДвижения = ТаблицаДвиженийВыпуск.Добавить();
		СтрокаДвижения.Организация           = Организация;
		СтрокаДвижения.Продукция             = Строка.Номенклатура;
		СтрокаДвижения.СчетЗатрат            = СчетЗатрат;
		СтрокаДвижения.Подразделение         = ПодразделениеОрганизации;
		СтрокаДвижения.НоменклатурнаяГруппа  = НоменклатурнаяГруппа;
		СтрокаДвижения.НалоговоеНазначениеДоходовИЗатрат  = Строка.НалоговоеНазначение;
		СтрокаДвижения.СчетСписания          = Счет;
		
		Если Счет.ВидыСубконто.Количество() > 0 Тогда
			СтрокаДвижения.СубконтоСписания1 = НоваяПроводка.СубконтоДт[НоваяПроводка.СчетДт.ВидыСубконто[0].ВидСубконто];
		КонецЕсли; 
		
		Если Счет.ВидыСубконто.Количество() > 1 Тогда
			СтрокаДвижения.СубконтоСписания2 = НоваяПроводка.СубконтоДт[НоваяПроводка.СчетДт.ВидыСубконто[1].ВидСубконто];
		КонецЕсли;
		
		Если Счет.ВидыСубконто.Количество() > 2 Тогда
			СтрокаДвижения.СубконтоСписания3 = НоваяПроводка.СубконтоДт[НоваяПроводка.СчетДт.ВидыСубконто[2].ВидСубконто];
		КонецЕсли;
		
		Если Счет.ВидыСубконто.Количество() > 3 Тогда
			СтрокаДвижения.СубконтоСписания4 = НоваяПроводка.СубконтоДт[НоваяПроводка.СчетДт.ВидыСубконто[3].ВидСубконто];
		КонецЕсли;
		
		СтрокаДвижения.Количество = Строка.Количество;
		СтрокаДвижения.ПлановаяСтоимость = Строка.СуммаПлановаяРегл;

	КонецЕсли;	
	
КонецПроцедуры // ДвиженияПоВыпускуПродукцииОтходовРегл()

Функция ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоТаре, Отказ)
	
	ТаблицаПоВторомуСобытиюНал = НалоговыйУчет.СоздатьСтруктуруТаблицыНалоговыхСумм();
	
	Если Не ОтражатьВБухгалтерскомУчете Тогда
		// Если не нужно отражать в налоговом учете, тогда не отражаем и в подсистеме учета НДС
		Возврат ТаблицаПоВторомуСобытиюНал;
	КонецЕсли;
	
	Если Не СтруктураШапкиДокумента.ЕстьНДС Тогда
		// Если не нужно отражать в налоговом учете, тогда не отражаем и в подсистеме учета НДС
		Возврат ТаблицаПоВторомуСобытиюНал;
	КонецЕсли;
	
	
	
	
	//Отразим Продажи в регистре ПродажиНалоговыйУчет
	НаборДвижений = Движения.ПриобретенияНалоговыйУчет;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	ТаблицаДвиженийТара = ТаблицаДвижений.Скопировать();
		
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	ТаблицаКопия.Свернуть("СделкаНУ, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС, Амортизируется","СуммаБезНДСВал, СуммаБезНДСВал, СуммаСНДСВал, СуммаНДСВал, СуммаНДСВалИсходный");
	ТаблицаПриобретений = ТаблицаКопия.Скопировать();
	
	ТаблицаПриобретений.Колонки.Добавить("СуммаНДСПропорционально");
	Для каждого СтрокаКопии Из ТаблицаПриобретений Цикл
		Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
			СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
			СтрокаКопии.СуммаНДСВал = СтрокаКопии.СуммаНДСВалИсходный;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПриобретений.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаПриобретений.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";
	ТаблицаПриобретений.Колонки.СделкаНУ.Имя   = "Сделка";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика, "Событие");
		
	Если СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// очистим налоговые реквизиты
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), 			"СтавкаНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Ложь, 										   	"ДляХозяйственнойДеятельности");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПустаяСсылка(), 	"ВидДеятельностиНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Ложь,												"Амортизируется");
		ТаблицаДвижений.ЗаполнитьЗначения(0, 												"СуммаНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(0, 												"СуммаНДСПропорционально");
		
	Иначе		
		
		Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// взаиморасчеты по договору по расчетным документам - необходимо заполнить в регистре реквизит РасчетныйДокумент
			НалоговыйУчет.ЗаполнитьДокументыРасчета(ТаблицаДвижений, ДокументыРасчетовСКонтрагентом.Выгрузить());
		КонецЕсли;			
		
	КонецЕсли;
	
	//ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	ТаблицаКопия.Свернуть("СделкаНУ, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС","СуммаСНДСВал, СуммаНДСВал");
	ТаблицаКопия.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";
	ТаблицаКопия.Колонки.СделкаНУ.Имя   = "Сделка";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика, "Событие");
    ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина, "ВозвратнаяТара");
	
	Если СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// очистим налоговые реквизиты
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), 			"СтавкаНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Ложь, 										   	"ДляХозяйственнойДеятельности");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПустаяСсылка(), 	"ВидДеятельностиНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Ложь,												"Амортизируется");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(0, 												"СуммаНДС");
		
	Иначе		
				
		Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// взаиморасчеты по договору по расчетным документам - необходимо заполнить в регистре реквизит РасчетныйДокумент
			НалоговыйУчет.ЗаполнитьДокументыРасчета(ТаблицаДвиженийТара, ДокументыРасчетовСКонтрагентом.Выгрузить());
		КонецЕсли;			
        		
	КонецЕсли;		
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;
	
	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;    
		
	
	// Движения по регистру Ожидаемый и подтвержденный НДС приобретений
	Если НЕ СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		// Движения формируются по данным расчета "первого события" 
	   НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаУпрощенныйНалоговыйУчет(ЭтотОбъект, ТаблицаПоВторомуСобытиюНал);
	
	ИначеЕсли  НЕ СтруктураШапкиДокумента.Внешнеэкономический Тогда
		// движения формируются по методу "по отгрузке"

		НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвиженийТара = ТаблицаДвижений.Скопировать();
			
		// УСЛУГИ
		ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
		ТаблицаКопия.Свернуть("СделкаНУ,СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал, СуммаНДСВалИсходный");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПриобретений);
		
		Для каждого СтрокаКопии Из ТаблицаПриобретений Цикл
			Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				СуммаСНДСВал = СтрокаКопии.СуммаБезНДСВал  + СтрокаКопии.СуммаНДСВал;
				СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
				СтрокаКопии.СуммаНДСВал 			= СтрокаКопии.СуммаНДСВалИсходный;
				СтрокаКопии.СуммаБезНДСВал 			= СуммаСНДСВал - СтрокаКопии.СуммаНДСВал;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПриобретений.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, 			"СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС , 	"КодОперации");

		// ТАРА
		ТаблицаКопия = ТаблицаПоТаре.Скопировать();
		ТаблицаКопия.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС","СуммаБезНДСВал, СуммаНДСВал");
		ТаблицаКопия.Колонки.СуммаБезНДСВал.Имя  = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСВал.Имя 	 = "СуммаНДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина            , "ВозвратнаяТара");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, 			"СобытиеНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС   , "КодОперации");
			
		Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьПриход();
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
			
		КонецЕсли;
		
		Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
		
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьПриход();
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаПоВторомуСобытиюНал;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения"
////
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок);
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                    , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                             , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                             , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Внешнеэкономический"                     , "Внешнеэкономический");	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"					   , "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"              , "ВидОперации"                             , "СделкаВидОперации");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "СписыватьПартииПриПроведенииДокументов"  , "СписыватьПартииПриПроведенииДокументов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВестиПартионныйУчетПоСкладам"            , "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентом"	 , "ВестиПоДокументамРасчетовСКонтрагентом");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентомРегл", "ВестиПоДокументамРасчетовСКонтрагентомРегл");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам",                     "ВедениеУчетаПоПроектам");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "НеОтноситьНаЗатратыПоНУ"   , "НеОтноситьНаЗатратыПоНУ");
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "ВидСклада"                               , "ВидСклада");
	Иначе
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "Склад"                                   , "СкладПриходногоОрдера");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "Склад.ВидСклада"                         , "ВидСклада");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "Организация"	                         , "ОрганизацияДокументаПолучения");
	КонецЕсли;
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "БезПраваПродажи"                   , "БезПраваПродажи");

	// Если сделка - Заказ поставщику, то надо цену для проведения пересчитать в валюту заказа.
	Если ЗначениеЗаполнено(Сделка) 
	   И ТипЗнч(Сделка) <> Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "ВалютаДокумента"                       , "ВалютаЗаказа");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КурсВзаиморасчетов"                    , "КурсВзаиморасчетовЗаказа");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КратностьВзаиморасчетов"               , "КратностьВзаиморасчетовЗаказа");
	КонецЕсли;
	
	// Дополним полями, нужными для регл. и упр. учета
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "ВалютаУправленческогоУчета"        , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "КурсВалютыУправленческогоУчета"    , "КурсВалютыУправленческогоУчета");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// Здесь контролировать сумму задолженности, предоплату и число дней задолженности не надо
	СтруктураШапкиДокумента.Вставить("КонтролироватьСуммуЗадолженности", Ложь);
	СтруктураШапкиДокумента.Вставить("ПроцентПредоплаты", 0);
	СтруктураШапкиДокумента.Вставить("КонтролироватьЧислоДнейЗадолженности", Ложь);
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	// Если надо пересчитывать цену в валюту заказа. то в структуре должна быть заполнена валюта заказа.
	ВалютаЗаказа = Неопределено;
	НужнаЦенаЗаказа = Ложь;
	Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа", ВалютаЗаказа) Тогда
		НужнаЦенаЗаказа = Истина;
		Если ВалютаЗаказа = мВалютаРегламентированногоУчета Тогда
			КурсЗаказа      = 1;
			КратностьЗаказа = 1;
		Иначе //ВалютаЗаказа = ВалютаВзаиморасчетов
			КурсЗаказа      = СтруктураШапкиДокумента.КурсВзаиморасчетовЗаказа;
			КратностьЗаказа = СтруктураШапкиДокумента.КратностьВзаиморасчетовЗаказа;
		КонецЕсли;
		СтруктураШапкиДокумента.Вставить("КурсЗаказа"     , КурсЗаказа);
		СтруктураШапкиДокумента.Вставить("КратностьЗаказа", КратностьЗаказа);
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("НужнаЦенаЗаказа", НужнаЦенаЗаказа);
	
	// Проверка заполнены ли все необходимые реквизиты шакпи.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ОбновитьПараметрыУчетнойПолитики();
	
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ЗаказПокупателя"             , "ЗаказПокупателя");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"       , "ЗаказПокупателя.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        								"ЗаказПокупателя.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");
	СтруктураПолей.Вставить("Услуга"      				  , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"       				  , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"       			  , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		  , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("СуммаПлановая"				  , "СуммаПлановая");
	СтруктураПолей.Вставить("ПлановаяСтоимость"			  , "ПлановаяСтоимость");
	СтруктураПолей.Вставить("Счет"        				  , "Счет");	
	СтруктураПолей.Вставить("НалоговоеНазначение",        "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве");
	СтруктураПолей.Вставить("ВидНалоговойДеятельности",   "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидНалоговойДеятельности");
	СтруктураПолей.Вставить("Амортизируется",             "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.Амортизируется");
	СтруктураПолей.Вставить("ВидДеятельностиНДС",         "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("НоменклатурнаяПозиция",      "НоменклатурнаяПозиция");
	
	СтруктураПолей.Вставить("СуммаПлановаяУпр"				  , "СуммаПлановаяУпр");
	СтруктураПолей.Вставить("ПлановаяСтоимостьУпр"			  , "ПлановаяСтоимостьУпр");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"			  ,     "ЕдиницаИзмерения"); 	
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
	
	
	РезультатЗапросаПоТаблицеПродукция = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Продукция", СтруктураПолей,СтруктураПростыхПолей);
	
	СтруктураПолей 			= Новый Структура;
	СтруктураПростыхПолей	= Новый Структура;
	СтруктураПолей.Вставить("Номенклатура", "Номенклатура");
	СтруктураПолей.Вставить("Количество"  , "Количество");
	СтруктураПолей.Вставить("Цена"        , "Цена");
	СтруктураПолей.Вставить("Сумма"       , "Сумма");
	СтруктураПолей.Вставить("СчетЗатрат"  , "Ссылка.СчетЗатрат");
	СтруктураПолей.Вставить("СтатьяЗатрат", "СтатьяЗатрат");
	СтруктураПолей.Вставить("ХарактерЗатрат", "СтатьяЗатрат.ХарактерЗатрат");
	СтруктураПолей.Вставить("СтавкаНДС"   , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"         , "СуммаНДС");
	СтруктураПолей.Вставить("Содержание"  , "Содержание");
	СтруктураПолей.Вставить("Подразделение", "Ссылка.Подразделение");
	СтруктураПолей.Вставить("Услуга"	  , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"    , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Заказ"		  , "Заказ");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"  	  , "Ссылка.НоменклатурнаяГруппа");
	
	СтруктураПолей.Вставить("БланкСтрогогоУчета",          "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("НалоговоеНазначение",        "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидНалоговойДеятельности",   "НалоговоеНазначение.ВидНалоговойДеятельности");
	СтруктураПолей.Вставить("ВидДеятельностиНДС",         "НалоговоеНазначение.ВидДеятельностиНДС");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
	
	РезультатЗапросаПоУслугам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей,СтруктураПростыхПолей);
	
	СтруктураПолей  = Новый Структура;
	
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("Цена"                        , "Цена");
	СтруктураПолей.Вставить("Сумма"                       , "Сумма");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");
	
	СтруктураПолей.Вставить("Услуга"	  , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"       , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("БланкСтрогогоУчета", "Номенклатура.БланкСтрогогоУчета");
	
	СтруктураПолей.Вставить("СчетУчетаБУ" , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СтатьяЗатрат", "СтатьяЗатрат");
	СтруктураПолей.Вставить("ЗаказПокупателя", "ЗаказПокупателя");
	СтруктураПолей.Вставить("НалоговоеНазначение",        "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве");
	СтруктураПолей.Вставить("ВидНалоговойДеятельности",   "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидНалоговойДеятельности");
	СтруктураПолей.Вставить("Амортизируется",             "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.Амортизируется");
	СтруктураПолей.Вставить("ВидДеятельностиНДС",         "Ссылка.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидДеятельностиНДС");
	
	РезультатЗапросаПоМатериалам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ИспользованныеМатериалы", СтруктураПолей);
	
	СтруктураПолей.Удалить("СтатьяЗатрат");
	СтруктураПолей.Вставить("СчетПередачиБУ", "СчетПередачиБУ");
	РезультатЗапросаПоВозвращеннымМатериалам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвращенныеМатериалы", СтруктураПолей);

	// Получим необходимые данные для проведения и проверки заполенения данных 
	// по табличной части "Возвратная тара".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТара();
	СтруктураПолей.Вставить("ЗаказПокупателя"           , "ЗаказПокупателя");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "Номенклатура.ЕдиницаХраненияОстатков");
	СтруктураПолей.Вставить("Комплект"       			, "Номенклатура.Комплект");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("ЗаказПокупателя"           , "ЗаказПокупателя");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"     , "ЗаказПокупателя.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        								"ЗаказПокупателя.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	
	СтруктураПолей.Вставить("СчетУчетаБУ", "СчетУчетаБУ");

	СтруктураПолей.Вставить("НалоговоеНазначение"     	, "НалоговоеНазначение");	
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"     , "НоменклатурнаяПозиция");
	
	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);
	
	ПогрешностиОкругления = Новый Соответствие;
	ПогрешностиОкругленияТара = Новый Соответствие;

	ТаблицаПоПродукции 	= ПодготовитьТаблицуПродукции(РезультатЗапросаПоТаблицеПродукция, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ТаблицаПоУслугам 	= ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ТаблицаПоМатериалам = ПодготовитьТаблицуМатериалов(РезультатЗапросаПоМатериалам, СтруктураШапкиДокумента);
	ТаблицаПоВозвращеннымМатериалам = ПодготовитьТаблицуВозвращенныхМатериалов(РезультатЗапросаПоВозвращеннымМатериалам, СтруктураШапкиДокумента);
	ТаблицаПоТаре       = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругленияТара);
	
	ПроверитьЗаполнениеТабличнойЧастиПродукция(ТаблицаПоПродукции, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиИспользованныеМатериалы(ТаблицаПоМатериалам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвращенныеМатериалы(ТаблицаПоВозвращеннымМатериалам, СтруктураШапкиДокумента, Отказ, Заголовок); 
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроводитьПоВзаиморасчетам = Истина;
	мСтруктураПараметровВзаиморасчетов.Вставить("ПроводитьПоВзаиморасчетам", ПроводитьПоВзаиморасчетам);
	
	СтруктураПодготовленныхТаблиц = Новый Структура("ТаблицаПоУслугам", ТаблицаПоУслугам);
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблиц);
	УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                ЭтотОбъект, мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента, 
	                                                Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда

		//Проверим на возможность проведения в БУ и НУ
		УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,
		                                     ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
		                                     Ложь, Отказ, Заголовок, "", СтруктураШапкиДокумента.ВалютаВзаиморасчетов);
	КонецЕсли;
					 
	Если ВозвращенныеМатериалы.Количество() > 0 Тогда	
		ТаблицаПоМатериалам.Колонки.Добавить("СчетПередачиБУ");
		ТаблицаПоМатериалам.Колонки.Добавить("СодержаниеПроводки"); 
		ТаблицаПоМатериалам.Колонки.Добавить("КодОперацииПартииТоваров");
		ТаблицаПоМатериалам.ЗаполнитьЗначения("Списаны ТМЦ", "СодержаниеПроводки");
		ТаблицаПоМатериалам.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.СписаниеПартийПереданныхВПроизводство, "КодОперацииПартииТоваров");

		ТаблицаПоВозвращеннымМатериалам.Колонки.Добавить("СодержаниеПроводки");
		ТаблицаПоВозвращеннымМатериалам.Колонки.Добавить("КодОперацииПартииТоваров");  
		ТаблицаПоВозвращеннымМатериалам.ЗаполнитьЗначения("Возврат сырья из переработки", "СодержаниеПроводки");
		ТаблицаПоВозвращеннымМатериалам.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ВозвратОтПереработчика, "КодОперацииПартииТоваров");  
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВозвращеннымМатериалам, ТаблицаПоМатериалам); 		
	КонецЕсли;
	
	
	Если НЕ Отказ Тогда // Формирование движений регистров
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
                            ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
							ТаблицаПоПродукции, ТаблицаПоУслугам, ТаблицаПоМатериалам,ТаблицаПоВозвращеннымМатериалам, ТаблицаПоТаре,
							Отказ, Заголовок); 				
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", Неопределено);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументПоОснованиюУпр(Основание);
	ОбработкаЗаполненияРегл(Основание);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПараметрыУчетнойПолитики();
	
	Если НЕ мУчетнаяПолитикаНал.ЕстьНДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Услуги Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
		Для каждого СтрокаТЧ  Из ВозвратнаяТара Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
	КонецЕсли;
		
	Если ВозвратнаяТара.Количество() > 0 
		И ДоговорКонтрагента.Внешнеэкономический Тогда
		
		ВозвратнаяТара.Очистить();
		
	КонецЕсли;
	
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Продукция);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(ИспользованныеМатериалы);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(ВозвращенныеМатериалы);
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Продукция");
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "ВозвратнаяТара");
	
	мУдалятьДвижения = НЕ ЭтоНовый();

	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Для каждого СтрокаТЧ  Из ДокументыРасчетовСКонтрагентом Цикл
			СтрокаТЧ.ВозвратнаяТара = Ложь;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУправленческогоУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

мСтруктураПараметровДляПолученияДоговора = Новый Структура();

СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);

мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);

мСтруктураПараметровВзаиморасчетов = Новый Структура;
// значением элемента структуры для документов поступления будет значение признака "Амортизируется": 
//		Истина/Ложь - значение для всех строк ТЧ
//		ИмяСчетаЗатрат - строковое значение - по данному счету будет определен вид затрат (в НУ), и если он = "Строительство", тогда Амортизируется = Истина (иначе - ложь)
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Услуги", "Ссылка.СчетЗатрат"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Ложь);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");
