Перем мВалютаРегламентированногоУчета Экспорт;
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мУдалятьДвижения;

Перем мУказаниеСкладов ;
Перем мУказаниеСкладовВТЧ Экспорт;

Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

Перем ПартионныйУчетБУ;

Перем СписокСтатейСуточные;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;

Перем мСтруктураНаименованийРеквизитовУслуги Экспорт;

Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьАвансовогоОтчетаУпр()

	// Запрос по Шапке.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("Курс",            КурсДокумента);
	Запрос.УстановитьПараметр("Кратность",       КратностьДокумента);
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	Номер,
	|	Дата                  КАК ДатаДокумента,
	|	ФизЛицо               КАК ПодотчетноеЛицо,
	|	ФизЛицо.Представление КАК ФИОПодотчетногоЛица,
	|	ФизЛицо.КодПоДРФО     КАК ИННПодотчетногоЛица,
	|	Организация           КАК Руководители,
	|	Организация.Ссылка    КАК Организация,
	|   Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	|	Подразделение,
	|	Подразделение.Код КАК КодПодразделения,
	|	НазначениеАванса,
	|	ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС,   
	|	КоличествоДокументов,   
	|	ВалютаДокумента,
	|	КурсДокумента,
	|	КратностьДокумента,
	|	ВалютаДокумента.Представление       КАК ПредставлениеВалютыДокумента,
	|	СуммаДокумента * &Курс / &Кратность КАК СуммаДокумента
	|ИЗ
	|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	// Запрос по Авансам.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Сумма        КАК Израсходовано,
	|	Док.Ссылка.ВалютаДокумента  КАК ВалютаРКО,
	|	Док.КурсВзаиморасчетов      КАК КурсВзаиморасчетовРКО,
	|	Док.КратностьВзаиморасчетов КАК КратностьВзаиморасчетовРКО,
	|	Док.СуммаВзаиморасчетов	 	КАК ПолученоПоРКО
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК Док
	|		ПО АвансовыйОтчет.ДокументАванса = Док.Ссылка
	|
	|ГДЕ
	|	  АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|	И АвансовыйОтчет.ДокументАванса ССЫЛКА Документ.РасходныйКассовыйОрдер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Сумма        КАК Израсходовано,
	|	Док.Ссылка.ВалютаДокумента  КАК ВалютаРКО,
	|	Док.КурсВзаиморасчетов      КАК КурсВзаиморасчетовРКО,
	|	Док.КратностьВзаиморасчетов КАК КратностьВзаиморасчетовРКО,
	|	Док.СуммаВзаиморасчетов	 	КАК ПолученоПоРКО
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК Док
	|		ПО АвансовыйОтчет.ДокументАванса = Док.Ссылка
	|
	|ГДЕ
	|	  АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|	И АвансовыйОтчет.ДокументАванса ССЫЛКА Документ.ПлатежныйОрдерСписаниеДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Сумма        КАК Израсходовано,
	|	Док.Ссылка.ВалютаДокумента  КАК ВалютаРКО,
	|	Док.КурсВзаиморасчетов      КАК КурсВзаиморасчетовРКО,
	|	Док.КратностьВзаиморасчетов КАК КратностьВзаиморасчетовРКО,
	|	Док.СуммаВзаиморасчетов	 	КАК ПолученоПоРКО
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК Док
	|		ПО АвансовыйОтчет.ДокументАванса = Док.Ссылка
	|
	|ГДЕ
	|	  АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|	И АвансовыйОтчет.ДокументАванса ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
	|";
	
	ВыборкаАвансы = Запрос.Выполнить().Выбрать();

	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АвансовыйОтчет_АвансовыйОтчет";
	ВариантДо01012011 = Дата < Дата("20110131000000");
	Если ВариантДо01012011 Тогда
		Макет       = ПолучитьМакет("АвансовыйОтчетУпр");
	Иначе
		Макет       = ПолучитьМакет("АвансовыйОтчет01012011");
	КонецЕсли;
	ВалютаРег    = мВалютаРегламентированногоУчета;
    КодЯзыкаПечать = "uk";
	
	// ТИТУЛЬНЫЙ ЛИСТ
	
	// Надо получить все ненулевые остатки регистра по этому подотчетнику и этой валюте (взаиморасчетов),
	// которые возникли до данного авансового отчета,
	// при этом курс и кратность взаиморасчетов надо брать из расчетного документа.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта"     , ВалютаДокумента);
	Запрос.УстановитьПараметр("ФизЛицо"    , ФизЛицо);
	Запрос.УстановитьПараметр("ДатаОстатка", Дата - 1);
	Запрос.УстановитьПараметр("Проведен", ИСТИНА);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.Валюта КАК ВалютаВзаиморасчетов,
	|	ВложенныйЗапрос.КурсВзаиморасчетов,
	|	ВложенныйЗапрос.КратностьВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&ДатаОстатка, Валюта = &Валюта И ФизЛицо = &ФизЛицо) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвансовыйОтчет.Ссылка КАК РасчетныйДокумент,
	|			АвансовыйОтчет.КурсДокумента КАК КурсВзаиморасчетов,
	|			АвансовыйОтчет.КратностьДокумента КАК КратностьВзаиморасчетов
	|		ИЗ
	|			Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|
	|		ГДЕ
	|			АвансовыйОтчет.ВалютаДокумента = &Валюта И
	|			АвансовыйОтчет.ФизЛицо = &ФизЛицо И
	|			АвансовыйОтчет.Дата <= &ДатаОстатка
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.КурсВзаиморасчетов,
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.КратностьВзаиморасчетов
	|		ИЗ
	|			Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|
	|		ГДЕ
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВалютаВзаиморасчетовРаботника = &Валюта И
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент = &ФизЛицо И
	|			ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата <= &ДатаОстатка
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.КурсВзаиморасчетов,
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.КратностьВзаиморасчетов
	|		ИЗ
	|			Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	|
	|		ГДЕ
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВалютаВзаиморасчетовРаботника = &Валюта И
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент = &ФизЛицо И
	|			РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата <= &ДатаОстатка
	
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка,
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.КурсВзаиморасчетов,
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.КратностьВзаиморасчетов
	|		ИЗ
	|			Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
	|
	|		ГДЕ
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ВалютаВзаиморасчетовРаботника = &Валюта И
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Контрагент = &ФизЛицо И
	|			ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Дата <= &ДатаОстатка
	
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.КурсВзаиморасчетов,
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.КратностьВзаиморасчетов
	|		ИЗ
	|			Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа
	|
	|		ГДЕ
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВалютаВзаиморасчетовРаботника = &Валюта И
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент = &ФизЛицо И
	|			ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата <= &ДатаОстатка) КАК ВложенныйЗапрос
	|
	|		ПО ВзаиморасчетыСПодотчетнымиЛицамиОстатки.РасчетныйДокумент = ВложенныйЗапрос.РасчетныйДокумент
	|";
	ПредыдущийАванс = Запрос.Выполнить().Выбрать();

	СуммаДоДокумента = 0;
	Пока ПредыдущийАванс.Следующий() Цикл
		Если ПредыдущийАванс.ВалютаВзаиморасчетов = ВалютаРег Тогда
			СуммаДоДокумента = СуммаДоДокумента + ПредыдущийАванс.СуммаВзаиморасчетов;
		Иначе
			СуммаДоДокумента = СуммаДоДокумента + ПредыдущийАванс.СуммаВзаиморасчетов 
												  * ПредыдущийАванс.КурсВзаиморасчетов
												  / ПредыдущийАванс.КратностьВзаиморасчетов;
		КонецЕсли;
	КонецЦикла;

	// теперь отнимем сумму расходных ордеров в первой вкладке
	ПолученоИзКассы    = 0;
	ПолученоИзКассыВал = 0;

	Пока ВыборкаАвансы.Следующий() Цикл

		ПолученоИзКассыВал = ПолученоИзКассыВал + ВыборкаАвансы.ПолученоПоРКО;

		Если ВалютаДокумента = ВалютаРег Тогда // валюта документа совпадает с валютой взаиморасчетов подотчетника

			ПолученоИзКассы    = ПолученоИзКассы    + ВыборкаАвансы.ПолученоПоРКО ;

		Иначе

			ПолученоИзКассы    = ПолученоИзКассы    + ВыборкаАвансы.ПолученоПоРКО 
													  * ВыборкаАвансы.КурсВзаиморасчетовРКО 
													  / ВыборкаАвансы.КратностьВзаиморасчетовРКО;

		КонецЕсли;
	КонецЦикла;

		СуммаДоДокумента = СуммаДоДокумента - ПолученоИзКассы;

	// Выводим титульный лист авансового отчета
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаРег;
	ОбластьМакета.Параметры.НомерДокумента  = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);

	ДанныеСотрудника = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация, Шапка.ПодотчетноеЛицо, Шапка.ДатаДокумента);
	
	ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(ДанныеСотрудника.ПодразделениеОрганизации);
	ОбластьМакета.Параметры.ДолжностьПодотчетногоЛицаПредставление = СокрЛП(ДанныеСотрудника.Должность);
	
	Если СуммаДоДокумента >= 0 тогда
		ОбластьМакета.Параметры.НачальныйОстаток    =   СуммаДоДокумента;
	Иначе
		ОбластьМакета.Параметры.НачальныйПерерасход = - СуммаДоДокумента;
	КонецЕсли;

	КвоАвансов = ?(ВыданныеАвансы.Количество()>3, 3, ВыданныеАвансы.Количество());
	Для Инд = 1 По КвоАвансов Цикл
		
		ДокументАванса = ВыданныеАвансы[Инд-1].ДокументАванса;
		
		Если ДокументАванса.Метаданные().Имя = "РасходныйКассовыйОрдер" Тогда
			Документ = "Видатковий касовий ордер №" + Строка(ДокументАванса.НомерОрдера) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));
						
		ИначеЕсли ДокументАванса.Метаданные().Имя = "ПлатежноеПоручениеИсходящее" Тогда
			Документ = "Платіжне доручення вихідне №" + Строка(ДокументАванса.НомерПоручения) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));
						
		ИначеЕсли ДокументАванса.Метаданные().Имя = "ПлатежныйОрдерСписаниеДенежныхСредств" Тогда
			Документ = "Платіжний ордер на списання коштів №" + Строка(ДокументАванса.Номер) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));	
		КонецЕсли;
		
		Если ДокументАванса.ВалютаДокумента = ВалютаРег Тогда
			ОбластьМакета.Параметры["Документ" + Инд] = Документ;
			ОбластьМакета.Параметры["Получено" + Инд] = ДокументАванса.СуммаДокумента;
		Иначе

			ОбластьМакета.Параметры["Документ" + Инд] = Документ;
			ОбластьМакета.Параметры["Получено" + Инд] = ДокументАванса.СуммаДокумента 
													  * ДокументАванса.РасшифровкаПлатежа[0].КурсВзаиморасчетов 
													  / ДокументАванса.РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

		КонецЕсли;
		
	КонецЦикла;
	
	ОстатокНаКонец = СуммаДоДокумента + ПолученоИзКассы - Шапка.СуммаДокумента;
	Если ОстатокНаКонец >= 0  Тогда
		ОбластьМакета.Параметры.КонечныйОстаток    = ОстатокНаКонец;
	Иначе
		ОбластьМакета.Параметры.КонечныйПерерасход = - ОстатокНаКонец;
	КонецЕсли;

	ОбластьМакета.Параметры.ИтогВсегоПолучено = ПолученоИзКассы - 0;
	
	ОбластьМакета.Параметры.Израсходовано = Шапка.СуммаДокумента;
	ОбластьМакета.Параметры.СуммаОтчетПодтверждаю = ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.СуммаДокумента, мВалютаРегламентированногоУчета, КодЯзыкаПечать);
	ОбластьМакета.Параметры.СуммаСНДСЧислом = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2;"); 
	ОбластьМакета.Параметры.СуммаДокумента = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2;");
	
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");

	ЕДРПОУОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоЕДРПОУ,",Ложь);
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["ЕДРПОУОрганизации_" + Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
	КонецЦикла; 
	// если организация - физ.лицо нужно "добавить" две ячейки
	Если Шапка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Для Инд = 9 По 10 Цикл
			ОбластьМакета.Параметры["ЕДРПОУОрганизации_" + Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
		КонецЦикла; 
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
		ОбластьМакета.Область("КодОрганизации9").Обвести(Линия,Линия,Линия,Линия);
		ОбластьМакета.Область("КодОрганизации10").Обвести(Линия,Линия,Линия,Линия);
	КонецЕсли;
	

	Для Инд = 1 По 10 Цикл
		ОбластьМакета.Параметры["ДРФОПодотчетногоЛица_" + Инд] = Сред(Шапка.ИННПодотчетногоЛица, Инд, 1);
	КонецЦикла;
	
	ОбластьМакета.Параметры.Дата	       		= Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.ДатаКоротко 		= Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy");

	
	ОбластьМакета.Параметры.ПредставлениеОрганизации        = ПредставлениеОрганизации;

	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	// ОБОРОТНАЯ СТОРОНА
	ЗапросТовары = Новый Запрос();
	ЗапросТовары.УстановитьПараметр("Курс",            ЭтотОбъект.КурсДокумента);
	ЗапросТовары.УстановитьПараметр("Кратность",       ЭтотОбъект.КратностьДокумента);
	ЗапросТовары.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросТовары.УстановитьПараметр("Валюта",          ЭтотОбъект.ВалютаДокумента);
	ЗапросТовары.Текст = "
	|ВЫБРАТЬ
	|	АвансовыйОтчет.НомерВходящегоДокумента   КАК ДокументНомер,
	|	АвансовыйОтчет.ДатаВходящегоДокумента    КАК ДокументДата,
	|	АвансовыйОтчет.Номенклатура.Наименование КАК НаименованиеРасхода,
	|	СУММА(АвансовыйОтчет.Сумма * &Курс / &Кратность)    КАК ПоОтчету,
	|	СУММА(АвансовыйОтчет.Сумма)                         КАК ПоОтчетуВВалюте,
	|	СУММА(АвансовыйОтчет.СуммаНДС * &Курс / &Кратность) КАК СуммаНДС,
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	NULL                                                КАК Договор,
	|	NULL                                                КАК СуточныеДатаС,
	|	NULL                                                КАК СуточныеДатаПо
	|ИЗ
	|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчет
	|
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС,
	|	АвансовыйОтчет.Номенклатура.Наименование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	СУММА(АвансовыйОтчет.Сумма * &Курс / &Кратность),
	|	СУММА(АвансовыйОтчет.Сумма),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.НеОблагаемая),
	|	АвансовыйОтчет.ДоговорКонтрагента,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчет
	|
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	СУММА(АвансовыйОтчет.Сумма * &Курс / &Кратность),
	|	СУММА(АвансовыйОтчет.Сумма),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.НеОблагаемая),
	|	NULL,
	|	АвансовыйОтчет.СуточныеДатаС,
	|	АвансовыйОтчет.СуточныеДатаПо
	|ИЗ
	|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчет
	|
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.СуточныеДатаС,
	|	АвансовыйОтчет.СуточныеДатаПо";

	Товар = ЗапросТовары.Выполнить().Выбрать();

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим табличные части
	НомерСтроки   = 0;

	ИтогоПоОтчету        = 0;
	ИтогоПоОтчетуВВалюте = 0;
	СуммаВВалюте = 0;

	Пока Товар.Следующий() Цикл

		ОбластьМакета = ?((Товар.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая И ОтражатьВБухгалтерскомУчете ИЛИ (Товар.СуммаНДС = 0)), Макет.ПолучитьОбласть("Строка"), Макет.ПолучитьОбласть("СтрокаСНДС"));
		ОбластьМакета.Параметры.Заполнить(Товар);
		НомерСтроки = НомерСтроки + 1;
		ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
		ОбластьМакета.Параметры.Дата        		= Товар.ДокументДата;
		ОбластьМакета.Параметры.ОснованиеПлатежа	= СокрЛП(Товар.НаименованиеРасхода);

		Сумма = Товар.ПоОтчету 
			+ ?(Шапка.СуммаВключаетНДС, 0, Товар.СуммаНДС);

		Если     (Товар.СуммаНДС > 0) 
			И НЕ (Товар.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая И ОтражатьВБухгалтерскомУчете) Тогда
			ОбластьМакета.Параметры.СуммаБезНДС = Товар.ПоОтчету - ?(Шапка.СуммаВключаетНДС, Товар.СуммаНДС, 0);
			ОбластьМакета.Параметры.СуммаНДС = Товар.СуммаНДС;
		Иначе	
			ОбластьМакета.Параметры.СуммаБезНДС = Товар.ПоОтчету + ?(Шапка.СуммаВключаетНДС, 0, Товар.СуммаНДС);
		КонецЕсли;

		ИтогоПоОтчету = ИтогоПоОтчету + Сумма;
		ИтогоПоОтчетуВВалюте = ИтогоПоОтчетуВВалюте + Товар.ПоОтчетуВВалюте;

		Если ЗначениеЗаполнено(Товар.СуточныеДатаС) И ЗначениеЗаполнено(Товар.СуточныеДатаПо) Тогда
		
			ОписаниеПериода = БухгалтерскиеОтчеты.СформироватьСтрокуВыводаПараметровПоДатам(Товар.СуточныеДатаС, Товар.СуточныеДатаПо);
			ОбластьМакета.Параметры.Дата = СтрЗаменить(ОписаниеПериода, "Период: ", "");
		
		ИначеЕсли ЗначениеЗаполнено(Товар.ДокументДата) Тогда
			
			ОбластьМакета.Параметры.Дата =  Формат(Товар.ДокументДата, "ДФ=дд.ММ.гггг");
			
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.СуммаСНДС = ИтогоПоОтчету;
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим подвал авансовго отчета
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;


КонецФункции // ПечатьАвансовогоОтчета()
	
// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьАвансовогоОтчетаБух()

	Если Организация.Пустая() Тогда
		Сообщить("Не указана организация.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	// Запрос по Шапке.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	Номер,
	|	Дата                  КАК ДатаДокумента,
	|	ФизЛицо               КАК ПодотчетноеЛицо,
	|	ФизЛицо.КодПоДРФО	  КАК ДРФОПодотчетногоЛица,
	|	Организация           КАК Руководители,
	|	Организация.Ссылка    КАК Организация,
	|   Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	|	НазначениеАванса      КАК НазначениеАванса,  
	|	ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС,
	|	ВалютаДокумента,
	|	КурсДокумента,
	|	КратностьДокумента,
	|	КоличествоДокументов,   
	|	ВалютаДокумента.Представление       КАК ПредставлениеВалютыДокумента,
	|	СуммаДокумента 		  КАК СуммаДокумента	
	|ИЗ
	|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АвансовыйОтчет_АвансовыйОтчет";
	ВариантДо01012011 = Дата < Дата("20110131000000");
	Если ВариантДо01012011 Тогда
		Макет       = ПолучитьМакет("АвансовыйОтчетБух");
	Иначе
		Макет       = ПолучитьМакет("АвансовыйОтчет01012011");
	КонецЕсли;
	КодЯзыкаПечать = "uk";

	// ТИТУЛЬНЫЙ ЛИСТ
	Запрос = Новый Запрос();
	Если НЕ (ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда
		Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте);
	Иначе
		Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Сотрудник",  Шапка.ПодотчетноеЛицо);
	Запрос.УстановитьПараметр("Организация",Шапка.Организация);
	Запрос.УстановитьПараметр("ДатаИтогов", Шапка.ДатаДокумента);
	Запрос.УстановитьПараметр("Валюта",		ВалютаДокумента);


	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки."+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"","Валютная")+"СуммаОстатокДт КАК СуммаОстатокКт,
	|	ХозрасчетныйОстатки."+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"","Валютная")+"СуммаОстатокКт КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаИтогов,
	|			Счет В ИЕРАРХИИ (&СчетРасчетов),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Сотрудник
	|				"+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"","И Валюта = &Валюта")+") КАК ХозрасчетныйОстатки";

	ПредыдущийАванс = Запрос.Выполнить().Выбрать();
	ПредыдущийАванс.Следующий();
	
	Перерасход = ?(ПредыдущийАванс.СуммаОстатокДт = Null, 0, ПредыдущийАванс.СуммаОстатокДт);
	Остаток    = ?(ПредыдущийАванс.СуммаОстатокКт = Null, 0, ПредыдущийАванс.СуммаОстатокКт);

	СуммаДоДокумента = 0;

	Если НЕ ЗначениеЗаполнено(Перерасход) Тогда
		Перерасход = 0;
	Иначе
		СуммаДоДокумента = - Число(Перерасход);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Остаток) Тогда
		Остаток = 0;
	Иначе
		СуммаДоДокумента = Число(Остаток);
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивДокументов", ВыданныеАвансы.ВыгрузитьКолонку("ДокументАванса"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Док.СуммаПлатежа) КАК СуммаДокумента
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.Ссылка В (&МассивДокументов)
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Док.СуммаПлатежа) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.Ссылка В (&МассивДокументов)
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Док.СуммаПлатежа) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.Ссылка В (&МассивДокументов)
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка";
	
	Таб = Запрос.Выполнить().Выгрузить();
	ПолученоИзКассы = Число(Таб.Итог("СуммаДокумента"));
 	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");

	СуммаДоДокумента = СуммаДоДокумента - ПолученоИзКассы;

	// Выводим титульный лист авансового отчета
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НомерДокумента  = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
	// для расписки получис ФИО с инициалами.
	ДанныеСотрудника = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация, Шапка.ПодотчетноеЛицо, Шапка.ДатаДокумента);
	
	ОбластьМакета.Параметры.ФИОПодотчетногоЛицаКратко = ДанныеСотрудника.Представление;
	ОбластьМакета.Параметры.ФИОПодотчетногоЛица = ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
	
	ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(ДанныеСотрудника.ПОдразделениеОрганизации);
	ОбластьМакета.Параметры.ДолжностьПодотчетногоЛицаПредставление = СокрЛП(ДанныеСотрудника.Должность);
	
	Если СуммаДоДокумента >= 0 тогда
		ОбластьМакета.Параметры.НачальныйОстаток    =   СуммаДоДокумента;
	Иначе
		ОбластьМакета.Параметры.НачальныйПерерасход = - СуммаДоДокумента;
	КонецЕсли;

	КвоАвансов = ?(ВыданныеАвансы.Количество()>3, 3, ВыданныеАвансы.Количество());
	Для Инд = 1 По КвоАвансов Цикл
		
		ДокументАванса = ВыданныеАвансы[Инд-1].ДокументАванса;
		
		Если ДокументАванса.Метаданные().Имя = "РасходныйКассовыйОрдер" Тогда
			Документ = "Видатковий касовий ордер №" + Строка(ДокументАванса.НомерОрдера) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));
						
		ИначеЕсли ДокументАванса.Метаданные().Имя = "ПлатежноеПоручениеИсходящее" Тогда
			Документ = "Платіжне доручення вихідне №" + Строка(ДокументАванса.НомерПоручения) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));
						
		ИначеЕсли ДокументАванса.Метаданные().Имя = "ПлатежныйОрдерСписаниеДенежныхСредств" Тогда
			Документ = "Платіжний ордер на списання коштів №" + Строка(ДокументАванса.Номер) + " від " 
						+ Строка(Формат(ДокументАванса.Дата, "ДФ=dd.MM.yyyy"));	
		КонецЕсли;
		
		ОбластьМакета.Параметры["Документ" + Инд] = Документ;
		ОбластьМакета.Параметры["Получено" + Инд] = ДокументАванса.СуммаДокумента;
		
	КонецЦикла;
	
	ОбластьМакета.Параметры.ИтогВсегоПолучено = ПолученоИзКассы - 0;
	
	ОбластьМакета.Параметры.Израсходовано = Шапка.СуммаДокумента;
	ОбластьМакета.Параметры.СуммаОтчетПодтверждаю = ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.СуммаДокумента, Шапка.ВалютаДокумента, КодЯзыкаПечать);

	ОбластьМакета.Параметры.СуммаСНДСЧислом = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2;"); 
    ОбластьМакета.Параметры.СуммаДокумента  = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2;");
  
	ОстатокНаКонец = СуммаДоДокумента + ПолученоИзКассы - Шапка.СуммаДокумента;
	Если ОстатокНаКонец >= 0  Тогда
		ОбластьМакета.Параметры.КонечныйОстаток    = ОстатокНаКонец;
	Иначе
		ОбластьМакета.Параметры.КонечныйПерерасход = - ОстатокНаКонец;
	КонецЕсли;

	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");

	ЕДРПОУОрганизации = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["ЕДРПОУОрганизации_" + Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
	КонецЦикла; 
	// если организация - физ.лицо нужно "добавить" две ячейки
	Если Шапка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Для Инд = 9 По 10 Цикл
			ОбластьМакета.Параметры["ЕДРПОУОрганизации_" + Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
		КонецЦикла; 
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
		ОбластьМакета.Область("КодОрганизации9").Обвести(Линия,Линия,Линия,Линия);
		ОбластьМакета.Область("КодОрганизации10").Обвести(Линия,Линия,Линия,Линия);
	КонецЕсли;

	
	Для Инд = 1 По 10 Цикл
		ОбластьМакета.Параметры["ДРФОПодотчетногоЛица_" + Инд] = Сред(Шапка.ДРФОПодотчетногоЛица, Инд, 1);
	КонецЦикла;
	
	ОбластьМакета.Параметры.Дата	       		= Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.ДатаКоротко 		= Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy");

	ЗапросПоПроводкам = Новый Запрос();
	ЗапросПоПроводкам.УстановитьПараметр("Ссылка", Ссылка);
	Если НЕ (ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда
		ЗапросПоПроводкам.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте);
	Иначе
		ЗапросПоПроводкам.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте);
	КонецЕсли;
	ЗапросПоПроводкам.Текст = "
	|ВЫБРАТЬ
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	СУММА(Хозрасчетный."+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"Сумма","ВалютнаяСуммаКт")+") КАК Сумма,
	|	МИНИМУМ(Хозрасчетный.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Ссылка
	|	И Хозрасчетный.СчетКт В ИЕРАРХИИ(&СчетРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ВыборкаПроводок = ЗапросПоПроводкам.Выполнить().Выгрузить();
	ВыборкаПроводокКопияДт = ВыборкаПроводок.Скопировать();
	ВыборкаПроводокКопияДт.Свернуть("СчетДт", "Сумма");
	ИспользуемыеКлассыСчетовРасходов = БухгалтерскийУчет.ПолучитьИспользуемыеКлассыСчетовРасходов(Дата, Организация);
	
	Счетчик = 0;
	Если ВариантДо01012011 Тогда
		
		Для каждого СтрокаВыборки Из ВыборкаПроводокКопияДт Цикл
			
			Если Счетчик = 5 тогда
				Прервать;
			КонецЕсли;
			
			Если (ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8
				ИЛИ ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9)
				И Счет9Класса(СтрокаВыборки.СчетДт) Тогда
				Продолжить;		
			КонецЕсли;
			
			ИспСумма     = Окр(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма), 2, 1);
			ЦелСумма     = Цел(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма));
			КопСумма     = 100 * (Окр(ИспСумма - ЦелСумма, 2, 1));
			
			Если КопСумма = 0 Тогда
				Если ЦелСумма = 0 Тогда
					КопСумма = "";
				Иначе
					КопСумма = "00";	
				КонецЕсли; 
			ИначеЕсли КопСумма < 10 Тогда
				КопСумма = "0" + Строка(КопСумма);
			Иначе
				КопСумма = Строка(КопСумма);
			КонецЕсли; 
			
			Если ЦелСумма = 0 Тогда
				Если КопСумма = 0 Тогда
					ЦелСумма = "";
				Иначе
					ЦелСумма = Строка(ЦелСумма);	
				КонецЕсли;  
			КонецЕсли;		
			
			ОбластьМакета.Параметры["СчетДт" 			+ (Счетчик + 1)] = СтрокаВыборки.СчетДт;
			ОбластьМакета.Параметры["СуммаБезКопеекДт" 	+ (Счетчик + 1)] = ЦелСумма;
			ОбластьМакета.Параметры["СуммаКопейкиДт"   	+ (Счетчик + 1)] = КопСумма;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		ВыборкаПроводокКопияКт = ВыборкаПроводок.Скопировать();
		ВыборкаПроводокКопияКт.Свернуть("СчетКт", "Сумма");
		
		Счетчик = 0;
		Для каждого СтрокаВыборки Из ВыборкаПроводокКопияКт Цикл
			
			Если Счетчик = 5 тогда
				Прервать;
			КонецЕсли;
			
			Если (ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8
				ИЛИ ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9)
				И Счет9Класса(СтрокаВыборки.СчетКт) Тогда
				Продолжить;		
			КонецЕсли;
			
			ИспСумма     = Окр(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма), 2, 1);
			ЦелСумма     = Цел(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма));		
			КопСумма     = 100 * (Окр(ИспСумма - ЦелСумма, 2, 1));
			
			Если КопСумма = 0 Тогда
				Если ЦелСумма = 0 Тогда
					КопСумма = "";
				Иначе
					КопСумма = "00";	
				КонецЕсли; 
			ИначеЕсли КопСумма < 10 Тогда
				КопСумма = "0" + Строка(КопСумма);
			Иначе
				КопСумма = Строка(КопСумма);
			КонецЕсли; 
			
			Если ЦелСумма = 0 Тогда
				Если КопСумма = 0 Тогда
					ЦелСумма = "";
				Иначе
					ЦелСумма = Строка(ЦелСумма);	
				КонецЕсли;  
			КонецЕсли;		
			
			ОбластьМакета.Параметры["СчетКт" 			+ (Счетчик + 1)] = СтрокаВыборки.СчетКт;
			ОбластьМакета.Параметры["СуммаБезКопеекКт" 	+ (Счетчик + 1)] = ЦелСумма;
			ОбластьМакета.Параметры["СуммаКопейкиКт"   	+ (Счетчик + 1)] = КопСумма;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаВыборки Из ВыборкаПроводок Цикл
			
			Если Счетчик = 10 тогда
				Прервать;
			КонецЕсли;
			
			Если (ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8
				ИЛИ ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9)
				И Счет9Класса(СтрокаВыборки.СчетДт) Тогда
				Продолжить;		
			КонецЕсли;
			
			Если (ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8
				ИЛИ ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9)
				И Счет9Класса(СтрокаВыборки.СчетКт) Тогда
				Продолжить;		
			КонецЕсли;
			
			ИспСумма     = Окр(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма), 2, 1);
			ЦелСумма     = Цел(?(СтрокаВыборки.Сумма = Null, 0, СтрокаВыборки.Сумма));		
			КопСумма     = 100 * (Окр(ИспСумма - ЦелСумма, 2, 1));
			
			Если КопСумма = 0 Тогда
				Если ЦелСумма = 0 Тогда
					КопСумма = "";
				Иначе
					КопСумма = "00";	
				КонецЕсли; 
			ИначеЕсли КопСумма < 10 Тогда
				КопСумма = "0" + Строка(КопСумма);
			Иначе
				КопСумма = Строка(КопСумма);
			КонецЕсли; 
			
			Если ЦелСумма = 0 Тогда
				Если КопСумма = 0 Тогда
					ЦелСумма = "";
				Иначе
					ЦелСумма = Строка(ЦелСумма);	
				КонецЕсли;  
			КонецЕсли;		
			
			ОбластьМакета.Параметры["СчетДт" 			+ (Счетчик + 1)] = СтрокаВыборки.СчетДт;
			ОбластьМакета.Параметры["СчетКт" 			+ (Счетчик + 1)] = СтрокаВыборки.СчетКт;
			ОбластьМакета.Параметры["СуммаБезКопеек" 	+ (Счетчик + 1)] = ЦелСумма;
			ОбластьМакета.Параметры["СуммаКопейки"   	+ (Счетчик + 1)] = КопСумма;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	// ОБОРОТНАЯ СТОРОНА
	ЗапросТовары = Новый Запрос();
	ЗапросТовары.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросТовары.УстановитьПараметр("Валюта",          ЭтотОбъект.ВалютаДокумента);
	ЗапросТовары.Текст = "
	|	ВЫБРАТЬ
	|	АвансовыйОтчет.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчет.НомерВходящегоДокумента КАК Номер,
	|	АвансовыйОтчет.ДатаВходящегоДокумента КАК Дата,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	"""" КАК Содержание,
	|	АвансовыйОтчет.СчетУчетаБУ КАК Счет,
	|	СУММА(АвансовыйОтчет.Сумма) КАК ПоОтчету,
	|	СУММА(АвансовыйОтчет.СуммаНДС) КАК СуммаНДС,
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	АвансовыйОтчет.СчетУчетаНДС КАК СчетНДС,
	|	NULL КАК СуточныеДатаС,
	|	NULL КАК СуточныеДатаПо
	|ИЗ
	|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Номенклатура,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	АвансовыйОтчет.СчетУчетаБУ,
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС,
	|	АвансовыйОтчет.СчетУчетаНДС
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""Оплата постачальникам"",
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом,
	|	СУММА(АвансовыйОтчет.Сумма),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.НеОблагаемая),
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Номенклатура,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.СчетЗатрат,
	|	СУММА(АвансовыйОтчет.Сумма),
	|	СУММА(АвансовыйОтчет.СуммаНДС),
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	АвансовыйОтчет.СчетУчетаНДС,
	|	АвансовыйОтчет.СуточныеДатаС,
	|	АвансовыйОтчет.СуточныеДатаПо
	|ИЗ
	|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Номенклатура,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	ВЫРАЗИТЬ(АвансовыйОтчет.Содержание КАК Строка(1000)),
	|	АвансовыйОтчет.СчетЗатрат,
	|	АвансовыйОтчет.НалоговоеНазначение.ВидДеятельностиНДС,
	|	АвансовыйОтчет.СчетУчетаНДС,
	|	АвансовыйОтчет.СуточныеДатаС,
	|	АвансовыйОтчет.СуточныеДатаПо";

	Товар = ЗапросТовары.Выполнить().Выбрать();

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	НомерСтроки   = 0;

	ИтогоПоОтчету        = 0;
	ИтогоПоОтчетуВВалюте = 0;
	СуммаВВалюте = 0;

	Пока Товар.Следующий() Цикл

		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСНДС");
		Если (Товар.СуммаНДС = 0) ИЛИ  (Товар.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");	
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(Товар);
		
		НомерСтроки = НомерСтроки + 1;
		
		ОснованиеПлатежа = ?(НЕ ЗначениеЗаполнено(Товар.Контрагент),"","Контр. """ + Товар.Контрагент + """");
		НазначениеПлатежа = ?(ЗначениеЗаполнено(Товар.Содержание), СокрЛП(Товар.Содержание), Товар.Номенклатура); 
		
		ОснованиеПлатежа = ОснованиеПлатежа + ?(НЕ ЗначениеЗаполнено(НазначениеПлатежа),""," за """ + НазначениеПлатежа + """"); 
		
		Если (ЗначениеЗаполнено(Товар.ВидДокВходящий))
		 ИЛИ (ЗначениеЗаполнено(Товар.Номер))
		 ИЛИ (ЗначениеЗаполнено(Товар.Дата)) Тогда
			ОснованиеПлатежа = ОснованиеПлатежа + " на підставі док. ";
			ОснованиеПлатежа = ОснованиеПлатежа + ?(НЕ ЗначениеЗаполнено(Товар.ВидДокВходящий),""," """ + Товар.ВидДокВходящий + """");
			ОснованиеПлатежа = ОснованиеПлатежа + ?(НЕ ЗначениеЗаполнено(Товар.Номер),""," № " + Товар.Номер);
			ОснованиеПлатежа = ОснованиеПлатежа + ?(НЕ ЗначениеЗаполнено(Товар.Дата),""," від " + Формат(Товар.Дата, "ДЛФ=Д"));
		КонецЕсли;		    
		
		ОбластьМакета.Параметры.ОснованиеПлатежа = ОснованиеПлатежа;			
		
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		
		
		ИтогоПоОтчету = ИтогоПоОтчету + Товар.ПоОтчету 	+ ?(Шапка.СуммаВключаетНДС, 0, Товар.СуммаНДС);
			
		Если     (Товар.СуммаНДС > 0) 
			И НЕ (Товар.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая) Тогда
			ОбластьМакета.Параметры.СуммаБезНДС = Товар.ПоОтчету - ?(Шапка.СуммаВключаетНДС, Товар.СуммаНДС, 0);
			ОбластьМакета.Параметры.СуммаНДС = Товар.СуммаНДС;
		Иначе	
			ОбластьМакета.Параметры.СуммаБезНДС = Товар.ПоОтчету + ?(Шапка.СуммаВключаетНДС, 0, Товар.СуммаНДС);
		КонецЕсли;
		
		Если БухгалтерскийУчет.ПолучитьИспользоватьКлассыСчетовВКачествеГрупп() Тогда
			СчетаЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыПоЭлементам;
		Иначе
			СчетаЗатрат	= Новый Массив;
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты);
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда);
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия);
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.Амортизация);
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты);
			СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам);
		КонецЕсли;
		
		Если (ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8
				ИЛИ ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9)
				И Счет9Класса(Товар.Счет) Тогда
				
			ЗапросПоПроводкам = Новый Запрос();
			ЗапросПоПроводкам.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросПоПроводкам.УстановитьПараметр("СчетаЗатрат", СчетаЗатрат);
			ЗапросПоПроводкам.Текст = "
			|ВЫБРАТЬ
			|	Хозрасчетный.СчетДт
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.Регистратор = &Ссылка
			|	И Хозрасчетный.СчетДт В ИЕРАРХИИ (&СчетаЗатрат)";
			Выборка = ЗапросПоПроводкам.Выполнить().Выбрать();
			Выборка.Следующий();
			СчетБу = Выборка.СчетДт
			
		Иначе 
			
			СчетБу = Товар.Счет;
			
		КонецЕсли;
		ОбластьМакета.Параметры.СчетБУ = СчетБу;		
		
		Если ЗначениеЗаполнено(Товар.СуточныеДатаС) И ЗначениеЗаполнено(Товар.СуточныеДатаПо) Тогда
		
			ОписаниеПериода = БухгалтерскиеОтчеты.СформироватьСтрокуВыводаПараметровПоДатам(Товар.СуточныеДатаС, Товар.СуточныеДатаПо);
			ОбластьМакета.Параметры.Дата = СтрЗаменить(ОписаниеПериода, "Период: ", "");
		
		ИначеЕсли ЗначениеЗаполнено(Товар.Дата) Тогда
			
			ОбластьМакета.Параметры.Дата = Товар.Дата;
			
		КонецЕсли; 
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.СуммаСНДС = ИтогоПоОтчету;
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим подвал авансовго отчета
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьАвансовогоОтчета()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	Если ИмяМакета = "Аванс_Отчет" Тогда
		// Получить экземпляр документа на печать
		Если ОтражатьВБухгалтерскомУчете Тогда
			ТабДокумент = ПечатьАвансовогоОтчетаБух();
		Иначе
			ТабДокумент = ПечатьАвансовогоОтчетаУпр();
		КонецЕсли;
	ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
		ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");
	ИначеЕсли ИмяМакета = "ПриходНаРозничныеСкладыВЦенахАТТ" Тогда
		ТабДокумент = ЗаполнениеДокументов.НапечататьПриходРасходСРозничныхСкладовВЦенахАТТ(Ссылка, мВалютаРегламентированногоУчета, Истина);
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидПоступления)), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Аванс_Отчет",    "Авансовый отчет");
	СтруктураМакетов.Вставить("СерийныеНомера", "Список серийных номеров");
	СтруктураМакетов.Вставить("ПриходНаРозничныеСкладыВЦенахАТТ", "Приход на розничные склады в ценах АТТ");

	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура выполняет заполнение табличной части выданные авансы.
//
Процедура ЗаполнитьВыданныеАвансы() Экспорт

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("МоментДокумента", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("ОтражатьВБухУчете", ОтражатьВБухгалтерскомУчете);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.РасчетныйДокумент КАК ДокументАванса,
	|	Остатки.СуммаВзаиморасчетовОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
	|			&МоментДокумента,
	|			ФизЛицо = &ФизЛицо
	|				И (НЕ РасчетныйДокумент ССЫЛКА Документ.АвансовыйОтчет)
	|				И Валюта = &ВалютаДокумента
	|				И Организация = &Организация
	|				И ВЫБОР
	|					КОГДА &ОтражатьВБухУчете
	|						ТОГДА РасчетныйДокумент.ОтражатьВБухгалтерскомУчете
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВзаиморасчетовОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.РасчетныйДокумент.Дата,
	|	Остатки.РасчетныйДокумент.Номер";
	

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		#Если Клиент Тогда
		Предупреждение("У подотчетного лица """                           + СокрЛП(ФизЛицо)         +
		               """ отсутствуют выданные авансы,"                  + Символы.ПС              +
		               "за которые он не отчитался перед организацией """ + СокрЛП(Организация)     +
		               """ в валюте взаиморасчетов """                    + СокрЛП(ВалютаДокумента) + """");
		#КонецЕсли
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаВыданныеАвансы                = ВыданныеАвансы.Добавить();
		СтрокаВыданныеАвансы.ДокументАванса = Выборка.ДокументАванса;
		СтрокаВыданныеАвансы.Сумма          = Выборка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьВыданныеАвансы()


// Процедура выполняет заполнение табличной части выданные авансы и прочее.
//
Процедура ЗаполнитьНаОснованииРКО(ДокументОснование)

	ФизЛицо = ДокументОснование.Контрагент;

	//Валюта авансового отчета  должна быть равна валюте взаиморасчетов с подотчетником, выбранной в РКО.
	ВалютаДокумента = ДокументОснование.ВалютаВзаиморасчетовРаботника;
	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ОбщегоНазначения.ПолучитьРабочуюДату());
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	// Вид поступления - по умолчанию "На склад".
	ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");

	
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокОснование",    ДокументОснование);
	Запрос.УстановитьПараметр("МоментДокумента", КонецДня(ОбщегоНазначения.ПолучитьРабочуюДату()));

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Остатки.РасчетныйДокумент                КАК РасчетныйДокумент,
	|	Остатки.СуммаВзаиморасчетовОстаток       КАК СуммаИзрасходовано
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(&МоментДокумента, РасчетныйДокумент = &ДокОснование) КАК Остатки
	|";

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Шапка = Результат.Выбрать();
	Шапка.Следующий();

	СтрокаАвансы                = ВыданныеАвансы.Добавить();
	СтрокаАвансы.ДокументАванса = Шапка.РасчетныйДокумент;
	СтрокаАвансы.Сумма          = Шапка.СуммаИзрасходовано;

КонецПроцедуры // ЗаполнитьНаОснованииРКО()

// Процедура выполняет заполнение табличной части по приходному ордеру товаров.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание (приходный ордер товаров).
//
Процедура ЗаполнитьТоварыПоОснованию(ДокументОснование) Экспорт

	// Сформируем запрос по шапке документа-основания
	ЗапросПоШапке = Новый Запрос;

	ЗапросПоШапке.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад"            , СкладОрдер);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	СкладыВТабличнойЧасти = мУказаниеСкладовВТЧ
	                        ИЛИ (ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
	|	ДокТовары.Номенклатура                 КАК Номенклатура,
	|	ДокТовары.Номенклатура.СтавкаНДС                           КАК СтавкаНДС,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаХранения,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,	
	|	ДокТовары.СерияНоменклатуры            КАК СерияНоменклатуры,
	|	ДокТовары.ХарактеристикаНоменклатуры   КАК ХарактеристикаНоменклатуры,"
	+ ?(СкладыВТабличнойЧасти, "
	|	Остатки.Склад                          КАК Склад,", "") + "
	|	СУММА(ДокТовары.Количество*ДокТовары.Коэффициент/ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК КоличествоПоСерии, 
	|	МАКСИМУМ(Остатки.КоличествоОстаток)    КАК КоличествоОстатокКомпании
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ДокТовары
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(, ДокументПолучения = &ДокументОснование) КАК Остатки
	|ПО
	|	ДокТовары.Номенклатура = Остатки.Номенклатура
	|	И ДокТовары.СерияНоменклатуры = Остатки.СерияНоменклатуры
	|	И ДокТовары.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|
	|ГДЕ
	|	ДокТовары.Ссылка = &ДокументОснование
	|	И Остатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТовары.Номенклатура,
	|	ДокТовары.Коэффициент,
	|	ДокТовары.СерияНоменклатуры,
	|	ДокТовары.ХарактеристикаНоменклатуры"
	+ ?(СкладыВТабличнойЧасти, ",
	|	Остатки.Склад", "") + "
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	РезультатЗапроса = Запрос.Выполнить();

	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;

	Контрагент = ДокументОснование.Контрагент;
	Выборка   = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Товары.Добавить();

		СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество                 = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаХранения;
		СтрокаТабличнойЧасти.Коэффициент                = Выборка.КоэффициентЕдиницыХранения;
		СтрокаТабличнойЧасти.СтавкаНДС                  = Выборка.СтавкаНДС;
		СтрокаТабличнойЧасти.Контрагент                 = Контрагент;
		СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.ПриходныйОрдер             = ДокументОснование;

		Если СкладыВТабличнойЧасти Тогда
			СтрокаТабличнойЧасти.Склад = Выборка.Склад;
		Иначе
			СтрокаТабличнойЧасти.Склад = ДокументОснование.Склад;
		КонецЕсли;

		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
		
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);

	КонецЦикла; // Выборка.Следующий()

КонецПроцедуры // ЗаполнитьТоварыПоОснованию()

// Процедура выполняет заполнение табличной части по приходному ордеру на товары.
//
// Параметры:
//  ДокументОснование  - ссылка на документ основание (приходный ордер товаров),
//  ДоговорКонтрагента - ссылка на договор контрагента. который нужно подставить в строки ТЧ.
//
Процедура ЗаполнитьВозвратнуюТаруПоОснованию(ДокументОснование, ДоговорКонтрагента) Экспорт

	// Сформируем запрос по шапке документа-основания
	ЗапросПоШапке = Новый Запрос;

	ЗапросПоШапке.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад"            , СкладОрдер);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокВозвратнаяТара.Номенклатура                 КАК Номенклатура,"
	+ ?(мУказаниеСкладовВТЧ, "
	|	Остатки.Склад                                  КАК Склад,", "") + "	
	|	СУММА(ДокВозвратнаяТара.Количество)            КАК КоличествоПоСерии,
	|	МАКСИМУМ(Остатки.КоличествоОстаток)            КАК КоличествоОстатокКомпании
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.ВозвратнаяТара КАК ДокВозвратнаяТара
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(, ДокументПолучения = &ДокументОснование) КАК Остатки
	|ПО
	|	ДокВозвратнаяТара.Номенклатура = Остатки.Номенклатура
	|
	|ГДЕ
	|	ДокВозвратнаяТара.Ссылка = &ДокументОснование
	|	И Остатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокВозвратнаяТара.Номенклатура"
	+ ?(мУказаниеСкладовВТЧ, ",
	|	Остатки.Склад", "");	

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();

		СтрокаТабличнойЧасти.Номенклатура   = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество     = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);
		СтрокаТабличнойЧасти.Контрагент     = ДокументОснование.Контрагент;
		СтрокаТабличнойЧасти.ДоговорКонтрагента = ДоговорКонтрагента;
		СтрокаТабличнойЧасти.ПриходныйОрдер = ДокументОснование;

		Если мУказаниеСкладовВТЧ Тогда
			СтрокаТабличнойЧасти.Склад = Выборка.Склад;
		Иначе
			СтрокаТабличнойЧасти.Склад = ДокументОснование.Склад;
		КонецЕсли;

		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
		
	КонецЦикла; // Выборка.Следующий()

КонецПроцедуры // ЗаполнитьВозвратнуюТаруПоОснованию()

// Процедура выполняет заполнение документа по документу-основанию.
//
// Параметры:
//  Основание - ссылка на документ основание (приходный ордер товаров).
//
Процедура ОбработкаЗаполненияУпр(Основание)
	
	Перем ДоговорКонтрагента;

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
	   И Основание.ВидОперации = Перечисления.ВидыОперацийПриходныйОрдер.ОтПодотчетника Тогда
	   
	   // Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		ВидПоступления               = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
		СкладОрдер                   = Основание;
		ФизЛицо                      = Основание.ФизЛицо;
		УчитыватьНДС                 = Истина;
		СуммаВключаетНДС             = Истина;
		ВалютаДокумента              = мВалютаРегламентированногоУчета;

		Если ЗначениеЗаполнено(Основание.Контрагент) Тогда
			ДоговорКонтрагента = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Организация, 
			                                          Основание.Контрагент, мСтруктураПараметровДляПолученияДоговора);
			Если ЗначениеЗаполнено(ДоговорКонтрагента)
			   И ЗначениеЗаполнено(ДоговорКонтрагента.ТипЦен) Тогда
				// Тип цен заполняем, только если в договоре указаны тип цен контрагента (он - поставщик).
				ТипЦенКонтрагента = ДоговорКонтрагента.ТипЦен;
				Если ТипЗнч(ТипЦенКонтрагента) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
					ТипЦен = ТипЦенКонтрагента.ТипЦеныНоменклатуры;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Основание.Проведен Тогда
			// Заполним табличные части по приходному ордеру на товары.
			ЗаполнитьТоварыПоОснованию(Основание);
			ЗаполнитьВозвратнуюТаруПоОснованию(Основание, ДоговорКонтрагента);
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
	        И Основание.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику Тогда

		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		// Заолненим теперь на оснвании РКО.
		ЗаполнитьНаОснованииРКО(Основание);

	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполненияУпр()

// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента)

	Если ЗаполнятьБУ = Истина Тогда

		Если ИмяТабЧасти = "Прочее" Тогда
			СтрокаТЧ.СчетЗатрат = СчетаУчета.СчетУчетаБУ;
		Иначе
			СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		Если ИмяТабЧасти = "Прочее" Тогда
			СтрокаТЧ.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Иначе
			СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУРегл()

// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДокумента)

	Если ЗаполнятьНУ  = Истина Тогда
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначение;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 		= СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;				
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;				
	КонецЕсли; // Если ЗаполнятьНУ  = Истина Тогда

КонецПроцедуры // ЗаполнитьСчетаНУРегл()

// Заполняет счета БУ и НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, ?(ИмяТабЧасти<>"Прочее", СтрокаТЧ.Склад, Справочники.Склады.ПустаяСсылка()));
	
	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	
	ЗаполнитьСчетаБУРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента);
	
	ЗаполнитьСчетаНУРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДокумента);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
			Возврат;
		КонецЕсли;
		
		МассивРазделовУчета = Новый Массив;
		// в каких видах учета должен отражаться документ
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);		
		ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);
	КонецЕсли;
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ДвиженияПоЕдиномуНалогу(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,Отказ)
	
	РеестрПлатежейПоЕдиномуНалогу = Новый ТаблицаЗначений;
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("ГривневаяСумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтатьяДекларацииПоЕдиномуНалогу");
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));		
    	
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	ТаблицаКопия.Свернуть("СтатьяДекларацииПоЕдиномуНалогу", "СуммаСНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаСНДСРегл.Имя = "ГривневаяСумма";
	ТаблицаКопия.Колонки.СуммаНДСРегл.Имя = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, РеестрПлатежейПоЕдиномуНалогу);

	ТаблицаКопия = ТаблицаПоПрочее.Скопировать();
	ТаблицаКопия.Свернуть("СтатьяДекларацииПоЕдиномуНалогу", "СуммаСНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаСНДСРегл.Имя = "ГривневаяСумма";
	ТаблицаКопия.Колонки.СуммаНДСРегл.Имя = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, РеестрПлатежейПоЕдиномуНалогу);
	
	ТаблицаКопия = ТаблицаПоОплатамПоставщикам.Скопировать();
	ТаблицаКопия.Свернуть("СтатьяДекларацииПоЕдиномуНалогу", "ПроводкаСуммаСНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.ПроводкаСуммаСНДСРегл.Имя = "ГривневаяСумма";
	ТаблицаКопия.Колонки.СуммаНДСРегл.Имя = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, РеестрПлатежейПоЕдиномуНалогу);

	НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежейПоЕдиномуНалогу,Отказ);
		
КонецПроцедуры

// По виду операции определяет статус партии прихода товаров (не возвратная тара!)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Значение перечисления "Статусы партии товаров".
//
Функция ОпределитьСтатусПартииПрихода() 

	Статус = Перечисления.СтатусыПартийТоваров.Купленный; 

	Возврат Статус;

КонецФункции // ОпределитьСтатусПартииПрихода()

// Заполняет в таблице движений по регитстру ПартииТоваровНаСкладах нестандартные поля.
//
// Параметры:
//  ТаблицаТЧ       - таблица значений, соответствующая табличной части документа
//  ТаблицаДвижений - таблица значений, соответствующая набору записей регистра,
//  СтатусПартии    - значение перечисления статусов партий. 
//
Процедура ЗаполнитьПоляПартииТоваровНаСкладахУпр(ТаблицаТЧ, СтруктураШапкиДокумента, ТаблицаДвижений, СтатусПартии, СпособОценкиМПЗ)

	Для каждого СтрокаДвижений Из ТаблицаДвижений Цикл

		СтрокаТЧ = ТаблицаТЧ.Найти(СтрокаДвижений.НомерСтроки, "НомерСтроки");
		
		Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
			Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
				СтрокаДвижений.Склад = СтрокаТЧ.ПриходныйОрдерСклад;
			КонецЕсли;
		Иначе
			СтрокаДвижений.Склад = Неопределено;
		КонецЕсли;
		
		Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда
			СтрокаДвижений.ДокументОприходования = Неопределено;
		Иначе
			СтрокаДвижений.ДокументОприходования = Ссылка;
		КонецЕсли;
		СтрокаДвижений.СтатусПартии          = СтатусПартии;
		СтрокаДвижений.Качество              = Справочники.Качество.Новый;

		// Заказ заполняем если его указали в документе и по договору ведется обособленный учет товаров по заказам.
		ОбособленныйУчет = СтрокаТЧ .ОбособленныйУчетТоваровПоЗаказамПокупателей;
		СтрокаДвижений.Заказ = ?(ОбособленныйУчет <> NULL И ОбособленныйУчет 
		        И Не (НЕ ЗначениеЗаполнено(СтрокаТЧ.Заказ)), СтрокаТЧ.Заказ, Неопределено);

		// Если партионный учет по сериям не ведется, то надо очистить серию
		Если СтатусПартии <> Перечисления.СтатусыПартийТоваров.ВозвратнаяТара И НЕ СтрокаТЧ.ВестиПартионныйУчетПоСериям Тогда
			СтрокаДвижений.СерияНоменклатуры = Неопределено;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоляПартииТоваровНаСкладах()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	ТаблицаТоваров.Индексы.Добавить("НомерСтроки");

	// Создаем колонку "Стоимость" и копируем в нее колонку "Сумма"
	ТаблицаТоваров.Колонки.Добавить("Стоимость");
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Сумма") , "Стоимость");
   
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТоваров, "Склад", "ВидСклада");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
		                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСклада");
	КонецЕсли;
	
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)
 
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр",    ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"           	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл		

		СтоимостьСНДС  = СтрокаТаблицы.Стоимость + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			
			Если СтруктураШапкиДокумента.УчитыватьНДС = Ложь Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				СуммаНДСВалУпр = СтрокаТаблицы.СуммаНДСПропорциональноКредит;
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;

	КонецЦикла;

	
КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)
	

	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаТоваров.ЗаполнитьЗначения(0                            , "НДС");		
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Добавить("ДляХозяйственнойДеятельности", Новый ОписаниеТипов("Булево"));
	// для товаров колонка Амортизируется = Ложь
	ТаблицаТоваров.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Ложь;	
		Иначе
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Истина;	
		КонецЕсли;
		Если СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
	        СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + ?(СтруктураШапкиДокумента.СуммаВключаетНДС, 0, СтрокаТаблицы.НДС - СтрокаТаблицы.СуммаНДСПропорциональноКредит);
		Иначе
			СтрокаТаблицы.СуммаНДСПропорциональноКредит = СтрокаТаблицы.НДС;
		КонецЕсли;
	КонецЦикла;

	ТаблицаТоваров.Колонки.НДС.Имя = "СуммаНДСВалИсходный";
	ТаблицаТоваров.Колонки.СуммаНДСПропорциональноКредит.Имя = "НДС";
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Если СтруктураШапкиДокумента.Дата >= '20120101' Тогда
		ТаблицаТоваров.ЗаполнитьЗначения(Ложь, "НеОтноситьНаЗатратыПоНУ");
	КонецЕсли;
		
КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура  ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, знач СтатусПартии)

	Сч = 0;

	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			  И СтрокаТаблицы.Заказ.Заказчик = СкладОрдер Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.Заказ, 
			                                                       СтрокаТаблицы.Количество, 
			                                                       СтрокаТаблицы.Номенклатура, 
			                                                       ?(СтатусПартии=Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,неопределено,СтрокаТаблицы.ХарактеристикаНоменклатуры), 
			                                                       СтрокаТаблицы.ЕдиницаИзмерения,
			                                                       СтатусПартии);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();
	ТаблицаТары.Индексы.Добавить("НомерСтроки");

	// Переименуем колонку "Сумма" в "Стоимость" (как в регистрах).
   	ТаблицаТары.Колонки.Добавить("Стоимость");
	ТаблицаТары.ЗагрузитьКолонку(ТаблицаТары.ВыгрузитьКолонку("Сумма") , "Стоимость");

	ТаблицаТары.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТары, "Склад", "ВидСклада");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТары.ВыгрузитьКолонку("Склад"),
		                 ТаблицаТары.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТары, ТаблицаПоЦенам, "ВидСклада");
	КонецЕсли;
	
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)
	
	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	// Надо расчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаТаблицы.ВалютаДоговора, Дата);

		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
		                                 СтрокаТаблицы.ВалютаДоговора, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураКурса.Курс, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураКурса.Кратность);

		// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
			СтрокаТаблицы.Сделка = Неопределено;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

Процедура ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ТаблицаТары.Колонки.Добавить("СтавкаНДС");
	ТаблицаТары.Колонки.Добавить("НДС");
	ТаблицаТары.Колонки.Добавить("Амортизируется");
	ТаблицаТары.Колонки.Добавить("ДляХозяйственнойДеятельности");
	
	ТаблицаТары.ЗаполнитьЗначения(Перечисления.СтавкиНДС.НеНДС	, "СтавкаНДС");
	ТаблицаТары.ЗаполнитьЗначения(0								, "НДС");
	
	Для каждого Строка Из ТаблицаТары Цикл
	
		
		// Для налоговых регистров тара без НДС, и не амортизируется
	    Строка.Амортизируется 				= Ложь; 
	    Строка.ДляХозяйственнойДеятельности = Истина;
	
	КонецЦикла;
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Если СтруктураШапкиДокумента.Дата >= '20120101' Тогда
		ТаблицаТары.ЗаполнитьЗначения(Ложь, "НеОтноситьНаЗатратыПоНУ");
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьТаблицуТарыРегл()	

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуПоОплате(РезультатЗапросаПоОплате, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаПоОплате = РезультатЗапросаПоОплате.Выгрузить();

	ПодготовитьТаблицуПоОплатеУпр(ТаблицаПоОплате, СтруктураШапкиДокумента);
    ПодготовитьТаблицуПоОплатеРегл(ТаблицаПоОплате, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Возврат ТаблицаПоОплате;

КонецФункции // ПодготовитьТаблицуПоОплате()

Процедура ПодготовитьТаблицуПоОплатеУпр(ТаблицаПоОплате, СтруктураШапкиДокумента)
	
	ТаблицаПоОплате.Колонки.Добавить("СуммаУпр",    ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
	
	// Надо расчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаПоОплате Цикл

		// Суммы пересчитаем в валюту упр. учета.
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
			СтрокаТаблицы.Сделка = Неопределено;
		КонецЕсли;
		
		Если НЕ  ЗначениеЗаполнено(СтрокаТаблицы.СделкаВзаиморасчеты)
			 ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтрокаТаблицы.СделкаВзаиморасчеты = Неопределено;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуПоОплатеУпр()

Процедура ПодготовитьТаблицуПоОплатеРегл(ТаблицаПоОплате, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ТаблицаПоОплате.Колонки.Добавить("ПроводкаСуммаСНДСВал", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоОплате.Колонки.Добавить("ПроводкаСуммаСНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоОплате.Колонки.Добавить("СуммаНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	ВалютаРег      = мВалютаРегламентированногоУчета;
	Данные         = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРег, Дата);

	// Надо расчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаПоОплате Цикл

		СтрокаТаблицы.ПроводкаСуммаСНДСВал = СтрокаТаблицы.СуммаВзаиморасчетов;
		Если СтрокаТаблицы.ВалютаДоговора = ВалютаРег Тогда
			СтрокаТаблицы.ПроводкаСуммаСНДСРегл = СтрокаТаблицы.СуммаВзаиморасчетов;
			СтрокаТаблицы.СуммаНДСРегл = СтрокаТаблицы.СуммаНДС;
		Иначе
			СтрокаТаблицы.ПроводкаСуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, 
											 СтруктураШапкиДокумента.ВалютаДокумента,    ВалютаРег,
											 СтруктураШапкиДокумента.КурсДокумента,      Данные.Курс,
											 СтруктураШапкиДокумента.КратностьДокумента, Данные.Кратность);
			СтрокаТаблицы.СуммаНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаНДС, 
											 СтруктураШапкиДокумента.ВалютаДокумента,    ВалютаРег,
											 СтруктураШапкиДокумента.КурсДокумента,      Данные.Курс,
											 СтруктураШапкиДокумента.КратностьДокумента, Данные.Кратность);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // ПодготовитьТаблицуТарыРегл()	

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоПрочие  - результат запроса по табличной части "Прочие",
//  СтруктураШапкиДокумента  - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуПрочие(РезультатЗапросаПоПрочее, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаПрочие = РезультатЗапросаПоПрочее.Выгрузить();

	ПодготовитьТаблицуПрочиеУпр(ТаблицаПрочие, СтруктураШапкиДокумента);
	ПодготовитьТаблицуПрочиеРегл(ТаблицаПрочие, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Возврат ТаблицаПрочие;

КонецФункции // ПодготовитьТаблицуПрочие()

Процедура ПодготовитьТаблицуПрочиеУпр(ТаблицаПрочие, СтруктураШапкиДокумента)

	КолонкаСумма = ТаблицаПрочие.Колонки["Сумма"];
	КолонкаСуммаУпр = ТаблицаПрочие.Колонки.Добавить("СуммаУпр", Новый ОписаниеТипов(КолонкаСумма.ТипЗначения));
	КолонкаСуммаУпр = ТаблицаПрочие.Колонки.Добавить("Стоимость", Новый ОписаниеТипов(КолонкаСумма.ТипЗначения));
	
	ТаблицаПрочие.Колонки.Добавить("НДСУпр", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;

	Для Каждого СтрокаТаблицы Из ТаблицаПрочие Цикл
		
		СтоимостьСНДС  = СтрокаТаблицы.Сумма + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			
			Если СтруктураШапкиДокумента.УчитыватьНДС = Ложь Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				СуммаНДСВалУпр = СтрокаТаблицы.СуммаНДСПропорциональноКредит;
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;


	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуПрочиеУпр()

Процедура ПодготовитьТаблицуПрочиеРегл(ТаблицаПрочие, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаПрочие.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаПрочие.ЗаполнитьЗначения(0                            , "НДС");
	КонецЕсли;
	
	ТаблицаПрочие.Колонки.Добавить("ДляХозяйственнойДеятельности", Новый ОписаниеТипов("Булево"));
	ТаблицаПрочие.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));
	
	Для Каждого Строка Из ТаблицаПрочие Цикл
		Если Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			Строка.ДляХозяйственнойДеятельности = Ложь;
		Иначе
			Строка.ДляХозяйственнойДеятельности = Истина;
		КонецЕсли;
		Если Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
	        Строка.Сумма = Строка.Сумма + ?(СтруктураШапкиДокумента.СуммаВключаетНДС, 0, Строка.НДС - Строка.СуммаНДСПропорциональноКредит);
		Иначе
			Строка.СуммаНДСПропорциональноКредит = Строка.НДС;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПрочие.Колонки.Добавить("ХарактерЗатратБУ");
	ТаблицаПрочие.Колонки.Добавить("ХарактерЗатратНУ");
	
	Для каждого Строка Из ТаблицаПрочие Цикл
		
		// заполним характер затрат, признак Амортизируется и НалоговоеНазначениеДоходовИЗатрат
		Строка.ХарактерЗатратБУ = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатратПриПоступлении(Строка.СчетЗатрат, Строка.СтатьяЗатрат);
		
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(Строка, Строка.СчетЗатрат, Строка.ХарактерЗатратНУ,
														       	Строка.НалоговоеНазначениеДоходовИЗатрат, Строка.Амортизируется,    
																Строка.НалоговоеНазначение, Строка.НалоговоеНазначениеДоходовИЗатрат,,,,Дата);
		
	КонецЦикла;	
	
	ТаблицаПрочие.Колонки.НДС.Имя = "СуммаНДСВалИсходный";
	ТаблицаПрочие.Колонки.СуммаНДСПропорциональноКредит.Имя = "НДС";
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаПрочие, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	Если СтруктураШапкиДокумента.Дата >= '20120101' Тогда
		ТаблицаПрочие.ЗаполнитьЗначения(Ложь, "НеОтноситьНаЗатратыПоНУ");
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ВидПоступления, Организация, ФизЛицо, ВалютаДокумента");
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И Не СтруктураШапкиДокумента.СкладВТабличнойЧасти
	   И (Товары.Количество() > 0 ИЛИ ВозвратнаяТара.Количество() > 0) Тогда
		СтруктураОбязательныхПолей.Вставить("СкладОрдер");
	КонецЕсли;
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Если склад указывается в ТЧ, то в шапке он может быть не заполнен или указан неправильно,
	// это ни на что не влияет, потому что при проведении используется склад в ТЧ.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И Не СтруктураШапкиДокумента.СкладВТабличнойЧасти 
	   И СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Документ не может осуществлять поступление на неавтоматизированную торговую точку!", Отказ, Заголовок);
	КонецЕсли;

	// Израсходованная сумма
	Если ВыданныеАвансы.Итог("Сумма") > СуммаДокумента Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Израсходованная сумма превышает сумму по документу!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Выданные авансы".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВыданныеАвансы(ТаблицаПоАвансам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ДокументАванса, Сумма");
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВыданныеАвансы",СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверка организации
	СписокПроверяемыхРеквизитов = Новый СписокЗначений;
	СписокПроверяемыхРеквизитов.Добавить("ДокументАвансаОрганизация", "документ аванса");
	ПроверитьОрганизациюВТабличнойЧасти(ЭтотОбъект, "ВыданныеАвансы", ТаблицаПоАвансам, СписокПроверяемыхРеквизитов, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВыданныеАвансы()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТовары();

	Если ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		
		Если УчитыватьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
		КонецЕсли;
						
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ЕстьНДС ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			СтруктураОбязательныхПолей.Вставить("Контрагент");
			СтруктураОбязательныхПолей.Вставить("ДоговорКонтрагента");
		КонецЕсли;

	КонецЕсли;	
	
	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;

	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, "Товары", СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);
	
	Если (   ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад 
	      ИЛИ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете)
	    И СтруктураШапкиДокумента.СкладВТабличнойЧасти Тогда
	   
	   Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Товары"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
	   
			Если СтрокаТЧ.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "указан склад - неавтоматизированная торговая точка!", Отказ, Заголовок);
			КонецЕсли;
			
	   	КонецЦикла;
		
	КонецЕсли;

	Если ОтражатьВБухгалтерскомУчете Тогда
		
		Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Товары"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
			СтрокаСообщения = " указан забалансовый счет. Прием на комиссию документом не поддерживается!";

			Если СтрокаТЧ.СчетУчетаБУЗаб = Истина  Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;

			Если СтруктураШапкиДокумента.УчитыватьНДС 
			   И СтруктураШапкиДокумента.ЕстьНДС Тогда
					
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетУчетаНДС) Тогда
					СтрокаСообщения = "Не заполнено значение реквизита ""Счет учета НДС""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				
				Если Не СтрокаТЧ.ДоговорКонтрагента.Пустая() Тогда
					  // вид договора может быть только по договору в целом или по счетам 
					  Если СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
					     И СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
						 
						СтрокаСообщения = "Веденее взаиморсчетов по договору должно быть или ""По договору в целом"" или ""По счетам""!";
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
						 
					 ИначеЕсли СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам 
						  И НЕ ЗначениеЗаполнено(СтрокаТЧ.Сделка) Тогда
						 // Сделка при расчетах по счетам должна быть заполнена.
						 
						СтрокаСообщения = "В реквизите ""Сделка"" не указан ""Счет на оплату поставщику""!";
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
										  
					  КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;	
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ВидПоступления <> Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		// Складов с видом НТТ здесь быть не должно.
		УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок, "ВидСклада");
	КонецЕсли;
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок, "ВидСклада");

	// Проверка организации
	СписокПроверяемыхРеквизитов = Новый СписокЗначений;
	СписокПроверяемыхРеквизитов.Добавить("ОрганизацияДокументаПолучения", "приходный ордер на товары");
	ПроверитьОрганизациюВТабличнойЧасти(ЭтотОбъект, "Товары", ТаблицаПоТоварам, СписокПроверяемыхРеквизитов, Отказ, Заголовок);

	// Проверка соответствия количества серийных номеров количеству товаров.
	УчетСерийныхНомеров.ПроверитьКоличествоСерийныхНомеровВДокументе(ЭтотОбъект, "Товары");
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплатаПоставщикам(ТаблицаПоОплате, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "ОплатаПоставщикам";
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Контрагент, ДоговорКонтрагента, Сумма");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");	
	
	КонецЕсли;
	
	Если  СтруктураШапкиДокумента.ЕстьНДС или СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		Для каждого Платеж  Из ТаблицаПоОплате Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС (неподтвержденный)!");
						
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС н/к (н/о)!");
						
					КонецЕсли;
				КонецЕсли;

				Если Платеж.НалоговоеНазначение.Пустая() Тогда
						
					Отказ = истина;
						
					Если Отказ Тогда
						
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указано Налоговое назначение!");
							
					КонецЕсли;
				КонецЕсли;
				
				// пропорциональный НДС может быть указан только для ставок НДС 20% и для хоз.деятельности
				Если СтруктураШапкиДокумента.ЕстьНДС Тогда
				
					Если Платеж.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально
						И НЕ (Платеж.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ Платеж.СтавкаНДС = Перечисления.СтавкиНДС.НДС0) Тогда
						
						СтрокаСообщения = Локализация.СтрШаблон1("Для договора ""¤1¤"" в табличной части ""Оплата поставщикам"" указан признак пропорционального включения НДС в кредит."
						"При этом ставка НДС может быть только 20%, а вид налоговой деятельности (из налогового назначения) должен относиться к хозяйственной деятельности. Испаравьте указанные реквизиты!", Строка(Платеж.ДоговорКонтрагента));
						
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
						
					КонецЕсли;
					
				КонецЕсли;		
				
			КонецЕсли;
			
		КонецЦикла; 	
		
	КонецЕсли; 
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти,СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Проверим заполнение заказов поставщикам
	УправлениеВзаиморасчетами.ПроверитьСделкуВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоОплате, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договорах взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоОплате, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОплатаПоставщикам()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  ТаблицаПоПрочее         - таблица значений, содержащая результат запроса с данными для проведения и проверки ТЧ Прочее
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПрочее(ТаблицаПоПрочее, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Содержание, Сумма, СтатьяЗатрат");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если СтруктураШапкиДокумента.УчитыватьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
			Если СтруктураШапкиДокумента.ЕстьНДС Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Прочее", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетТоваров(ЭтотОбъект, "Прочее", ТаблицаПоПрочее, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Прочее", ТаблицаПоПрочее, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Прочее", ТаблицаПоПрочее, Отказ, Заголовок);
	
	// Проверим заполнение аналитики затрат
	ОбщегоНазначения.ПроверитьЗаполнениеАналитикиЗатратТабличнойЧасти(ЭтотОбъект,"Прочее", Отказ, Заголовок);	
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			ОбщегоНазначения.ПроверитьСоответствиеАналитикиЗатратНалоговомуНазначению(ЭтотОбъект, "Прочее", Отказ, Заголовок);
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ТаблицаПоПрочее Цикл
			
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
								   """ табличной части ""Прочее"": ";
					
		КонецЦикла;		
 
		Для каждого СтрокаАвансовПрочее Из Прочее Цикл
			
		    Если СтрокаТаблицы.ЭтоСуточные Тогда
				
				Если СтрокаТаблицы.СуточныеДатаС > СтрокаТаблицы.СуточныеДатаПо Тогда
			
					СтрокаСообщения = "Значение реквизита ""Суточные дата с"" не может быть больше значения реквизита ""Суточные дата по""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
					
				КонецЕсли;
				
			ИначеЕсли СтруктураШапкиДокумента.ЕстьНДС Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначение) Тогда
					ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.НалоговоеНазначение.Представление();
					СтрокаСообщения = НСтр("Не заполнено значение реквизита """) + СокрЛП(ПредставлениеРеквизита) + """!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
					ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.Контрагент.Представление();
					СтрокаСообщения = НСтр("Не заполнено значение реквизита """) + СокрЛП(ПредставлениеРеквизита) + """!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
					ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.ДоговорКонтрагента.Представление();
					СтрокаСообщения = НСтр("Не заполнено значение реквизита """) + СокрЛП(ПредставлениеРеквизита) + """!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				
				Если УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС) > 0 Тогда
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДС) Тогда // надо ругаться
						ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.СчетУчетаНДС.Представление();
						СтрокаСообщения = НСтр("Не заполнено значение реквизита """) + СокрЛП(ПредставлениеРеквизита) + """!";
		                
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);

					КонецЕсли;
					
				КонецЕсли;
				
				
			ИначеЕсли СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
					ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.Контрагент.Представление();
					СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""';uk='Не заповнене значення реквізиту ""'") + СокрЛП(ПредставлениеРеквизита) + """!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
					ПредставлениеРеквизита = ЭтотОбъект.Метаданные().ТабличныеЧасти.Прочее.Реквизиты.ДоговорКонтрагента.Представление();
					СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""';uk='Не заповнене значення реквізиту ""'") + СокрЛП(ПредставлениеРеквизита) + """!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ Отказ И СтруктураШапкиДокумента.ЕстьНДС Тогда
				Если   СтрокаТаблицы.ХарактерЗатратНУ = "ОПЗ"
					 И СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для услуги в строке ""¤1¤"" нельзя указывать нехозяйственное налоговое назначение (на 91 счете такое налоговое назначение не допустимо)!'; uk = 'Для послуги в рядку ""¤1¤"" не можна зазначати негосподарське податкове призначення (на 91 рахунку таке податкое призначення не припустиме)!'"), СтрокаТаблицы.НомерСтроки);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ Отказ И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				ХарактерЗатрат = СтрокаТаблицы.ХарактерЗатратНУ;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат) Тогда
					
					Если ХарактерЗатрат = "Затраты" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" не указано налоговое назначение затрат!", СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "Строительство" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" не указано налоговое назначение для объекта строительства или НМА!", СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "Производство" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" не указано налоговое назначение в производстве для номенклатурной группы!", СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					ИначеЕсли ХарактерЗатрат = "РБП" Тогда
						СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" не указано налоговое назначение для расходов будущих периодов!", СтрокаТаблицы.НомерСтроки);
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
					Иначе
						СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" невозможно определить налоговое назначение затрат для указанного счета затрат!", СтрокаТаблицы.НомерСтроки);
						Сообщить(СтрокаСообщения);			
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			// нельзя по НДС указывать нехоз. деятельность, а по НП - хоз. деятельность
			Если НЕ Отказ И НЕ СтрокаТаблицы.ЭтоСуточные И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И СтруктураШапкиДокумента.ЕстьНДС Тогда
				
				НехозДеятельностьНДС = (СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
				НехозДеятельностьНКУ = (СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
				
				Если НЕ СтрокаТаблицы.НалоговоеНазначение = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат
					  И НехозДеятельностьНДС <> НехозДеятельностьНКУ Тогда 
					СтрокаСообщения = Локализация.СтрШаблон1("Для услуги в строке ""¤1¤"" нельзя указывать нехозяйственное налоговое назначение и одновременно хозяйственную деятельность по затратам (и наоборот)!", СтрокаТаблицы.НомерСтроки);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				КонецЕсли;
				
			КонецЕсли; 
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиПрочее()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, 
	                                                      Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвратнаяТара";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТара();
	СтруктураОбязательныхПолей.Вставить("Контрагент");
	СтруктураОбязательныхПолей.Вставить("ДоговорКонтрагента");

	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре");
		
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти,СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ВидПоступления <> Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		// Складов с видом НТТ здесь быть не должно.
		УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок, "ВидСклада");
	КонецЕсли;
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);

	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договорах взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);

	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, Отказ, Заголовок);
	
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок, "ВидСклада");
	
	// Проверка организации, договор взаиморасчетов проверяем всегда.
	СписокПроверяемыхРеквизитов = Новый СписокЗначений;
	СписокПроверяемыхРеквизитов.Добавить("ДоговорОрганизация",            "договор контрагента");
	СписокПроверяемыхРеквизитов.Добавить("СделкаОрганизация",             "документ сделки");
	СписокПроверяемыхРеквизитов.Добавить("ОрганизацияДокументаПолучения", "приходный ордер на товары");
	ПроверитьОрганизациюВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТаре, СписокПроверяемыхРеквизитов, Отказ, Заголовок);
	
	// Нельзя резервировать возвратную тару под заказ покупателя с обособленным учетом
	УправлениеЗаказами.ПроверитьРезервированиеТарыПодЗаказСОбособленнымУчетом(ЭтотОбъект,"Заказ", ложь,, Отказ, Заголовок);
	
	ПроверитьСоответствиеВалютДоговоровИДокумента("ВозвратнаяТара", Отказ, Заголовок, "Тара");
	
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	Для каждого СтрокаТаблицы Из ТаблицаПоТаре Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

		Если Не СтрокаТаблицы.ДоговорКонтрагента.Пустая() Тогда
			// вид договора может быть только по договору в целом или по счетам 
			Если СтрокаТаблицы.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
			   И СтрокаТаблицы.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					
				СтрокаСообщения = "Веденее взаиморсчетов по договору должно быть или ""По договору в целом"" или ""По счетам""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
					
			ИначеЕсли СтрокаТаблицы.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам 
				И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
				// Сделка при расчетах по счетам должна быть заполнена.
					
				СтрокаСообщения = "В реквизите ""Сделка"" не указан ""Счет на оплату поставщику""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
					
			КонецЕсли;
		КонецЕсли;

		Если (    ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
			  ИЛИ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете)
		   И СтруктураШапкиДокумента.СкладВТабличнойЧасти 
	       И СтрокаТаблицы.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "указан склад - неавтоматизированная торговая точка!", Отказ, Заголовок);
		
		КонецЕсли;

		СтрокаСообщения = " указан забалансовый счет!";
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			
			Если СтрокаТаблицы.СчетУчетаБУЗаб = Истина Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.НалоговоеНазначение) Тогда
				Если СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					СтрокаСообщения = " указно налоговое назначение по нехозяйственной деятельности!";
											
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли СтрокаТаблицы.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
					СтрокаСообщения = " указно налоговое назначение по пропорциональному НДС!";
								
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;

			КонецЕсли;
			

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// Проверка соответствия организации указанной в документе
// и организации в реквизитах табличной части.
//
// Параметры:
//  ДокументОбъект              - объект проводимого документа,
//  ИмяТабличнойЧасти           - табличная часть документа,
//  ТаблицаЗначений             - таблица значений, содержащая данные табличной части,
//  СписокПроверяемыхРеквизитов - список значений, список проверяемых реквизитов табличной части,
//  Отказ                       - флаг отказа в проведении,
//  Заголовок                   - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьОрганизациюВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ТаблицаЗначений,
                                              СписокПроверяемыхРеквизитов, Отказ, Заголовок)

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	// Цикл по строкам таблицы значений.
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """     + СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                                """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

		// Цикл по проверяемым реквизитам
		Для каждого ЭлементСписка Из СписокПроверяемыхРеквизитов Цикл
			ПроверяемоеЗначение = СтрокаТаблицы[ЭлементСписка.Значение];
			ТекстСообщения      = ЭлементСписка.Представление;

			// Если не заполнен реквизит или организация, то не ругаемся.
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ЗначениеЗаполнено(ПроверяемоеЗначение)
			   И ДокументОбъект.Организация <> ПроверяемоеЗначение Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке 
				                 + "выбран " + ТекстСообщения + ", не соответствующий организации, указанной в документе!", Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ПроверитьОрганизациюВТабличнойЧасти()

Процедура ПроверитьСоответствиеВалютДоговоровИДокумента(ИмяТабличнойЧасти, Отказ, Заголовок, ПредставлениеТабличнойЧасти = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки,
	|	ТабЧасть.ДоговорКонтрагента,
	|	ТабЧасть.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТабЧасть.ДоговорКонтрагента.Внешнеэкономический КАК Внешнеэкономический
	|ИЗ
	|	Документ.АвансовыйОтчет." + ИмяТабличнойЧасти + " КАК ТабЧасть
	|ГДЕ
	|	Ссылка = &Ссылка
	|		И ТабЧасть.ДоговорКонтрагента.Внешнеэкономический ЕСТЬ НЕ NULL";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если ПустаяСтрока(ПредставлениеТабличнойЧасти) Тогда
		ПредставлениеТабличнойЧасти = Ссылка.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Синоним;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
	
		Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
		
			Если Выборка.ВалютаВзаиморасчетов <> ВалютаДокумента
				И Выборка.Внешнеэкономический Тогда
				ТекстСообщения = "Строка " + Выборка.НомерСтроки + " табличной части " + ПредставлениеТабличнойЧасти + ":
				|    валюта договора должна быть равна валюте регламентированного учета или договор должен быть внешнеэкономическим.";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			КонецЕсли;
		
		Иначе
		
			Если Выборка.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
				ТекстСообщения = "Строка " + Выборка.НомерСтроки + " табличной части " + ПредставлениеТабличнойЧасти + ":
				|    валюта договора должна быть равна валюте документа.";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

// Формируем движения по ТЧ "ВыданныеАвансы"
//
// Параметры: 
//  СтруктураШапкиДокумента                  - выборка из результата запроса по шапке документа
//  ВыборкаПоВыданныеАвансы		             - выборка из результата запроса по ТЧ "ВыданныеАвансы" 
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//  Режим									 - режим проведения
//  Отказ   			                     - флаг отказа в проведении.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДвиженияПоПодотчетникамУпр(СтруктураШапкиДокумента, ТаблицаПоВыданныеАвансы, Режим, Отказ, Заголовок)

	// Если НДС и не включаются в сумму документа, то его надо добавить 
	// к общей сумме
	Налоги = 0;
	НалогиПрочее = 0;
	Если НЕ СуммаВключаетНДС Тогда
		Налоги 		 = Товары.Итог("СуммаНДС");
		НалогиПрочее = Прочее.Итог("СуммаНДС");
	КонецЕсли;

	// Следующие переменные будут содержать текущие (непогашенные) остатки сумм
	// по табличным частям документа
	ОстПогСуммаТовары = Товары.Итог("Сумма") + Налоги;
	ОстПогСуммаОплата = ОплатаПоставщикам.Итог("Сумма");
	ОстПогСуммаПрочее = Прочее.Итог("Сумма") + НалогиПрочее;
	
	НаборДвижений   = Движения.ВзаиморасчетыСПодотчетнымиЛицами;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Для каждого СтрокаТаблицы Из ТаблицаПоВыданныеАвансы Цикл

		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		ОстПогРКО = СтрокаТаблицы.Сумма;
		
		// Будем последовательно списывать суммы по табличным частям документа,
		// делая движения с соответствующими кодами операций
		Пока ОстПогРКО > 0 Цикл
			
			// ОстПог - текущий остаток по текущей ТЧ документа, который надо погасить
			Если ОстПогСуммаТовары > 0 Тогда
				ОстПог					= ОстПогСуммаТовары;  
				//КодОперации				= Перечисления.КодыОпераций.АвансовыйОтчетЗакупкаТМЦ;
				ОстПогСуммаТовары	= ОстПогСуммаТовары - Мин(ОстПог, ОстПогРКО);
			ИначеЕсли ОстПогСуммаОплата > 0 Тогда
				ОстПог					= ОстПогСуммаОплата;
				//КодОперации				= Перечисления.КодыОпераций.АвансовыйОтчетОплатаПоставщикам;
				ОстПогСуммаОплата		= ОстПогСуммаОплата - Мин(ОстПог, ОстПогРКО);
			ИначеЕсли ОстПогСуммаПрочее > 0 Тогда
				ОстПог					= ОстПогСуммаПрочее;
				//КодОперации				= Перечисления.КодыОпераций.АвансовыйОтчетПрочее;
				ОстПогСуммаПрочее		= ОстПогСуммаПрочее - Мин(ОстПог, ОстПогРКО);
			Иначе
				Прервать;
			КонецЕсли;
				
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			
			// Измерения
			СтрокаДвижений.Организация	        = СтруктураШапкиДокумента.Организация;
			СтрокаДвижений.ФизЛицо	 	        = ФизЛицо;
			СтрокаДвижений.РасчетныйДокумент    = СтрокаТаблицы.ДокументАванса;
			СтрокаДвижений.Валюта			    = ВалютаДокумента;

			// Ресурсы
			СтрокаДвижений.СуммаВзаиморасчетов  = Мин(ОстПог, ОстПогРКО);
			СтрокаДвижений.СуммаУпр             = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаДвижений.СуммаВзаиморасчетов,
								ВалютаДокумента, СтруктураШапкиДокумента.ВалютаУправленческогоУчета, КурсДокумента,
								СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, КратностьДокумента,
								СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

			ОстПогРКО = ОстПогРКО - СтрокаДвижений.СуммаВзаиморасчетов;
			
		КонецЦикла;
			
	КонецЦикла; 

	// Если все суммы выданных авансов списаны, а суммы по расходам списаны неполностью,
	// то возникает перерасход
	Перерасход = ОстПогСуммаТовары + ОстПогСуммаОплата + ОстПогСуммаПрочее;

	Если Перерасход > 0 И НЕ Отказ Тогда

		СтрокаДвижений = ТаблицаДвижений.Добавить();
		
		// Измерения
		СтрокаДвижений.Организация	        = СтруктураШапкиДокумента.Организация;
		СтрокаДвижений.ФизЛицо	 	        = ФизЛицо;
		СтрокаДвижений.РасчетныйДокумент    = Ссылка;
		СтрокаДвижений.Валюта			    = ВалютаДокумента;

		// Ресурсы
		СтрокаДвижений.СуммаВзаиморасчетов  = Перерасход;
		СтрокаДвижений.СуммаУпр             = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаДвижений.СуммаВзаиморасчетов,
								ВалютаДокумента, СтруктураШапкиДокумента.ВалютаУправленческогоУчета, КурсДокумента,
								СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, КратностьДокумента,
								СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

	КонецЕсли;

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ВзаиморасчетыСПодотчетнымиЛицами.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоПодотчетникам()

// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартий(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоПрочее, Отказ, Заголовок)

	ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоПрочее, Отказ, Заголовок);

КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартий()

Процедура ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоПрочее, Отказ, Заголовок)
	
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.

		РезультатЗапроса = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам,
		                   Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Оптовый));

		Если Не РезультатЗапроса.Пустой() Тогда
			НаборДвижений = Движения.ТоварыНаСкладах;

			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(РезультатЗапроса.Выгрузить(), ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				НаборДвижений.ВыполнитьПриход();
			КонецЕсли;
		КонецЕсли;

		РезультатЗапроса = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам,
		                   Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Розничный));

		Если Не РезультатЗапроса.Пустой() Тогда
			НаборДвижений = Движения.ТоварыВРознице;

			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(РезультатЗапроса.Выгрузить(), ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				НаборДвижений.ВыполнитьПриход();
			КонецЕсли;
		КонецЕсли;

		// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
		РезультатЗапроса = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,
		                   Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Оптовый));

		Если Не РезультатЗапроса.Пустой() Тогда
			НаборДвижений = Движения.ТоварыНаСкладах;

			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(РезультатЗапроса.Выгрузить(), ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				НаборДвижений.ВыполнитьПриход();
			КонецЕсли;
		КонецЕсли;

		РезультатЗапроса = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,
		                   Новый Структура("ВидСклада", Перечисления.ВидыСкладов.Розничный));

		Если Не РезультатЗапроса.Пустой() Тогда
			НаборДвижений = Движения.ТоварыВРознице;

			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(РезультатЗапроса.Выгрузить(), ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				НаборДвижений.ВыполнитьПриход();
			КонецЕсли;
        КонецЕсли;

	Иначе   // по ордеру

		// ТОВАРЫ ПО РЕГИСТРУ ТоварыКПолучениюНаСклады.
		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			// Проверка осатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		Если Не Отказ Тогда
			Движения.ТоварыКПолучениюНаСклады.ВыполнитьРасход();
		КонецЕсли;

		// ТАРА ПО РЕГИСТРУ ТоварыКПолучениюНаСклады.
		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		// Проверка осатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		Если Не Отказ Тогда
			Движения.ТоварыКПолучениюНаСклады.ВыполнитьРасход();
		КонецЕсли;

		// Если товары поступили по ордеру без права продажи, то надо снять резерв
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру
		   И СкладОрдер.БезПраваПродажи Тогда

  			НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер,"ДокументРезерва");

			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			// Проверка остатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;

			Если Не Отказ Тогда
				Движения.ТоварыВРезервеНаСкладах.ВыполнитьРасход();
			КонецЕсли;

			НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер,"ДокументРезерва");

			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			// Проверка остатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;

			Если Не Отказ Тогда
				Движения.ТоварыВРезервеНаСкладах.ВыполнитьРасход();
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	// Резервирование по заказам покупателей
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит Заказ пуст)
	ТаблицаПоТоварамЗаказамПокупателей = ТаблицаПоТоварам.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамЗаказамПокупателей.Получить(Сч);
		Если (Не ЗначениеЗаполнено(СтрокаТаблицы.Заказ))
		 ИЛИ (ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
		   И  СтрокаТаблицы.Заказ.Заказчик = Ссылка.СкладОрдер) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТоварамЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаПоТоварамЗаказамПокупателей.Количество() > 0 Тогда

		ТаблицаПоТоварамЗаказамПокупателей.Колонки.Заказ.Имя = "ДокументРезерва";

		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийРезервы = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийРезервы.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамЗаказамПокупателей, ТаблицаДвижений);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
		КонецЕсли;

		ТаблицаДвижений.Очистить();
		
	КонецЕсли;
	
		// Теперь зарезервируем возвратную тару
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказП пуст)
	ТаблицаПоТареЗаказамПокупателей = ТаблицаПоТаре.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТареЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТареЗаказамПокупателей.Получить(Сч);
		Если (Не ЗначениеЗаполнено(СтрокаТаблицы.Заказ))
		 ИЛИ (ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
		   И  СтрокаТаблицы.Заказ.Заказчик = Ссылка.СкладОрдер) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТареЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаПоТареЗаказамПокупателей.Количество() > 0 Тогда

		ТаблицаПоТареЗаказамПокупателей.Колонки.Заказ.Имя = "ДокументРезерва";

		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийРезервы = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийРезервы.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТареЗаказамПокупателей, ТаблицаДвижений);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
		КонецЕсли;

		ТаблицаДвижений.Очистить();

	КонецЕсли;

	// Погашение внутренних заказов в случае Заказчик = Склад поступления
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить( "СтатусПартии",          Перечисления.СтатусыПартийТоваров.Купленный);
	ДопПараметры.Вставить( "РежимПроведения",       РежимПроведения);
	ДопПараметры.Вставить( "ИмяРеквизитаЗаказ",     "Заказ");
	ДопПараметры.Вставить( "ЗаказВШапке",           Ложь);
	ДопПараметры.Вставить( "ИмяТабЧасти",           "Товары");
	
	ТабИсходная = ТаблицаПоТоварам.Скопировать();
	ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.Купленный);
	
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;
	
	ТабИсходная.Очистить();
	ТабИсходная = ТаблицаПоТаре.Скопировать();
	ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	
	ДопПараметры.Вставить( "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	ДопПараметры.Вставить( "ИмяТабЧасти",  "ВозвратнаяТара");
	
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;

	Если ОтражатьВУправленческомУчете Тогда
		
		// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		
		НаборДвижений = Движения.ПартииТоваровНаСкладах;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийПартииТоваровНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();
		
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КопияТаблицыТоваров.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("НДСУпр"), "НДС");
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыТоваров, ТаблицаДвижений);
		
		// Недостающие поля.
		ЗаполнитьПоляПартииТоваровНаСкладахУпр(ТаблицаПоТоварам, СтруктураШапкиДокумента, ТаблицаДвижений, ОпределитьСтатусПартииПрихода(), УчетнаяПолитика.СпособОценкиМПЗ);
		
		// Код операции - поступление
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.Поступление, "КодОперации");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
		КонецЕсли;
		
		// При поступлении по ордеру нужно сторнировать партию ордера
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда

			ТаблицаДвижений.Очистить();

			ТаблицаПартииПоОрдерам = ТаблицаПоТоварам.Скопировать();
			ТаблицаПартииПоОрдерам.Колонки.Добавить("ДокументОприходования");
			
			Сч = 0;
			Пока Сч < ТаблицаПартииПоОрдерам.Количество() Цикл
				СтрокаТаблицы = ТаблицаПартииПоОрдерам.Получить(Сч);
				Если СтрокаТаблицы.БезПраваПродажи = Истина Тогда
					ТаблицаПартииПоОрдерам.Удалить(СтрокаТаблицы);
				Иначе

					// Документ оприходования - приходный ордрер
					СтрокаТаблицы.ДокументОприходования = СтрокаТаблицы.ДокументПолучения;
					// Устанавливаем склад в склад приходного ордера
					СтрокаТаблицы.Склад = СтрокаТаблицы.ПриходныйОрдерСклад;
					Сч = Сч + 1;
					
					Если НЕ СтрокаТаблицы.ВестиПартионныйУчетПоСериям Тогда
						СтрокаТаблицы.СерияНоменклатуры = Неопределено;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаПартииПоОрдерам.Количество() > 0 Тогда

				// Заполним таблицу движений.
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПартииПоОрдерам, ТаблицаДвижений);
				
				ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ПоОрдеру, "СтатусПартии");
				ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
				

				Для каждого Строка Из ТаблицаДвижений Цикл
					Строка.Количество = - Строка.Количество;
				КонецЦикла;

				ТаблицаДвижений.ЗаполнитьЗначения(0, "Стоимость");
				ТаблицаДвижений.ЗаполнитьЗначения(0, "НДС");
			
				// Код операции - поступление по ордеру (сторно)
				ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПоступлениеПоОрдеру, "КодОперации");

				НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

				Если Не Отказ Тогда
					Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		
		// ТОВАРЫ ПО РЕГИСТРУ Закупки.
		
		НаборДвижений = Движения.Закупки;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийЗакупки = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийЗакупки.Скопировать();
		
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КопияТаблицыТоваров.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("НДСУпр"), "НДС");
		КопияТаблицыТоваров.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");

		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыТоваров,ТаблицаДвижений,Проект,Дата,"Закупки");
			
		Иначе
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыТоваров, ТаблицаДвижений);
			
		КонецЕсли;
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,      "Подразделение");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументЗакупки");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.Закупки.ВыполнитьДвижения();
		КонецЕсли;
		
		// ПРОЧЕЕ ПО РЕГИСТРУ Закупки.
		
		НаборДвижений = Движения.Закупки;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвиженийЗакупки = НаборДвижений.ВыгрузитьКолонки(); 
		ТаблицаДвижений = ТаблицаДвиженийЗакупки.Скопировать();
		
		КопияТаблицыПрочее = ТаблицаПоПрочее.Скопировать();
		КопияТаблицыПрочее.ЗагрузитьКолонку(КопияТаблицыПрочее.ВыгрузитьКолонку("НДСУпр"), "НДС");
		КопияТаблицыПрочее.ЗагрузитьКолонку(КопияТаблицыПрочее.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");
		
		Если КопияТаблицыПрочее.Колонки.Найти("Количество")=Неопределено Тогда
			КопияТаблицыПрочее.Колонки.Добавить("Количество",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыПрочее,ТаблицаДвижений,Проект,Дата,"Закупки");
			
		Иначе
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыПрочее, ТаблицаДвижений);
			
		КонецЕсли;
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, "СтатусПартии");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументЗакупки");
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.Закупки.ВыполнитьДвижения();
		КонецЕсли;
		
		
		// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		
		НаборДвижений = Движения.ПартииТоваровНаСкладах;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
		
		// Недостающие поля.
		ЗаполнитьПоляПартииТоваровНаСкладахУпр(ТаблицаПоТаре, СтруктураШапкиДокумента, ТаблицаДвижений, 
		Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, УчетнаяПолитика.СпособОценкиМПЗ);
		
		// Код операции - поступление
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.Поступление, "КодОперации");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
		КонецЕсли;
		
		// При поступлении по ордеру нужно сторнировать партию ордера
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда

			ТаблицаДвижений.Очистить();

			ТаблицаПартииПоОрдерам = ТаблицаПоТаре.Скопировать();
			ТаблицаПартииПоОрдерам.Колонки.Добавить("ДокументОприходования");
			
			//Удалим не нужные строки (которые без права продажи).
			КолвоЭлементов = ТаблицаПартииПоОрдерам.Количество();
			Для ОбратныйИндекс = 1 По КолвоЭлементов Цикл
				СтрокаТаблицы = ТаблицаПартииПоОрдерам[КолвоЭлементов - ОбратныйИндекс];
				Если СтрокаТаблицы.БезПраваПродажи Тогда
					ТаблицаПартииПоОрдерам.Удалить(СтрокаТаблицы);
				КонецЕсли;

			КонецЦикла;
			
			// Документ оприходования - приходный ордрер
			Для каждого СтрокаТаблицы из ТаблицаПартииПоОрдерам Цикл
				СтрокаТаблицы.ДокументОприходования = СтрокаТаблицы.ДокументПолучения;
			КонецЦикла;
			
			Если ТаблицаПартииПоОрдерам.Количество() > 0 Тогда

				// Заполним таблицу движений.
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПартииПоОрдерам, ТаблицаДвижений);
				
				ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ПоОрдеру, "СтатусПартии");
				ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
				

				Для каждого Строка Из ТаблицаДвижений Цикл
					Строка.Количество = - Строка.Количество;
				КонецЦикла;

				ТаблицаДвижений.ЗаполнитьЗначения(0, "Стоимость");
				ТаблицаДвижений.ЗаполнитьЗначения(0, "НДС");
			
				// Код операции - поступление по ордеру (сторно)
				ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПоступлениеПоОрдеру, "КодОперации");

				НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

				Если Не Отказ Тогда
					Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартийУпр()	

// Проводит табличную часть "Оплата поставщикам" по регистрам
//
// Параметры:
//  ТаблицаПоОплатамПоставщикам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ОплатаПоставщикамУпр(РежимПроведения, ТаблицаПоОплатамПоставщикам, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	НаборДвижений   = Движения.ВзаиморасчетыСКонтрагентами;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаПоОплатамПоставщикам.Колонки.Сделка.Имя = "_Сделка";
	ТаблицаПоОплатамПоставщикам.Колонки.СделкаВзаиморасчеты.Имя = "Сделка";	
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОплатамПоставщикам, ТаблицаДвижений);
	
	ТаблицаПоОплатамПоставщикам.Колонки.Сделка.Имя = "СделкаВзаиморасчеты";	
	ТаблицаПоОплатамПоставщикам.Колонки._Сделка.Имя = "Сделка";
	
	НаборДвижений.мПериод           = Дата;
	НаборДвижений.мТаблицаДвижений  = ТаблицаДвижений;
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ОплатаПоставщикам", СтруктураШапкиДокумента, Отказ, Заголовок, "СуммаВзаиморасчетов")
	КонецЕсли;
					
	Если Не Отказ Тогда
		Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
	КонецЕсли;
	
	НаборДвижений   = Движения.РасчетыСКонтрагентами;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОплатамПоставщикам, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Расчеты, "РасчетыВозврат"); 
	
	НаборДвижений.мПериод           = Дата;
	НаборДвижений.мТаблицаДвижений  = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.РасчетыСКонтрагентами.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры // ОплатаПоставщикамУпр()

// По результатам запросовформируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения            - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента    - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам           - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре              - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоВыданныеАвансы    - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоВыданныеАвансы",
//  ТаблицаПоОплатамПоставщикам - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоОплатамПоставщикам",
//  ТаблицаПоПрочее            - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоПрочее",
//  Отказ                      - флаг отказа в проведении,
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	                Отказ, Заголовок);

	ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента,
	                ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	                Отказ, Заголовок);

	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента, ТаблицаПоОплатамПоставщикам);
	
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента,
	                ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	                Отказ, Заголовок);

	ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента,
	                ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	                Отказ, Заголовок);
					
	ДвиженияПоРегистрамБухгалтерии(РежимПроведения, СтруктураШапкиДокумента, 
	                        ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	                        Отказ, Заголовок);
							
	ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента,
									ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
									Отказ);
					
	// По партиям, оприходованным по ордеру с парвом продажи, возможно следует выполнить 
	// корректировку списания
	Если ОтражатьВУправленческомУчете
		И ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру
		И ТипЗнч(СкладОрдер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
		И НЕ СкладОрдер.БезПраваПродажи Тогда

		Движения.ПартииТоваровНаСкладах.Записать();
		
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
		ЗаписьРегистрации.Период = Дата;
		
		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);

		Если УчетнаяПолитика.СписыватьПартииПриПроведенииДокументов Тогда

			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
	
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента, ТаблицаПоОплатамПоставщикам)
	
	ВидДвижения = ВидДвиженияНакопления.Приход;
	ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, Дата, "ОплатаПоставщикам", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	Отказ, Заголовок);
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;

	// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
		
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
		
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
		
	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
		
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	Отказ, Заголовок);
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить корректировку списания
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		
		МассивПриходныхОрдеров = Новый Массив;
		Для каждого Строка Из ТаблицаПоТоварам Цикл
		
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
			   И Строка.БезПраваПродажи =Ложь Тогда
			 МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
		
		КонецЦикла;
		
		Для каждого Строка Из ТаблицаПоТаре Цикл
		
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
			   И Строка.БезПраваПродажи =Ложь Тогда
			 МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
		
		КонецЦикла;
		
		УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивПриходныхОрдеров);
		
		// ПО РЕГИСТРУ СписанныеТовары: формируем запись с указанием приходного ордера, которая будет обрабатываться при списании
		НаборДвижений = Движения.СписанныеТовары;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		Инд = 0;
		Для каждого Элемент Из МассивПриходныхОрдеров Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.ПоступлениеПриходныйОрдер = Элемент;
			Инд = Инд+1;
			НоваяСтрока.НомерСтрокиДокумента = Инд;

		КонецЦикла;
		
		ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
		
		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Движения.СписанныеТовары.Модифицированность() Тогда
			Движения.СписанныеТовары.Записать(Истина);
		КонецЕсли;		
		
		Если Не Отказ Тогда
			Движения.СписанныеТовары.ВыполнитьДвижения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// По результатам запросов формируем движения по регистрам упр. учета.
//
// Параметры: 
//  РежимПроведения            - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента    - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам           - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре              - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоВыданныеАвансы    - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоВыданныеАвансы",
//  ТаблицаПоОплатамПоставщикам - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоОплатамПоставщикам",
//  ТаблицаПоПрочее            - таблица значений, содержащая данные для проведения и проверки ТЧ "ТаблицаПоПрочее",
//  Отказ                      - флаг отказа в проведении,
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
	Отказ, Заголовок);
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ПО РЕГИСТРУ ВзаиморасчетыСПодотчетнымиЛицами.
	ДвиженияПоПодотчетникамУпр(СтруктураШапкиДокумента, ТаблицаПоВыданныеАвансы, РежимПроведения, Отказ, Заголовок);

	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТОВАРЫ ПО РЕГИСТРУ Закупки
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыВРезервеНаСкладах
	// ТАРА ПО РЕГИСТРУ ТоварыВРезервеНаСкладах
	// ТОВАРЫ ПО РЕГИСТРУ ВнутренниеЗаказы
	// ТАРА ПО РЕГИСТРУ ВнутренниеЗаказы
    ТоварыИТараПоРегистрамОстатковИПартий(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоПрочее, Отказ, Заголовок);

	// ПО РЕГИСТРУ ВзаиморасчетыСКонтрагентами
	ОплатаПоставщикамУпр(РежимПроведения, ТаблицаПоОплатамПоставщикам, Отказ, Заголовок, СтруктураШапкиДокумента);

	// ТАРА ПО РЕГИСТРУ ТоварыПолученные.
	НаборДвижений = Движения.ТоварыПолученные;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	мТаблицаПоТаре = ТаблицаПоТаре.Скопировать();
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара,"СтатусПолучения");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация,"Организация");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ТоварыПолученные.ВыполнитьПриход();
	КонецЕсли;
	
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить 
	// корректировку списания
	Если ОтражатьВУправленческомУчете
		И ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру
		И ТипЗнч(СкладОрдер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
		И НЕ СкладОрдер.БезПраваПродажи Тогда

		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
		
		Если УчетнаяПолитика.СписыватьПартииПриПроведенииДокументов Тогда

			Движения.ПартииТоваровНаСкладах.Записать();

			// Проведение по партиям
			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

		КонецЕсли;

	КонецЕсли;
	
	// Движения по услугам.
	Если ТаблицаПоПрочее.Количество() > 0 Тогда
		СтруктДопПараметры = Новый Структура;
		СтруктДопПараметры.Вставить("ЕстьНДС", Истина);
		СтруктДопПараметры.Вставить("КодОперацииНЗП", Перечисления.КодыОперацийНезавершенноеПроизводство.УслугиКонтрагентаНаПроизводство);
		СтруктДопПараметры.Вставить("ЕстьКонтрагентВТабЧасти", Истина);
		УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ЭтотОбъект, ТаблицаПоПрочее, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, СтруктДопПараметры);
	КонецЕсли;
	
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()	

Процедура ДвиженияПоРегистрамБухгалтерии(РежимПроведения, СтруктураШапкиДокумента, 
		                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВыданныеАвансы, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,
		                          Отказ, Заголовок);

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	    // документ не отражается в регл. учете
		Возврат;	
	
	КонецЕсли;							  
								  
	ВалютаРег = мВалютаРегламентированногоУчета;

	// Формирование проводок.
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Если СтруктураШапкиДокумента.ВалютаДокумента = ВалютаРег Тогда
		СчетРасчетовСПодотчетником = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;
	Иначе
		СчетРасчетовСПодотчетником = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте;
		ТаблицыДокумента = Новый Структура();
		ТаблицыДокумента.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);
		ТаблицыДокумента.Вставить("ТаблицаПоПрочее",ТаблицаПоПрочее);
		УправлениеВзаиморасчетами.ЗачетАвансаПодотчетника(ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, ТаблицыДокумента, Отказ,СчетРасчетовСПодотчетником);
	КонецЕсли;

	ДатаДок      = Дата;
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
		ЗапросПоЕдинщикам = Новый Запрос();
		ЗапросПоЕдинщикам.Текст = "ВЫБРАТЬ
		                          |	СхемыНалогообложенияКонтрагентов.Контрагент КАК Контрагент
		                          |ИЗ
		                          |	РегистрСведений.СхемыНалогообложенияКонтрагентов.СрезПоследних(&Дата, ) КАК СхемыНалогообложенияКонтрагентов
		                          |ГДЕ
		                          |	СхемыНалогообложенияКонтрагентов.СхемаНалогообложения.ЕдиныйНалог = Истина
		                          |	И СхемыНалогообложенияКонтрагентов.Контрагент В
		                          |			(ВЫБРАТЬ
		                          |				Документ.АвансовыйОтчет.Товары.Контрагент
		                          |			ИЗ
		                          |				Документ.АвансовыйОтчет.Товары
		                          |			ГДЕ
		                          |				Документ.АвансовыйОтчет.Товары.Ссылка = &Ссылка
		                          |		
		                          |			ОБЪЕДИНИТЬ
		                          |		
		                          |			ВЫБРАТЬ
		                          |				Документ.АвансовыйОтчет.Прочее.Контрагент
		                          |			ИЗ
		                          |				Документ.АвансовыйОтчет.Прочее
		                          |			ГДЕ
		                          |				Документ.АвансовыйОтчет.Прочее.Ссылка = &Ссылка)";
		
		ЗапросПоЕдинщикам.УстановитьПараметр("Дата", Дата);
		ЗапросПоЕдинщикам.УстановитьПараметр("Ссылка", Ссылка);
		КонтрагентыЕдинщики = ЗапросПоЕдинщикам.Выполнить().Выгрузить();
	КонецЕсли;
	
	// Проводки по товарам
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = ДатаДок;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = "Оприходованы ТМЦ";

		Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
		
		Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначение;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И
			 СтрокаТаблицы.НеОтноситьНаЗатратыПоНУ = Ложь И 
			 СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			 
			 Проводка.СуммаНУДт = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
		 КонецЕсли;
		
		// Для товаров, принятых на комиссию партия прописывается всегда 
		Если (ПартионныйУчетБУ) Тогда 
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", Ссылка, Истина, Заголовок);
		КонецЕсли;
		
		Проводка.КоличествоДт = СтрокаТаблицы.Количество;

		Проводка.Сумма = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;

		Проводка.СчетКт = СчетРасчетовСПодотчетником;
		Проводка.СубконтоКт.РаботникиОрганизаций = СтруктураШапкиДокумента.ФизЛицо;

		Если СчетРасчетовСПодотчетником.Валютный Тогда
			Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаБезНДСВал;
		КонецЕсли;

		// Проводки по НДС
		Если СтруктураШапкиДокумента.УчитыватьНДС и СтрокаТаблицы.ПроводкиСуммаНДСРегл<>0 Тогда

			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;

			Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",        	 СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаТаблицы, Ссылка, СтрокаТаблицы.Сделка));
			
			Проводка.СчетКт      = СчетРасчетовСПодотчетником;
			Проводка.СубконтоКт.РаботникиОрганизаций  = СтруктураШапкиДокумента.ФизЛицо;
			Если СчетРасчетовСПодотчетником.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаНДСВал;
			КонецЕсли;

			Проводка.Сумма       = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			Проводка.Содержание  = "НДС (товары)";

		КонецЕсли;

		// если организация - плательщик налога на прибыль, в приложение ОК Декларации по прибыли закупки у единщиков, отраженные авансовым отчетом,
		// не попадают, так как при построении декларации анализируются обороты по счетам взаиморасчетов с поставщиками, а в АО все корреспондирует со счетм 372.
		// Для обхода этой проблемы будем формировать обороты по специальному забалансовому счету "ОК", который анализируется при построении Декларации (Приложения ОК)
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
			// АО в валюте не может быть от резидентов - плательщиков единого налога
			И СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета 
			// проводки будем формировать только для контрагентов-единщиков
			И НЕ КонтрагентыЕдинщики.Найти(СтрокаТаблицы.Контрагент) = Неопределено Тогда

			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ЗакупкиУЕдинщиковЧерезПодотчетников;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ЗакупкиУЕдинщиковЧерезПодотчетников;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			
			Проводка.Сумма       = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			
			Проводка.Содержание  = НСТР("ru = 'Информация для заполнения Приложения ОК Декларации о Прибыли'; uk = 'Інформація для заповнення Додатка ОК Декларації з прибутку'");
			
		КонецЕсли;
		Если СтрокаТаблицы.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			// проводки по торговой наценке
			ТорговаяНаценка = СтрокаТаблицы.СуммаПродажная - СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				
			Если ТорговаяНаценка <> 0 Тогда
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.Дата;
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "Торговая наценка";
					
				Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаБУ;
				Проводка.СчетКт      = СчетНаценки;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтрокаТаблицы.Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтрокаТаблицы.Склад);
					
				Если (ПартионныйУчетБУ) Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии", Ссылка);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии", Ссылка);
				КонецЕсли;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  СтрокаТаблицы.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  СтрокаТаблицы.Номенклатура);
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  СтрокаТаблицы.НоменклатурнаяПозиция);
					
				Проводка.Сумма       = ТорговаяНаценка;
			КонецЕсли;
				
		КонецЕсли;
				
	КонецЦикла; // Проводки по товарам
	
	
	// Проводки по авансам по таре
	
	Если ТаблицаПоТаре.Количество()>0 Тогда
		
		ТаблицаПоТареАвансы = ТаблицаПоТаре.Скопировать();
		ТаблицаПоТареАвансы.Свернуть("Контрагент,ДоговорКонтрагента,СчетУчетаРасчетовПоТаре,СчетУчетаРасчетовПоТареПоАвансам","ПроводкиСуммаБезНДСРегл,ПроводкиСуммаНДСРегл,ПроводкиСуммаСНДСРегл,ПроводкиСуммаБезНДСВал,ПроводкиСуммаНДСВал,ПроводкиСуммаСНДСВал");
		
		Для каждого СтрокаТаблицы Из ТаблицаПоТареАвансы Цикл
			// для каждого договора - отдельно запускаем зачет авансов
			СтруктураШапкиДокументаДляАвансов = СтруктураШапкиДокумента;
			СтруктураШапкиДокументаДляАвансов.Вставить("Контрагент",СтрокаТаблицы.Контрагент);
			СтруктураШапкиДокументаДляАвансов.Вставить("ДоговорКонтрагента",СтрокаТаблицы.ДоговорКонтрагента);
			СтруктураШапкиДокументаДляАвансов.Вставить("Сделка",Неопределено);
			СтруктураШапкиДокументаДляАвансов.Вставить("ВедениеВзаиморасчетов",СтрокаТаблицы.ДоговорКонтрагента.ВедениеВзаиморасчетов);
			
			ТаблицыДокумента = Новый Структура();
			ТаблицаПоТареДляАвансов = ТаблицаПоТаре.Скопировать();
			ТаблицаПоТареДляАвансов.Очистить();
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Контрагент",СтрокаТаблицы.Контрагент);
			СтруктураПоиска.Вставить("ДоговорКонтрагента",СтрокаТаблицы.ДоговорКонтрагента);
			СтруктураПоиска.Вставить("СчетУчетаРасчетовПоТаре",СтрокаТаблицы.СчетУчетаРасчетовПоТаре);
			СтруктураПоиска.Вставить("СчетУчетаРасчетовПоТареПоАвансам",СтрокаТаблицы.СчетУчетаРасчетовПоТареПоАвансам);
			НайденныеСтроки = ТаблицаПоТаре.НайтиСтроки(СтруктураПоиска);
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(НайденныеСтроки,ТаблицаПоТареДляАвансов);
			
			ТаблицыДокумента.Вставить("ТаблицаПоТаре",ТаблицаПоТареДляАвансов);
				
			//Возможны корректировки сумм при расчетах в валюте
			ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокументаДляАвансов, мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок,"АВ",,,СтрокаТаблицы.СчетУчетаРасчетовПоТаре, СтрокаТаблицы.СчетУчетаРасчетовПоТареПоАвансам);
			
			//Если были корректировки, их надо вернуть в таблицу тары !
			//Скорректированы могут быть только суммы Регл, скопируем их обратно
			Для Индекс = 0 по НайденныеСтроки.ВГраница() Цикл
				НайденныеСтроки[Индекс].ПроводкиСуммаБезНДСРегл = ТаблицаПоТареДляАвансов[Индекс].ПроводкиСуммаБезНДСРегл;
				НайденныеСтроки[Индекс].ПроводкиСуммаНДСРегл 	= ТаблицаПоТареДляАвансов[Индекс].ПроводкиСуммаНДСРегл;
				НайденныеСтроки[Индекс].ПроводкиСуммаСНДСРегл 	= ТаблицаПоТареДляАвансов[Индекс].ПроводкиСуммаСНДСРегл;
			КонецЦикла; 
		КонецЦикла; 

	КонецЕсли; 

	// Проводки по таре
	Для каждого СтрокаТаблицы Из ТаблицаПоТаре Цикл
		
		// Бухгалтерский учет
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = ДатаДок;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = "Возвратная тара";
		Проводка.Сумма       = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;

		Проводка.НалоговоеНазначениеДт   = СтрокаТаблицы.НалоговоеНазначение;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И
			 СтрокаТаблицы.НеОтноситьНаЗатратыПоНУ = Ложь И 
			 СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			 
			 Проводка.СуммаНУДт = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			 
		 КонецЕсли;
		
		Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина , Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады"      , СтрокаТаблицы.Склад);

		Если ПартионныйУчетБУ Тогда 
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии",Ссылка,Истина, Заголовок);
		КонецЕсли;

		Проводка.КоличествоДт = СтрокаТаблицы.Количество;

		Проводка.СчетКт       = СтрокаТаблицы.СчетУчетаРасчетовПоТаре;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты"       , СтрокаТаблицы.Контрагент,Истина , Заголовок);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры"          , СтрокаТаблицы.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка, СтрокаТаблицы.Сделка));

		Если СтрокаТаблицы.СчетУчетаРасчетовПоТаре.Валютный Тогда
			Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаБезНДСВал;
		КонецЕсли;

		Если СтрокаТаблицы.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			// проводки по торговой наценке
			ТорговаяНаценка = СтрокаТаблицы.СуммаПродажная - СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				
			Если ТорговаяНаценка <> 0 Тогда
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.Дата;
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "Торговая наценка";
					
				Проводка.СчетДт      = СтрокаТаблицы.СчетУчетаБУ;
				Проводка.СчетКт      = СчетНаценки;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтрокаТаблицы.Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтрокаТаблицы.Склад);
					
				Если (ПартионныйУчетБУ) Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии", Ссылка);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии", Ссылка);
				КонецЕсли;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  СтрокаТаблицы.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  СтрокаТаблицы.Номенклатура);
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  СтрокаТаблицы.НоменклатурнаяПозиция);
					
				Проводка.Сумма       = ТорговаяНаценка;
			КонецЕсли;
				
		КонецЕсли;
				
	КонецЦикла; // Проводки по таре
	
	
	//Проводки по расчетам с поставщиками
	Если ТаблицаПоОплатамПоставщикам.Количество() > 0 Тогда

		СтруктураШапкиДокумента.Вставить("КоррСчет", СчетРасчетовСПодотчетником);
		
		Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок)=Ложь тогда
			Возврат;
		КонецЕсли;
						
	КонецЕсли;

	// Проводки по Прочее
	Для каждого СтрокаТаблицы Из ТаблицаПоПрочее Цикл

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период       = Дата;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Если СтрокаТаблицы.ЭтоСуточные Тогда
			Проводка.Содержание   = "Суточные (с " + Формат(СтрокаТаблицы.СуточныеДатаС,"ДЛФ=ДД") + " по "+ Формат(СтрокаТаблицы.СуточныеДатаПо,"ДЛФ=ДД") +", "+ СтрокаТаблицы.КоличествоСуток +" сут.)";
		Иначе
			Проводка.Содержание   = "Прочие поступления";
		КонецЕсли;
		Проводка.Сумма        = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;

		Проводка.НалоговоеНазначениеДт       = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И
			СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			
			Если СтрокаТаблицы.ЭтоСуточные Тогда
				Проводка.СуммаНУДт = СтрокаТаблицы.СуммаНУ;
			Иначе
				Если СтрокаТаблицы.НеОтноситьНаЗатратыПоНУ = Ложь Тогда
					Проводка.СуммаНУДт = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Проводка.СчетДт       = СтрокаТаблицы.СчетЗатрат;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ХарактерЗатратБУ) И НЕ (СтрокаТаблицы.ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.Прочие ИЛИ СтрокаТаблицы.ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы) Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения"       , СтрокаТаблицы.ПодразделениеОрганизации);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТаблицы.НоменклатурнаяГруппа);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат"        , СтрокаТаблицы.СтатьяЗатрат);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства", СтрокаТаблицы.ОбъектСтроительства);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НалоговыеНазначения" , СтрокаТаблицы.НалоговоеНазначение);
		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.Субконто1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.Субконто2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.Субконто3);
		КонецЕсли; 

		Проводка.СчетКт       = СчетРасчетовСПодотчетником;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РаботникиОрганизаций",  СтруктураШапкиДокумента.ФизЛицо);

		Если СтруктураШапкиДокумента.ВалютаДокумента <> мВалютаРегламентированногоУчета 
		   И СчетРасчетовСПодотчетником.Валютный Тогда
			Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаБезНДСВал;
		КонецЕсли;

		// Проводки по НДС
		Если СтруктураШапкиДокумента.УчитыватьНДС И СтрокаТаблицы.ПроводкиСуммаНДСРегл > 0 Тогда
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период       = Дата;
			Проводка.Организация  = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма        = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			Проводка.Содержание   = "НДС (прочие поступления)";

			Проводка.СчетДт       = СтрокаТаблицы.СчетУчетаНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,     "Контрагенты",             СтрокаТаблицы.Контрагент,Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,     "Договоры",                СтрокаТаблицы.ДоговорКонтрагента,Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,		"ДокументыРасчетовСКонтрагентами", НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаТаблицы, Ссылка, СтрокаТаблицы.Сделка));

			Проводка.СчетКт       = СчетРасчетовСПодотчетником;
			Проводка.СубконтоКт.РаботникиОрганизаций = СтруктураШапкиДокумента.ФизЛицо;

			Если СтруктураШапкиДокумента.ВалютаДокумента <> мВалютаРегламентированногоУчета 
			   И СчетРасчетовСПодотчетником.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.ПроводкиСуммаНДСВал;
			КонецЕсли;

		КонецЕсли; // Проводка по НДС
		
		// если организация - плательщик налога на прибыль, в приложение ОК Декларации по прибыли закупки у единщиков, отраженные авансовым отчетом,
		// не попадают, так как при построении декларации анализируются обороты по счетам взаиморасчетов с поставщиками, а в АО все корреспондирует со счетм 372.
		// Для обхода этой проблемы будем формировать обороты по специальному забалансовому счету "ОК", который анализируется при построении Декларации (Приложения ОК)
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
			// АО в валюте не может быть от резидентов - плательщиков единого налога
			И СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета 
			// проводки будем формировать только для контрагентов-единщиков
			И НЕ КонтрагентыЕдинщики.Найти(СтрокаТаблицы.Контрагент) = Неопределено Тогда

			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ЗакупкиУЕдинщиковЧерезПодотчетников;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ЗакупкиУЕдинщиковЧерезПодотчетников;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтрокаТаблицы.Контрагент  , Истина, Заголовок);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтрокаТаблицы.ДоговорКонтрагента  , Истина, Заголовок);
			
			Проводка.Сумма       = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
			
			Проводка.Содержание  = НСТР("ru = 'Информация для заполнения Приложения ОК Декларации о Прибыли'; uk = 'Інформація для заповнення Додатка ОК Декларації з прибутку'");
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц
	
	Если СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
				
		ДвиженияПоЕдиномуНалогу(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее,Отказ);
		
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрамБухгалтерии()

Процедура ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОплатамПоставщикам, ТаблицаПоПрочее, Отказ)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете ИЛИ Не СтруктураШапкиДокумента.ЕстьНДС Тогда
		// Если не нужно отражать в налоговом учете, тогда не отражаем и в подсистеме учета НДС
		Возврат;
	КонецЕсли;
	
	// в начале сделаем прводки по оплате поставщикам
	Если    СтруктураШапкиДокумента.ЕстьНДС Тогда
		
		Если ТаблицаПоОплатамПоставщикам.Количество() > 0 Тогда
			РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
	    КонецЕсли;
		
	КонецЕсли;

	

  	НаборДвижений = Движения.ПриобретенияНалоговыйУчет;
			
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
	ТаблицаДвиженийОплата = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийТара   = ТаблицаДвижений.Скопировать();
		
	//ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	Для каждого Строка Из ТаблицаКопия Цикл
		Строка.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(Строка, СтруктураШапкиДокумента.Ссылка, Строка.Сделка);
		
		Если Строка.СложныйНалоговыйУчет Тогда
			
			// очистим налоговые реквизиты
			Строка.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			Строка.ДляХозяйственнойДеятельности = Ложь;
			Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();			
			Строка.Амортизируется = Ложь;			
			Строка.СуммаНДСВал = 0;			
			
		Иначе		
			// упрощенный налоговый учет
			Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
				Строка.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
				Строка.ДляХозяйственнойДеятельности = Ложь;
				Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();				
				Строка.СуммаНДСВал = 0;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЦикла;
	ТаблицаКопия.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС, Амортизируется","СуммаСНДСВал, СуммаНДСВал, СуммаНДСВалИсходный");
	ТаблицаПриобретений = ТаблицаКопия.Скопировать();
		
	//ПРОЧЕЕ
	
	ТаблицаКопия = ТаблицаПоПрочее.Скопировать();
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаКопия Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
			СтрокиКУдалению.Добавить(СтрокаТаблицы);
		Иначе
			СтрокаТаблицы.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтрокаТаблицы, СтруктураШапкиДокумента.Ссылка, СтрокаТаблицы.Сделка);	
						
			Если СтрокаТаблицы.СложныйНалоговыйУчет Тогда
				
				// очистим налоговые реквизиты
				СтрокаТаблицы.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
				СтрокаТаблицы.ДляХозяйственнойДеятельности = Ложь;
				СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();				
				СтрокаТаблицы.Амортизируется = Ложь;
				СтрокаТаблицы.СуммаНДСВал = 0;				
				
			Иначе		
				// упрощенный налоговый учет
				Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
					СтрокаТаблицы.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
					СтрокаТаблицы.ДляХозяйственнойДеятельности = Ложь;
					СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();					
					СтрокаТаблицы.СуммаНДСВал = 0;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы из СтрокиКУдалению Цикл
		ТаблицаКопия.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	ТаблицаКопия.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаСНДСВал, СуммаНДСВал, СуммаНДСВалИсходный");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПриобретений);
		
	ТаблицаПриобретений.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаСНДСВал, СуммаНДСВал, СуммаНДСВалИсходный");
	
	ТаблицаПриобретений.Колонки.Добавить("СуммаНДСПропорционально");
	Для каждого СтрокаКопии Из ТаблицаПриобретений Цикл
		Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
			СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
			СтрокаКопии.СуммаНДСВал = СтрокаКопии.СуммаНДСВалИсходный;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПриобретений.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаПриобретений.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвижений);
	
	// полученные подотчетником ценности им же и оплачены. Покажем оплату поставщику
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвиженийОплата);
		
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика, "Событие");
		
	ТаблицаДвиженийОплата.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	ТаблицаДвиженийОплата.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику, "Событие");
		
	//ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	Для каждого Строка Из ТаблицаКопия Цикл
		Строка.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(Строка, СтруктураШапкиДокумента.Ссылка, Строка.Сделка);
		Если Строка.СложныйНалоговыйУчет Тогда
			
			// очистим налоговые реквизиты
			Строка.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			Строка.ДляХозяйственнойДеятельности = Ложь;
			Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();
			Строка.СуммаНДСВал = 0;			
			
		Иначе		
			// упрощенный налоговый учет
			Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
				Строка.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
				Строка.ДляХозяйственнойДеятельности = Ложь;
				Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();
				Строка.СуммаНДСВал = 0;
			КонецЕсли;
						
		КонецЕсли;		
	КонецЦикла;
	
	
	ТаблицаКопия.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС","СуммаСНДСВал, СуммаНДСВал");
	
	ТаблицаКопия.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";	
		
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
		
	ТаблицаДвиженийТара.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина, "ВозвратнаяТара");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика, "Событие");

	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
				
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийОплата;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
				
	КонецЕсли;		
		
	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
				
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
				
	КонецЕсли;
	
 	
	// Движения по регистру ОжидаемыйИПодтвержденныйНДСПриобретений
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	ТаблицаДвиженийТара = ТаблицаДвижений.Скопировать();	
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	
	СтрокиКУдалению = Новый Массив;
	Для каждого Строка Из ТаблицаКопия Цикл
		Если Строка.Внешнеэкономический Тогда
			СтрокиКУдалению.Добавить(Строка);
		Иначе
			Строка.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(Строка, СтруктураШапкиДокумента.Ссылка, Строка.Сделка);				
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТаблицы из СтрокиКУдалению Цикл
		ТаблицаКопия.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	ТаблицаКопия.Свернуть("ДоговорКонтрагента,Сделка, СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал, СуммаНДСВалИсходный");
	ТаблицаПриобретений = ТаблицаКопия.Скопировать();
	
	// ПРОЧЕЕ
	// Если для строки не указан договор взаиморасчетов, то и записивать в регистр её не нужно
	ТаблицаКопия = ТаблицаПоПрочее.Скопировать();
	СтрокиКУдалению = Новый Массив;
	Для Каждого Строка Из ТаблицаКопия Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ДоговорКонтрагента) Тогда
			СтрокиКУдалению.Добавить(Строка);
		ИначеЕсли Строка.Внешнеэкономический Тогда
			СтрокиКУдалению.Добавить(Строка);
		Иначе
			Строка.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(Строка, СтруктураШапкиДокумента.Ссылка, Строка.Сделка);				
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТаблицы из СтрокиКУдалению Цикл
		ТаблицаКопия.Удалить(СтрокаТаблицы);
	КонецЦикла;
	ТаблицаКопия.Свернуть("ДоговорКонтрагента,Сделка,СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал, СуммаНДСВалИсходный");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПриобретений);
	
	ТаблицаПриобретений.Свернуть("ДоговорКонтрагента,Сделка,СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал, СуммаНДСВалИсходный");
	
	ТаблицаПриобретений.Колонки.Добавить("СуммаНДСПропорционально");
	Для каждого СтрокаКопии Из ТаблицаПриобретений Цикл
		Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
			СуммаСНДСВал = СтрокаКопии.СуммаБезНДСВал  + СтрокаКопии.СуммаНДСВал;
			СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
			СтрокаКопии.СуммаНДСВал 			= СтрокаКопии.СуммаНДСВалИсходный;
			СтрокаКопии.СуммаБезНДСВал 			= СуммаСНДСВал - СтрокаКопии.СуммаНДСВал;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПриобретений.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
	ТаблицаПриобретений.Колонки.СуммаНДСВал   .Имя = "СуммаНДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, 		 "СобытиеНДС");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС, "КодОперации");
	
	// ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	Для каждого Строка Из ТаблицаКопия Цикл
		Строка.Сделка = НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(Строка, СтруктураШапкиДокумента.Ссылка, Строка.Сделка);			
	КонецЦикла;	
	ТаблицаКопия.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал");
	ТаблицаКопия.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСВал   .Имя = "СуммаНДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
	ТаблицаДвиженийТара.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина,							  "ВозвратнаяТара");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, 		 "СобытиеНДС");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС, "КодОперации");
		
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
					
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
					
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьПриход();
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
					
	КонецЕсли;

	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
					
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
					
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьПриход();
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
					
	КонецЕсли;
		
КонецПроцедуры

Функция Счет9Класса(Счет)
	
	Если БухгалтерскийУчет.ПолучитьИспользоватьКлассыСчетовВКачествеГрупп() Тогда
		Счет9Класса = Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ЗатратыДеятельности); 
	Иначе
		СчетаЗатрат	= Новый Массив;
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализации);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаСбыт);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ФинансовыеЗатраты);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ПотериОтУчастияВКапитале);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыДеятельности);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.НалогНаПрибыль);
		СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ЧрезвычайныеЗатраты);
		Счет9Класса = (СчетаЗатрат.Найти(Счет) <> Неопределено);
	КонецЕсли;
	
	Возврат(Счет9Класса);
				
КонецФункции

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ УПРАВЛЕНИЯ ПОДЧИНЕННЫМИ ДОКУМЕНТАМИ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	ОбработкаЗаполненияУпр(Основание);

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);

	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Прочее);
	
	// Заполнить склад и ордер в табличных частях
	СкладИзШапки    =  Не мУказаниеСкладовВТЧ
	                 И (ВидПоступления <> Перечисления.ВидыПоступленияТоваров.ПоОрдеру);

	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, Товары,         СкладИзШапки);
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, ВозвратнаяТара, СкладИзШапки);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Товары") + ОплатаПоставщикам.Итог("Сумма") + УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Прочее");

	ОбновитьПараметрыУчетнойПолитики(Дата,Организация, Истина);
	
	Если ОтражатьВБухгалтерскомУчете И НЕ мУчетнаяПолитикаНУ.ЕстьНДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Товары Цикл
			СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
		Для каждого СтрокаТЧ  Из Прочее Цикл
			СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
	КонецЕсли;
	
	Для каждого СтрокаТЧ  Из Товары Цикл
		Если СтрокаТЧ.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
		КонецЕсли;
	КонецЦикла;				
	Для каждого СтрокаТЧ  Из ВозвратнаяТара Цикл
		Если СтрокаТЧ.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
		КонецЕсли;
	КонецЦикла;				
		
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Товары");
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "ВозвратнаяТара");
		
	// Удаление неиспользуемых строк табличной части "Серийные номера".
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке)

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"       , "ВалютаУправленческогоУчета"    ,     "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"       , "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");

КонецПроцедуры // ДополнитьДеревоПолейЗапросаПоШапкеУпр()	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Перем Заголовок, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоПрочее;
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
   	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	// Для определения где нужно проверять склад: в шапке или в ТЧ.
	СтруктураШапкиДокумента.Вставить("СкладВТабличнойЧасти", мУказаниеСкладовВТЧ);
	СтруктураШапкиДокумента.Вставить("ДатаОплаты", Дата);
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер", "ВидСклада",       "ВидСклада");
	Иначе
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер", "Склад.ВидСклада", "ВидСклада");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер", "Склад",           "СкладПриходногоОрдера");
	КонецЕсли;

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика", "ВестиПартионныйУчетПоСкладам" ,    "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика", "ВедениеУчетаПоПроектам",           "ВедениеУчетаПоПроектам");

	// Дополним полями, нужными для упр. учета
	ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке);

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	Отказ = Ложь;
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	ОбновитьПараметрыУчетнойПолитики(Дата,Организация);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Получим необходимые данные для проведения и проверки заполнения данных по табличной части "Товары".
	СтруктураПолей 		  = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
    СтруктураПростыхПолей = Новый Структура;
	
	СтруктураПолей.Вставить("Услуга"                        , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                         , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                      , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"              , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Заказ"                         , "Заказ");
	СтруктураПолей.Вставить("Склад"                         , "Склад");
	СтруктураПолей.Вставить("ВидСклада"                     , "Склад.ВидСклада");
	СтруктураПолей.Вставить("Внешнеэкономический"     		, "ДоговорКонтрагента.Внешнеэкономический");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"         , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                                                		  "Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("Контрагент"                    , "Контрагент"); 
	СтруктураПолей.Вставить("ДоговорКонтрагента"            , "ДоговорКонтрагента");  
	СтруктураПолей.Вставить("ВестиПоДокументамРасчетовСКонтрагентомРегл"            , "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл");  
	СтруктураПолей.Вставить("НеОтноситьНаЗатратыПоНУ" , 	"ДоговорКонтрагента.НеОтноситьНаЗатратыПоНУ"); 
	СтруктураПолей.Вставить("Сделка"		                , "сделка");
	СтруктураПолей.Вставить("СделкаОрганизация"             , "Сделка.Организация");
	СтруктураПолей.Вставить("ДокументПолучения"             , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения" , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("БезПраваПродажи"               , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"           , "ПриходныйОрдер.Склад");
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
	
	СтруктураПолей.Вставить("БланкСтрогогоУчета"			, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("СчетУчетаБУ" 					, "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаБУЗаб"				, "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("СчетУчетаНДС"					, "СчетУчетаНДС");
	
	СтруктураПолей.Вставить("СтатьяДекларацииПоЕдиномуНалогу", "СтатьяДекларацииПоЕдиномуНалогу");
	
	СтруктураПолей.Вставить("НалоговоеНазначение"     		, "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"	     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("СуммаНДСПропорциональноКредит" , "СуммаНДСПропорциональноКредит");
	
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"	     	, "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"	     	, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"         , "НоменклатурнаяПозиция");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	// Получим необходимые данные для проведения и проверки заполнения данных 
	// по табличной части "Возвратная тара".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТара();
	СтруктураПолей.Вставить("Набор"                         , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Заказ"               			, "Заказ");
	СтруктураПолей.Вставить("ВалютаДоговора"                , "ДоговорКонтрагента.ВалютаВзаиморасчетов");
	СтруктураПолей.Вставить("ДоговорКонтрагента"            , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("Внешнеэкономический"     		, "ДоговорКонтрагента.Внешнеэкономический");
	СтруктураПолей.Вставить("ДоговорОрганизация"            , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("Склад"                         , "Склад");
	СтруктураПолей.Вставить("ВидСклада"                     , "Склад.ВидСклада");
	СтруктураПолей.Вставить("НеОтноситьНаЗатратыПоНУ" 		, "ДоговорКонтрагента.НеОтноситьНаЗатратыПоНУ"); 
	СтруктураПолей.Вставить("СделкаОрганизация"             , "Сделка.Организация");
	СтруктураПолей.Вставить("ДокументПолучения"             , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения" , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("БезПраваПродажи"               , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"           , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"         , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        								  "Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("Контрагент"                    , "Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента"            , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("ВестиПоДокументамРасчетовСКонтрагентомРегл"            , "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл");  
	СтруктураПолей.Вставить("Сделка"                        , "Сделка");

	СтруктураПолей.Вставить("БланкСтрогогоУчета"			, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("СчетУчетаБУ"  					, "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаБУЗаб"				, "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("СчетУчетаРасчетовПоТаре"		, "СчетУчетаРасчетовПоТаре");
	СтруктураПолей.Вставить("СчетУчетаРасчетовПоТареПоАвансам", "СчетУчетаРасчетовПоТареПоАвансам");
	
	СтруктураПолей.Вставить("НалоговоеНазначение"		    , "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"  			, "НалоговоеНазначение.ВидДеятельностиНДС");
	
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"	     	, "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"	     	, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"         , "НоменклатурнаяПозиция");

	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);

	// Получим необходимые данные для проведения и проверки заполнения данных 
	// по табличной части "Авансы".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ДокументАванса",            "ДокументАванса");
	СтруктураПолей.Вставить("ДокументАвансаОрганизация", "ДокументАванса.Организация");
	СтруктураПолей.Вставить("Сумма", "Сумма");

	РезультатЗапросаПоВыданнымАвансам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВыданныеАвансы", СтруктураПолей);

	// Получим необходимые данные для проведения и проверки заполнения данных 
	// по табличной части "Прочее".
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Вставить("Содержание",          "Содержание");
	СтруктураПолей.Вставить("Номенклатура",        "Номенклатура");
	СтруктураПолей.Вставить("ДоговорКонтрагента",  "ДоговорКонтрагента");	
	СтруктураПолей.Вставить("Внешнеэкономический", "ДоговорКонтрагента.Внешнеэкономический");
	СтруктураПолей.Вставить("Услуга",              "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор" ,              "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект",            "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Заказ",               "Заказ");
	СтруктураПолей.Вставить("НеОтноситьНаЗатратыПоНУ" ,"ДоговорКонтрагента.НеОтноситьНаЗатратыПоНУ"); 
	СтруктураПолей.Вставить("Сделка",              "Сделка");
	СтруктураПолей.Вставить("СтатьяЗатрат",        "СтатьяЗатрат");	
	СтруктураПолей.Вставить("Сумма",               "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС",           "СтавкаНДС");
	СтруктураПолей.Вставить("НДС",                 "СуммаНДС");
	СтруктураПолей.Вставить("Подразделение",       "Подразделение");
	СтруктураПолей.Вставить("ПодразделениеОрганизации",  "ПодразделениеОрганизации");
	СтруктураПолей.Вставить("ОбъектСтроительства",       "ОбъектСтроительства");
	СтруктураПолей.Вставить("Контрагент",          "Контрагент"); 
	СтруктураПолей.Вставить("СчетЗатрат", 		   "СчетЗатрат");
	СтруктураПолей.Вставить("Субконто1",  		   "Субконто1");
	СтруктураПолей.Вставить("Субконто2", 		   "Субконто2");
	СтруктураПолей.Вставить("Субконто3", 		   "Субконто3");
	СтруктураПолей.Вставить("СчетУчетаНДС",		   "СчетУчетаНДС");
	СтруктураПолей.Вставить("БланкСтрогогоУчета",  "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа","НоменклатурнаяГруппа");
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
	
	СтруктураПолей.Вставить("ЭтоСуточные"				, "ЭтоСуточные");
	СтруктураПолей.Вставить("СуточныеДатаС"				, "СуточныеДатаС");
	СтруктураПолей.Вставить("СуточныеДатаПо"			, "СуточныеДатаПо");
	
	СтруктураПолей.Вставить("СтатьяДекларацииПоЕдиномуНалогу", "СтатьяДекларацииПоЕдиномуНалогу");
	СтруктураПолей.Вставить("КомандировкаЗарубеж", 	 "КомандировкаЗарубеж");
	СтруктураПолей.Вставить("КоличествоСуток", 		 "КоличествоСуток");
	СтруктураПолей.Вставить("НалоговоеНазначение", 	    "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС", 		"НалоговоеНазначение.ВидДеятельностиНДС");
	
	СтруктураПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат" , "НалоговоеНазначениеДоходовИЗатрат");
	СтруктураПолей.Вставить("СуммаНУ" 					, "СуммаНУ");
	СтруктураПолей.Вставить("СуммаНДСПропорциональноКредит" , "СуммаНДСПропорциональноКредит");
	
	СтруктураПолей.Вставить("Сделка", "Сделка");
	
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"	     	, "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"	     	, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураПолей.Вставить("ВестиПоДокументамРасчетовСКонтрагентомРегл"            , "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл");  
	
	РезультатЗапросаПоПрочее = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Прочее", СтруктураПолей, СтруктураПростыхПолей);
	
	// Получим необходимые данные для проведения и проверки заполнения данных 
	// по табличной части "Оплата поставщикам".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Контрагент"              , "Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента"      , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"   , "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураПолей.Вставить("ВалютаДоговора"          , "ДоговорКонтрагента.ВалютаВзаиморасчетов");
	СтруктураПолей.Вставить("Организация"             , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("ДоговорОрганизация"      , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("Внешнеэкономический"     , "ДоговорКонтрагента.Внешнеэкономический");
	СтруктураПолей.Вставить("Сделка"                  , "Сделка");
	СтруктураПолей.Вставить("СделкаВзаиморасчеты"	  , "Сделка");
	СтруктураПолей.Вставить("СделкаОрганизация"       , "Сделка.Организация");
	СтруктураПолей.Вставить("Сумма"                   , "Сумма");
	СтруктураПолей.Вставить("СуммаВзаиморасчетов"     , "СуммаВзаиморасчетов");	
	СтруктураПолей.Вставить("КурсВзаиморасчетов"   	  , "КурсВзаиморасчетов");
	СтруктураПолей.Вставить("КратностьВзаиморасчетов" , "КратностьВзаиморасчетов");
	СтруктураПолей.Вставить("СчетУчетаРасчетовСКонтрагентом", "СчетУчетаРасчетовСКонтрагентом");
	
	СтруктураПолей.Вставить("СчетУчетаНДС", 	  			"СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНДСПодтвержденный", 	"СчетУчетаНДСПодтвержденный");
	СтруктураПолей.Вставить("СчетУчетаРасчетовПоАвансам", 	"СчетУчетаРасчетовПоАвансам");
	СтруктураПолей.Вставить("НалоговоеНазначение", 			"НалоговоеНазначение");
	СтруктураПолей.Вставить("Амортизируется", 				"Амортизируется");
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"	     	, "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"	     	, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	
	СтруктураПолей.Вставить("СтавкаНДС"	     				, "СтавкаНДС");
	СтруктураПолей.Вставить("СуммаНДСПропорциональноКредит" , "СуммаНДСПропорциональноКредит");
	СтруктураПолей.Вставить("СуммаНДС"	     				, "СуммаНДС");
			
	СтруктураПолей.Вставить("СтатьяДекларацииПоЕдиномуНалогу"	, "СтатьяДекларацииПоЕдиномуНалогу");
	
	РезультатЗапросаПоОплатеПоставщикам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОплатаПоставщикам", СтруктураПолей);

	// Подготовим таблицы для проведения.
	ПогрешностиОкругления = Новый Соответствие;	
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ТаблицаПоПрочее  = ПодготовитьТаблицуПрочие(РезультатЗапросаПоПрочее, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	ТаблицаПоАвансам = РезультатЗапросаПоВыданнымАвансам.Выгрузить();
	ТаблицаПоОплате  = ПодготовитьТаблицуПоОплате(РезультатЗапросаПоОплатеПоставщикам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	
	ПогрешностиОкругленияТара = Новый Соответствие;
	ТаблицаПоТаре    = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругленияТара);
	
	//Проверим на возможность проведения в БУ и НУ
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете тогда

		Для Каждого СтрокаОплаты из ТаблицаПоОплате Цикл
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(СтрокаОплаты.ДоговорКонтрагента, СтруктураШапкиДокумента.ВалютаДокумента,
			                                     СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете,
			                                     СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете,
			                                     мВалютаРегламентированногоУчета, Истина, Отказ, Заголовок,
			                                     "Оплата поставщикам, строка "+СтрокаОплаты.НомерСтроки+": ",
			                                     СтрокаОплаты.ВалютаДоговора);
		КонецЦикла;

	КонецЕсли;

	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиПрочее(ТаблицаПоПрочее, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВыданныеАвансы(ТаблицаПоАвансам,СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиОплатаПоставщикам(ТаблицаПоОплате, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПартионныйУчетБУ = УправлениеЗапасами.ВедетсяПартионныйУчет(ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Бух"));
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
							ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоАвансам, ТаблицаПоОплате, ТаблицаПоПрочее,
							Отказ, Заголовок);
	КонецЕсли;

	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");


БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

мСтруктураНаименованийРеквизитовУслуги = Новый Структура("СчетЗатрат, Подразделение, ПодразделениеОрганизации, НоменклатурнаяГруппа, СтатьяЗатрат, ОбъектСтроительства, НалоговоеНазначение", 
				"СчетЗатрат", "Подразделение", "ПодразделениеОрганизации", "НоменклатурнаяГруппа", "СтатьяЗатрат", "ОбъектСтроительства", "НалоговоеНазначение");
				
ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата,Ссылка.Организация, Ложь);

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

УказаниеСкладов = Константы.УказаниеСкладовВТабличнойЧастиДокументов.Получить();
мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления)
                      Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации);

мСтруктураПараметровДляПолученияДоговора = Новый Структура();

СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);