Перем мУдалятьДвижения;

Перем ПартионныйУчетБУ;

Перем мВалютаРегламентированногоУчета Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;

// Хранит структуру, содержащую параметры для определения договора, доступного в данном документе:
//    список допустимых видов договоров;
//    список допустимых способов ведения взаиморасчетов.
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

// Хранит структуру, содержащую параметры для определения рублевого договора, доступного в данном документе:
//    валюта взаиморасчетов;
//    список допустимых видов договоров;
//    список допустимых способов ведения взаиморасчетов.
Перем мСтруктураПараметровДляПолученияДоговораРегл Экспорт;

Перем мСтруктураПараметровДляПолученияДоговораПоставщика Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Расчитывает сумму НДС.
//
// Параметры
//  ТаможеннаяСтоимость        -  число, величина таможенной стоимости в валюте документа,
//  СуммаПошлины               - число, сумма пошлины, 
//  СтавкаАкцзиа               - число, сумма акциза, 
//  СтавкаНДС                  - ссылка на перечисление, определяющая ставку НДС, 
//
// Возвращаемое значение:
//   Число  – сумма НДС.
//
Функция РассчитатьСуммуНДСГТД(ТаможеннаяСтоимость, СуммаПошлины, СуммаАкциза, СтавкаНДС) Экспорт
	
	БазаНДС = ТаможеннаяСтоимость + СуммаПошлины + СуммаАкциза;

	Возврат УчетНДС.РассчитатьСуммуНДС(БазаНДС, Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС)); // УчитыватьНДС, Сумма не включает НДС.

КонецФункции // РассчитатьСуммуНДСГТД()

// Добавляет строку в табличную часть "Разделы"
//
// Возвращаемое значение:
//   строка табличной части, которую добавили.
//
Функция ДобавитьРаздел() Экспорт

#Если Клиент Тогда
	СтавкаПошлины = ВосстановитьЗначение("СтавкаТаможеннойПошлины");
	СтавкаАкциза  = ВосстановитьЗначение("СтавкаАкциза");
#Иначе
	СтавкаПошлины = 0;
	СтавкаАкциза  = 0;
#КонецЕсли

	НовыйРаздел = Разделы.Добавить();
	НовыйРаздел.СтавкаНДС      = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяСтавкаНДС");
	НовыйРаздел.СтавкаАкциза   = СтавкаАкциза;
	НовыйРаздел.СтавкаПошлины  = СтавкаПошлины;

	Возврат НовыйРаздел;

КонецФункции // ДобавитьРаздел()

// Вычисляет суммы по данным раздела.
//
// Параметры
//  НомерРаздела   - число, номер раздела по которому надо получить итоги,
//  ВсегоСтоимость - число, в этот параметр будет возвращена сумма фактурной стоимости,
//  ВсегоПошлина   - число, в этот параметр будет возвращена сумма пошлины, 
//  ВсегоНДС       - число, в этот параметр будет возвращена сумма НДС.
//
Процедура ПосчитатьИтогиПоРазделу(НомерРаздела, ВсегоСтоимость, ВсегоПошлина, ВсегоАкциз, ВсегоНДС)  Экспорт

	ВсегоСтоимость = 0;
	ВсегоПошлина   = 0;
	ВсегоАкциз     = 0;	
	ВсегоНДС       = 0;
	МассивСтрок = Товары.НайтиСтроки(Новый Структура("НомерРаздела", НомерРаздела));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		ВсегоСтоимость = ВсегоСтоимость + ЭлементМассива.ФактурнаяСтоимость;
		ВсегоПошлина   = ВсегоПошлина   + ЭлементМассива.СуммаПошлины;
		ВсегоАкциз     = ВсегоАкциз     + ЭлементМассива.СуммаАкциза;
		ВсегоНДС       = ВсегоНДС       + ЭлементМассива.СуммаНДС;
	КонецЦикла;
	МассивСтрок = Оборудование.НайтиСтроки(Новый Структура("НомерРаздела", НомерРаздела));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		ВсегоСтоимость = ВсегоСтоимость + ЭлементМассива.ФактурнаяСтоимость;
		ВсегоПошлина   = ВсегоПошлина   + ЭлементМассива.СуммаПошлины;
		ВсегоАкциз     = ВсегоАкциз     + ЭлементМассива.СуммаАкциза;
		ВсегоНДС       = ВсегоНДС       + ЭлементМассива.СуммаНДС;
	КонецЦикла;

КонецПроцедуры // ПосчитатьИтогиПоРазделу()

Процедура ЗаполнитьСтатьюНалоговойДекларации(СтрокаТЧ) Экспорт
	
	Раздел = Разделы[СтрокаТЧ.НомерРаздела - 1];
	
	ДляХозяйственнойДеятельности = ?(СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Ложь, Истина);
	ДляОперацийОблагаемыхНДС 	 = ?(СтрокаТЧ.НалоговоеНазначение.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая, Ложь, Истина);
	
	// Определим, имеется ли право на налоговый кредит	
	Если  ДляХозяйственнойДеятельности
		И ДляОперацийОблагаемыхНДС Тогда
		
		Если ОформленНалоговыйВексельПоНДС Тогда
			// ст 6 Декларации
		    СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		Иначе
			Если Раздел.СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
			ИЛИ Раздел.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 12.1 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРОблагНДСТамож;
			Иначе
				// ст 12.3 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРОблагБезНДС;
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли ДляХозяйственнойДеятельности Тогда
			// И НЕ ДляОперацийОблагаемыхНДС
		Если ОформленНалоговыйВексельПоНДС Тогда
			//Если Раздел.СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
			//ИЛИ Раздел.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			//	// ст 6 Декларации
			//	СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НОИмпортВексель;
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
			//КонецЕсли; 
		Иначе
			Если Раздел.СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
			ИЛИ Раздел.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 13.1.1 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРНеОблагНеОбъектНДСТамож;
			Иначе
				// ст 13.1.2 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРНеОблагНеОбъектБезНДС;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Если ОформленНалоговыйВексельПоНДС Тогда
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		Иначе		
			Если Раздел.СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
			ИЛИ Раздел.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 13.1.1 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПокупкаСНДСнеВР_;
			Иначе
				// ст 13.1.2 Декларации
				СтрокаТЧ.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПокупкаБезНДСнеВР_;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

// Заполняет счета БУ в строке табличной части
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ)
	
	Если ЗаполнятьБУ = Истина Тогда
		СтрокаТЧ.СчетУчетаБУ  = СчетаУчета.СчетУчетаБУ;
		//для векселя
		СтрокаТЧ.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		СтрокаТЧ.СчетУчетаБУ  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СтрокаТЧ.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет счета НУ в строке табличной части
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ)
	
	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	
	Если ЗаполнятьНУ  = Истина Тогда
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			
			СтрокаТЧ.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначение;
			
		КонецЕсли;
		
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			
			СтрокаТЧ.НалоговоеНазначение 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Склад = Неопределено;
	
	Если  ЗначениеЗаполнено(СтрокаТЧ.ДокументПартии) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", СтрокаТЧ.ДокументПартии.Метаданные()) Тогда
			Склад = СтрокаТЧ.ДокументПартии.Склад;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("СкладОрдер", СтрокаТЧ.ДокументПартии.Метаданные())
			    И ТипЗнч(СтрокаТЧ.ДокументПартии.СкладОрдер) = Тип("СправочникСсылка.Склады") Тогда
			Склад = СтрокаТЧ.ДокументПартии.СкладОрдер;
		КонецЕсли;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);
	
	ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ);
	ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ);
 	ЗаполнитьСтатьюНалоговойДекларации(СтрокаТЧ);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

// Заполнение раздела документа "ГТД по импорту" по документам поступления
//
// Параметры
//  ДокументПоступления - ссылка на документ ПоступлениеТоваровУслуг, определяет документ поступления, по которому надо заполнить этот документ,
//  НомерРаздела        - число, номер раздела, который надо заполнить.
//
Процедура ЗаполнитьПоПоступлению(ДокументПоступления, НомерРаздела) Экспорт

	Если ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")
	   И НЕ ДокументПоступления.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслугВНТТ.ОтПоставщика Тогда
			Возврат;
	КонецЕсли;

	ТаблицаЗначенийТовары = ДокументПоступления.Товары.Выгрузить();

	Для каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийТовары Цикл

		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.НомерРаздела               = НомерРаздела;
		НоваяСтрока.ДокументПартии             = ДокументПоступления;
		НоваяСтрока.ЕдиницаИзмерения           = СтрокаТаблицыЗначений.ЕдиницаИзмерения;
		НоваяСтрока.ЕдиницаИзмеренияМест       = СтрокаТаблицыЗначений.ЕдиницаИзмеренияМест;
		НоваяСтрока.Количество                 = СтрокаТаблицыЗначений.Количество;
		НоваяСтрока.КоличествоМест             = СтрокаТаблицыЗначений.КоличествоМест;
		НоваяСтрока.Коэффициент                = СтрокаТаблицыЗначений.Коэффициент;
		НоваяСтрока.Номенклатура               = СтрокаТаблицыЗначений.Номенклатура;
		НоваяСтрока.СерияНоменклатуры          = СтрокаТаблицыЗначений.СерияНоменклатуры;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТаблицыЗначений.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЗаказПокупателя            = СтрокаТаблицыЗначений.Заказ;
		НоваяСтрока.ФактурнаяСтоимость         = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицыЗначений.Сумма, ДокументПоступления.ВалютаДокумента,
		                                         ВалютаДокумента,
		                                         ЗаполнениеДокументов.КурсДокумента(ДокументПоступления, мВалютаРегламентированногоУчета),
		                                         КурсДокумента,
		                                         ЗаполнениеДокументов.КратностьДокумента(ДокументПоступления, мВалютаРегламентированногоУчета),
		                                         КратностьДокумента);
												 
		НоваяСтрока.СчетУчетаБУ             	= СтрокаТаблицыЗначений.СчетУчетаБУ;
		НоваяСтрока.СчетУчетаНДС 				= ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
		НоваяСтрока.НалоговоеНазначение			= СтрокаТаблицыЗначений.НалоговоеНазначение;
			
		ЗаполнитьСтатьюНалоговойДекларации(НоваяСтрока);

	КонецЦикла;
	
	// Заполним оборудование
	Если ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
	   И ДокументПоступления.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда

		ТаблицаЗначенийОборудование = ДокументПоступления.Оборудование.Выгрузить();

		Для каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийОборудование Цикл

			НоваяСтрока = Оборудование.Добавить();
			НоваяСтрока.НомерРаздела               = НомерРаздела;
			НоваяСтрока.ДокументПартии             = ДокументПоступления;
			НоваяСтрока.ЕдиницаИзмерения           = СтрокаТаблицыЗначений.ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмеренияМест       = СтрокаТаблицыЗначений.ЕдиницаИзмеренияМест;
			НоваяСтрока.Количество                 = СтрокаТаблицыЗначений.Количество;
			НоваяСтрока.КоличествоМест             = СтрокаТаблицыЗначений.КоличествоМест;
			НоваяСтрока.Коэффициент                = СтрокаТаблицыЗначений.Коэффициент;
			НоваяСтрока.Номенклатура               = СтрокаТаблицыЗначений.Номенклатура;
			НоваяСтрока.СерияНоменклатуры          = СтрокаТаблицыЗначений.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТаблицыЗначений.ХарактеристикаНоменклатуры;
			НоваяСтрока.ФактурнаяСтоимость         = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицыЗначений.Сумма, ДокументПоступления.ВалютаДокумента,
			                                         ВалютаДокумента,
			                                         ЗаполнениеДокументов.КурсДокумента(ДокументПоступления, мВалютаРегламентированногоУчета),
			                                         КурсДокумента,
			                                         ЗаполнениеДокументов.КратностьДокумента(ДокументПоступления, мВалютаРегламентированногоУчета),
			                                         КратностьДокумента);
													 
			НоваяСтрока.СчетУчетаБУ             	= СтрокаТаблицыЗначений.СчетУчетаБУ;
			НоваяСтрока.СчетУчетаНДС 				= ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
			НоваяСтрока.НалоговоеНазначение			= СтрокаТаблицыЗначений.НалоговоеНазначение;
				
			ЗаполнитьСтатьюНалоговойДекларации(НоваяСтрока);

		КонецЦикла;
	   
	КонецЕсли;   

КонецПроцедуры // ЗаполнитьПоПоступлению()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиРазделы(ТаблицаПоРазделам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ТаможеннаяСтоимость, СтавкаНДС");
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Разделы", СтруктураОбязательныхПолей, Отказ, Заголовок);

	//Суммы пошлины и НДС в каждом разделе должны совпадать с итогами по разделу в ТЧ Товары.
	Для каждого Раздел Из ТаблицаПоРазделам Цикл
	
		ВсегоСтоимость = 0;
		ВсегоПошлина   = 0;
		ВсегоАкциз     = 0;
		ВсегоНДС       = 0;
		НомерРаздела = ТаблицаПоРазделам.Индекс(Раздел) + 1;
		ПосчитатьИтогиПоРазделу(НомерРаздела, ВсегоСтоимость, ВсегоПошлина, ВсегоАкциз, ВсегоНДС);
		
		Если ВсегоПошлина <> Раздел.СуммаПошлины Тогда
			ОбщегоНазначения.СообщитьОбОшибке("По разделу """ + СокрЛП(НомерРаздела) + """ сумма пошлины не совпадает с итогом по товарам раздела", Отказ, Заголовок);
		КонецЕсли;
		
		Если ВсегоАкциз <> Раздел.СуммаАкциза Тогда
			ОбщегоНазначения.СообщитьОбОшибке("По разделу """ + СокрЛП(НомерРаздела) + """ сумма акциза не совпадает с итогом по товарам раздела", Отказ, Заголовок);
		КонецЕсли;
	
		Если ВсегоНДС <> Раздел.СуммаНДС Тогда
			ОбщегоНазначения.СообщитьОбОшибке("По разделу """ + СокрЛП(НомерРаздела) + """ сумма НДС не совпадает с итогом по товарам раздела", Отказ, Заголовок);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
   	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ФактурнаяСтоимость");
	
	ПоставщикКомитент = (СтруктураШапкиДокумента.ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
	Если НЕ ПоставщикКомитент 
		И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		// при проведении по бух.учету заполненность документа-партии является обязательными.
		СтруктураОбязательныхПолей.Вставить("ДокументПартии");
	КонецЕсли; 
		
	Если  СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС
		И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");	
	КонецЕсли;
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если НЕ ПоставщикКомитент И СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит");
		КонецЕсли;
		
		Если  СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
	КонецЕсли;	
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Все партии должны быть от ПоставщикаТоваров
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + "Товары" + """: ";
									   
		// документ не работает с партиями оприходованными в розницу по продажным ценам
		Если ТипЗнч(СтрокаТаблицы.ДокументОприходования) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")
			И СтрокаТаблицы.ДокументОприходования.Склад.СуммовойУчет Тогда
			СтрокаСообщения = " указан ""Документ партии"" осуществляющий приходование на розничный склад (учет в рознице ведется в продажных ценах)!";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументОприходования) Тогда
			Если НЕ СтрокаТаблицы.ДокументПартииДоговор = СтруктураШапкиДокумента.ДоговорПоставщикаТоваров Тогда
				СтрокаСообщения = " реквизит ""Документ партии"" не соответствует реквизиту ""Договор поставщика товаров""!";
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			ИначеЕсли НЕ СтрокаТаблицы.ДокументПартииКонтрагент = СтруктураШапкиДокумента.ПоставщикТоваров Тогда	
				СтрокаСообщения = " реквизит ""Документ партии"" не соответствует реквизиту ""Поставщик товаров""!";
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
										
		Если СтрокаТаблицы.ДокументПартииВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			// ГТД принятые в переработку не обрабатывает
			СтрокаСообщения = " реквизит ""Документ партии"" является поступлением в переработку. ГТД оформляется только для купленных товаров !";
			
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		
    КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ФактурнаяСтоимость");
	
	ПоставщикКомитент = (СтруктураШапкиДокумента.ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		// при проведении по бух.учету заполненность документа-партии является обязательными.
		СтруктураОбязательныхПолей.Вставить("ДокументПартии");
	
	КонецЕсли; 
		
	Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете
		И СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");	
	КонецЕсли;
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если НЕ ПоставщикКомитент И СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит");
		КонецЕсли;
		
		Если  СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
		
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Оборудование", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Оборудование", ТаблицаПоТоварам, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Оборудование", ТаблицаПоТоварам, Отказ, Заголовок);

	// Все партии должны быть от ПоставщикаТоваров
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + "Товары" + """: ";
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументОприходования) Тогда
			Если НЕ СтрокаТаблицы.ДокументПартииДоговор = СтруктураШапкиДокумента.ДоговорПоставщикаТоваров Тогда
				СтрокаСообщения = " реквизит ""Документ партии"" не соответствует реквизиту ""Договор поставщика товаров""!";
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			ИначеЕсли НЕ СтрокаТаблицы.ДокументПартииКонтрагент = СтруктураШапкиДокумента.ПоставщикТоваров Тогда	
				СтрокаСообщения = " реквизит ""Документ партии"" не соответствует реквизиту ""Поставщик товаров""!";
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТаблицы.ДокументПартииВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			// ГТД принятые в переработку не обрабатывает
			СтрокаСообщения = " реквизит ""Документ партии"" является поступлением в переработку. ГТД оформляется только для купленных товаров !";
			
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, НомерГТД,
	                             |ВалютаДокумента, КурсДокумента, КратностьДокумента, Контрагент, ДоговорКонтрагента,
	                             |ПоставщикТоваров, ДоговорПоставщикаТоваров,КурсВзаиморасчетов,КратностьВзаиморасчетов");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
								 
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаПошлины");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаАкциза");
		Если Не СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
		КонецЕсли; 
		
		ПоставщикКомитент = (СтруктураШапкиДокумента.ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
		Если ПоставщикКомитент Тогда
			СтруктураОбязательныхПолей.Вставить("СчетЗатрат");
		КонецЕсли;

		Если СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаВексель");	
		КонецЕсли;
			
		
		Если ВключаетсяВУточняющийРасчет Тогда
			СтруктураОбязательныхПолей.Вставить("УточняемыйПериод");
		КонецЕсли;
			
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
		
	КонецЕсли;
								 
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);

	// С таможней Оба договора должны иметь вид "Прочее" и ведение взаиморасчетов "по договору в целом".
	Если СтруктураШапкиДокумента.ВидДоговора<> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Договор с таможней должен иметь вид ""Прочее"".", Отказ, Заголовок);
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Договор с таможней должен быть в валюте регламентированного учета ("+ мВалютаРегламентированногоУчета +") .", Отказ, Заголовок);
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для договора с таможней ведение взаиморасчетов должно быть ""По договору в целом"".", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ОбработатьТабличнуюЧастьРазделы(СтруктураШапкиДокумента)

	// Для проведения по взаиморасчетам посчитаем долг таможне.
	СуммаВзаиморасчетов    = ТаможенныйСбор;
	Для каждого СтрокаТабличнойЧасти Из Разделы Цикл
	
		СуммаВзаиморасчетов = СуммаВзаиморасчетов + СтрокаТабличнойЧасти.СуммаПошлины;
		
		СуммаВзаиморасчетов = СуммаВзаиморасчетов + СтрокаТабличнойЧасти.СуммаАкциза;
		
		Если НЕ СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			
			// если оформлен вексель, то сумма НДС не идет во взаиморасчеты
			СуммаВзаиморасчетов = СуммаВзаиморасчетов + СтрокаТабличнойЧасти.СуммаНДС;	
		
		КонецЕсли; 
		
	КонецЦикла;

	СтруктураШапкиДокумента.Вставить("СуммаВзаиморасчетов",    СуммаВзаиморасчетов);

КонецПроцедуры //ОбработатьТабличнуюЧастьРазделы()

Процедура РаспределитьСуммыИзШапки(ТаблицаПоТоварам, ТаблицаПоОборудованию, СтруктураШапкиДокумента)
	
	// Распределим таможенный сбор по товарам
	ТаблицаПоТоварам.Колонки.Добавить("ТаможенныйСбор", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоТоварам.Колонки.Добавить("ТаможеннаяСтоимость", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ТаблицаПоОборудованию.Колонки.Добавить("ТаможенныйСбор", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоОборудованию.Колонки.Добавить("ТаможеннаяСтоимость", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ОшибкаОкругленияТаможенныйСбор = 0;
	ВсегоСтоимостьПоГТД = ТаблицаПоТоварам.Итог("ФактурнаяСтоимость") + ТаблицаПоОборудованию.Итог("ФактурнаяСтоимость");
	
	Для каждого ТекРаздел Из Разделы Цикл
		
		СтрокиТоваровПоРазделу 		= ТаблицаПоТоварам.НайтиСтроки(Новый Структура("НомерРаздела", Разделы.Индекс(ТекРаздел) + 1)); 
		СтрокиОборудованияПоРазделу = ТаблицаПоОборудованию.НайтиСтроки(Новый Структура("НомерРаздела", Разделы.Индекс(ТекРаздел) + 1)); 
		
		ОшибкаОкругленияТаможеннаяСтоимость = 0;
		ТаможеннаяСтоимость = ТекРаздел.ТаможеннаяСтоимость;
		
		ВсегоСтоимостьПоРазделу = 0;
		
		Для каждого СтрокаРаздела Из СтрокиТоваровПоРазделу Цикл
			ВсегоСтоимостьПоРазделу = ВсегоСтоимостьПоРазделу + СтрокаРаздела.ФактурнаяСтоимость;
		КонецЦикла;
	
		Для каждого СтрокаРаздела Из СтрокиОборудованияПоРазделу Цикл
			ВсегоСтоимостьПоРазделу = ВсегоСтоимостьПоРазделу + СтрокаРаздела.ФактурнаяСтоимость;
		КонецЦикла;
		
		Если ВсегоСтоимостьПоРазделу = 0 Тогда
			// распределять нечего
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаРаздела Из СтрокиТоваровПоРазделу Цикл
			// таможенный сбор распределяем пропорционально строкам всех разделов
			СтрокаРаздела.ТаможенныйСбор 	  = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТаможенныйСбор      * (СтрокаРаздела.ФактурнаяСтоимость/ВсегоСтоимостьПоГТД), 2, ОшибкаОкругленияТаможенныйСбор);
			// таможенную стоимость распределяем только в рамках раздела, для которого она указана.
			СтрокаРаздела.ТаможеннаяСтоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТаможеннаяСтоимость * (СтрокаРаздела.ФактурнаяСтоимость/ВсегоСтоимостьПоРазделу), 2, ОшибкаОкругленияТаможеннаяСтоимость);
		КонецЦикла;
	
		Для каждого СтрокаРаздела Из СтрокиОборудованияПоРазделу Цикл
			// таможенный сбор распределяем пропорционально строкам всех разделов
			СтрокаРаздела.ТаможенныйСбор 	  = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТаможенныйСбор      * (СтрокаРаздела.ФактурнаяСтоимость/ВсегоСтоимостьПоГТД), 2, ОшибкаОкругленияТаможенныйСбор);
			// таможенную стоимость распределяем только в рамках раздела, для которого она указана.
			СтрокаРаздела.ТаможеннаяСтоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТаможеннаяСтоимость * (СтрокаРаздела.ФактурнаяСтоимость/ВсегоСтоимостьПоРазделу), 2, ОшибкаОкругленияТаможеннаяСтоимость);
		КонецЦикла;
		
	КонецЦикла;
	

	
КонецПроцедуры

Функция ПодготовитьТаблицуТоваров(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаТоваров.Колонки.Добавить("Качество");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	ТаблицаТоваров.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	// Недостающие поля.
	ТаблицаТоваров.Колонки.Добавить("Стоимость",     ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СтатусПартии");                                                
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"           	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	ПогрешностьРасчетаНДС = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Стоимость = СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз + СтрокаТаблицы.ТаможенныйСбор;
		СтоимостьСНДС = Стоимость + СтрокаТаблицы.НДС;
		
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, мВалютаРегламентированногоУчета,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
										 
		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			
			Если СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
					СуммаНДСВалУпр = 0;
				Иначе	
					СуммаНДСВалУпр = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, ПогрешностьРасчетаНДС);
				КонецЕсли;			
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.Стоимость - СтрокаТаблицы.НДСУпр;
										 
		Если СтрокаТаблицы.ОбособленныйУчетТоваровПоЗаказамПокупателей = Ложь Тогда
			СтрокаТаблицы.Заказ = Неопределено;
		КонецЕсли;

		Если СтрокаТаблицы.ДокументПартииВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТаблицы.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию; 
		Иначе
			СтрокаТаблицы.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный; 
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)

	// Ставку НДС возьмём из разделов
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаНУ");

	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСРегл"        	 		 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("БазаНДС"        	 		 	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаБезНДС" 	 		 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДСКредит"       	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДССебестоимость"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаСНДСРегл"  		 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСИсходный"			 	 ,ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ТаблицаТоваров.Колонки.Добавить("ДляХозяйственнойДеятельности", Новый ОписаниеТипов("Булево"));
	// для товаров колонка Амортизируется = Ложь
	ТаблицаТоваров.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));
	
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	НалоговоеНазначениеНДС_НеоблагаемаяНеХозДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Если СтрокаТаблицы.НалоговоеНазначение = НалоговоеНазначениеНДС_НеоблагаемаяНеХозДеятельность Тогда
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Ложь;
		Иначе
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Истина;
		КонецЕсли;
		
		СтрокаТаблицы.СуммаСНДСРегл			= СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз 
												+ СтрокаТаблицы.ТаможенныйСбор + СтрокаТаблицы.НДС;
		СтрокаТаблицы.БазаНДС				= СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз 
												+ СтрокаТаблицы.ТаможеннаяСтоимость;
		
		СтрокаТаблицы.ПроводкиСуммаСНДСРегл 	= СтрокаТаблицы.СуммаСНДСРегл;
		// подкорректируем ПроводкиСуммаСНДСРегл - для зачета аванса. При оформлении налогового векселя - нет задолженности по НДС перед таможней
		Если СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			СтрокаТаблицы.ПроводкиСуммаСНДСРегл = СтрокаТаблицы.ПроводкиСуммаСНДСРегл - СтрокаТаблицы.НДС;
		КонецЕсли;
		
		// Определим значение НДС в проводках
		// Ставку НДС получим из разделов
		СтрокаТаблицы.СтавкаНДС = Разделы[СтрокаТаблицы.НомерРаздела-1].СтавкаНДС;
		 
		Если СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
			// нет налогового кредита
			СтрокаТаблицы.ПроводкиСуммаНДСКредит = 0;
		ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
			Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
				СтрокаТаблицы.ПроводкиСуммаНДСКредит = 0;
			Иначе	
				СтрокаТаблицы.ПроводкиСуммаНДСКредит = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, , ПогрешностиОкругления, "СуммаНДСПропорциональноВал");
			КонецЕсли;
		Иначе
			СтрокаТаблицы.ПроводкиСуммаНДСКредит = СтрокаТаблицы.НДС;
		КонецЕсли;
		
		СтрокаТаблицы.ПроводкиСуммаНДССебестоимость = СтрокаТаблицы.НДС - СтрокаТаблицы.ПроводкиСуммаНДСКредит;
		
		СтрокаТаблицы.ПроводкиСуммаБезНДС 		    = СтрокаТаблицы.СуммаСНДСРегл - СтрокаТаблицы.ПроводкиСуммаНДСКредит;
		
	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровРегл()

Функция ПодготовитьТаблицуОборудование(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	ПодготовитьТаблицуОборудованиеУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуОборудованиеРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуОборудованиеУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаТоваров.Колонки.Добавить("Качество");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	ТаблицаТоваров.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	// Недостающие поля.
	ТаблицаТоваров.Колонки.Добавить("Стоимость",     ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТоваров.Колонки.Добавить("СтатусПартии");
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"           	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	ПогрешностьРасчетаНДС = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Стоимость = СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз + СтрокаТаблицы.ТаможенныйСбор;
		СтоимостьСНДС = Стоимость + СтрокаТаблицы.НДС;
		
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, мВалютаРегламентированногоУчета,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			Если СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
					СуммаНДСВалУпр = 0;
				Иначе	
					СуммаНДСВалУпр = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, ПогрешностьРасчетаНДС);
				КонецЕсли;			
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;

		СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.Стоимость - СтрокаТаблицы.НДСУпр;
	
		СтрокаТаблицы.СтатусПартии = Перечисления.СтатусыПартийТоваров.Оборудование; 

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура ПодготовитьТаблицуОборудованиеРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)

	// Ставку НДС возьмём из разделов
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");

	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСРегл"        	 		 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("БазаНДС"        	 		 	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаБезНДС" 	 		 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДСКредит"       	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДССебестоимость"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаСНДСРегл"			 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ТаблицаТоваров.Колонки.Добавить("ДляХозяйственнойДеятельности");	
	
	// для оборудования колонка Амортизируется = Истина
	ТаблицаТоваров.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));
	
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	НалоговоеНазначениеНДС_НеоблагаемаяНеХозДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность;

	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		СтрокаТаблицы.Амортизируется = Истина;
		Если СтрокаТаблицы.НалоговоеНазначение = НалоговоеНазначениеНДС_НеоблагаемаяНеХозДеятельность Тогда
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Ложь;
		Иначе
			СтрокаТаблицы.ДляХозяйственнойДеятельности = Истина;
		КонецЕсли;

		СтрокаТаблицы.СуммаСНДСРегл			= СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз 
												+ СтрокаТаблицы.ТаможенныйСбор + СтрокаТаблицы.НДС;
		СтрокаТаблицы.БазаНДС				= СтрокаТаблицы.Пошлина + СтрокаТаблицы.Акциз 
												+ СтрокаТаблицы.ТаможеннаяСтоимость;
		
		СтрокаТаблицы.ПроводкиСуммаСНДСРегл 	= СтрокаТаблицы.СуммаСНДСРегл;
		// подкорректируем ПроводкиСуммаСНДСРегл - для зачета аванса. При оформлении налогового векселя - нет задолженности по НДС перед таможней
		Если СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			СтрокаТаблицы.ПроводкиСуммаСНДСРегл = СтрокаТаблицы.ПроводкиСуммаСНДСРегл - СтрокаТаблицы.НДС;
		КонецЕсли;
		
		// Определим значение НДС в проводках
		// Ставку НДС получим из разделов
		СтрокаТаблицы.СтавкаНДС = Разделы[СтрокаТаблицы.НомерРаздела-1].СтавкаНДС;
		 
		Если СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
			// нет налогового кредита
			СтрокаТаблицы.ПроводкиСуммаНДСКредит = 0;
		ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
			Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
				СтрокаТаблицы.ПроводкиСуммаНДСКредит = 0;
			Иначе	
				СтрокаТаблицы.ПроводкиСуммаНДСКредит = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, , ПогрешностиОкругления, "СуммаНДСПропорциональноВал");
			КонецЕсли;
		Иначе
			СтрокаТаблицы.ПроводкиСуммаНДСКредит = СтрокаТаблицы.НДС;
		КонецЕсли;
		СтрокаТаблицы.ПроводкиСуммаНДССебестоимость = СтрокаТаблицы.НДС - СтрокаТаблицы.ПроводкиСуммаНДСКредит;
		
		СтрокаТаблицы.ПроводкиСуммаБезНДС 	= СтрокаТаблицы.СуммаСНДСРегл - СтрокаТаблицы.ПроводкиСуммаНДСКредит;
		
	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровРегл()

// Формируем движения по регистрам.
//
// Параметры: 
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  Отказ                     - флаг отказа в проведении
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию,Отказ, Заголовок)

	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда

		// ТОВАРЫ ПО РЕГИСТРУ ВзаиморасчетыСКонтрагентами

		НаборДвижений = Движения.ВзаиморасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.

		Если СтруктураШапкиДокумента.СуммаВзаиморасчетов <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.ДоговорКонтрагента  = ДоговорКонтрагента;
			СтрокаДвижений.Контрагент  		   = Контрагент;
			СтрокаДвижений.Организация  	   = Организация;
			СтрокаДвижений.Сделка              = Неопределено;
			СтрокаДвижений.СуммаВзаиморасчетов = СтруктураШапкиДокумента.СуммаВзаиморасчетов;
			СтрокаДвижений.СуммаУпр   		   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
													СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
													СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
													СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		КонецЕсли;
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход();
		КонецЕсли;

		// ПО РЕГИСТРУ РасчетыСКонтрагентами
		НаборДвижений = Движения.РасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		Если СтруктураШапкиДокумента.СуммаВзаиморасчетов <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.РасчетыВозврат        = Перечисления.РасчетыВозврат.Расчеты;
			СтрокаДвижений.ДоговорКонтрагента 	 = ДоговорКонтрагента;
			СтрокаДвижений.Контрагент  		     = Контрагент;
			СтрокаДвижений.Организация  	     = Организация;
			СтрокаДвижений.Сделка                = Неопределено;
			СтрокаДвижений.СуммаВзаиморасчетов   = СтруктураШапкиДокумента.СуммаВзаиморасчетов;
			СтрокаДвижений.СуммаУпр   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
										СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
										СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
										СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
        КонецЕсли;

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.РасчетыСКонтрагентами.ВыполнитьРасход();
		КонецЕсли;

		Если НЕ (СтруктураШапкиДокумента.ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
			
			// ПО РЕГИСТРУ Партии товаров на складах
			НаборДвижений = Движения.ПартииТоваровНаСкладах;

			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
				
			ТабПартий = ТаблицаПоТоварам.Скопировать();
			
			ТабПартий.ЗагрузитьКолонку(ТабПартий.ВыгрузитьКолонку("НДСУпр"), "НДС");
			
			// Из таблицы по товарам выделим строки, для которых заполнен документ оприходования
			Инд=0;
			Пока Инд<ТабПартий.Количество() Цикл
				
				Если НЕ ЗначениеЗаполнено(ТабПартий[Инд].ДокументОприходования) Тогда
					ТабПартий.Удалить(Инд);
				Иначе
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;

			ТабПартийОборудование = ТаблицаПоОборудованию.Скопировать();
			ТабПартийОборудование.ЗагрузитьКолонку(ТабПартийОборудование.ВыгрузитьКолонку("НДСУпр"), "НДС");
			
			// Из таблицы по товарам выделим строки, для которых заполнен документ оприходования
			Инд=0;
			Пока Инд<ТабПартийОборудование.Количество() Цикл
				
				Если НЕ ЗначениеЗаполнено(ТабПартийОборудование[Инд].ДокументОприходования) Тогда
					ТабПартийОборудование.Удалить(Инд);
				Иначе
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
				// потребуется распределение по складам
			   РаспределитьДопРасходыПоСкладамУпр(ТабПартий, ТабПартийОборудование, СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;   
			
			Для каждого Строка Из ТабПартий Цикл
			
				// Если партионный учет по сериям не ведется, то надо очистить серию
				Если НЕ Строка.ВестиПартионныйУчетПоСериям Тогда
					Строка.СерияНоменклатуры = Неопределено;
				КонецЕсли;
			
			КонецЦикла;
			
			Для каждого Строка Из ТабПартийОборудование Цикл
			
				// Если партионный учет по сериям не ведется, то надо очистить серию
				Если НЕ Строка.ВестиПартионныйУчетПоСериям Тогда
					Строка.СерияНоменклатуры = Неопределено;
				КонецЕсли;
			
			КонецЦикла;
			   
			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТабПартий, 			 ТаблицаДвижений);
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТабПартийОборудование, ТаблицаДвижений);
			
			ТаблицаДвижений.ЗаполнитьЗначения(0, "Количество");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПоступлениеДопРасходов, "КодОперации");
			
			// Если суммовой 
			Если НЕ СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
			КонецЕсли;
			
			// При учете по средней документ оприходования не заполняется 
			УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата); 
			Если УчетнаяПолитика.СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда 
				ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ДокументОприходования"); 
			КонецЕсли;

			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
			КонецЕсли;
			
			// ПО РЕГИСТРУ доп.расходов для последующего распределения
			
			НаборДвижений = Движения.ДопРасходыНаПриобретениеТоваров;

			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			ТабЗатрат = ТаблицаПоТоварам.Скопировать();
			
			// Из таблицы по товарам выделим строки, для которых НЕ заполнен документ оприходования
			Инд=0;
			Пока Инд<ТабЗатрат.Количество() Цикл
				
				Если ЗначениеЗаполнено(ТабЗатрат[Инд].ДокументОприходования) Тогда
					ТабЗатрат.Удалить(Инд);
				Иначе
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТабЗатрат.Колонки.Найти("Сумма")<>Неопределено Тогда
				ТабЗатрат.Колонки.Удалить("Сумма");
			КонецЕсли;
			ТабЗатрат.Колонки.Стоимость.Имя = "Сумма";
			
			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТабЗатрат, ТаблицаДвижений);
			
			ТабЗатратОборудование = ТаблицаПоОборудованию.Скопировать();
			
			// Из таблицы по товарам выделим строки, для которых НЕ заполнен документ оприходования
			Инд=0;
			Пока Инд<ТабЗатратОборудование.Количество() Цикл
				
				Если ЗначениеЗаполнено(ТабЗатратОборудование[Инд].ДокументОприходования) Тогда
					ТабЗатратОборудование.Удалить(Инд);
				Иначе
					Инд=Инд+1;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТабЗатратОборудование.Колонки.Найти("Сумма")<>Неопределено Тогда
				ТабЗатратОборудование.Колонки.Удалить("Сумма");
			КонецЕсли;
			ТабЗатратОборудование.Колонки.Стоимость.Имя = "Сумма";
			
			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТабЗатратОборудование, ТаблицаДвижений);
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ДопРасходыНаПриобретениеТоваров.ВыполнитьПриход();
			КонецЕсли;
			
		Иначе
		
			//Отнесем на затраты 
			ТабЗатрат = Новый ТаблицаЗначений;
			
			ТабЗатрат.Колонки.Добавить("Сумма",         		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
			ТабЗатрат.Колонки.Добавить("Заказ");
			ТабЗатрат.Колонки.Добавить("СтатьяЗатрат",  		Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
			ТабЗатрат.Колонки.Добавить("НоменклатурнаяГруппа", 	Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
			ТабЗатрат.Колонки.Добавить("Подразделение",        	Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
			
			Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл
				НоваяСтрока = ТабЗатрат.Добавить();
				НоваяСтрока.Сумма                = СтрокаТЧ.Пошлина + СтрокаТЧ.Акциз + СтрокаТЧ.НДС + СтрокаТЧ.ТаможенныйСбор;
				НоваяСтрока.Заказ                = СтрокаТЧ.Заказ;
				НоваяСтрока.СтатьяЗатрат         = СтатьяЗатрат;
				НоваяСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
				НоваяСтрока.Подразделение        = Подразделение;
			КонецЦикла;
			
			Для каждого СтрокаТЧ Из ТаблицаПоОборудованию Цикл
				НоваяСтрока = ТабЗатрат.Добавить();
				НоваяСтрока.Сумма                = СтрокаТЧ.Пошлина + СтрокаТЧ.Акциз + СтрокаТЧ.НДС + СтрокаТЧ.ТаможенныйСбор;
				НоваяСтрока.Заказ                = СтрокаТЧ.Заказ;
				НоваяСтрока.СтатьяЗатрат         = СтатьяЗатрат;
				НоваяСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
				НоваяСтрока.Подразделение        = Подразделение;
			КонецЦикла;
				
			УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ЭтотОбъект, ТабЗатрат, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
			
		КонецЕсли;
			
		// ПО РЕГИСТРУ Закупки
		НаборДвижений = Движения.Закупки;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Подготовим таблицу товаров для регистра закупки.
		ТаблицаПоТоварамЗакупки = ТаблицаПоТоварам.Скопировать();
		
		ТаблицаПоТоварамЗакупки.ЗагрузитьКолонку(ТаблицаПоТоварамЗакупки.ВыгрузитьКолонку("НДСУпр"), "НДС");
		
		Сч = 0;
		Пока Сч < ТаблицаПоТоварамЗакупки.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТоварамЗакупки.Получить(Сч);

			Если СтрокаТаблицы.Стоимость = 0 Тогда
				ТаблицаПоТоварамЗакупки.Удалить(СтрокаТаблицы);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
			
		// Заполним таблицу движений.
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(ТаблицаПоТоварамЗакупки, ТаблицаДвижений, Проект, Дата, "Закупки");
		Иначе		
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамЗакупки, ТаблицаДвижений);
			
		КонецЕсли;

		// Подготовим таблицу товаров для регистра закупки.
		ТаблицаПоОборудованиюЗакупки = ТаблицаПоОборудованию.Скопировать();
		
		ТаблицаПоОборудованиюЗакупки.ЗагрузитьКолонку(ТаблицаПоОборудованиюЗакупки.ВыгрузитьКолонку("НДСУпр"), "НДС");
		
		Сч = 0;
		Пока Сч < ТаблицаПоОборудованиюЗакупки.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоОборудованиюЗакупки.Получить(Сч);

			Если СтрокаТаблицы.Стоимость = 0 Тогда
				ТаблицаПоОборудованиюЗакупки.Удалить(СтрокаТаблицы);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
			
		// Заполним таблицу движений.
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(ТаблицаПоОборудованиюЗакупки, ТаблицаДвижений, Проект, Дата, "Закупки");
		Иначе		
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОборудованиюЗакупки, ТаблицаДвижений);
			
		КонецЕсли;
		
		ТаблицаДвижений.ЗаполнитьЗначения(0,                  "Количество");
		ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,      "Подразделение");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, 		  "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, 		  "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,             "ДокументЗакупки");

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.Закупки.ВыполнитьДвижения();
		КонецЕсли;

	КонецЕсли; // ОтражатьВУправленческомУчете

КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура РаспределитьДопРасходыПоСкладамУпр(ТаблицаПоТоварам, ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ЗапросРаспределенияПоСкладам = Новый Запрос;
	ЗапросРаспределенияПоСкладам.Текст = "ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка КАК ДокументОприходования,
	                                     |	ДокументОприходованияТовары.Склад КАК Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура КАК Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Коэффициент КАК Коэффициент,
										 |	ДокументОприходованияТовары.НалоговоеНазначение КАК НалоговоеНазначение,
	                                     |	СУММА(ДокументОприходованияТовары.Количество) КАК Количество,
	                                     |	&СтатусПартии КАК СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслуг.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Ссылка
										 |
										 |ОБЪЕДИНИТЬ ВСЕ
										 |
										 |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка КАК ДокументОприходования,
	                                     |	ДокументОприходованияТовары.Склад КАК Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура КАК Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Коэффициент КАК Коэффициент,
										 |	ДокументОприходованияТовары.НалоговоеНазначение КАК НалоговоеНазначение,
	                                     |	СУММА(ДокументОприходованияТовары.Количество) КАК Количество,
	                                     |	&СтатусПартииОборудование КАК СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Ссылка

	                                     |ОБЪЕДИНИТЬ ВСЕ
	                                     |
	                                     |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка,
	                                     |	ДокументОприходованияТовары.Ссылка.Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Коэффициент,
										 |	ДокументОприходованияТовары.НалоговоеНазначение КАК НалоговоеНазначение,
	                                     |	СУММА(ДокументОприходованияТовары.Количество),
	                                     |	&СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Ссылка.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Ссылка
	                                     |
	                                     |ОБЪЕДИНИТЬ ВСЕ
	                                     |
	                                     |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Коэффициент,
										 |	ДокументОприходованияТовары.НалоговоеНазначение КАК НалоговоеНазначение,
	                                     |	СУММА(ДокументОприходованияТовары.Количество),
	                                     |	&СтатусПартии
	                                     |ИЗ
	                                     |	Документ.АвансовыйОтчет.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Ссылка
	                                     |";

										 
	ОбщаяТаблица = ТаблицаПоТоварам.Скопировать();
	ОбщаяТаблица.Свернуть("ДокументОприходования, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "");
	ТаблицаОборудованияКопия = ТаблицаПоОборудованию.Скопировать();
	ТаблицаОборудованияКопия.Свернуть("ДокументОприходования, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаОборудованияКопия, ОбщаяТаблица);
	
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("Ссылка", 						ОбщаяТаблица.ВыгрузитьКолонку("ДокументОприходования"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("Номенклатура", 				ОбщаяТаблица.ВыгрузитьКолонку("Номенклатура"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("ХарактеристикаНоменклатуры", 	ОбщаяТаблица.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СерияНоменклатуры", 			ОбщаяТаблица.ВыгрузитьКолонку("СерияНоменклатуры"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СтатусПартии", 	Перечисления.СтатусыПартийТоваров.Купленный);
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СтатусПартииОборудование", Перечисления.СтатусыПартийТоваров.Оборудование);
	
	ТаблицаРаспределенияПоСкладам = ЗапросРаспределенияПоСкладам.Выполнить().Выгрузить();
	
	РаспределитьПоСкладамУпр(ТаблицаПоТоварам, 	 ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, Перечисления.СтатусыПартийТоваров.Купленный,    Отказ, Заголовок);
    РаспределитьПоСкладамУпр(ТаблицаПоОборудованию, ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, Перечисления.СтатусыПартийТоваров.Оборудование, Отказ, Заголовок);

КонецПроцедуры

Процедура РаспределитьПоСкладамУпр(ТаблицаПоТоварам, ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, СтатусПартии, Отказ, Заголовок)
	
	ТаблицаПоТоварам.Колонки.Добавить("МеткаРаспределения", Новый ОписаниеТипов("Булево"));
	
	ДопСтроки = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из ТаблицаПоТоварам.Колонки Цикл
		ДопСтроки.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаПоТоварам Цикл
		// В таблице распределения по складам могут быть записи с любыми комбинациями 
		// ДокументОприходования, Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры
		// Отберем нужные
		СтруктураПоиска = Новый Структура ("ДокументОприходования, Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, СтатусПартии",
											Строка.ДокументОприходования,
											Строка.Номенклатура,
											Строка.СерияНоменклатуры,
											Строка.ХарактеристикаНоменклатуры,
											СтатусПартии);
											
		Если ОтражатьВБухгалтерскомУчете Тогда
			СтруктураПоиска.Вставить("НалоговоеНазначение", Строка.НалоговоеНазначение);
		КонецЕсли;											
											
		МассивСтрокРаспределения = ТаблицаРаспределенияПоСкладам.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрокРаспределения.Количество() = 0 тогда
			ТекстСообщения = "Не найден в документе "+ Строка.ДокументОприходования
			+ " товар " + Строка.Номенклатура
			+ ?(Строка.Номенклатура.ВестиУчетПоХарактеристикам, ", х-ка: " + Строка.ХарактеристикаНоменклатуры, "")
			+ ?(Строка.Номенклатура.ВестиУчетПоСериям, ", серия: " + Строка.СерияНоменклатуры, "")
			+ ?(ОтражатьВБухгалтерскомУчете, ", нал. назн.: " + Строка.НалоговоеНазначение, "");
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		КонецЕсли;
		
		ИтогоКоличество = 0;
		Для Каждого Элемент Из МассивСтрокРаспределения Цикл
			ИтогоКоличество = ИтогоКоличество + Элемент.Количество * Элемент.Коэффициент;
		КонецЦикла;
		
		РаспределяемаяСумма = Строка.Стоимость;
		РаспределяемыйНДС 	= Строка.НДС;
		
		ПогрешностиОкругления = Новый Соответствие;
		
		Для Каждого Элемент Из МассивСтрокРаспределения Цикл
			
			Если ИтогоКоличество<=0 Тогда         
				Прервать;
			КонецЕсли;
			
			Если Элемент.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДопСтрока = ДопСтроки.Добавить();
			ЗаполнитьЗначенияСвойств(ДопСтрока,Строка);
			
			ДопСтрока.Склад = Элемент.Склад;
			
			Если Элемент.Количество<ИтогоКоличество Тогда
				КоэффРаспред = Элемент.Количество * Элемент.Коэффициент/ИтогоКоличество;
			Иначе
				КоэффРаспред = 1;
			КонецЕсли;
			
			ДопСтрока.Стоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяСумма 	* КоэффРаспред, 2, , ПогрешностиОкругления, "Стоимость"); 						
			ДопСтрока.НДС 		= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемыйНДС 	* КоэффРаспред, 2, , ПогрешностиОкругления, "НДС"); 						
			
		КонецЦикла;
		
		// Исходная строка будет помечена
		Строка.МеткаРаспределения = Истина;
		
	КонецЦикла;
	
	// Теперь доп строки добавим в таблицу по товарам
	Для Каждого ДопСтрока Из ДопСтроки Цикл
		НоваяСтрока = ТаблицаПоТоварам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ДопСтрока);
	КонецЦикла;
			
	// После обработки удалим строки с нулевыми суммами
	Инд=0;
	Пока Инд<ТаблицаПоТоварам.Количество() Цикл
		Если ТаблицаПоТоварам[Инд].МеткаРаспределения = Истина Тогда
			ТаблицаПоТоварам.Удалить(Инд);
		Иначе
			Инд = Инд+1;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры//РаспределитьПоСкладам

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию, Отказ, Заголовок);

	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		// документ не проводится по беух. учету.
		Возврат;
	КонецЕсли; 
 
	ДатаДок    = Дата;
	ПроводкиБУ = Движения.Хозрасчетный;
	
	// Зачтем аванс
	ТаблицыДокумента = Новый Структура();
    ТаблицыДокумента.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);
    ТаблицыДокумента.Вставить("ТаблицаПоОборудованию",ТаблицаПоОборудованию);
    ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ");

	ПоставщикКомитент = (СтруктураШапкиДокумента.ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	// ПРОВОДКИ ПО ДООЦЕНКЕ ТОВАРОВ и ОБОРУДОВАНИЯ
	
	// занесём все строки в один массив, чтобы работать с ними единообразно
	МассивСтрок = Новый Массив;
	Если НЕ ПоставщикКомитент Тогда
		
		// потребуется распределить доп.расходы по складам, указанным в документах оприходования.
		ТаблицаПоТоварамСРаспределением 	 = ТаблицаПоТоварам.Скопировать(); 
		ТаблицаПоОборудованиюСРаспределением = ТаблицаПоОборудованию.Скопировать();
		
		РаспределитьДопРасходыПоСкладамРегл(ТаблицаПоТоварамСРаспределением, ТаблицаПоОборудованиюСРаспределением, СтруктураШапкиДокумента, Отказ, Заголовок);
		
		Для каждого СтрокаТаблицы Из ТаблицаПоТоварамСРаспределением Цикл
			МассивСтрок.Добавить(СтрокаТаблицы);
		КонецЦикла;
		Для каждого СтрокаТаблицы Из ТаблицаПоОборудованиюСРаспределением Цикл
			МассивСтрок.Добавить(СтрокаТаблицы);
		КонецЦикла;
		
	Иначе		
		
		Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
			МассивСтрок.Добавить(СтрокаТаблицы);
		КонецЦикла;
		Для каждого СтрокаТаблицы Из ТаблицаПоОборудованию Цикл
			МассивСтрок.Добавить(СтрокаТаблицы);
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		// Бухгалтерский учет
		// Пошлина
		Если НЕ СтрокаТаблицы.Пошлина = 0 Тогда
		
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = ДатаДок;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.Пошлина;
			Проводка.Содержание                 = "Таможенная пошлина";
			Проводка.НомерЖурнала               = "";

			Если НЕ ПоставщикКомитент Тогда
				
				Проводка.СчетДт                     = СтрокаТаблицы.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
				Если ПартионныйУчетБУ Тогда 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", СтрокаТаблицы.ДокументОприходования);
				КонецЕсли;
				Проводка.КоличествоДт               = 0;
				
				Проводка.НалоговоеНазначениеДт		= СтрокаТаблицы.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И 
					СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
					СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка.СуммаНУДт = Проводка.Сумма;
					
				КонецЕсли;

			Иначе	
				
				// ГТД от комитента - все на затраты
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетЗатрат;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ЗатратСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ЗатратСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ЗатратСубконто3);
			
			КонецЕсли; 

			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаПошлины;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтруктураШапкиДокумента.ПошлинаСубконто1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтруктураШапкиДокумента.ПошлинаСубконто2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3 , СтруктураШапкиДокумента.ПошлинаСубконто3);
		
		КонецЕсли; 
		
		// Акциз
		Если НЕ СтрокаТаблицы.Акциз = 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = ДатаДок;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.Акциз;
			Проводка.Содержание                 = "Акциз";
			Проводка.НомерЖурнала               = "";
			
			Если НЕ ПоставщикКомитент Тогда
				
				Проводка.СчетДт                     = СтрокаТаблицы.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
				Если ПартионныйУчетБУ Тогда 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", СтрокаТаблицы.ДокументОприходования);
				КонецЕсли;
				Проводка.КоличествоДт               = 0;

				
				Проводка.НалоговоеНазначениеДт		= СтрокаТаблицы.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И 
					СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
					СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка.СуммаНУДт = Проводка.Сумма;
					
				КонецЕсли;
				
			Иначе	
				
				// ГТД от комитента - все на затраты
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетЗатрат;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ЗатратСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ЗатратСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ЗатратСубконто3);
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт		= СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				    Если СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
							СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
					
						Проводка.СуммаНУДт = Проводка.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			
			КонецЕсли; 

			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаАкциза;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтруктураШапкиДокумента.АкцизСубконто1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтруктураШапкиДокумента.АкцизСубконто2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3 , СтруктураШапкиДокумента.АкцизСубконто3);
			
		КонецЕсли; 
				
		// Таможенный сбор
		Если НЕ СтрокаТаблицы.ТаможенныйСбор = 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = ДатаДок;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.ТаможенныйСбор;
			Проводка.Содержание                 = "Таможенный сбор";
			Проводка.НомерЖурнала               = "";

			Если НЕ ПоставщикКомитент Тогда

				Проводка.СчетДт                     = СтрокаТаблицы.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
				Если ПартионныйУчетБУ Тогда 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", СтрокаТаблицы.ДокументОприходования);
				КонецЕсли;
				Проводка.КоличествоДт               = 0;
				
				Проводка.НалоговоеНазначениеДт		= СтрокаТаблицы.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И 
					СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
					СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка.СуммаНУДт = Проводка.Сумма;
					
				КонецЕсли;

			Иначе	
				
				// ГТД от комитента - все на затраты
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетЗатрат;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ЗатратСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ЗатратСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ЗатратСубконто3);
			
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт		= СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				    Если СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
							СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
					
						Проводка.СуммаНУДт = Проводка.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
			
			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры",    СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка));
	
		КонецЕсли; 
		
		// НДС (если он идет на себестоимость)
		Если НЕ СтрокаТаблицы.ПроводкиСуммаНДССебестоимость = 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = ДатаДок;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.ПроводкиСуммаНДССебестоимость;
			Если НЕ ПоставщикКомитент Тогда
				Проводка.Содержание                 = "НДС: на себестоимость запасов";
			Иначе
				Проводка.Содержание                 = "НДС: на затраты";
			КонецЕсли;
			Проводка.НомерЖурнала               = "";
			
			Если НЕ ПоставщикКомитент Тогда

				Проводка.СчетДт                     = СтрокаТаблицы.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Склады",       СтрокаТаблицы.Склад);
				Если ПартионныйУчетБУ Тогда 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Партии", СтрокаТаблицы.ДокументОприходования);
				КонецЕсли;
				Проводка.КоличествоДт               = 0;
				
				Проводка.НалоговоеНазначениеДт		= СтрокаТаблицы.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И 
					СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
					СтрокаТаблицы.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					
					Проводка.СуммаНУДт = Проводка.Сумма;
					
				КонецЕсли;

			Иначе	
				
				// ГТД от комитента - все на затраты
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетЗатрат;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ЗатратСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ЗатратСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ЗатратСубконто3);
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт		= СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				    Если СтруктураШапкиДокумента.НеОтноситьНаЗатратыПоНУ = Ложь И 
							СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
					
						Проводка.СуммаНУДт = Проводка.Сумма;
					КонецЕсли;
				КонецЕсли;
			
			КонецЕсли; 
			
			Если СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
				
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаВексель;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтруктураШапкиДокумента.ВексельСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтруктураШапкиДокумента.ВексельСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3 , СтруктураШапкиДокумента.ВексельСубконто3);
				
			Иначе
				
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры",    СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка));
			
			КонецЕсли; 
				
		КонецЕсли; 
		
	КонецЦикла; // Проводки по товарам и оборудованию
	
	// Взаиморасчетам с таможней по пошлине
	ВсегоПошлина = ТаблицаПоТоварам.Итог("Пошлина")+ТаблицаПоОборудованию.Итог("Пошлина");
	Если НЕ ВсегоПошлина = 0 Тогда
	
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период                     = ДатаДок;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма                      = ВсегоПошлина;
		Проводка.Содержание                 = "Таможенная пошлина";
		Проводка.НомерЖурнала               = "";

		Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаПошлины;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ПошлинаСубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ПошлинаСубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ПошлинаСубконто3);
		
		Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры",    СтруктураШапкиДокумента.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,  "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка));
		
	КонецЕсли;
	
	// Взаиморасчетам с таможней по акцизу
	ВсегоАкциз = ТаблицаПоТоварам.Итог("Акциз") + ТаблицаПоОборудованию.Итог("Акциз");
	Если НЕ ВсегоАкциз = 0 Тогда
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период                     = ДатаДок;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма                      = ВсегоАкциз;
		Проводка.Содержание                 = "Акциз";
		Проводка.НомерЖурнала               = "";
		
		Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаАкциза;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.АкцизСубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.АкцизСубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.АкцизСубконто3);
		
		Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры",    СтруктураШапкиДокумента.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,  "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка));
		
	КонецЕсли;
	
	// налоговый кредит по НДС
	ВсегоНДСКредит = ТаблицаПоТоварам.Итог("ПроводкиСуммаНДСКредит") + ТаблицаПоОборудованию.Итог("ПроводкиСуммаНДСКредит");
	Если НЕ ВсегоНДСКредит = 0 Тогда
	

		Если СтруктураШапкиДокумента.ОформленНалоговыйВексельПоНДС Тогда
			
			ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
			ТаблицаКопия.Свернуть("СчетУчетаНДС", "ПроводкиСуммаНДСКредит");
			
			ТаблицаКопияОборудование = ТаблицаПоОборудованию.Скопировать();
			ТаблицаКопияОборудование.Свернуть("СчетУчетаНДС", "ПроводкиСуммаНДСКредит");
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопияОборудование,ТаблицаКопия);
			ТаблицаКопия.Свернуть("СчетУчетаНДС", "ПроводкиСуммаНДСКредит");
			
			Для каждого Строка Из ТаблицаКопия Цикл
			
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период                     = ДатаДок;
				Проводка.Активность                 = Истина;
				Проводка.Организация                = СтруктураШапкиДокумента.Организация;
				Проводка.Сумма                      = Строка.ПроводкиСуммаНДСКредит;
				Проводка.Содержание                 = "НДС: оформлен вексель";
				Проводка.НомерЖурнала               = "";

				Проводка.СчетДт                     = Строка.СчетУчетаНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтруктураШапкиДокумента.ПоставщикТоваров);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры"   , СтруктураШапкиДокумента.ДоговорПоставщикаТоваров);
					
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаВексель;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтруктураШапкиДокумента.ВексельСубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтруктураШапкиДокумента.ВексельСубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3 , СтруктураШапкиДокумента.ВексельСубконто3);
			
			КонецЦикла; 
			
		Иначе
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = ДатаДок;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = ВсегоНДСКредит;
			Проводка.Содержание                 = "НДС: налоговый кредит";
			Проводка.НомерЖурнала               = "";

			Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
			Если НЕ ПоставщикКомитент Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.НДССубконто1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.НДССубконто2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.НДССубконто3);
			Иначе
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтруктураШапкиДокумента.ПоставщикТоваров);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры",    СтруктураШапкиДокумента.ДоговорПоставщикаТоваров);
			КонецЕсли;
				
			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры",    СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,  "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка));
		КонецЕсли; 
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ЕстьНДС Тогда
		
		// поскольку ГТД является налговым документом, то пишем сразу в книгу приобретений (НДСНалоговыйКредит)
		
		// Движения по регистру "Книга приобретений"
		НаборДвижений = Движения.НДСНалоговыйКредит;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
		ИсходноеКоличествоСтрок = ТаблицаКопия.Количество();
		Для НомСтроки = 1 По ИсходноеКоличествоСтрок Цикл
			ТекСтрока = ТаблицаКопия[НомСтроки-1];
			Если НЕ ТекСтрока.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				Продолжить;
			КонецЕсли;
			
			// добавим строку по пропорц. НДС, относящемуся на кредит, текущая строка останется такой, что не относится на кредит
			ДобавленнаяСтрока = ТаблицаКопия.Добавить();
			ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, ТекСтрока);
			
			ДобавленнаяСтрока.БазаНДС = ?(ТекСтрока.НДС = 0, 0, ТекСтрока.БазаНДС * (ТекСтрока.ПроводкиСуммаНДСКредит / ТекСтрока.НДС));
			ДобавленнаяСтрока.НДС     = ТекСтрока.ПроводкиСуммаНДСКредит;
			Если ДобавленнаяСтрока.Амортизируется = Истина Тогда
				ДобавленнаяСтрока.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорциональноВклВКредитПоставкаОФ;
			Иначе
				ДобавленнаяСтрока.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорциональноВклВКредит;
			КонецЕсли;
			
			ТекСтрока.НДС     = ТекСтрока.НДС 	  - ДобавленнаяСтрока.НДС;
			ТекСтрока.БазаНДС = ТекСтрока.БазаНДС - ДобавленнаяСтрока.БазаНДС;
			ТекСтрока.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорциональноНеВклВКредит;
		
		КонецЦикла;
		
		ТаблицаКопия.Свернуть("СтатьяДекларацииНДСНалоговыйКредит,СтавкаНДС","БазаНДС,НДС");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		//оборудование
		ТаблицаКопия = ТаблицаПоОборудованию.Скопировать();
		ТаблицаКопия.Свернуть("СтатьяДекларацииНДСНалоговыйКредит,СтавкаНДС","БазаНДС,НДС");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация		, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорПоставщикаТоваров, "ДоговорКонтрагента");
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийНДСНалоговыйКредит.ПервичныйДокумент, "КодОперации");
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			НаборДвижений.ДобавитьДвижение();
		КонецЕсли;
	
	КонецЕсли; 

КонецПроцедуры

Процедура РаспределитьДопРасходыПоСкладамРегл(ТаблицаПоТоварам, ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ЗапросРаспределенияПоСкладам = Новый Запрос;
	ЗапросРаспределенияПоСкладам.Текст = "ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка КАК ДокументОприходования,
	                                     |	ДокументОприходованияТовары.Склад КАК Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура КАК Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.СчетУчетаБУ 				КАК СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение 		КАК НалоговоеНазначение,
										 |	ДокументОприходованияТовары.Коэффициент 				КАК Коэффициент,
	                                     |	СУММА(ДокументОприходованияТовары.Количество) 			КАК Количество,
	                                     |	&СтатусПартии КАК СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслуг.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Ссылка,
										 |	ДокументОприходованияТовары.СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение
										 |
										 |ОБЪЕДИНИТЬ ВСЕ
										 |
										 |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка КАК ДокументОприходования,
	                                     |	ДокументОприходованияТовары.Склад КАК Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура КАК Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.СчетУчетаБУ 				КАК СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение 		КАК НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Коэффициент КАК Коэффициент,
	                                     |	СУММА(ДокументОприходованияТовары.Количество) КАК Количество,
	                                     |	&СтатусПартииОборудование КАК СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Ссылка,
										 |	ДокументОприходованияТовары.СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение
                                         |
	                                     |ОБЪЕДИНИТЬ ВСЕ
	                                     |
	                                     |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка,
	                                     |	ДокументОприходованияТовары.Ссылка.Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.СчетУчетаБУ 				КАК СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение 		КАК НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	СУММА(ДокументОприходованияТовары.Количество),
	                                     |	&СтатусПартии
	                                     |ИЗ
	                                     |	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Ссылка.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Ссылка,
										 |	ДокументОприходованияТовары.СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение
	                                     |
	                                     |ОБЪЕДИНИТЬ ВСЕ
	                                     |
	                                     |ВЫБРАТЬ
	                                     |	ДокументОприходованияТовары.Ссылка,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
										 |	ДокументОприходованияТовары.СчетУчетаБУ 				КАК СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение 		КАК НалоговоеНазначение,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	СУММА(ДокументОприходованияТовары.Количество),
	                                     |	&СтатусПартии
	                                     |ИЗ
	                                     |	Документ.АвансовыйОтчет.Товары КАК ДокументОприходованияТовары
	                                     |ГДЕ
	                                     |	ДокументОприходованияТовары.Ссылка В(&Ссылка)
	                                     |	И ДокументОприходованияТовары.Номенклатура В(&Номенклатура)
	                                     |	И ДокументОприходованияТовары.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)
	                                     |	И ДокументОприходованияТовары.СерияНоменклатуры В(&СерияНоменклатуры)
	                                     |
	                                     |СГРУППИРОВАТЬ ПО
	                                     |	ДокументОприходованияТовары.Номенклатура,
	                                     |	ДокументОприходованияТовары.Коэффициент,
	                                     |	ДокументОприходованияТовары.Склад,
	                                     |	ДокументОприходованияТовары.СерияНоменклатуры,
	                                     |	ДокументОприходованияТовары.ХарактеристикаНоменклатуры,
	                                     |	ДокументОприходованияТовары.Ссылка,
										 |	ДокументОприходованияТовары.СчетУчетаБУ,
										 |	ДокументОприходованияТовары.НалоговоеНазначение
	                                     |";

										 
	ОбщаяТаблица = ТаблицаПоТоварам.Скопировать();
	ОбщаяТаблица.Свернуть("ДокументОприходования, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "");
	ТаблицаОборудованияКопия = ТаблицаПоОборудованию.Скопировать();
	ТаблицаОборудованияКопия.Свернуть("ДокументОприходования, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаОборудованияКопия, ОбщаяТаблица);
	
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("Ссылка", 						ОбщаяТаблица.ВыгрузитьКолонку("ДокументОприходования"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("ПустойСклад", 				Справочники.Склады.ПустаяСсылка());
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("Номенклатура", 				ОбщаяТаблица.ВыгрузитьКолонку("Номенклатура"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("ХарактеристикаНоменклатуры", 	ОбщаяТаблица.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СерияНоменклатуры", 			ОбщаяТаблица.ВыгрузитьКолонку("СерияНоменклатуры"));
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СтатусПартии", 	Перечисления.СтатусыПартийТоваров.Купленный);
	ЗапросРаспределенияПоСкладам.УстановитьПараметр("СтатусПартииОборудование", Перечисления.СтатусыПартийТоваров.Оборудование);
	
	ТаблицаРаспределенияПоСкладам = ЗапросРаспределенияПоСкладам.Выполнить().Выгрузить();
	
	РаспределитьПоСкладамРегл(ТаблицаПоТоварам, 	 ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, Перечисления.СтатусыПартийТоваров.Купленный,    Отказ, Заголовок);
    РаспределитьПоСкладамРегл(ТаблицаПоОборудованию, ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, Перечисления.СтатусыПартийТоваров.Оборудование, Отказ, Заголовок);

КонецПроцедуры

Процедура РаспределитьПоСкладамРегл(ТаблицаПоТоварам, ТаблицаРаспределенияПоСкладам, СтруктураШапкиДокумента, СтатусПартии, Отказ, Заголовок)
	
	ТаблицаПоТоварам.Колонки.Добавить("МеткаРаспределения", Новый ОписаниеТипов("Булево"));
	
	ДопСтроки = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из ТаблицаПоТоварам.Колонки Цикл
		ДопСтроки.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаПоТоварам Цикл
		// В таблице распределения по складам могут быть записи с любыми комбинациями 
		// ДокументОприходования, Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры
		// Отберем нужные
		СтруктураПоиска = Новый Структура ("ДокументОприходования,
											|Номенклатура, 
											|СерияНоменклатуры, 
											|ХарактеристикаНоменклатуры, 
											|СтатусПартии,
											|СчетУчетаБУ",
											Строка.ДокументОприходования,
											Строка.Номенклатура,
											Строка.СерияНоменклатуры,
											Строка.ХарактеристикаНоменклатуры,
											СтатусПартии,
											Строка.СчетУчетаБУ);
											
											
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
			И СтруктураШапкиДокумента.ЕстьНДС Тогда
			
			СтруктураПоиска.Вставить("НалоговоеНазначение",  		Строка.НалоговоеНазначение);
			
		КонецЕсли;
											
		МассивСтрокРаспределения = ТаблицаРаспределенияПоСкладам.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрокРаспределения.Количество() = 0 тогда
			ТекстСообщения = "Не найден в документе (регл.учет)"+ Строка.ДокументОприходования
			+ " товар " + Строка.Номенклатура
			+ ?(Строка.Номенклатура.ВестиУчетПоХарактеристикам, ", х-ка: " + Строка.ХарактеристикаНоменклатуры, "")
			+ ?(Строка.Номенклатура.ВестиУчетПоСериям, ", серия: " + Строка.СерияНоменклатуры, "")
			+ ?(СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ЕстьНДС, ", налоговое назначение: " + Строка.НалоговоеНазначение , "");
				
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		КонецЕсли;
		
		ИтогоКоличество = 0;
		Для Каждого Элемент Из МассивСтрокРаспределения Цикл
			ИтогоКоличество = ИтогоКоличество + Элемент.Количество * Элемент.Коэффициент;
		КонецЦикла;
		
		РаспределяемаяПошлина			= Строка.Пошлина;
		РаспределяемаяАкциз 			= Строка.Акциз;
		РаспределяемаяСбор 				= Строка.ТаможенныйСбор;
		
		РаспределяемаяНДС				= Строка.ПроводкиСуммаНДССебестоимость;
		
		РаспределяемаяСуммаБезНДС 		= Строка.ПроводкиСуммаБезНДС;
        РаспределяемаяНДСКредит  		= Строка.ПроводкиСуммаНДСКредит;
		
		
		ПогрешностиОкругления = Новый Соответствие;
		
		Для Каждого Элемент Из МассивСтрокРаспределения Цикл
			
			Если ИтогоКоличество<=0 Тогда         
				Прервать;
			КонецЕсли;
			
			Если Элемент.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДопСтрока = ДопСтроки.Добавить();
			ЗаполнитьЗначенияСвойств(ДопСтрока,Строка);
			
			ДопСтрока.Склад = Элемент.Склад;
			
			Если Элемент.Количество<ИтогоКоличество Тогда
				КоэффРаспред = Элемент.Количество * Элемент.Коэффициент/ИтогоКоличество;
			Иначе
				КоэффРаспред = 1;
			КонецЕсли;
			
			ДопСтрока.Пошлина						= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяПошлина		* КоэффРаспред, 2, , ПогрешностиОкругления, "Пошлина");
			ДопСтрока.Акциз							= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяАкциз 		* КоэффРаспред, 2, , ПогрешностиОкругления, "Акциз");
			ДопСтрока.ТаможенныйСбор				= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяСбор 		* КоэффРаспред, 2, , ПогрешностиОкругления, "Сбор");
			
			ДопСтрока.ПроводкиСуммаНДССебестоимость	= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяНДС 		* КоэффРаспред, 2, , ПогрешностиОкругления, "НДС");
			
			ДопСтрока.ПроводкиСуммаБезНДС			= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяСуммаБезНДС	* КоэффРаспред, 2, , ПогрешностиОкругления, "СуммаБезНДС");
			ДопСтрока.ПроводкиСуммаНДСКредит		= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(РаспределяемаяНДСКредит 	* КоэффРаспред, 2, , ПогрешностиОкругления, "НДСКредит");
			
		КонецЦикла;
		// Исходная строка будет помечена
		Строка.МеткаРаспределения = Истина;
		
	КонецЦикла;
	
	// Теперь доп строки добавим в таблицу по товарам
	Для Каждого ДопСтрока Из ДопСтроки Цикл
		НоваяСтрока = ТаблицаПоТоварам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ДопСтрока);
	КонецЦикла;
			
	// После обработки удалим распределенные строки 
	Инд=0;
	Пока Инд<ТаблицаПоТоварам.Количество() Цикл
		Если ТаблицаПоТоварам[Инд].МеткаРаспределения = Истина Тогда
			ТаблицаПоТоварам.Удалить(Инд);
		Иначе
			Инд = Инд+1;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры//РаспределитьПоСкладам
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	ПоступлениеТоваров    = (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	ПоступлениеТоваровНТТ = (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));

	Если ПоступлениеТоваров
	 ИЛИ ПоступлениеТоваровНТТ Тогда

		Если ПоступлениеТоваровНТТ
		   И Не Основание.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслугВНТТ.ОтПоставщика Тогда
			Возврат;
		КонецЕсли;

		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		ПоставщикТоваров   		 = Контрагент;
		ДоговорПоставщикаТоваров = ДоговорКонтрагента;
		
		// Контрагент у нас другой
		Контрагент         = Неопределено;
		ДоговорКонтрагента = Неопределено;
		Сделка             = Неопределено;
		
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		
        СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсДокумента           = СтруктураКурсаДокумента.Курс;
		КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

		// Заполним Табличную часть   
		Раздел = ДобавитьРаздел();
		ЗаполнитьПоПоступлению(Основание, 1);

		ВсегоСтоимость = 0;
		ВсегоПошлина   = 0;
		ВсегоАкциз     = 0;
		ВсегоНДС       = 0;
	
		ПосчитатьИтогиПоРазделу(1, ВсегоСтоимость, ВсегоПошлина, ВсегоАкциз, ВсегоНДС);
		

		Раздел.ТаможеннаяСтоимость = ВсегоСтоимость;
		Раздел.СуммаАкциза = Раздел.СтавкаАкциза * ВсегоСтоимость/100;
		Раздел.СуммаПошлины = Раздел.СтавкаПошлины * ВсегоСтоимость/100;
		Раздел.СуммаНДС = РассчитатьСуммуНДСГТД(ВсегоСтоимость, Раздел.СуммаПошлины, Раздел.СуммаАкциза, Раздел.СтавкаНДС);
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",     "ВалютаВзаиморасчетов"          , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",     "ВедениеВзаиморасчетов"         , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",     "ВидДоговора"                   , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",     "Организация"                   , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", 	 "НеОтноситьНаЗатратыПоНУ", "НеОтноситьНаЗатратыПоНУ");
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     ,     "ВестиПартионныйУчетПоСкладам"  , "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , 	"СпособОценкиМПЗ"               , "СпособОценкиМПЗ");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"     , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета" , "КурсВалютыУправленческогоУчета");
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам",                     "ВедениеУчетаПоПроектам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ);

	// Получим необходимые данные для проверки и проведения по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("НомерРаздела"                , "НомерРаздела");
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ФактурнаяСтоимость"          , "ФактурнаяСтоимость");
	СтруктураПолей.Вставить("Акциз"                       , "СуммаАкциза");
	СтруктураПолей.Вставить("НДС"                         , "СуммаНДС");
	СтруктураПолей.Вставить("Пошлина"                     , "СуммаПошлины");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");

	СтруктураПолей.Вставить("Услуга"                      , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                    , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Заказ"                       , "ЗаказПокупателя");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		  , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("ДокументОприходования"       , "ДокументПартии");
	СтруктураПолей.Вставить("ДокументПартииВидОперации"   , "ДокументПартии.ВидОперации");
	СтруктураПолей.Вставить("ДокументПартииВидПоступления", "ДокументПартии.ВидПоступления");
	СтруктураПолей.Вставить("ДокументПартииКонтрагент"    , "ДокументПартии.Контрагент");
	СтруктураПолей.Вставить("ДокументПартииДоговор"  	  , "ДокументПартии.ДоговорКонтрагента");
	СтруктураПолей.Вставить("ДокументПартииВидДоговора"	  , "ДокументПартии.ДоговорКонтрагента.ВидДоговора");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
							"ЗаказПокупателя.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");

	СтруктураПолей.Вставить("СчетУчетаБУ"             	, "СчетУчетаБУ");
	СтруктураПолей.Вставить("Забалансовый"            	, "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("НалоговоеНазначение"     	, "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит"	, "СтатьяДекларацииНДСНалоговыйКредит");
    СтруктураПолей.Вставить("СчетУчетаНДС"             	, "СчетУчетаНДС");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"       , "НоменклатурнаяПозиция");
							
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей = Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей = Неопределено;	
	КонецЕсли;
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей,СтруктураСложныхПолей);

	// Получим необходимые данные для проверки и проведения по табличной части "Оборудование".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("НомерРаздела"                , "НомерРаздела");
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ФактурнаяСтоимость"          , "ФактурнаяСтоимость");
	СтруктураПолей.Вставить("Акциз"                       , "СуммаАкциза");
	СтруктураПолей.Вставить("НДС"                         , "СуммаНДС");
	СтруктураПолей.Вставить("Пошлина"                     , "СуммаПошлины");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");

	СтруктураПолей.Вставить("Услуга"                      , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		  , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Набор"                       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                    , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ДокументОприходования"       , "ДокументПартии");
	СтруктураПолей.Вставить("ДокументПартииВидОперации" , "ДокументПартии.ВидОперации");
	СтруктураПолей.Вставить("ДокументПартииВидПоступления", "ДокументПартии.ВидПоступления");
	СтруктураПолей.Вставить("ДокументПартииКонтрагент"    , "ДокументПартии.Контрагент");
	СтруктураПолей.Вставить("ДокументПартииДоговор"  	  , "ДокументПартии.ДоговорКонтрагента");
	СтруктураПолей.Вставить("ДокументПартииВидДоговора"	  , "ДокументПартии.ДоговорКонтрагента.ВидДоговора");

	СтруктураПолей.Вставить("СчетУчетаБУ"             	, "СчетУчетаБУ");
	СтруктураПолей.Вставить("Забалансовый"            	, "СчетУчетаБУ.Забалансовый");
	
	СтруктураПолей.Вставить("НалоговоеНазначение"     	, "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит"	, "СтатьяДекларацииНДСНалоговыйКредит");
    СтруктураПолей.Вставить("СчетУчетаНДС"             	, "СчетУчетаНДС");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"       , "НоменклатурнаяПозиция");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей = Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей = Неопределено;	
	КонецЕсли;
	
	РезультатЗапросаПоОборудованию = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураПолей, СтруктураСложныхПолей);
	
	ОбработатьТабличнуюЧастьРазделы(СтруктураШапкиДокумента);

	ТаблицаПоТоварам = РезультатЗапросаПоТоварам.Выгрузить();
	ТаблицаПоОборудованию = РезультатЗапросаПоОборудованию.Выгрузить();

	РаспределитьСуммыИзШапки(ТаблицаПоТоварам, ТаблицаПоОборудованию, СтруктураШапкиДокумента);
	
	ПогрешностиОкругления = Новый Соответствие;
	ПодготовитьТаблицуТоваров(ТаблицаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, ПогрешностиОкругления);
    	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиРазделы(Разделы, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок);

	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоОборудованию, Отказ,Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Оборудование);
	
	// очищаем лишние табличные части
	Если (ДоговорПоставщикаТоваров.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
		Оборудование.Очистить();
	КонецЕсли;
		
	Если НЕ ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация).НДС Тогда
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Товары Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
		Для каждого СтрокаТЧ  Из Оборудование Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла;
		
	КонецЕсли; 
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Товары");
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Оборудование");
	
КонецПроцедуры // ПередЗаписью

Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ)

 	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал", СтруктураПолейУчетнойПолитикиНУ);

	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Бух");

	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Нал");

	ПартионныйУчетБУ = УправлениеЗапасами.ВедетсяПартионныйУчет(УчетнаяПолитикаБУ);

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

мСтруктураПараметровДляПолученияДоговора = Новый Структура();
мСписокДопустимыхВидовДоговоров = Новый СписокЗначений();
мСписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", мСписокДопустимыхВидовДоговоров);
мСписокДопустимыхВидовВзаиморасчетов = Новый СписокЗначений();
мСписокДопустимыхВидовВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовВзаиморасчетов", мСписокДопустимыхВидовВзаиморасчетов);
мСтруктураПараметровДляПолученияДоговора.Вставить("ВалютаВзаиморасчетовДоговора", мВалютаРегламентированногоУчета);
мСтруктураПараметровДляПолученияДоговора.Вставить("ВидСравненияВалютыВзаиморасчетов", "<>");

мСтруктураПараметровДляПолученияДоговораПоставщика = Новый Структура();
мСписокДопустимыхВидовДоговоров = Новый СписокЗначений();
мСписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
мСписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
мСтруктураПараметровДляПолученияДоговораПоставщика.Вставить("СписокДопустимыхВидовДоговоров", мСписокДопустимыхВидовДоговоров);
