
Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 	
			
	ТипЦены                   = Константы.ТипЦенКидстаф                   .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс             .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиКидстафф          .Получить();
	
	ГруппыНоменклатур = Новый Массив;
	//ГруппыНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("000000389"));
	//ГруппыНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("000000544"));
	//ГруппыНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("000000631"));      
	//ГруппыНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("000001256"));
	//ГруппыНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("000000717"));
	
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,);
	Остатки = ОстаткиКВыгрузке.Остатки;
	Комплектующие = ОстаткиКВыгрузке.Комплектующие;
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");                                
	
	Если СтрДлина(Врем)= 7 Тогда
		Врем  = Лев(Врем,4);
	Иначе
		Врем  = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 
	|<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+"""> 
	|<shop>
	|<name>Cvetkov</name>
	|<company>Cvetkov TM</company>
	|<url>https://www.cvetkovtm.com/</url>
	|<currencies>
	|<currency id=""UAH"" rate=""1""/>
	|</currencies>");
	
	ТД.ЗаписатьСтроку("<offers>");
	
	Контрагент =  Справочники.Контрагенты.НайтиПоКоду("000004388");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000003207");
	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияКидстафф", ПроверятьРазбитиеРостовок, ВариантВыгрузки,,,,Контрагент,Договор);	

	
	ТаблицаНоменклатуры = ТаблицаХарактеристик.Скопировать();
	ТаблицаНоменклатуры.Свернуть("ИдГуппы");
	
	Для Каждого Стр из ТаблицаНоменклатуры Цикл 
		Строка = ТаблицаХарактеристик.Найти(Стр.ИдГуппы,"ИдГуппы"); 
		ЗаписатьНоменклатуру(Строка, ТД, ТаблицаХарактеристик.НайтиСтроки(Новый Структура("ИдГуппы", Стр.ИдГуппы)));
	КонецЦикла;
		
	ТД.ЗаписатьСтроку("</offers>
	|</shop>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, Тд, ТаблицаХарактреистик)
	
	// Из Строки 
	Цена                 = Стр.Цена;	
	СпрГруппыЦветов	     = Стр.ГруппаЦвета;
	Номенклатура         = Стр.Номенклатура;	
	Характеристика       = Стр.Характеристика;
	Ид                   = Стр.ИД;
	ИдГуппы              = Стр.ИдГуппы;
	Доступна             = Стр.Доступна;
	ШтрихКод             = Стр.ШтрихКод;
	Скидка               = Стр.Скидка;
	Ростовка             = Стр.Ростовка;		
	ОстатокРозница       = Стр.Остаток;	
	Предзаказ            = Стр.Предзаказ;
	
	// Доп параметры
	ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
	НоменклатураОбъект   = Номенклатура.ПолучитьОбъект();	
	                  
	ТипИзделия = НоменклатураОбъект.ПолучитьТипИзделия(Истина);
	
	РусскийЯзык     = Истина;
	Переводить      = Ложь;
	ЦветРус         = ХарактеристикаОбъект.ЦветХарактеристики(РусскийЯзык, Переводить);
	Название        = НоменклатураОбъект.Наименование(Истина);
	Наименование = ТипИзделия + " Cvetkov " + Название + " " + ЦветРус; 
		
	////////////////////////////////////////////////////////////////////////////////////////////
	ТД.ЗаписатьСтроку("<offer id="""+ Ид +""" state=""active"""+" available=""true"">");
			
	// Категория
	КодК = ОбщегоНазначения.УбратьНоликиСлева(Номенклатура.КатегорияКидСтафф.Код);//кидстафф	
	ТД.ЗаписатьСтроку("<categoryId>"+СокрЛп(КодК)+"</categoryId>");
	// раздел магазина                  
	ТД.ЗаписатьСтроку("<shopsection>" + СокрЛП(Номенклатура.ЦеноваяГруппа.IDKidsStaff) + "</shopsection>");	
	
	ТД.ЗаписатьСтроку("<model>"+Наименование+"</model>");
	
	// Скидка Цена
	Если Скидка>0 Тогда
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</price>");
	Иначе
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Строка(Цена))+"</price>");
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<vendor>Cvetkov</vendor>");
	
	ТД.ЗаписатьСтроку("<condition>new</condition>");
	
	ПолС = ОбщегоНазначения.СоответвиеСвойстваЗначение(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000055"),ОбщегоНазначения.СвойстваОбъекта(Стр.Номенклатура,"000000055"),Ложь,"Кидстафф");
	
	Попытка
		Пол = ПолС.Зн;
	Исключение
		Пол = "";
	КонецПопытки;
	
	ТД.ЗаписатьСтроку("<gender>"+СокрЛП(Пол)+"</gender>");
	ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
	ТД.ЗаписатьСтроку("<add-conditions>");
	ТД.ЗаписатьСтроку("<add-condition>with-label</add-condition>");
	ТД.ЗаписатьСтроку("</add-conditions>");
	
	ТД.ЗаписатьСтроку("<delivery-method>nova-poshta</delivery-method>");
	ТД.ЗаписатьСтроку("<delivery-method>ukrpost</delivery-method>");
	ТД.ЗаписатьСтроку("<delivery>country</delivery>");
	ТД.ЗаписатьСтроку("<payment>specified</payment>");
	
	ТД.ЗаписатьСтроку("<keywords>"+ОбщегоНазначения.КлючевыйСловаГруппы(Номенклатура.НоменклатурнаяГруппа)+"</keywords>");
	
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Ложь);
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>","Опис відсутній");
	ТД.ЗаписатьСтроку("<description>"+Описание+"</description>");
	
	// фото
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов, Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			Если Фот.НеВыгружать Тогда // Или Фот.НеВыгружатьРозница
				Продолжить;
			КонецЕсли;
			
			ИмяФото = Фот.Наименование;
			
			ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Кидстафф");
	
	ТабСвойств = ТабПараметры.скопировать();
	ТабСвойств.Свернуть("Свойство");
	
	ТД.ЗаписатьСтроку("<characteristics>");
	
	Для Каждого Стр1 Из ТаблицаХарактреистик Цикл
		ХарОбъект = Стр1.Характеристика.ПолучитьОбъект();
	    Размер = ХарОбъект.ПолучитьРазмер();
		
		Если Стр1.Остаток = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ТД.ЗаписатьСтроку("<characteristic name=""Рост"">"+Размер+" см</characteristic>");
		РазмерС = ОбщегоНазначения.СоответвиеСвойстваЗначение(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000099"),ОбщегоНазначения.СвойствоПоНаименованию(Размер,"000000099"),Ложь,"Кидстафф");
		Попытка
			Раз = РазмерС.Зн;
			НРаз = РазмерС.Имя;
		Исключение
			Раз = "";
			НРаз = "";
		КонецПопытки;
		
		ТД.ЗаписатьСтроку("<characteristic name="""+НРаз+""">"+Раз+"</characteristic>");
	КонецЦикла;
	
	Для Каждого Стр1 Из ТабСвойств Цикл
		
		ЗнСв = ОбщегоНазначения.СвойстваОбъекта(Стр.Характеристика,Стр1.Свойство.Код);
		Если НЕ ЗначениеЗаполнено(ЗнСв) Тогда
			ЗнСв = ОбщегоНазначения.СвойстваОбъекта(Стр.Номенклатура,Стр1.Свойство.Код);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗнСв) Тогда Продолжить; КонецЕсли;
		
		НайденоСвойство = ТабПараметры.НайтиСтроки(Новый Структура("Свойство,Значение",Стр1.Свойство,ЗнСв));
		
		Если НайденоСвойство.Количество()=0 Тогда
			НайденоСвойство = ТабПараметры.Найти(Стр1.Свойство,"Свойство");
			Если НайденоСвойство = Неопределено Тогда
				Продолжить;
			Иначе
				Если НайденоСвойство.Отметка1 Тогда
					Им = СокрЛП(НайденоСвойство.Наименование1);
					Зн = СокрЛП(ЗнСв);
					Если ЗначениеЗаполнено(Им) И ЗначениеЗаполнено(Зн) Тогда
						Если СтрЧислоВхождений("РОСТ РАЗМЕР ВОЗРАСТ ПОЛ", ВРег(Им))>0 Тогда
							Продолжить;
						Иначе
							ТД.ЗаписатьСтроку("<characteristic name="""+Им+""">"+Зн+"</characteristic>");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если НайденоСвойство.Отметка2 Тогда
					Им = СокрЛП(НайденоСвойство.Наименование2);
					Зн = СокрЛП(НайденоСвойство.Соответствие2);
					Если ЗначениеЗаполнено(Им) И ЗначениеЗаполнено(Зн) Тогда
						Если СтрЧислоВхождений("РОСТ РАЗМЕР ВОЗРАСТ ПОЛ", ВРег(Им))>0 ИЛИ СтрЧислоВхождений("ПОЛ", ВРег(Им))>0 Тогда
							Продолжить;
						Иначе
							ТД.ЗаписатьСтроку("<characteristic name="""+Им+""">"+Зн+"</characteristic>");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			ДЛя Каждого Св Из НайденоСвойство Цикл
				Если Св.Отметка1 Тогда
					Им = СокрЛП(Св.Наименование1);
					Зн = СокрЛП(ЗнСв);
					Если ЗначениеЗаполнено(Им) И ЗначениеЗаполнено(Зн) Тогда
						Если СтрЧислоВхождений("РОСТ РАЗМЕР ВОЗРАСТ ПОЛ", ВРег(Им))>0 ИЛИ СтрЧислоВхождений("ПОЛ", ВРег(Им))>0 Тогда
							Продолжить;
						Иначе
							ТД.ЗаписатьСтроку("<characteristic name="""+Им+""">"+Зн+"</characteristic>");
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Св.Отметка2 Тогда
					Им = СокрЛП(Св.Наименование2);
					Зн = СокрЛП(Св.Соответствие2);
					Если ЗначениеЗаполнено(Им) И ЗначениеЗаполнено(Зн) Тогда
						Если СтрЧислоВхождений("РОСТ РАЗМЕР ВОЗРАСТ ПОЛ", ВРег(Им))>0 ИЛИ СтрЧислоВхождений("ПОЛ", ВРег(Им))>0 Тогда
							Продолжить;
						Иначе
							ТД.ЗаписатьСтроку("<characteristic name="""+Им+""">"+Зн+"</characteristic>");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</characteristics>");
	
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры

Функция НормОписание(Описание)
	
	Опис = Описание;
	Опис = СтрЗаменить(Опис,"""","&quot");
	Опис = СтрЗаменить(Опис,"&","&amp");
	Опис = СтрЗаменить(Опис,"'","&apos");
	Опис = СтрЗаменить(Опис,Символы.ПС," ");
	
	Возврат Опис;
	
КонецФункции

Процедура ДобавитьТаблицуВОписание(Описание, Стр, СпрГруппыЦветов)
	
	ТабЗамеров = ОбщегоНазначения.ЗамерыПолучитьТЗВсехРазмеров(Стр.Номенклатура,Стр.Характеристика);
	
	Если ТабЗамеров.Количество()>0 Тогда
		Описание = Описание+"
		|<p>Замеры изделия :&nbsp;</p>
		|<table style=""width: 600px; height: 100px;"" class=""table-price-size"">";
		
		ТабРазмеров = ТабЗамеров.Скопировать();
		ТабРазмеров.Свернуть("Размер");
		ТабРазмеров.Колонки.Добавить("РазмерС");
		
		Для Каждого Стр1 Из ТабРазмеров Цикл
			Попытка
				Стр1.РазмерС = Число(Стр1.Размер);
			Исключение КонецПопытки;
		КонецЦикла;
		ТабРазмеров.Сортировать("РазмерС");
		
		ТабПолей = ТабЗамеров.Скопировать();
		ТабПолей.Свернуть("Поле");
		ТабПолей.Сортировать("Поле");
		
		Описание = Описание+"
		|<tr>
		|	<td>
		|	<div class=""size-color2""></div>
		|	</td>";
		Для Каждого Стр1 Из ТабРазмеров Цикл
			Описание = Описание+"
			|	<td>"+СокрЛП(Стр1.Размер)+"</td>";
		КонецЦикла;
		Описание = Описание+"
		|</tr>";
		
		Для Каждого Стр1 Из ТабПолей Цикл
			Описание = Описание+"
			|<tr>
			|	<td>
			|	<div class=""size-color2"">"+СокрЛП(Стр1.Поле)+"</div>
			|	</td>";
			
			Для Каждого Стр2 Из ТабРазмеров Цикл
				
				ОтборПоЗамеру = ТабЗамеров.НайтиСтроки(Новый Структура("Поле,Размер",Стр1.Поле,Стр2.Размер));
				Попытка
					Замер = ОтборПоЗамеру[0].Замер;
				Исключение
					Замер = "";
				КонецПопытки;
				
				Описание = Описание+"
				
				|	<td>"+?(СокрЛП(Замер)="","-",СокрЛП(Замер))+"</td>";
				
			КонецЦикла;
			Описание = Описание+"
			|</tr>";
			
		КонецЦикла;
		Описание = Описание+"
		|</tbody>
		|</table>";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов, Истина);
		Для Каждого Фот Из ТабФото Цикл
			ИмяФото = Фот.Наименование;   
			Описание = Описание+"
			|<img alt="""" src=""http://cvetkovtm.com/assets/shop/sync/imgJpg/"+ИмяФото+""" style=""width: 307px; height: 461px;"" />";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры