// #Область СлужебныеПроцедурыИФункции

// Выводит сообщение пользователю методом "Сообщить"
// 
Функция КоличествоХранимыхЦифрТелефона() Экспорт
	                                
	Возврат ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КоличествоХранимыхЦифрТелефона();
	
КонецФункции

// Выводит сообщение пользователю методом "Сообщить"
// 
Функция ПолучитьКлючЗащиты() Экспорт
	                                
	Возврат ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КлючЗащиты();
	
КонецФункции

Функция ПолучитьПредставлениеТранкаПоИмени(Знач ИмяТранка) Экспорт

	Возврат ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПолучитьПредставлениеТранкаПоИмени(ИмяТранка);	

КонецФункции

Функция GetJScriptComponent() Экспорт
	ScrptCtrl = Неопределено;
	Попытка
		ScrptCtrl = новый COMОбъект("MSScriptControl.ScriptControl");
		ScrptCtrl.Language="JScript";
	Исключение
	КонецПопытки;
	
	Возврат ScrptCtrl;
КонецФункции

Функция НазваниеОчередиПоId(IdQueue, NameIdQueue) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_ОчередиЗвонков.Наименование
		|ИЗ
		|	Справочник.МИКО_ОчередиЗвонков КАК МИКО_ОчередиЗвонков
		|ГДЕ
		|	МИКО_ОчередиЗвонков.IdQueue = &IdQueue";
	
	Запрос.УстановитьПараметр("IdQueue", IdQueue);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И NameIdQueue = "" Тогда
		Возврат ВыборкаДетальныеЗаписи.Наименование;
	Иначе
		Возврат NameIdQueue;
	КонецЕсли;	

КонецФункции // ()

// Возвращает признак изменения структуры подчиненности справочников
// Контактные лица и Контрагенты для конфигурации УНФ.
//
Функция ИзмененаСтруктураПодчиненностиКонтактовУНФ() Экспорт

	ИзмененаПодчиненность = Ложь;
	
	Если НЕ Найти(Метаданные.Имя, "УправлениеНебольшойФирмой")>0 Тогда
		Возврат ИзмененаПодчиненность;
	КонецЕсли; 

	ИзмененаПодчиненность = НЕ ЭтоСтандартныйРеквизит(Метаданные.Справочники["КонтактныеЛица"].СтандартныеРеквизиты, "Владелец")
							И НЕ Метаданные.РегистрыСведений.Найти("СвязиКонтрагентКонтакт") = Неопределено;
							
	Возврат ИзмененаПодчиненность;
	
КонецФункции // ()

// Возвращает признак того, что реквизит входит в подмножество стандартных реквизитов.
//
Функция ЭтоСтандартныйРеквизит(СтандартныеРеквизиты, ИмяРеквизита)
	
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		
		Если Реквизит.Имя = ИмяРеквизита Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает запрос по контаткной информации с учетом измененной подчиненности
// справочников Контактные лица и Контрагенты для конфигурации УНФ.
// 
Функция ПолучитьЗапросКИДляУНФ(ТекстПорядок = "1", ИмяРегистра) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
		|	МИКО_опИндексНомераТелефонов.СсылкаНаКлиента КАК СсылкаНаКлиента,
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой КАК НомерТелефонаСтрокой,"+
		ТекстПорядок + " КАК Порядок
		|ПОМЕСТИТЬ КонтактыВТ
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК МИКО_опИндексНомераТелефонов
		|ГДЕ
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс = &НомерТелефонаЧислом
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СсылкаНаКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиКонтрагентКонтактСрезПоследних.Контрагент КАК Контрагент,
		|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
		|ПОМЕСТИТЬ КонтрагентыВТ
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
		|			,
		|			Контакт В
		|				(ВЫБРАТЬ
		|					КонтактыВТ.СсылкаНаКлиента КАК СсылкаНаКлиента
		|				ИЗ
		|					КонтактыВТ КАК КонтактыВТ)) КАК СвязиКонтрагентКонтактСрезПоследних
		|ГДЕ
		|	СвязиКонтрагентКонтактСрезПоследних.СвязьНедействительна = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактыВТ.СсылкаНаКлиента КАК Абонент,
		|	КонтактыВТ.НомерТелефонаСтрокой КАК НомерТелефона,
		|	КонтактыВТ.Порядок КАК Порядок,
		|	ЕСТЬNULL(КонтрагентыВТ.Контрагент, КонтактыВТ.СсылкаНаКлиента) КАК Партнер
		|ИЗ
		|	КонтактыВТ КАК КонтактыВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыВТ КАК КонтрагентыВТ
		|		ПО КонтактыВТ.СсылкаНаКлиента = КонтрагентыВТ.Контакт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
	Возврат ТекстЗапроса;

КонецФункции // ПолучитьЗапросКИДляУНФ()

// #КонецОбласти
