// Возвращает фиксированное соответствие, содержащее некоторые параметры клиента:
//  ПараметрЗапуска                    - Строка,
//  СтрокаСоединенияИнформационнойБазы - Строка - строка соединения, полученная на клиенте.
//
// Возвращает пустое фиксированное соответствие, если ТекущийРежимЗапуска() = Неопределено.
//
Функция ПараметрыКлиентаНаСервере() Экспорт
	
	Если ТекущийРежимЗапуска() = Неопределено Тогда
		Возврат Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКлиента = ПараметрыСеанса.ПараметрыКлиентаНаСервере;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПараметрыКлиента.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнены параметры клиента на сервере.'");
	КонецЕсли;
	
	Возврат ПараметрыКлиента;
	
КонецФункции

// Возвращает серверный общий модуль по имени.
Функция СерверныйОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	 //Санлайн закомментировал
	//Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	//КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Заполняет структуру параметров, необходимых для работы клиентского кода
// данной подсистемы при запуске конфигурации, т.е. в обработчиках событий
// - ПередНачаломРаботыСистемы,
// - ПриНачалеРаботыСистемы
//
// Важно: при запуске недопустимо использовать команды сброса кэша
// повторно используемых модулей, иначе запуск может привести
// к непредсказуемым ошибкам и лишним серверным вызовам
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
// Возвращаемое значение:
//   Булево   - Ложь, если дальнейшее заполнение параметров необходимо прервать.
//
Функция ДобавитьПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	// Обязательные параметры для продолжения работы.
	Параметры.Вставить("ИменаПодсистем", СтандартныеПодсистемыПовтИсп.ИменаПодсистем());
	
	// Проверка продолжения работы.
	Параметры.Вставить("ИнформационнаяБазаЗаблокированаДляОбновления",
	//Санлайн
		//ОбновлениеИнформационнойБазы.ИнформационнаяБазаЗаблокированаДляОбновления(, Истина));
		ОбновлениеИнформационнойБазыБитрикс.ИнформационнаяБазаЗаблокированаДляОбновления(, Истина));
		//
	
	Если ЗначениеЗаполнено(Параметры.ИнформационнаяБазаЗаблокированаДляОбновления) Тогда
		// Работа будет завершена.
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка запуска с пустым списком пользователей.
	Параметры.Вставить("ОшибкаЗапускаСПустымСпискомПользователей",
		ПользователиСлужебный.ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ(Истина));
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("ОбменДаннымиПовтИсп");
		Если Модуль.ЭтоАвтономноеРабочееМесто() Тогда
			// Для автономного рабочего места проверка выполняется после загрузки данных.
			Параметры.ОшибкаЗапускаСПустымСпискомПользователей = "";
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ОшибкаЗапускаСПустымСпискомПользователей) Тогда
		// Будет предложено создать администратора или завершить работу.
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка необходимости предварительного обновления параметров работы программы.
	Параметры.Вставить("НеобходимоОбновлениеПараметровРаботыПрограммы",
		НеобходимоОбновлениеПараметровРаботыПрограммы());
	
	Если Параметры.НеобходимоОбновлениеПараметровРаботыПрограммы
	   И Параметры.ПервыйЗапросПараметров Тогда
		// Будет выполнено предварительное обновление.
		//Санлайн
		//Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
		Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначенияКлиентСерверДополнительно.ИнформационнаяБазаФайловая());
		 //
		//Санлайн
		//Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ()
		Если ОбщегоНазначенияКлиентСерверДополнительно.ЭтоПодчиненныйУзелРИБ()
			//
		   И ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
			
			Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("ОбменДаннымиСервер");
			Если Модуль.НеобходимоПодтвердитьНастройкиЗагрузкиСообщенияВПодчиненномУзлеРИБ() Тогда
				Параметры.Вставить("ПодтвердитьНастройкиЗагрузкиСообщенияВПодчиненномУзлеРИБ");
				Параметры.Вставить("ГлавныйУзел", ПланыОбмена.ГлавныйУзел());
			КонецЕсли;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	// Обязательные параметры для всех режимов работы.
	Параметры.Вставить("ОбработчикиКлиентскихСобытий", СтандартныеПодсистемыПовтИсп.ПараметрыПрограммныхСобытий(
		).ОбработчикиСобытий.НаКлиенте);
	
	Параметры.Вставить("ДоступноИспользованиеРазделенныхДанных", 
		ОбщегоНазначенияПовтИспДополнительно.ДоступноИспользованиеРазделенныхДанных());
	
	Параметры.Вставить("ПервыйЗапускИнформационнойБазы",
	//Санлайн
		//ОбновлениеИнформационнойБазы.ПервыйЗапускИнформационнойБазы());
		ОбновлениеИнформационнойБазыБитрикс.ПервыйЗапускИнформационнойБазы());
		//
	
	Параметры.Вставить("РазделениеВключено", ОбщегоНазначенияПовтИспДополнительно.РазделениеВключено());
	Параметры.Вставить("ПодробнаяИнформация", Метаданные.ПодробнаяИнформация);
	
	Параметры.Вставить("НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы",
	     //Санлайн
		//ОбновлениеИнформационнойБазы.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы());
		ОбновлениеИнформационнойБазыБитрикс.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы());
		//
	
	// При входе неразделенным пользователем в неразделенный сеанс ошибки авторизации нет.
	Параметры.Вставить("ОшибкаАвторизации", "");
	
	Если Параметры.РазделениеВключено И Не Параметры.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Параметры для работы в локальном режиме или
	// в сеансе с установленными значениями разделителей в модели сервиса.
	Параметры.Вставить("НеобходимоОбновлениеИнформационнойБазы",
	//Санлайн
		//ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы());
		ОбновлениеИнформационнойБазыБитрикс.НеобходимоОбновлениеИнформационнойБазы());
		//
	
	Параметры.Вставить("ЭтоРазделеннаяКонфигурация", ОбщегоНазначенияПовтИспДополнительно.ЭтоРазделеннаяКонфигурация());
	Параметры.Вставить("ЕстьДоступДляОбновленияВерсииПлатформы", ПравоДоступа("Администрирование", Метаданные));
	
	//Санлайн
	//ОбщиеПараметры = ОбщегоНазначения.ОбщиеПараметрыБазовойФункциональности();
	ОбщиеПараметры = ОбщегоНазначенияКлиентСерверДополнительно.ОбщиеПараметрыБазовойФункциональности();
	//
	Параметры.Вставить("МинимальноНеобходимаяВерсияПлатформы", ОбщиеПараметры.МинимальноНеобходимаяВерсияПлатформы);
	Параметры.Вставить("РаботаВПрограммеЗапрещена",            ОбщиеПараметры.РаботаВПрограммеЗапрещена);
	
	Параметры.Вставить("ОшибкаАвторизации", ПользователиСлужебный.АвторизоватьТекущегоПользователя(Истина));
	Если Параметры.ОшибкаАвторизации <> "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИнформационнаяБазаЗаблокированаДляОбновления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДобавитьОбщиеПараметрыРаботыКлиента(Параметры);
	
	Возврат Истина;
	
КонецФункции

// Только для внутреннего использования.
Функция НеобходимоОбновлениеПараметровРаботыПрограммы(БезЗагрузки = Ложь) Экспорт
	
	Если ОбщегоНазначенияПовтИспДополнительно.РазделениеВключено() Тогда
		// Обновление в модели сервиса.
		Если НЕ ОбщегоНазначенияПовтИспДополнительно.ДоступноИспользованиеРазделенныхДанных()
			//Санлайн
			//И ОбновлениеИнформационнойБазы.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы() Тогда
			И ОбновлениеИнформационнойБазыБитрикс.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы() Тогда
			//
			
			Возврат Истина;
		КонецЕсли;
	Иначе
		// Обновление в локальном режиме.
			//Санлайн
		//Если ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы() Тогда
		Если ОбновлениеИнформационнойБазыБитрикс.НеобходимоОбновлениеИнформационнойБазы() Тогда
			//
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("ОбменДаннымиСервер");
		
		Если Модуль.НастройкаПодчиненногоУзлаРИБ() Тогда
			БезЗагрузки = Истина;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ПользователиСлужебныйПовтИсп.Параметры();
	Исключение
		БезЗагрузки = Истина;
		Возврат Истина;
	КонецПопытки;
		
	Возврат Ложь;
	
КонецФункции

// Заполняет структуру параметров, необходимых для работы клиентского кода
// при запуске конфигурации и в дальнейшем во время работы с ней. 
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ДобавитьОбщиеПараметрыРаботыКлиента(Параметры) 
	
	Если Не Параметры.РазделениеВключено Или Параметры.ДоступноИспользованиеРазделенныхДанных Тогда
		
		Параметры.Вставить("АвторизованныйПользователь", ПользователиДополнительно.АвторизованныйПользователь());
		Параметры.Вставить("ПредставлениеПользователя", Строка(Параметры.АвторизованныйПользователь));
		
		УстановитьПривилегированныйРежим(Истина);
		Параметры.Вставить("ЗаголовокПриложения", СокрЛП(Константы.ЗаголовокСистемы.Получить()));
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	//Санлайн
	//Параметры.Вставить("ЭтоГлавныйУзел", НЕ ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ());
	//Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
	Параметры.Вставить("ЭтоГлавныйУзел", НЕ ОбщегоНазначенияКлиентСерверДополнительно.ЭтоПодчиненныйУзелРИБ());
	Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначенияКлиентСерверДополнительно.ИнформационнаяБазаФайловая());
	//
	Параметры.Вставить("ИнформационнаяБазаФайловаяБезМенеджераФоновыхЗаданий",
	//Санлайн
		//ОбщегоНазначения.ИнформационнаяБазаФайловая()
		ОбщегоНазначенияКлиентСерверДополнительно.ИнформационнаяБазаФайловая()
		//
		И НЕ ОбщегоНазначенияКлиентСерверДополнительно.ЭтоПлатформа83БезРежимаСовместимости());
	Параметры.Вставить("ТребуетсяОбновлениеКонфигурацииУзлаРИБ",
	//Санлайн
		//ОбновлениеИнформационнойБазы.ТребуетсяОбновлениеКонфигурацииУзлаРИБ());
		ОбновлениеИнформационнойБазыБитрикс.ТребуетсяОбновлениеКонфигурацииУзлаРИБ());
		//
	Параметры.Вставить("ТребуетсяОбновлениеКонфигурацииУзлаРИБ",
	//Санлайн
		//ОбщегоНазначения.ТребуетсяОбновлениеКонфигурацииПодчиненногоУзлаРИБ());
		ОбщегоНазначенияКлиентСерверДополнительно.ТребуетсяОбновлениеКонфигурацииПодчиненногоУзлаРИБ());
		//
	
	Параметры.Вставить("ЭтоБазоваяВерсияКонфигурации", ЭтоБазоваяВерсияКонфигурации());
	
КонецПроцедуры

// Возвращает признак, является ли конфигурация базовой.
//
// Возвращаемое значение:
//   Булево   - Истина, если конфигурация - базовая.
//
Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	
	Возврат Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0;
	
КонецФункции

// Возвращает соответствие имен событий массивам их обработчиков.
// 
// Возвращаемое значение:
//  Структура со свойствами:
//    НаКлиенте - Соответствие (см. ниже)
//    НаСервере - Соответствие (см. ниже)
//
//  Соответствие, где
//   Ключ     - Строка - полное имя события,
//   Значение - Массив структур со свойствами:
//               Версия - Строка - версия обработчика (пустая, если не была указана),
//               Модуль - имя модуля в котором размещен обработчик.
//
Функция ОбработчикиСобытий() Экспорт
	
	ОписанияПодсистем = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем();
	
	// Определение всех доступных событий программы.
	КлиентскиеСобытия = Новый Массив;
	СерверныеСобытия  = Новый Массив;
	КлиентскиеСлужебныеСобытия = Новый Массив;
	СерверныеСлужебныеСобытия  = Новый Массив;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		Описание = ОписанияПодсистем.ПоИменам[Подсистема];
		
		Если НЕ Описание.ДобавлятьСобытия
		   И НЕ Описание.ДобавлятьСлужебныеСобытия Тогда
			
			Продолжить;
		КонецЕсли;
		
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль(
			Описание.ОсновнойСерверныйМодуль);
		
		Если Описание.Имя = "СтандартныеПодсистемы" Тогда
			Модуль = СтандартныеПодсистемыСервер;
		КонецЕсли;
		
		Если Описание.ДобавлятьСобытия Тогда
			Модуль.ПриДобавленииСобытий(КлиентскиеСобытия, СерверныеСобытия);
		КонецЕсли;
		
		Если Описание.ДобавлятьСлужебныеСобытия Тогда
			Модуль.ПриДобавленииСлужебныхСобытий(КлиентскиеСлужебныеСобытия, СерверныеСлужебныеСобытия);
		КонецЕсли;
	КонецЦикла;
	
	ПроверкаУникальностиИменСобытий(КлиентскиеСобытия);
	ПроверкаУникальностиИменСобытий(СерверныеСобытия);
	ПроверкаУникальностиИменСобытий(КлиентскиеСлужебныеСобытия);
	ПроверкаУникальностиИменСобытий(СерверныеСлужебныеСобытия);
	
	// Подготовка новых массивов для добавления обработчиков.
	ОбработчикиКлиентскихСобытийПоПодсистемам = Новый Соответствие;
	ОбработчикиСерверныхСобытийПоПодсистемам  = Новый Соответствие;
	ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам = Новый Соответствие;
	ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам  = Новый Соответствие;
	
	ОбязательныеКлиентскиеСобытия = Новый Соответствие;
	ОбязательныеСерверныеСобытия  = Новый Соответствие;
	ОбязательныеКлиентскиеСлужебныеСобытия = Новый Соответствие;
	ОбязательныеСерверныеСлужебныеСобытия  = Новый Соответствие;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		
		ОбработчикиКлиентскихСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(КлиентскиеСобытия, ОбязательныеКлиентскиеСобытия));
		
		ОбработчикиСерверныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(СерверныеСобытия, ОбязательныеСерверныеСобытия));
		
		ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(КлиентскиеСлужебныеСобытия, ОбязательныеКлиентскиеСлужебныеСобытия));
		
		ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(СерверныеСлужебныеСобытия, ОбязательныеСерверныеСлужебныеСобытия));
		
	КонецЦикла;
	
	// Добавление всех обработчиков для требуемых событий программы.
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		Описание = ОписанияПодсистем.ПоИменам[Подсистема];
		
		Если НЕ Описание.ДобавлятьОбработчикиСобытий
		   И НЕ Описание.ДобавлятьОбработчикиСлужебныхСобытий Тогда
			
			Продолжить;
		КонецЕсли;
		
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль(
			Описание.ОсновнойСерверныйМодуль);
		
		Если Описание.Имя = "СтандартныеПодсистемы" Тогда
			Модуль = СтандартныеПодсистемыСервер;
		КонецЕсли;
		
		Если Описание.ДобавлятьОбработчикиСобытий Тогда
			Модуль.ПриДобавленииОбработчиковСобытий(
				ОбработчикиКлиентскихСобытийПоПодсистемам[Подсистема],
				ОбработчикиСерверныхСобытийПоПодсистемам[Подсистема]);
		КонецЕсли;
		
		Если Описание.ДобавлятьОбработчикиСлужебныхСобытий Тогда
			Модуль.ПриДобавленииОбработчиковСлужебныхСобытий(
				ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам[Подсистема],
				ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам[Подсистема]);
		КонецЕсли;
	КонецЦикла;
	
	// Проверка обязательных событий.
	ОбязательныеСобытияБезОбработчиков = Новый Массив;
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеКлиентскиеСобытия, ОбработчикиКлиентскихСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеСерверныеСобытия, ОбработчикиСерверныхСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеКлиентскиеСлужебныеСобытия, ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеСерверныеСлужебныеСобытия, ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам);
	
	Если ОбязательныеСобытияБезОбработчиков.Количество() > 0 Тогда
		ИмяСобытия  = НСтр("ru = 'Обработчики событий'", ОбщегоНазначенияКлиентСерверДополнительно.КодОсновногоЯзыка());
		
		Комментарий = НСтр("ru = 'Для следующих обязательных событий не определены обработчики:'")
			+ Символы.ПС + СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ОбязательныеСобытияБезОбработчиков, Символы.ПС);
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		ВызватьИсключение НСтр("ru = 'Для обязательных событий не определены обработчики.
		                             |Подробности см. в журнале регистрации.'");
	КонецЕсли;
	
	// Форматирование описаний обработчиков событий программы.
	ВсеОбработчикиСобытий = Новый Структура;
	ВсеОбработчикиСобытий.Вставить("НаКлиенте", Новый Структура);
	ВсеОбработчикиСобытий.Вставить("НаСервере", Новый Структура);
	
	ВсеОбработчикиСобытий.НаКлиенте.Вставить("ОбработчикиСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиКлиентскихСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаСервере.Вставить("ОбработчикиСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиСерверныхСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаКлиенте.Вставить("ОбработчикиСлужебныхСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаСервере.Вставить("ОбработчикиСлужебныхСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам));
	
	Возврат Новый ФиксированнаяСтруктура(ВсеОбработчикиСобытий);
	
КонецФункции

Процедура ПроверкаУникальностиИменСобытий(События)
	
	ВсеСобытия    = Новый Соответствие;
	
	Для каждого Событие Из События Цикл
		
		Если ВсеСобытия.Получить(Событие) = Неопределено Тогда
			ВсеСобытия.Вставить(Событие, Истина);
		Иначе
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при подготовке списка событий.
				           |
				           |Событие ""%1""
				           |уже добавлено.'"),
				Событие);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблонОбработчиковСобытий(События, ОбязательныеСобытия)
	
	ОбработчикиСобытий  = Новый Соответствие;
	
	Для каждого Событие Из События Цикл
		
		Если ТипЗнч(Событие) = Тип("Строка") Тогда // Имя события в виде строки.
			ОбработчикиСобытий.Вставить(Событие, Новый Массив);
			
		Иначе// Описание события в виде структуры - см. ОбщегоНазначения.НовоеСобытие().
			ОбработчикиСобытий.Вставить(Событие.Имя, Новый Массив);
			Если Событие.Обязательное Тогда
				Если ОбязательныеСобытия.Получить(Событие.Имя) = Неопределено Тогда
					ОбязательныеСобытия.Вставить(Событие.Имя, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбработчикиСобытий;
	
КонецФункции

Процедура ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
                                                     ОбязательныеСобытия,
                                                     ОбработчикиСобытийПоПодсистемам)
	
	Для каждого ОбязательноеСобытие Из ОбязательныеСобытия Цикл
		
		ОбработчикНайден = Ложь;
		Для каждого ОбработчикиСобытийПодсистемы Из ОбработчикиСобытийПоПодсистемам Цикл
			
			Если ОбработчикиСобытийПодсистемы.Значение.Получить(ОбязательноеСобытие.Ключ).Количество() <> 0 Тогда
				ОбработчикНайден = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ОбработчикНайден Тогда
			ОбязательныеСобытияБезОбработчиков.Добавить(ОбязательноеСобытие.Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СтандартноеОписаниеОбработчиковСобытий(ОписанияПодсистем, ОбработчикиСобытийПоПодсистемам)
	
	ОбработчикиСобытий  = Новый Соответствие;
	МодулиОбработчиков  = Новый Соответствие;
	СобытияОбработчиков = Новый Соответствие;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		ОбработчикиСобытийПодсистемы = ОбработчикиСобытийПоПодсистемам[Подсистема];
		
		Для каждого КлючИЗначение Из ОбработчикиСобытийПодсистемы Цикл
			Событие              = КлючИЗначение.Ключ;
			ОписанияОбработчиков = КлючИЗначение.Значение;
			
			Обработчики = ОбработчикиСобытий[Событие];
			Если Обработчики = Неопределено Тогда
				Обработчики = Новый Массив;
				ОбработчикиСобытий.Вставить(Событие, Обработчики);
				МодулиОбработчиков.Вставить(Событие, Новый Соответствие);
			КонецЕсли;
			
			Для каждого ОписаниеОбработчика Из ОписанияОбработчиков Цикл
				Если ТипЗнч(ОписаниеОбработчика) = Тип("Структура") Тогда
					Обработчик = ОписаниеОбработчика;
				Иначе
					Обработчик = Новый Структура;
					Обработчик.Вставить("Модуль", ОписаниеОбработчика);
				КонецЕсли;
				Если НЕ Обработчик.Свойство("Версия") Тогда
					Обработчик.Вставить("Версия", "");
				КонецЕсли;
				Обработчик.Вставить("Подсистема", Подсистема);
				
				// Проверка полного имени модуля процедуры обработчика события.
				Если ТипЗнч(Обработчик.Модуль) <> Тип("Строка")
				 ИЛИ НЕ ЗначениеЗаполнено(Обработчик.Модуль) Тогда
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Ошибка в имени модуля ""%2"".'"),
						Событие,
						Обработчик.Модуль);
				КонецЕсли;
				
				// Проверка, что один и тот же модуль указан для события только раз.
				Если МодулиОбработчиков[Событие].Получить(Обработчик.Модуль) = Неопределено Тогда
					МодулиОбработчиков[Событие].Вставить(Обработчик.Модуль, Истина);
				Иначе
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Модуль ""%2"" уже добавлен.'"),
						Событие,
						Обработчик.Модуль);
				КонецЕсли;
				Обработчики.Добавить(Новый ФиксированнаяСтруктура(Обработчик));
				
				// Проверка, что один и тот же обработчик указан для событий только один раз.
				ИмяПроцедуры = Сред(Событие, Найти(Событие, "\") + 1);
				ИмяОбработчика = Обработчик.Модуль + "." + ИмяПроцедуры;
				
				Если СобытияОбработчиков[ИмяОбработчика] = Неопределено Тогда
					СобытияОбработчиков.Вставить(ИмяОбработчика, Событие);
				Иначе
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Обработчик ""%2"" уже добавлен для события
						           |""%3"".'"),
						Событие,
						ИмяОбработчика,
						СобытияОбработчиков[ИмяОбработчика]);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Фиксация массивов обработчиков.
	Для каждого КлючИЗначение Из ОбработчикиСобытий Цикл
		ОбработчикиСобытий[КлючИЗначение.Ключ] = Новый ФиксированныйМассив(КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ОбработчикиСобытий);
	
КонецФункции

// Инициализация параметров сеанса.
// Параметры
//  ИменаПараметровСеанса - массив, неопределено - 
//                         в массиве имена параметров сеанса для инициализации
//
//  Возвращает массив имен установленных параметров сеанса
//
Функция УстановкаПараметровСеанса(ИменаПараметровСеанса=Неопределено) Экспорт  //Санлайн =Неопределено
	
	Перем ТекстСообщения;
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
	УстановленныеПараметры = Новый Массив;
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
		
		// Начальное выполнение на сервере перед запуском программы.
		ПередЗапускомПрограммы();
		Возврат УстановленныеПараметры;
		
	ИначеЕсли ИменаПараметровСеанса.Найти("ПараметрыКлиентаНаСервере") <> Неопределено Тогда
		
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
		УстановленныеПараметры.Добавить("ПараметрыКлиентаНаСервере");
	КонецЕсли;
	
	Обработчики = Новый Соответствие;
	//Санлайн
	//ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
	ОбработчикиСобытия = ОбщегоНазначенияДополнительно.ОбработчикиСлужебногоСобытия(
	//
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииОбработчиковУстановкиПараметровСеанса");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	КонецЦикла;
	
	//Санлайн
	//ОбработчикиСобственные = ОбщегоНазначенияПереопределяемый.ОбработчикиИнициализацииПараметровСеанса();
	ОбработчикиСобственные = ОбщегоНазначенияПереопределяемыйДополнительно.ОбработчикиИнициализацииПараметровСеанса();
	//
	
	Для Каждого Запись Из ОбработчикиСобственные Цикл
		Обработчики.Вставить(Запись.Ключ, Запись.Значение);
	КонецЦикла;
	
	// массив с ключами параметров сеанса
	// задаются начальным словом в имени параметра сеанса и символом "*"
	ПараметрыСеансаКлючи = Новый Массив;
	
	Для Каждого Запись Из Обработчики Цикл
		Если Найти(Запись.Ключ, "*") > 0 Тогда
			КлючПараметра = СокрЛП(Запись.Ключ);
			ПараметрыСеансаКлючи.Добавить(Лев(КлючПараметра, СтрДлина(КлючПараметра)-1));
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
		Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Обработчик = Обработчики.Получить(ИмяПараметра);
		Если Обработчик <> Неопределено Тогда
			//Санлайн
			//Если Не ОбщегоНазначения.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
			Если Не ОбщегоНазначенияДополнительно.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
				//
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			Выполнить Обработчик + "(ИмяПараметра, УстановленныеПараметры)";
			Продолжить;
		КонецЕсли;
		Для Каждого ИмяКлючаПараметра Из ПараметрыСеансаКлючи Цикл
			Если Лев(ИмяПараметра, СтрДлина(ИмяКлючаПараметра)) = ИмяКлючаПараметра Тогда
				Обработчик = Обработчики.Получить(ИмяКлючаПараметра+"*");
		//Санлайн
			//Если Не ОбщегоНазначения.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
			Если Не ОбщегоНазначенияДополнительно.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
				//
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
				Выполнить Обработчик + "(ИмяПараметра, УстановленныеПараметры)";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат УстановленныеПараметры;
	
КонецФункции

Процедура ПередЗапускомПрограммы()
	
	// Привилегированный режим (установлен платформой).
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("РаботаВМоделиСервиса");
		Модуль.ПриПроверкеВключенияБезопасногоРежимаРазделенияДанных();
		
	КонецЕсли;
	
	// Проверка заполнения версии конфигурации.
	Если ПустаяСтрока(Метаданные.Версия) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено свойство конфигурации Версия.'");
	Иначе
		Попытка
			НулеваяВерсия = ОбщегоНазначенияКлиентСерверДополнительно.СравнитьВерсии(Метаданные.Версия, "0.0.0.0") = 0;
		Исключение
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не правильно заполнено свойство конфигурации Версия: ""%1"".
				           |Правильный формат, например: ""2.1.3.70"".'"),
				Метаданные.Версия);
		КонецПопытки;
		Если НулеваяВерсия Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не правильно заполнено свойство конфигурации Версия: ""%1"".
				           |Версия не может быть нулевой.'"),
				Метаданные.Версия);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСерверДополнительно.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.РезервноеКопированиеОбластейДанных") Тогда
		// Установка флага активности пользователей в области
		Модуль = ОбщегоНазначенияКлиентСерверДополнительно.ОбщийМодуль("РезервноеКопированиеОбластейДанных");
		Модуль.УстановитьФлагАктивностиПользователяВОбласти();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает параметры работы программы для использования (фиксированные данные),
// которые являются, например, кэшем.
//
// Параметры:
//  ИмяКонстанты - Строка - имя константы (имя группы параметров работы программы).
//
Функция ПараметрыРаботыПрограммы(ИмяКонстанты) Экспорт
	
	Возврат СтандартныеПодсистемыПовтИсп.ПараметрыРаботыПрограммы(ИмяКонстанты);
	
КонецФункции

// Устанавливает вспомогательные данные для работы программы, хранимые в неразделенных константах.
//
// Параметры:
//  ИмяКонстанты      - Строка - имя неразделенной константы, в которой сохраняется значение параметра.
//  ИмяПараметра      - Строка - имя параметра, который нужно установить (без приставки ИзмененияПараметра).
//  ЗначениеПараметра - фиксированные данные, которые устанавливаются в качестве значения параметра.
//
Процедура УстановитьПараметрРаботыПрограммы(ИмяКонстанты, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Константа." + ИмяКонстанты);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Параметры = Константы[ИмяКонстанты].Получить().Получить();
		Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
			Параметры = Новый Структура;
		КонецЕсли;
		
		Параметры.Вставить(ИмяПараметра, ЗначениеПараметра);
		
		МенеджерЗначения = Константы[ИмяКонстанты].СоздатьМенеджерЗначения();
		МенеджерЗначения.ОбменДанными.Загрузка = Истина;
		МенеджерЗначения.ОбменДанными.Получатели.Автозаполнение = Ложь;
		МенеджерЗначения.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		МенеджерЗначения.Значение = Новый ХранилищеЗначения(Параметры);
		МенеджерЗначения.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Регистрирует завершение обновления параметров работы программы
// для возможности использования в сеансе их обновления.
//
Процедура ПодтвердитьОбновлениеПараметраРаботыПрограммы(ИмяКонстанты, ИмяПараметра) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКлиентаНаСервере = Новый Соответствие(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	
	ВсеОбновленныеПараметры = ПараметрыКлиентаНаСервере.Получить("ВсеОбновленныеПараметрыРаботыПрограммы");
	Если ВсеОбновленныеПараметры = Неопределено Тогда
		ВсеОбновленныеПараметры = Новый Соответствие;
		ОбновленныеПараметры = Новый Соответствие;
	Иначе
		ОбновленныеПараметры = ВсеОбновленныеПараметры.Получить(ИмяКонстанты);
		ВсеОбновленныеПараметры = Новый Соответствие(ВсеОбновленныеПараметры);
		Если ОбновленныеПараметры = Неопределено Тогда
			ОбновленныеПараметры = Новый Соответствие;
		Иначе
			ОбновленныеПараметры = Новый Соответствие(ОбновленныеПараметры);
		КонецЕсли;
	КонецЕсли;
	ОбновленныеПараметры.Вставить(ИмяПараметра, Истина);
	ВсеОбновленныеПараметры.Вставить(ИмяКонстанты, Новый ФиксированноеСоответствие(ОбновленныеПараметры));
	
	ПараметрыКлиентаНаСервере.Вставить("ВсеОбновленныеПараметрыРаботыПрограммы",
		Новый ФиксированноеСоответствие(ВсеОбновленныеПараметры));
	
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ПараметрыКлиентаНаСервере);
	
КонецПроцедуры
