
#Если Клиент Тогда

// Процедура выполняет открытие отчета "СведенияОбОС" с отбором по основному средству.
// Вызывается из ПоказататьСведенияОбОС()
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства - Основное средство по которому установить отбор
//
Процедура ОткрытьСведенияПоОдномуОС(ОсновноеСредство)
	
	Отчет       = Отчеты.СведенияОбОС.Создать();
	ОтборОтчета = Отчет.Отбор;
	Отчет.ЗаполнитьНачальныеНастройки();
	
	ФормаОтчета = Отчет.ПолучитьФорму();
	ФормаОтчета.ВосстанавливатьЗначенияПриОткрытии = Ложь;
	
	Если ОсновноеСредство.ЭтоГруппа Тогда
		
		ОтборОтчета.ОсновноеСредство.Значение      = ОсновноеСредство;
		ОтборОтчета.ОсновноеСредство.Использование = Истина;
		ОтборОтчета.ОсновноеСредство.ВидСравнения  = ВидСравнения.ВИерархии;
		
	Иначе
		
		ОтборОтчета.ОсновноеСредство.Установить(ОсновноеСредство);;
		
	КонецЕсли;
	
	ФормаОтчета.Открыть();
	ФормаОтчета.ОбновитьОтчет();
	
КонецПроцедуры // ОткрытьСведенияПоОдномуОС()

// Процедура выполняет открытие отчета "СведенияОбОС" с отбором по основному средству.
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства или массив - Основное средство по которому установить отбор
//
Процедура ПоказататьСведенияОбОС(ОсновноеСредство) Экспорт
		
	Если ТипЗнч(ОсновноеСредство) = Тип("Массив") Тогда
		
		ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(ОсновноеСредство);
		
		КоличествоОС = ОсновноеСредство.Количество();
		
		Если КоличествоОС = 1 Тогда
			
			// Отбор по одному
			ОткрытьСведенияПоОдномуОС(ОсновноеСредство[0]);
			
		ИначеЕсли КоличествоОС > 1 Тогда
			
			// нужно дать пользователю выбрать
			СписокОС = Новый СписокЗначений;
			
			СписокОС.ЗагрузитьЗначения(ОсновноеСредство);
			
			Отмечено = СписокОС.ОтметитьЭлементы();
			
			Если Не Отмечено Тогда
				
				Возврат
				
			КонецЕсли;
			
			// удаление не отмеченных
			Для Н = 1 По КоличествоОС Цикл
				
				Элемент = СписокОС[КоличествоОС - Н];
				
				Если НЕ Элемент.Пометка Тогда
					
					СписокОС.Удалить(Элемент);
					
				КонецЕсли;
				
			КонецЦикла;
			
			КоличествоОС = СписокОС.Количество();
			
			Если КоличествоОС = 1 Тогда
				
				// Отбор по одному
				ОткрытьСведенияПоОдномуОС(СписокОС[0].Значение);
				
			ИначеЕсли КоличествоОС > 1 Тогда
				
				// Отбор списком
				Отчет = Отчеты.СведенияОбОС.Создать();
				Отчет.ЗаполнитьНачальныеНастройки();
				ОтборОтчета = Отчет.Отбор;
				
				ФормаОтчета = Отчет.ПолучитьФорму();
				ФормаОтчета.ВосстанавливатьЗначенияПриОткрытии = Ложь;
				
				ОтборОтчета.ОсновноеСредство.Использование = Истина;
				ОтборОтчета.ОсновноеСредство.ВидСравнения  = ВидСравнения.ВСписке;
				ОтборОтчета.ОсновноеСредство.Значение.ЗагрузитьЗначения(СписокОС.ВыгрузитьЗначения());
				
 			    ФормаОтчета.Открыть();
				ФормаОтчета.ОбновитьОтчет();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьСведенияПоОдномуОС(ОсновноеСредство)
		
	КонецЕсли;

КонецПроцедуры // ПоказататьДокументыПоОС()

// Процедура выполняет открытие журнала документов с отбором по основному средству.
// Вызывается из ПоказататьДокументыПоОС()
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства - Основное средство по которому установить отбор
//
Процедура ОткрытьДокументыПоОдномуОС(ОсновноеСредство)
	
	ФормаСписка = ЖурналыДокументов.ДокументыПоОС.ПолучитьФорму(,, Новый УникальныйИдентификатор);
	
	Если ОсновноеСредство.ЭтоГруппа Тогда
		
		ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.Значение      = ОсновноеСредство;
		ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.Использование = Истина;
		ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.ВидСравнения  = ВидСравнения.ВИерархии;
		
	Иначе
		
		ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.Установить(ОсновноеСредство);;
		
	КонецЕсли;
	
	ФормаСписка.Открыть();

КонецПроцедуры // ОткрытьДокументыПоОдномуОС()

// Процедура выполняет открытие журнала документов с отбором по основному средству.
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства или массив - Основное средство по которому установить отбор
//
Процедура ПоказататьДокументыПоОС(ОсновноеСредство) Экспорт
	
	Если ТипЗнч(ОсновноеСредство) = Тип("Массив") Тогда
		
		ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(ОсновноеСредство);
		
		КоличествоОС = ОсновноеСредство.Количество();
		
		Если КоличествоОС = 1 Тогда
			
			// Отбор по одному
			ОткрытьДокументыПоОдномуОС(ОсновноеСредство[0]);
			
		ИначеЕсли КоличествоОС > 1 Тогда
			
			// нужно дать пользователю выбрать
			СписокОС = Новый СписокЗначений;
			
			СписокОС.ЗагрузитьЗначения(ОсновноеСредство);
			
			Отмечено = СписокОС.ОтметитьЭлементы();
			
			Если Не Отмечено Тогда
				
				Возврат
				
			КонецЕсли;
			
			// удаление не отмеченных
			Для Н = 1 По КоличествоОС Цикл
				
				Элемент = СписокОС[КоличествоОС - Н];
				
				Если НЕ Элемент.Пометка Тогда
					
					СписокОС.Удалить(Элемент);
					
				КонецЕсли;
				
			КонецЦикла;
			
			КоличествоОС = СписокОС.Количество();
			
			Если КоличествоОС = 1 Тогда
				
				// Отбор по одному
				ОткрытьДокументыПоОдномуОС(СписокОС[0].Значение);
				
			ИначеЕсли КоличествоОС > 1 Тогда
				
				// Отбор списком
				ФормаСписка = ЖурналыДокументов.ДокументыПоОС.ПолучитьФорму(,, Новый УникальныйИдентификатор);
				
				ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.Использование = Истина;
				ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.ВидСравнения  = ВидСравнения.ВСписке;
				ФормаСписка.ЖурналДокументовСписок.Отбор.ДокументыПоОС.Значение.ЗагрузитьЗначения(СписокОС.ВыгрузитьЗначения());
				
			    ФормаСписка.Открыть()
				
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьДокументыПоОдномуОС(ОсновноеСредство)
		
	КонецЕсли;

КонецПроцедуры // ПоказататьДокументыПоОС()

#КонецЕсли

// Функция возвращает счета учета по выбранному объекту
//
// Параметры:
//  Организация - по которой выполняется поиск
//  Объект      - ... строительства по которому выполняется поиск
//
// Возвращаемое значение:
//  Структура - структура содержащая счета учета 
// 
Функция ПолучитьСчетаУчетаОбъектовСтроительства(Организация, Объект) Экспорт

	Результат = Новый Структура("СчетУчетаБУ, СчетУчетаНДС, НалоговоеНазначение");

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("ПустойОбъект"     , Справочники.ОбъектыСтроительства.ПустаяСсылка());
	Запрос.УстановитьПараметр("Объект"           , Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчета    КАК СчетУчетаБУ,
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчетаНДС КАК СчетУчетаНДС
	|ИЗ
	|	РегистрСведений.ОбъектыСтроительстваОрганизаций КАК ОбъектыСтроительстваОрганизаций
	|ГДЕ
	|	ОбъектыСтроительстваОрганизаций.Организация = &Организация
	|	И ОбъектыСтроительстваОрганизаций.ОбъектСтроительства = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчета,
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчетаНДС
	|ИЗ
	|	РегистрСведений.ОбъектыСтроительстваОрганизаций КАК ОбъектыСтроительстваОрганизаций
	|ГДЕ
	|	ОбъектыСтроительстваОрганизаций.Организация = &ПустаяОрганизация
	|	И ОбъектыСтроительстваОрганизаций.ОбъектСтроительства = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчета,
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчетаНДС
	|ИЗ
	|	РегистрСведений.ОбъектыСтроительстваОрганизаций КАК ОбъектыСтроительстваОрганизаций
	|ГДЕ
	|	ОбъектыСтроительстваОрганизаций.Организация = &Организация
	|	И ОбъектыСтроительстваОрганизаций.ОбъектСтроительства = &ПустойОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчета,
	|	ОбъектыСтроительстваОрганизаций.СчетБухгалтерскогоУчетаНДС
	|ИЗ
	|	РегистрСведений.ОбъектыСтроительстваОрганизаций КАК ОбъектыСтроительстваОрганизаций
	|ГДЕ
	|	ОбъектыСтроительстваОрганизаций.Организация = &ПустаяОрганизация
	|	И ОбъектыСтроительстваОрганизаций.ОбъектСтроительства = &ПустойОбъект";
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Результат.СчетУчетаБУ  = Выборка.СчетУчетаБУ;
		Результат.СчетУчетаНДС = Выборка.СчетУчетаНДС;

	КонецЕсли;
	
	Результат.НалоговоеНазначение = Объект.НалоговоеНазначение;

	Возврат Результат;

КонецФункции //ПолучитьСчетаУчетаОбъектовСтроительства()

// Функция определяет фактический срок использования актива (в месяцах)
// исходя из даты принятия актива к учету и даты выбытия
//
// Параметры:
//   ДатаПринятияКУчету - дата принятия актива к учету
//   ДатаВыбытия - дата выбытия актива
//
// Возвращаемое значение:
//   Число месяцев.
//
Функция ОпределитьФактическийСрокИспользования(ДатаПринятияКУчету, ДатаВыбытия) Экспорт
	
	КоличествоЛет     = Год(ДатаВыбытия) - Год(ДатаПринятияКУчету);
	КоличествоМесяцев = Месяц(ДатаВыбытия) - Месяц(ДатаПринятияКУчету);
	
	Возврат КоличествоЛет * 12 + КоличествоМесяцев;
	
КонецФункции // ОпределитьФактическийСрокИспользования()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ АМОРТИЗАЦИИ ОС

// Расчитывает сумму амортизации по указаному основному средству по бух/нал учету
//
// Параметры
//  ОсновноеСредство                            - СправочникСсылка.ОсновныеСредства - ОС, по которому 
//                                                нужно рассчитать амортизацию.
//  ДатаРасчета                                 - Дата - Дата расчета амортизации
//
// Возвращаемое значение:
//   Число - Сумма начисленной амортизации
//
Функция РасчетАмортизацииРегл(ДатаРасчета, Организация, ОсновноеСредство = Неопределено, 
	                             ВыдаватьСообщения = Истина, Отказ = Ложь) Экспорт

	ТаблицаАмортизации = Новый ТаблицаЗначений();

	ТаблицаАмортизации.Колонки.Добавить("ОбъектУчета"           , Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаАмортизации.Колонки.Добавить("СчетУчета"     		, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаАмортизации.Колонки.Добавить("СчетАмортизации"    	, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаАмортизации.Колонки.Добавить("НаправлениеАмортизации", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТаблицаАмортизации.Колонки.Добавить("Амортизация"			, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("АмортизацияНУ"			, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("Метод_50_50"			, Новый ОписаниеТипов("Булево"));
	ТаблицаАмортизации.Колонки.Добавить("НалоговоеНазначение"	, Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаАмортизации.Колонки.Добавить("Местонахождение"		, Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));

	ТаблицаАмортизации.Колонки.Добавить("СуммаПереоценкиПропорциональнаяАмортизации", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("СчетУчетаДооценокОС"	, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоГода"    , НачалоГода(ДатаРасчета));
	СтруктураПараметров.Вставить("НачалоКвартала", НачалоКвартала(ДатаРасчета));
	СтруктураПараметров.Вставить("НачалоПериода" , НачалоМесяца(ДатаРасчета));
	СтруктураПараметров.Вставить("КонецПериода"  , КонецМесяца(ДатаРасчета));
	СтруктураПараметров.Вставить("Организация"   , Организация);
	СтруктураПараметров.Вставить("Период"    	 , ДатаРасчета);
	                                         	
	СтруктураПараметров.Вставить("НачалоПериода200911" , Дата(2009,11,01));
	
	Если ОсновноеСредство = Неопределено Тогда
		
		ТекстУсловия 	= "";
		
		ТекстУсловияПроизводственные 	= "";
		
	Иначе
		
		СтруктураПараметров.Вставить("СписокОС", ОсновноеСредство);
		ТекстУсловия 	= "И ОсновноеСредство В (&СписокОС)";
		
		ТекстУсловияПроизводственные 	= "И ОсновноеСредство В (&СписокОСПроизводственные)";
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"" 						КАК ТипЗаписи,
	|	СчетаБухгалтерскогоУчета.СчетУчета 	КАК Поле
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчетаНачалоГода"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоГода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчетаНачалоКвартала"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоКвартала,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизацииНачалоГода"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоГода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизацииНачалоКвартала"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &НачалоКвартала,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|ИТОГИ ПО
	|	ТипЗаписи";
	
	ДеревоРезультатов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПараметров.Вставить("СчетаУчета"                    , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчетаНачалоГода"          , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчетаНачалоКвартала"      , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизации"              , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизацииНачалоГода"    , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизацииНачалоКвартала", Неопределено);
	
	Для каждого СтрокаТипаЗаписи Из ДеревоРезультатов.Строки Цикл
	
		СтруктураПараметров.Вставить(СтрокаТипаЗаписи.ТипЗаписи, 
		                             СтрокаТипаЗаписи.Строки.ВыгрузитьКолонку("Поле"));	
	
	КонецЦикла;

	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		ЗапросСчетовАмортизации = Новый Запрос;
		ЗапросСчетовАмортизации.УстановитьПараметр("ВнешнийИсточник", СтруктураПараметров.СчетаАмортизации);
		ЗапросСчетовАмортизации.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК СчетНачисленияАмортизации
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Ссылка В(&ВнешнийИсточник)";
		ИсточникДанных = ЗапросСчетовАмортизации.Выполнить();
		
		// Блокировка регистра бухгалтерии.
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы, ИсточникДанных", 
														"РегистрБухгалтерии", "Хозрасчетный", ИсточникДанных);
														
		СтруктураЗначенийБлокировки = Новый Структура("Период, Организация", 
													  Новый Диапазон(, КонецМесяца(ДатаРасчета)), Организация);
													  
		СтруктураИсточникаДанных = Новый Структура("Счет", "СчетНачисленияАмортизации");
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных);
		
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СубконтоОС"    , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);	
	Запрос.УстановитьПараметр("СостояниеВвода", Перечисления.СостоянияОС.ВведеноВЭксплуатацию);	
	
	Если ОсновноеСредство <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокОСПроизводственные", ОсновноеСредство);	
	КонецЕсли;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ
	|	СнятыеСУчета
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|ГДЕ
	|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) И
	|	СостоянияОСОрганизаций.ДатаСостояния < &Период И
	|	СостоянияОСОрганизаций.Организация = &Организация " + ТекстУсловия + "
	|;
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ЕСТЬNULL(НачислениеАмортизации.НачислятьАмортизацию, ЛОЖЬ)        КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(НачислениеАмортизацииНУ.НачислятьАмортизацию, ЛОЖЬ)        КАК НачислятьАмортизациюНУ
	|ПОМЕСТИТЬ
	|   СписокОС
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + " И ОсновноеСредство НЕ В (ВЫБРАТЬ ОсновноеСредство ИЗ СнятыеСУчета)) КАК НачислениеАмортизации
	|		ПО ОсновныеСредства.Ссылка = НачислениеАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + " И ОсновноеСредство НЕ В (ВЫБРАТЬ ОсновноеСредство ИЗ СнятыеСУчета)) КАК НачислениеАмортизацииНУ
	|		ПО ОсновныеСредства.Ссылка = НачислениеАмортизацииНУ.ОсновноеСредство
	|ГДЕ
	|	(НачислениеАмортизации.НачислятьАмортизацию
	|			ИЛИ НачислениеАмортизацииНУ.НачислятьАмортизацию)
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.Организация                                       	  КАК Организация,
	|	ПервоначальныеСведения.ОсновноеСредство                                       КАК ОсновноеСредство,
	|	ПервоначальныеСведения.ПараметрВыработки                            		  КАК ПараметрВыработки,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                            КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                            	  КАК ПервоначальнаяСтоимость
	|ПОМЕСТИТЬ
	|   ПервоначальныеСведения
	|ИЗ	
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ПервоначальныеСведения
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияНУ.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ПервоначальныеСведенияНУ.НалоговаяГруппаОС                            КАК НалоговаяГруппаОС
	|ПОМЕСТИТЬ
	|   ПервоначальныеСведенияНУ
	|ИЗ	
	|			РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ПервоначальныеСведенияНУ
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизации.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.Период                                      КАК Период
	|ПОМЕСТИТЬ
	|   ПараметрыАмортизации
	|ИЗ	
	|			РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ПараметрыАмортизации
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииНУ.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизацииНУ.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииНУ.Период                                      КАК Период
	|ПОМЕСТИТЬ
	|   ПараметрыАмортизацииНУ
	|ИЗ	
	|			РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ПараметрыАмортизацииНУ
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиАмортизации.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ГрафикиАмортизации.ГрафикАмортизации                            КАК ГрафикАмортизации
	|ПОМЕСТИТЬ
	|   ГрафикиАмортизации
	|ИЗ	
	|			РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ГрафикиАмортизации
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаОС.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ВыработкаОС.ПараметрВыработки                            КАК ПараметрВыработки,
	|	ВыработкаОС.КоличествоОборот                             КАК КоличествоОборот
	|ПОМЕСТИТЬ
	|   ВыработкаОС
	|ИЗ	
	|			РегистрНакопления.ВыработкаОС.Обороты(
	|			                  &НачалоПериода,
	|			                  &КонецПериода, ,
	|			                  ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ВыработкаОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОстатки.Субконто1                             	КАК ОсновноеСредство,
	|	СтоимостьОстатки.СуммаОстатокДт							КАК СуммаОстатокДт,
	|	СтоимостьОстатки.СуммаНУОстатокДт						КАК СуммаНУОстатокДт
	|ПОМЕСТИТЬ
	|   СтоимостьОстатки
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтоимостьОстатки
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьНачалоГода.Субконто1                             	КАК ОсновноеСредство,
	|	СтоимостьНачалоГода.СуммаОстатокДт	                        КАК СуммаОстатокДт,
	|	СтоимостьНачалоГода.СуммаНУОстатокДт						КАК СуммаНУОстатокДт
	|ПОМЕСТИТЬ
	|   СтоимостьНачалоГода
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоГода,
	|		                       Счет В (&СчетаУчетаНачалоГода),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтоимостьНачалоГода
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьНачалоКвартала.Субконто1           	               КАК ОсновноеСредство,
	|	СтоимостьНачалоКвартала.СуммаОстатокДт		                   КАК СуммаОстатокДт,
	|	СтоимостьНачалоКвартала.СуммаНУОстатокДт					   КАК СуммаНУОстатокДт
	|ПОМЕСТИТЬ
	|   СтоимостьНачалоКвартала
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоКвартала,
	|		                       Счет В (&СчетаУчетаНачалоКвартала),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтоимостьНачалоКвартала
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОстатки.Субконто1           	               КАК ОсновноеСредство,
	|	АмортизацияОстатки.СуммаОстатокКт		               КАК СуммаОстатокКт,
	|	АмортизацияОстатки.СуммаНУОстатокКт		               КАК СуммаНУОстатокКт
	|ПОМЕСТИТЬ
	|   АмортизацияОстатки
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК АмортизацияОстатки
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНачалоГода.Субконто1           	               КАК ОсновноеСредство,
	|	АмортизацияНачалоГода.СуммаОстатокКт		               КАК СуммаОстатокКт,
	|	АмортизацияНачалоГода.СуммаНУОстатокКт		               КАК СуммаНУОстатокКт
	|ПОМЕСТИТЬ
	|   АмортизацияНачалоГода
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоГода,
	|		                       Счет В (&СчетаАмортизацииНачалоГода),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК АмортизацияНачалоГода
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНачалоКвартала.Субконто1           	               КАК ОсновноеСредство,
	|	АмортизацияНачалоКвартала.СуммаОстатокКт		               КАК СуммаОстатокКт,
	|	АмортизацияНачалоКвартала.СуммаНУОстатокКт		               КАК СуммаНУОстатокКт
	|ПОМЕСТИТЬ
	|   АмортизацияНачалоКвартала
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоКвартала,
	|		                       Счет В (&СчетаАмортизацииНачалоКвартала),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК АмортизацияНачалоКвартала
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НачислениеАмортизацииОС.Период)  КАК Период,
	|	НачислениеАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ
	|   ДатыПервойАмортизации
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОС
	|ГДЕ 
	|	(НачислениеАмортизацииОС.НачислятьАмортизацию) И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)
	|СГРУППИРОВАТЬ ПО 
	|	НачислениеАмортизацииОС.ОсновноеСредство
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеАмортизацииОС.Период                             КАК ДатаПервойАмортизации,
	|	НачислениеАмортизацииОС.ОсновноеСредство                   КАК ОсновноеСредство
	|ПОМЕСТИТЬ
	|   ПервоеНачислениеАмортизации
	|ИЗ
	|	ДатыПервойАмортизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ 
	|				РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОС
	|			ПО ДатыПервойАмортизации.ОсновноеСредство = НачислениеАмортизацииОС.ОсновноеСредство 
	|		 	 И ДатыПервойАмортизации.Период = НачислениеАмортизацииОС.Период
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпособыОтраженияРасходов.ОсновноеСредство           	        		КАК ОсновноеСредство,
	|	СпособыОтраженияРасходов.СпособыОтраженияРасходовПоАмортизации          КАК СпособыОтраженияРасходовПоАмортизации
	|ПОМЕСТИТЬ
	|   СпособыОтраженияРасходов
	|ИЗ	
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СпособыОтраженияРасходов
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.СубконтоКт1           	        КАК ОсновноеСредство,
	|	НачисленнаяАмортизация.СуммаОборот		               	КАК СуммаОборот,
	|	НачисленнаяАмортизация.СуммаНУОборотКт	               	КАК СуммаНУОборот
	|ПОМЕСТИТЬ
	|   НачисленнаяАмортизация
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|		                       СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)
	|		                       ) КАК НачисленнаяАмортизация	
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчета.ОсновноеСредство           	        КАК ОсновноеСредство,
	|	СчетаБухгалтерскогоУчета.СчетУчета                              КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетУчетаДооценокОС                      КАК СчетУчетаДооценокОС,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации              КАК СчетНачисленияАмортизации
	|ПОМЕСТИТЬ
	|   СчетаБухгалтерскогоУчета
	|ИЗ	
	|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СчетаБухгалтерскогоУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговыеНазначенияОС.ОсновноеСредство           	        КАК ОсновноеСредство,
	|	НалоговыеНазначенияОС.НалоговоеНазначение                   КАК НалоговоеНазначение
	|ПОМЕСТИТЬ
	|   НалоговыеНазначенияОС
	|ИЗ	
	|			РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК НалоговыеНазначенияОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеОС.ОсновноеСредство                             	КАК ОсновноеСредство,
	|	МестонахождениеОС.Местонахождение                       		КАК Местонахождение
	|ПОМЕСТИТЬ
	|   МестонахождениеОС
	|ИЗ	
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|			                  &КонецПериода,
	|							  Организация = &Организация
	|			                  И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК МестонахождениеОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереоценкаОС.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ПереоценкаОС.СуммаПереоценкиОстаток                       КАК СуммаПереоценки
	|ПОМЕСТИТЬ
	|   ПереоценкаОС
	|ИЗ	
	|			РегистрНакопления.ПереоценкаОСБухгалтерскийУчет.Остатки(
	|			                  &КонецПериода,
	|							  Организация = &Организация
	|			                  И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК ПереоценкаОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|// Для производственного способа
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОС.ОсновноеСредство  			КАК ОсновноеСредство,
	|	СостоянияОС.ДатаСостояния  				КАК ДатаСостояния
	|ПОМЕСТИТЬ
	|   СписокОСПринятыхВТекущемМесяце
	|ИЗ	
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		            &КонецПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловияПроизводственные + ") КАК НачислениеАмортизации
	|	ПО НачислениеАмортизации.Организация = СостоянияОС.Организация
	|		И НачислениеАмортизации.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|		И (НачислениеАмортизации.НачислятьАмортизацию)
	|		И СостоянияОС.Состояние = &СостояниеВвода
	|		И (СостоянияОС.ДатаСостояния МЕЖДУ &НачалоПериода И &КонецПериода)
	|		И (СостоянияОС.ДатаСостояния > &НачалоПериода200911)
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.Организация                                       	  КАК Организация,
	|	ПервоначальныеСведения.ОсновноеСредство                                       КАК ОсновноеСредство,
	|	ПервоначальныеСведения.ПараметрВыработки                            		  КАК ПараметрВыработки,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                            КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ
	|   ПервоначальныеСведенияПМ
	|ИЗ	
	|		РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПервых(
	|		            &НачалоПериода,
	|		            Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)
	|		            ) КАК ПервоначальныеСведения
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаОС.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ВыработкаОС.ПараметрВыработки                            КАК ПараметрВыработки,
	|	ВыработкаОС.КоличествоОборот                             КАК КоличествоОборот
	|ПОМЕСТИТЬ
	|   ВыработкаОСПМ
	|ИЗ	
	|			РегистрНакопления.ВыработкаОС.Обороты(
	|			                  &НачалоПериода,
	|			                  &КонецПериода, ,
	|			                  ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК ВыработкаОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизации.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.Период                                      КАК Период
	|ПОМЕСТИТЬ
	|   ПараметрыАмортизацииПМ
	|ИЗ	
	|		РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПервых(
	|	                    &НачалоПериода,
	|	                    Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК ПараметрыАмортизации
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииНУ.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПараметрыАмортизацииНУ.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииНУ.Период                                      КАК Период
	|ПОМЕСТИТЬ
	|   ПараметрыАмортизацииПМ_НУ
	|ИЗ	
	|		РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПервых(
	|	                    &НачалоПериода,
	|	                    Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК ПараметрыАмортизацииНУ
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпособыОтраженияРасходов.ОсновноеСредство           	        		КАК ОсновноеСредство,
	|	СпособыОтраженияРасходов.СпособыОтраженияРасходовПоАмортизации          КАК СпособыОтраженияРасходовПоАмортизации
	|ПОМЕСТИТЬ
	|   СпособыОтраженияРасходовПМ
	|ИЗ	
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПервых(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК СпособыОтраженияРасходов
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.СубконтоКт1           	        КАК ОсновноеСредство,
	|	НачисленнаяАмортизация.СуммаОборот		               	КАК СуммаОборот,
	|	НачисленнаяАмортизация.СуммаНУОборотКт		            КАК СуммаНУОборот
	|ПОМЕСТИТЬ
	|   НачисленнаяАмортизацияПМ
	|ИЗ	
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|		                       СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)
	|		                       ) КАК НачисленнаяАмортизация
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчета.ОсновноеСредство           	        КАК ОсновноеСредство,
	|	СчетаБухгалтерскогоУчета.СчетУчета                              КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетУчетаДооценокОС                    КАК СчетУчетаДооценокОС,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации              КАК СчетНачисленияАмортизации
	|ПОМЕСТИТЬ
	|   СчетаБухгалтерскогоУчетаПМ
	|ИЗ	
	|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПервых(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК СчетаБухгалтерскогоУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговыеНазначенияОС.ОсновноеСредство           	        КАК ОсновноеСредство,
	|	НалоговыеНазначенияОС.НалоговоеНазначение                   КАК НалоговоеНазначение
	|ПОМЕСТИТЬ
	|   НалоговыеНазначенияОСПМ
	|ИЗ	
	|			РегистрСведений.НалоговыеНазначенияОС.СрезПервых(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК НалоговыеНазначенияОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;	
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеОС.ОсновноеСредство                             	КАК ОсновноеСредство,
	|	МестонахождениеОС.Местонахождение                       		КАК Местонахождение
	|ПОМЕСТИТЬ
	|   МестонахождениеОСПМ
	|ИЗ	
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|			                  &КонецПериода,
	|							  Организация = &Организация
	|			                  И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК МестонахождениеОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереоценкаОС.ОсновноеСредство                             КАК ОсновноеСредство,
	|	ПереоценкаОС.СуммаПереоценкиОстаток                       КАК СуммаПереоценки
	|ПОМЕСТИТЬ
	|   ПереоценкаОСПМ
	|ИЗ	
	|			РегистрНакопления.ПереоценкаОСБухгалтерскийУчет.Остатки(
	|			                  &КонецПериода,
	|							  Организация = &Организация
	|			                  И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОСПринятыхВТекущемМесяце)) КАК ПереоценкаОС
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.ОсновноеСредство                                       КАК ОсновноеСредство,
	|	СписокОС.НачислятьАмортизацию                                       		  КАК НачислятьАмортизацию,
	|	СписокОС.НачислятьАмортизациюНУ                                       		  КАК НачислятьАмортизациюНУ,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                            КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации, 0)   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации, 0)           КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации, 0) КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.ЛиквидационнаяСтоимость, 0)                     КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокИспользованияДляВычисленияАмортизации, 0)   КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации, 0)           КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	ПараметрыАмортизации.Период                                                   КАК Период,
	|	ПараметрыАмортизацииНУ.Период                                                   КАК ПериодНУ,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                            	  КАК ПервоначальнаяСтоимость,
	|	ПервоеНачислениеАмортизации.ДатаПервойАмортизации                             КАК ДатаПервойАмортизации,
	|	ЕСТЬNULL(ВыработкаОС.КоличествоОборот, 0)                                     КАК ТекущийОбъемПродукцииРабот,
	|	СпособыОтраженияРасходов.СпособыОтраженияРасходовПоАмортизации                КАК СпособыОтраженияРасходовПоАмортизации,
	|	ГрафикиАмортизации.ГрафикАмортизации                                          КАК ГрафикАмортизации,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияОстатки.СуммаОстатокКт, 0)                          КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаОборот, 0)                               КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоГода.СуммаОстатокКт, 0)                       КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоКвартала.СуммаОстатокКт, 0)                   КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияОстатки.СуммаНУОстатокКт, 0)                        КАК СтоимостьКонечныйОстатокНУ,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаНУОборот, 0)                             КАК АмортизацияОборотНУ,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоГода.СуммаНУОстатокКт, 0)                     КАК СтоимостьНаНачалоГодаНУ,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоКвартала.СуммаНУОстатокКт, 0)                 КАК СтоимостьНаНачалоКварталаНУ,
	|	СостоянияОС.ДатаСостояния                                                     КАК ДатаВводаВЭксплуатацию,
	|	НалоговыеНазначенияОС.НалоговоеНазначение                                     КАК НалоговоеНазначение,
	|	МестонахождениеОС.Местонахождение                                             КАК Местонахождение,
	|	ЕСТЬNULL(ПереоценкаОС.СуммаПереоценки, 0)          							  КАК СуммаПереоценки,
	|	СчетаБухгалтерскогоУчета.СчетУчета                                            КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетУчетаДооценокОС                      			  КАК СчетУчетаДооценокОС,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации                            КАК СчетНачисленияАмортизации
	|ИЗ
	|	ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СписокОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СписокОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПервоначальныеСведенияНУ
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПервоначальныеСведенияНУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПараметрыАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПараметрыАмортизацииНУ
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизацииНУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ГрафикиАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ГрафикиАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВыработкаОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ВыработкаОС.ОсновноеСредство
	|			И ПервоначальныеСведения.ПараметрВыработки = ВыработкаОС.ПараметрВыработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СтоимостьОстатки
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СтоимостьОстатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СтоимостьНачалоГода
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СтоимостьНачалоГода.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СтоимостьНачалоКвартала
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СтоимостьНачалоКвартала.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			АмортизацияОстатки
	|		ПО ПервоначальныеСведения.ОсновноеСредство = АмортизацияОстатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			АмортизацияНачалоГода
	|		ПО ПервоначальныеСведения.ОсновноеСредство = АмортизацияНачалоГода.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			АмортизацияНачалоКвартала
	|		ПО ПервоначальныеСведения.ОсновноеСредство = АмортизацияНачалоКвартала.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПервоеНачислениеАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПервоеНачислениеАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СпособыОтраженияРасходов
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			НачисленнаяАмортизация
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НачисленнаяАмортизация.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = СостоянияОС.Организация
	|			И (СостоянияОС.Состояние = &СостояниеВвода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СчетаБухгалтерскогоУчета
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СчетаБухгалтерскогоУчета.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			НалоговыеНазначенияОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			МестонахождениеОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПереоценкаОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПереоценкаОС.ОсновноеСредство
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокОСПринятыхВТекущемМесяце.ОсновноеСредство 									КАК ОсновноеСредство,
	|	ИСТИНА                                       		  КАК НачислятьАмортизацию,
	|	ИСТИНА                                       		  КАК НачислятьАмортизациюНУ,
	|	ПервоначальныеСведенияПМ.СпособНачисленияАмортизации 								КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.СрокИспользованияДляВычисленияАмортизации, 0)   	КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.СтоимостьДляВычисленияАмортизации, 0)           	КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0) 	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.ЛиквидационнаяСтоимость, 0)                     	КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ_НУ.СрокИспользованияДляВычисленияАмортизации, 0)   	КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ_НУ.СтоимостьДляВычисленияАмортизации, 0)           	КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	ПараметрыАмортизацииПМ.Период                                                   	КАК Период,
	|	ПараметрыАмортизацииПМ_НУ.Период                                                   	КАК ПериодНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.СтоимостьДляВычисленияАмортизации, 0)           	КАК ПервоначальнаяСтоимость,
	|	NULL                             													КАК ДатаПервойАмортизации,
	|	ЕСТЬNULL(ВыработкаОСПМ.КоличествоОборот, 0)                                     	КАК ТекущийОбъемПродукцииРабот,
	|	СпособыОтраженияРасходовПМ.СпособыОтраженияРасходовПоАмортизации                	КАК СпособыОтраженияРасходовПоАмортизации,
	|	NULL                                          										КАК ГрафикАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ.СтоимостьДляВычисленияАмортизации, 0)           	КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(НачисленнаяАмортизацияПМ.СуммаОборот, 0)                               	КАК АмортизацияОборот,
	|	0														                      		КАК СтоимостьНаНачалоГода,
	|	0														                      		КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(ПараметрыАмортизацииПМ_НУ.СтоимостьДляВычисленияАмортизации, 0)           	КАК СтоимостьКонечныйОстатокНУ,
	|	ЕСТЬNULL(НачисленнаяАмортизацияПМ.СуммаНУОборот, 0)                               	КАК АмортизацияОборотНУ,
	|	0														                      		КАК СтоимостьНаНачалоГодаНУ,
	|	0														                      		КАК СтоимостьНаНачалоКварталаНУ,
	|	СписокОСПринятыхВТекущемМесяце.ДатаСостояния                                  		КАК ДатаВводаВЭксплуатацию,
	|	НалоговыеНазначенияОСПМ.НалоговоеНазначение                                     	КАК НалоговоеНазначение,
	|	МестонахождениеОСПМ.Местонахождение		            							  	КАК Местонахождение,
	|	ЕСТЬNULL(ПереоценкаОСПМ.СуммаПереоценки, 0)            							  	КАК СуммаПереоценки,
	|	СчетаБухгалтерскогоУчетаПМ.СчетУчета                                            	КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаПМ.СчетУчетаДооценокОС                      					КАК СчетУчетаДооценокОС,
	|	СчетаБухгалтерскогоУчетаПМ.СчетНачисленияАмортизации                            	КАК СчетНачисленияАмортизации
	|ИЗ
	|	СписокОСПринятыхВТекущемМесяце
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ПервоначальныеСведенияПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = ПервоначальныеСведенияПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВыработкаОСПМ
	|		ПО ПервоначальныеСведенияПМ.ОсновноеСредство = ВыработкаОСПМ.ОсновноеСредство
	|			И ПервоначальныеСведенияПМ.ПараметрВыработки = ВыработкаОСПМ.ПараметрВыработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ПараметрыАмортизацииПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = ПараметрыАмортизацииПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ПараметрыАмортизацииПМ_НУ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = ПараметрыАмортизацииПМ_НУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			НачисленнаяАмортизацияПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = НачисленнаяАмортизацияПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СпособыОтраженияРасходовПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = СпособыОтраженияРасходовПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			СчетаБухгалтерскогоУчетаПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = СчетаБухгалтерскогоУчетаПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			НалоговыеНазначенияОСПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = НалоговыеНазначенияОСПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			МестонахождениеОСПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = МестонахождениеОСПМ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПереоценкаОСПМ
	|		ПО СписокОСПринятыхВТекущемМесяце.ОсновноеСредство = ПереоценкаОСПМ.ОсновноеСредство
	| ГДЕ ПервоначальныеСведенияПМ.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Производственный)
	|";
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТаблицаГрафиков = ПолучитьТаблицуГрафиков();

	Пока ВыборкаПоОС.Следующий() Цикл
		
		Если (ВыборкаПоОС.АмортизацияОборот > 0) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ амортизация в этом месяце уже начислялась';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ амортизація в цьому місяці вже нараховувалася'"), ВыборкаПоОС.ОсновноеСредство));
				
			КонецЕсли;
			
			Продолжить; // по указанному ОС в этом месяце уже начисляли амортизацию 
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.СпособНачисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ не указан способ амортизации';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ не вказаний спосіб амортизації'"), ВыборкаПоОС.ОсновноеСредство),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		НачислятьАмортизацию 	= ВыборкаПоОС.НачислятьАмортизацию;
		НачислятьАмортизациюНУ 	= ВыборкаПоОС.НачислятьАмортизациюНУ;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.СтоимостьДляВычисленияАмортизации) И НачислятьАмортизацию Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ стоимость для вычисления амортизации равна 0';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ вартість для обчислення амортизації дорівнює 0'"), ВыборкаПоОС.ОсновноеСредство),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.СтоимостьДляВычисленияАмортизацииНУ) И НачислятьАмортизациюНУ Тогда
			
			НачислятьАмортизациюНУ = Ложь;	
			
		КонецЕсли;	
		

		
		СуммаАмортизации = 0;
		
		СуммаАмортизацииНУ = 0;
		
		Метод_50_50      = Ложь;
		
		СтоимостьДляВычисленияАмортизации 			= ВыборкаПоОС.СтоимостьДляВычисленияАмортизации;
		ЛиквидационнаяСтоимость						= ВыборкаПоОС.ЛиквидационнаяСтоимость;
		АмортизируемаяСтоимость	 					= СтоимостьДляВычисленияАмортизации - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизации	= ВыборкаПоОС.СрокИспользованияДляВычисленияАмортизации;
		
		СтоимостьДляВычисленияАмортизацииНУ 		= ВыборкаПоОС.СтоимостьДляВычисленияАмортизацииНУ;
		АмортизируемаяСтоимостьНУ	 				= СтоимостьДляВычисленияАмортизацииНУ - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизацииНУ	= ВыборкаПоОС.СрокИспользованияДляВычисленияАмортизацииНУ;
		
		ТекущийОбъемПродукцииРабот					= ВыборкаПоОС.ТекущийОбъемПродукцииРабот;
		ОбъемПродукцииРаботДляВычисленияАмортизации	= ВыборкаПоОС.ОбъемПродукцииРаботДляВычисленияАмортизации;
		ДатаВводаВЭксплуатацию                      = ВыборкаПоОС.ДатаВводаВЭксплуатацию;
		
		Если ВыборкаПоОС.ДатаВводаВЭксплуатацию = NULL Тогда
	    	ДатаВводаВЭксплуатациюНУ 				= NULL;
		Иначе	
			ДатаВводаВЭксплуатациюНУ 				= Макс(ВыборкаПоОС.ДатаВводаВЭксплуатацию, '20110331');
		КонецЕсли;	
		
		СтоимостьКонечныйОстаток					= ВыборкаПоОС.СтоимостьКонечныйОстаток;
		
		СтоимостьКонечныйОстатокНУ					= ВыборкаПоОС.СтоимостьКонечныйОстатокНУ;
		
		Если (ЛиквидационнаяСтоимость <> 0) 
		   И (ЛиквидационнаяСтоимость >= СтоимостьКонечныйОстаток) И (ЛиквидационнаяСтоимость >= СтоимостьКонечныйОстатокНУ) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьИнформацию(Локализация.СтрШаблон1(НСтр("ru='Бух./нал. расчет амортизации: остаточная стоимость основного средства ¤1¤ достигла ликвидационной <¤2¤>, амортизация не начислена.';uk='Бух./под. розрахунок амортизації: залишкова вартість основного засобу ¤1¤ досягла ліквідаційної <¤2¤>, амортизація не нарахована.'"),
				                             ВыборкаПоОС.ОсновноеСредство, ЛиквидационнаяСтоимость));
				
			КонецЕсли;
			
            Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Прямолинейный Тогда

			Если НачислятьАмортизацию Тогда
				Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				СуммаГодовойАмортизации = АмортизируемаяСтоимость / СрокИспользованияДляВычисленияАмортизации * 12;

				Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
					
					СуммаАмортизации = СуммаГодовойАмортизации / 12;

				Иначе
					
					КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, 
					                                                                 ВыборкаПоОС.ГрафикАмортизации, 
																					 ДатаРасчета);
					СуммаАмортизации       = СуммаГодовойАмортизации * КоэффициентАмортизации;

				КонецЕсли;
			КонецЕсли;	
			
			Если НачислятьАмортизациюНУ Тогда
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				СуммаГодовойАмортизацииНУ = АмортизируемаяСтоимостьНУ / СрокИспользованияДляВычисленияАмортизацииНУ * 12;

				Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
					
					СуммаАмортизацииНУ = СуммаГодовойАмортизацииНУ / 12;

				Иначе
					
					КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, 
					                                                                 ВыборкаПоОС.ГрафикАмортизации, 
																					 ДатаРасчета);
					СуммаАмортизацииНУ       = СуммаГодовойАмортизацииНУ * КоэффициентАмортизации;

				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Производственный Тогда

			Если ОбъемПродукцииРаботДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан предполагаемый объем выработки!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний передбачуваний обсяг виробітку!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации),
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			СуммаАмортизации = АмортизируемаяСтоимость * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;
			
			СуммаАмортизацииНУ = АмортизируемаяСтоимостьНУ * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;

		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.УменьшенияОстатка Тогда

			Если ЛиквидационнаяСтоимость = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указана ликвидационная стоимость!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказана ліквідаційна вартість!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если Год(ВыборкаПоОС.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаВводаВЭксплуатацию)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
													   
			Если (ОсталосьЭксплуатироватьВЭтомГоду < 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = СтоимостьИтоговая * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизации,
				                                                       12 / СрокИспользованияДляВычисленияАмортизации));
																	   
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации   = СуммаГодовойАмортизации / 12;
				
			Иначе
				
				КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
				                                                                 ВыборкаПоОС.ГрафикАмортизации,
																				 ДатаРасчета);
				СуммаАмортизации       = СуммаГодовойАмортизации * КоэффициентАмортизации;
				
			КонецЕсли;

			Если НачислятьАмортизациюНУ Тогда
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				Если Год(ВыборкаПоОС.ПериодНУ) = Год(ДатаРасчета) Тогда
					
					СтоимостьИтоговаяНУ = ВыборкаПоОС.СтоимостьДляВычисленияАмортизацииНУ;
					
				Иначе
					
					СтоимостьИтоговаяНУ = ВыборкаПоОС.СтоимостьНаНачалоГодаНУ;
					
				КонецЕсли;
				
				Если ДатаВводаВЭксплуатациюНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				РазностьЛетНУ = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатациюНУ);
				
				Если РазностьЛетНУ > 0 Тогда
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ 
					                                   - РазностьЛетНУ * 12
					                                   + Месяц(ДатаВводаВЭксплуатациюНУ)
													   
				ИначеЕсли СрокИспользованияДляВычисленияАмортизацииНУ < 12 Тогда 
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ;
													   
				Иначе
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = 0;
													   
				КонецЕсли;
														   
				Если (ОсталосьЭксплуатироватьВЭтомГодуНУ < 12) И (ОсталосьЭксплуатироватьВЭтомГодуНУ > 0)  Тогда
					
					// Последний год применяем прямолинейный метод
					
					СуммаГодовойАмортизацииНУ = 12 * (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГодуНУ
					
				ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
					
					СуммаГодовойАмортизацииНУ = СтоимостьИтоговаяНУ * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизацииНУ,
					                                                       12 / СрокИспользованияДляВычисленияАмортизацииНУ));
																		   
				Иначе // Срок использования исчерпан
					
					СуммаГодовойАмортизацииНУ = 0;
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
				КонецЕсли;

				Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
					
					СуммаАмортизацииНУ   = СуммаГодовойАмортизацииНУ / 12;
					
				Иначе
					
					КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
					                                                                 ВыборкаПоОС.ГрафикАмортизации,
																					 ДатаРасчета);
					СуммаАмортизацииНУ       = СуммаГодовойАмортизацииНУ * КоэффициентАмортизации;
					
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.УскоренногоУменьшенияОстатка Тогда
			
			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если СрокИспользованияДляВычисленияАмортизации <= 24 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ зазначений строк корисного використання <¤3¤> міс.!"
"Для коректного нарахування амортизації строк використання повинен бути більше 24 місяців.'"),
					                                ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизации),);
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если Год(ВыборкаПоОС.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаВводаВЭксплуатацию)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду <= 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = 2 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизации * 12;
				
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации = СуммаГодовойАмортизации / 12;
				
			Иначе
				
				КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
				                                                                 ВыборкаПоОС.ГрафикАмортизации,
																				 ДатаРасчета);
				СуммаАмортизации        = СуммаГодовойАмортизации * КоэффициентАмортизации;
				
			КонецЕсли;
			
			Если НачислятьАмортизациюНУ Тогда
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ <= 24 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
	"Для корректного начисления амортизации срок использования должен быть более 24 месяца.';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ зазначений строк корисного використання <¤3¤> міс.!"
	"Для коректного нарахування амортизації строк використання повинен бути більше 24 місяців.'"),
						                                ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизации),);
						
					КонецЕсли;
					
				КонецЕсли; 
				
				Если Год(ВыборкаПоОС.ПериодНУ) = Год(ДатаРасчета) Тогда
					
					СтоимостьИтоговаяНУ = ВыборкаПоОС.СтоимостьДляВычисленияАмортизацииНУ;
					
				Иначе
					
					СтоимостьИтоговаяНУ = ВыборкаПоОС.СтоимостьНаНачалоГодаНУ;
					
				КонецЕсли;
				
				Если ДатаВводаВЭксплуатациюНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				РазностьЛетНУ = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатациюНУ);
				
				Если РазностьЛетНУ > 0 Тогда
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ 
					                                   - РазностьЛетНУ * 12
					                                   + Месяц(ДатаВводаВЭксплуатациюНУ)
													   
				ИначеЕсли СрокИспользованияДляВычисленияАмортизацииНУ < 12 Тогда											   
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ;
													   
				Иначе
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = 0;
													   
				КонецЕсли;
				
				Если (ОсталосьЭксплуатироватьВЭтомГодуНУ <= 12) И (ОсталосьЭксплуатироватьВЭтомГодуНУ > 0)  Тогда
					
					// Последний год применяем прямолинейный метод
					
					СуммаГодовойАмортизацииНУ = 12 * (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГодуНУ
					
				ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
					
					СуммаГодовойАмортизацииНУ = 2 * (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизацииНУ * 12;
					
				Иначе // Срок использования исчерпан
					
					СуммаГодовойАмортизацииНУ = 0;
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
						
					КонецЕсли;
				
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
					
					СуммаАмортизацииНУ = СуммаГодовойАмортизацииНУ / 12;
					
				Иначе
					
					КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
					                                                                 ВыборкаПоОС.ГрафикАмортизации,
																					 ДатаРасчета);
					СуммаАмортизацииНУ        = СуммаГодовойАмортизацииНУ * КоэффициентАмортизации;
					
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Кумулятивный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			ЧислоЛетПользования       = Макс(1,СрокИспользованияДляВычисленияАмортизации / 12);
			ЧислоЛетПользования       = ЧислоЛетПользования + ?(ЧислоЛетПользования 
			                                                    - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
			
			ГодИспользования          = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию) + 1;
			
			Если Месяц(ДатаВводаВЭксплуатацию) >= Месяц(ДатаРасчета) Тогда
				
				ГодИспользования	  = ГодИспользования - 1;
				
			КонецЕсли; 

			СуммаГодовойАмортизации   = АмортизируемаяСтоимость * (ЧислоЛетПользования - ГодИспользования + 1)
					/ (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
										  
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации = СуммаГодовойАмортизации / 12;

			Иначе
				
				КоэффициентАмортизации  = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
				                                                                  ВыборкаПоОС.ГрафикАмортизации,
																				  ДатаРасчета);
				СуммаАмортизации        = СуммаГодовойАмортизации * КоэффициентАмортизации;

			КонецЕсли;
			
			Если НачислятьАмортизациюНУ Тогда
					
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				Если ДатаВводаВЭксплуатациюНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ при розрахунку способом ¤2¤ не визначилася дата уведення в експлуатацію!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;

				ЧислоЛетПользования       = Макс(1,СрокИспользованияДляВычисленияАмортизацииНУ / 12);
				ЧислоЛетПользования       = ЧислоЛетПользования + ?(ЧислоЛетПользования 
				                                                    - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
				
				ГодИспользования          = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатациюНУ) + 1;
				
				Если Месяц(ДатаВводаВЭксплуатациюНУ) >= Месяц(ДатаРасчета) Тогда
					
					ГодИспользования	  = ГодИспользования - 1;
					
				КонецЕсли; 

				СуммаГодовойАмортизацииНУ   = АмортизируемаяСтоимостьНУ * (ЧислоЛетПользования - ГодИспользования + 1)
						/ (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
											  
				Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
					
					СуммаАмортизацииНУ = СуммаГодовойАмортизацииНУ / 12;

				Иначе
					
					КоэффициентАмортизации  = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
					                                                                  ВыборкаПоОС.ГрафикАмортизации,
																					  ДатаРасчета);
					СуммаАмортизацииНУ        = СуммаГодовойАмортизацииНУ * КоэффициентАмортизации;

				КонецЕсли;
			КонецЕсли;

			
			
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
			
			// Амортизация начисляется в документе ввод в эксплуатацию и документах выбытия
			Метод_50_50 = Истина;
			ЛиквидационнаяСтоимость = 0;
				
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС._100 Тогда

			// Амортизация начисляется в документе ввод в эксплуатацию
			Продолжить;
	
		Иначе 
			
			Если ВыдаватьСообщения  Тогда
			
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ установлен способ расчета амортизации, не поддерживаемый в бухгалтерском учете (¤2¤)!';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ встановлений спосіб розрахунку амортизації, який не підтримується у бухгалтерському обліку (¤2¤)!'"), ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации), 
								 Отказ);
			
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		Если НачислятьАмортизацию Тогда
			СуммаАмортизации = Макс(0, Мин(СуммаАмортизации, СтоимостьКонечныйОстаток - ЛиквидационнаяСтоимость));
		Иначе
			СуммаАмортизации = 0;
		КонецЕсли;

		Если НачислятьАмортизациюНУ Тогда
			СуммаАмортизацииНУ = Макс(0, Мин(СуммаАмортизацииНУ, СтоимостьКонечныйОстатокНУ - ЛиквидационнаяСтоимость));
		Иначе	
			СуммаАмортизацииНУ = 0;
		КонецЕсли;	
		
		СтрокаАмортизации = ТаблицаАмортизации.Добавить();

		СтрокаАмортизации.ОбъектУчета            = ВыборкаПоОС.ОсновноеСредство;
		СтрокаАмортизации.НаправлениеАмортизации = ВыборкаПоОС.СпособыОтраженияРасходовПоАмортизации;
		СтрокаАмортизации.НалоговоеНазначение 	 = ВыборкаПоОС.НалоговоеНазначение;
		СтрокаАмортизации.Местонахождение 		 = ВыборкаПоОС.Местонахождение;
    	СтрокаАмортизации.СчетУчета	             = ВыборкаПоОС.СчетУчета;
    	СтрокаАмортизации.СчетАмортизации	     = ВыборкаПоОС.СчетНачисленияАмортизации;
    	СтрокаАмортизации.Амортизация            = СуммаАмортизации;
    	СтрокаАмортизации.АмортизацияНУ          = СуммаАмортизацииНУ;
    	СтрокаАмортизации.Метод_50_50            = Метод_50_50;

		Если СтоимостьКонечныйОстаток > 0 Тогда
    		СтрокаАмортизации.СуммаПереоценкиПропорциональнаяАмортизации = ВыборкаПоОС.СуммаПереоценки * СуммаАмортизации / СтоимостьКонечныйОстаток;
		КонецЕсли;	
		СтрокаАмортизации.СчетУчетаДооценокОС = ВыборкаПоОС.СчетУчетаДооценокОС;
		Если НЕ ЗначениеЗаполнено(СтрокаАмортизации.СчетУчетаДооценокОС) Тогда 
			СтрокаАмортизации.СчетУчетаДооценокОС = ПланыСчетов.Хозрасчетный.ДооценкаОсновныхСредств; // По умолчанию 423.1
		КонецЕсли;	
		
		Если СуммаАмортизации = 0 И НачислятьАмортизацию И ВыдаватьСообщения И Не Метод_50_50 Тогда
			
			Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для основного средства ¤1¤ амортизация равна 0';uk='Бух. розрахунок амортизації: для основного засобу ¤1¤ амортизація дорівнює 0'"), ВыборкаПоОС.ОсновноеСредство));
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаАмортизации;

КонецФункции // РасчетАмортизацииБухРегл()

// Расчитывает сумму амортизации по указаному основному средству по упр учету
//
// Параметры
//  ОсновноеСредство                            - СправочникСсылка.ОсновныеСредства - ОС, по которому 
//                                                нужно рассчитать амортизацию.
//  ДатаРасчета                                 - Дата - Дата расчета амортизации
//
// Возвращаемое значение:
//   Число - Сумма начисленной амортизации
//
Функция РасчетАмортизацииУпр(ДатаРасчета,ОсновноеСредство = Неопределено, ВыдаватьСообщения = Истина, Отказ = Ложь) Экспорт

	ТаблицаАмортизации = Новый ТаблицаЗначений();

	ТаблицаАмортизации.Колонки.Добавить("ОбъектУчета");
	ТаблицаАмортизации.Колонки.Добавить("Амортизация", 				ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("НаправлениеАмортизации", 	Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТаблицаАмортизации.Колонки.Добавить("Метод_50_50"			, 	Новый ОписаниеТипов("Булево"));
	ТаблицаАмортизации.Колонки.Добавить("Местонахождение", 			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НачалоГода",    НачалоГода(ДатаРасчета));
	Запрос.УстановитьПараметр("НачалоКвартала",	НачалоКвартала(ДатаРасчета));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(ДатаРасчета));
	
	//СписокУпрощенныхМетодов = Новый Массив(2);
	//СписокУпрощенныхМетодов[0] = Перечисления.СпособыНачисленияАмортизацииОС._100;
	//СписокУпрощенныхМетодов[1] = Перечисления.СпособыНачисленияАмортизацииОС._50_50;
	//Запрос.УстановитьПараметр("СписокУпрощенныхМетодов", СписокУпрощенныхМетодов);
	Запрос.УстановитьПараметр("СостояниеВвода", Перечисления.СостоянияОС.ВведеноВЭксплуатацию);	
	
	Если ОсновноеСредство = Неопределено Тогда
		
		ТекстУсловия 	= "";
		ТекстУсловияГДЕ = "";
		
	Иначе
		
		Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
		ТекстУсловия 	= "ОсновноеСредство В (&ОсновноеСредство)";
		ТекстУсловияГДЕ = "И ОсновноеСредство В (&ОсновноеСредство)";
		
	КонецЕсли;

	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "СтоимостьОС");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период", 				Новый Диапазон(, КонецМесяца(ДатаРасчета))); 
		
		СтруктураИсточникаДанных = Неопределено;
		
		Если ОсновноеСредство <> Неопределено Тогда
			
			ЗапросОсновныхСредств = Новый Запрос;
			ЗапросОсновныхСредств.УстановитьПараметр("ВнешнийИсточник", ОсновноеСредство);
			ЗапросОсновныхСредств.Текст =
			"ВЫБРАТЬ
			|	ОсновныеСредства.Ссылка Как ОсновноеСредство
			|ИЗ 
			|	Справочник.ОсновныеСредства КАК ОсновныеСредства
			|ГДЕ
			|	ОсновныеСредства.Ссылка В(&ВнешнийИсточник)";
			ИсточникДанных = ЗапросОсновныхСредств.Выполнить();
			
			СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ИсточникДанных);
			
			СтруктураИсточникаДанных = Новый Структура("ОсновноеСредство", "ОсновноеСредство");
			
		КонецЕсли;	
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, СтруктураИсточникаДанных);
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияНУ_НаКонец.ОсновноеСредство 	КАК ОсновноеСредство,
	|	ЕСТЬNULL(НормыНалоговойАмортизацииНаКонец.Норма, 0) 	КАК Норма,
	|	СведенияОГруппахНаКонец.Период КАК Период,
	|	ЕСТЬNULL(СведенияОГруппахНаКонец.МинимальнаяСтоимостьОбъекта, 0) КАК МинимальнаяСтоимостьОбъекта
	|ПОМЕСТИТЬ
	|   ВТПервоначальныеСведенияНУ_НаКонец
	|ИЗ	
	| 	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	| 		&КонецПериода, " + ТекстУсловия + ") КАК ПервоначальныеСведенияНУ_НаКонец
	| 	ЛЕВОЕ СОЕДИНЕНИЕ 
	| 		РегистрСведений.НормыНалоговойАмортизацииОсновныхСредств.СрезПоследних(
	| 			&КонецПериода, ) КАК НормыНалоговойАмортизацииНаКонец
	| 	ПО ПервоначальныеСведенияНУ_НаКонец.НалоговаяГруппаОС = НормыНалоговойАмортизацииНаКонец.ГруппаОС
	| 	ЛЕВОЕ СОЕДИНЕНИЕ 
	| 		РегистрСведений.СведенияОГруппахОсновныхСредствНалоговыйУчет.СрезПоследних(
	| 			&КонецПериода, ) КАК СведенияОГруппахНаКонец
	| 	ПО ПервоначальныеСведенияНУ_НаКонец.НалоговаяГруппаОС = СведенияОГруппахНаКонец.ГруппаОС	
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияНУ_НаНачало.ОсновноеСредство 	КАК ОсновноеСредство,
	|	ЕСТЬNULL(НормыНалоговойАмортизацииНаНачало.Норма, 0) 	КАК Норма,
	|	СведенияОГруппахНаНачало.Период КАК Период,
	|	ЕСТЬNULL(СведенияОГруппахНаНачало.МинимальнаяСтоимостьОбъекта, 0) КАК МинимальнаяСтоимостьОбъекта
	|ПОМЕСТИТЬ
	|   ВТПервоначальныеСведенияНУ_НаНачало
	|ИЗ	
	| 	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|							                &НачалоПериода, " + ТекстУсловия + ") КАК ПервоначальныеСведенияНУ_НаНачало
	|							ЛЕВОЕ СОЕДИНЕНИЕ 
	|								РегистрСведений.НормыНалоговойАмортизацииОсновныхСредств.СрезПоследних(
	|								                &НачалоПериода, ) КАК НормыНалоговойАмортизацииНаНачало
	|							ПО ПервоначальныеСведенияНУ_НаНачало.НалоговаяГруппаОС = НормыНалоговойАмортизацииНаНачало.ГруппаОС
	|							ЛЕВОЕ СОЕДИНЕНИЕ 
	|								РегистрСведений.СведенияОГруппахОсновныхСредствНалоговыйУчет.СрезПоследних(
	|		                		                &НачалоПериода, ) КАК СведенияОГруппахНаНачало
	|							ПО ПервоначальныеСведенияНУ_НаНачало.НалоговаяГруппаОС = СведенияОГруппахНаНачало.ГруппаОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииНаКонец.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПараметрыАмортизацииНаНачало.Период ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНаКонец.СрокИспользованияДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНаНачало.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПараметрыАмортизацииНаНачало.Период ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНаКонец.СтоимостьДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНаНачало.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПараметрыАмортизацииНаНачало.Период ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНаКонец.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНаНачало.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПараметрыАмортизацииНаНачало.Период ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНаКонец.ЛиквидационнаяСтоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНаНачало.ЛиквидационнаяСтоимость, 0)
	|	КОНЕЦ КАК ЛиквидационнаяСтоимость,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПараметрыАмортизацииНаНачало.Период ЕСТЬ NULL
	|			ТОГДА ПараметрыАмортизацииНаКонец.Период
	|		ИНАЧЕ ПараметрыАмортизацииНаНачало.Период
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПервоначальныеСведенияНУ_НаНачало.Период ЕСТЬ NULL 
	|			ТОГДА ПервоначальныеСведенияНУ_НаКонец.Норма
	|		ИНАЧЕ ПервоначальныеСведенияНУ_НаНачало.Норма
	|	КОНЕЦ КАК НормаНалоговойАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииНаКонец.ПрименитьВТекущемМесяце
	|				ИЛИ ПервоначальныеСведенияНУ_НаНачало.Период ЕСТЬ NULL 
	|			ТОГДА ПервоначальныеСведенияНУ_НаКонец.МинимальнаяСтоимостьОбъекта
	|		ИНАЧЕ ПервоначальныеСведенияНУ_НаНачало.МинимальнаяСтоимостьОбъекта
	|	КОНЕЦ КАК МинимальнаяСтоимостьОбъекта
	|ПОМЕСТИТЬ
	|   ВТПараметрыАмортизации
	|		ИЗ
	|			РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних(&КонецПериода, 
	|			                " + ТекстУсловия + ") КАК ПараметрыАмортизацииНаКонец
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних(&НачалоПериода, 
	|					                " + ТекстУсловия + ") КАК ПараметрыАмортизацииНаНачало
	|					ЛЕВОЕ СОЕДИНЕНИЕ 
	|                       ВТПервоначальныеСведенияНУ_НаНачало КАК ПервоначальныеСведенияНУ_НаНачало
	|					ПО ПараметрыАмортизацииНаНачало.ОсновноеСредство = ПервоначальныеСведенияНУ_НаНачало.ОсновноеСредство
	|				ПО ПараметрыАмортизацииНаКонец.ОсновноеСредство = ПараметрыАмортизацииНаНачало.ОсновноеСредство
	|				ЛЕВОЕ СОЕДИНЕНИЕ
	|                       ВТПервоначальныеСведенияНУ_НаКонец КАК ПервоначальныеСведенияНУ_НаКонец
	|				ПО ПараметрыАмортизацииНаКонец.ОсновноеСредство = ПервоначальныеСведенияНУ_НаКонец.ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеАмортизацииОС.Период                             КАК ДатаПервойАмортизации,
	|	НачислениеАмортизацииОС.ОсновноеСредство                   КАК ОсновноеСредство,
	|	НачислениеАмортизацииОС.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВПервомМесяце
	|ПОМЕСТИТЬ
	|	ВТПервоеНачислениеАмортизации
	|ИЗ
	|		(ВЫБРАТЬ
	|			МИНИМУМ(НачислениеАмортизацииОС.Период)  КАК Период,
	|				НачислениеАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство
	|			ИЗ
	|				РегистрСведений.НачислениеАмортизацииОС КАК НачислениеАмортизацииОС
	|
	|			ГДЕ
	|				(НачислениеАмортизацииОС.НачислятьАмортизацию) " + ТекстУсловияГДЕ + "
	|			СГРУППИРОВАТЬ ПО НачислениеАмортизацииОС.ОсновноеСредство) КАК ДатыПервойАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НачислениеАмортизацииОС КАК НачислениеАмортизацииОС
	|		ПО ДатыПервойАмортизации.ОсновноеСредство = НачислениеАмортизацииОС.ОсновноеСредство 
	|		 И ДатыПервойАмортизации.Период = НачислениеАмортизацииОС.Период
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеОССрезПоследних.ОсновноеСредство  	КАК ОсновноеСредство,
	|	МестонахождениеОССрезПоследних.Местонахождение 		КАК Местонахождение                                      
	|ПОМЕСТИТЬ
	|   МестонахождениеОССрезПоследних
	|ИЗ
	|	РегистрСведений.МестонахождениеОС.СрезПоследних(&КонецПериода, " + ТекстУсловия + ") КАК МестонахождениеОССрезПоследних
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокАмортизируемыхОС.ОсновноеСредство                                            КАК ОсновноеСредство,
	|	ЕСТЬNULL(СтоимостьОС.АмортизацияОстаток, 0)                                        КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьОстаток, 0)                                          КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(Амортизация.АмортизацияОборот, 0)                                         КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СтоимостьОстаток, 0) 
	|		- ЕСТЬNULL(СтоимостьНачалоГода.АмортизацияОстаток, 0)                          КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СтоимостьОстаток, 0) 
	|		- ЕСТЬNULL(СтоимостьНачалоКвартала.АмортизацияОстаток, 0)                      КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(ВыработкаОСОбороты.КоличествоОборот, 0)                                   КАК ТекущийОбъемПродукцииРабот,
	|	МестонахождениеОССрезПоследних.Местонахождение                                     КАК Местонахождение,
	|	ГрафикиАмортизацииСрезПоследних.ГрафикАмортизации                                  КАК ГрафикАмортизации,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации      КАК СпособыОтраженияРасходовПоАмортизации,
	|	ПервоначальныеСведенияОбОсновныхСредствахСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации, 0)        КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации, 0)                КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации                   КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.ЛиквидационнаяСтоимость, 0)                          КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.Период                                                        КАК Период,
	|	ПервоеНачислениеАмортизации.ДатаПервойАмортизации                                  КАК ДатаПервойАмортизации,
	|	ПервоеНачислениеАмортизации.НачислятьАмортизациюВПервомМесяце                      КАК НачислятьАмортизациюВПервомМесяце,
	|	ЕСТЬNULL(ПараметрыАмортизации.НормаНалоговойАмортизации, 0)                        КАК НормаНалоговойАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизации.МинимальнаяСтоимостьОбъекта, 0)                      КАК МинимальнаяСтоимостьОбъекта,
	|	СостоянияОС.ДатаСостояния                                                          КАК ДатаВводаВЭксплуатацию
	|ИЗ
	|		РегистрСведений.НачислениеАмортизацииОС.СрезПоследних(&КонецПериода, " + ТекстУсловия + ")
	|		                КАК СписокАмортизируемыхОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.НачислениеАмортизацииОС.СрезПоследних(&НачалоПериода, " + ТекстУсловия + ")
	|		    	            КАК СписокАмортизируемыхОСНаНачало
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СписокАмортизируемыхОСНаНачало.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.СтоимостьОС.Остатки(&КонецПериода, " + ТекстУсловия + ") КАК СтоимостьОС
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.СтоимостьОС.Обороты(&НачалоПериода, 
	|			                  &КонецПериода, , " + ТекстУсловия + ") КАК Амортизация
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = Амортизация.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ГрафикиАмортизацииОС.СрезПоследних(&КонецПериода, " + ТекстУсловия + ")
	|			                КАК ГрафикиАмортизацииСрезПоследних
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = ГрафикиАмортизацииСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(
	|			                &КонецПериода, " + ТекстУсловия + ") КАК СпособыОтраженияРасходовПоАмортизацииУУ
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииУУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(
	|			                &КонецПериода, " + ТекстУсловия + "
	|			                ) КАК ПервоначальныеСведенияОбОсновныхСредствахСрезПоследних
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = ПервоначальныеСведенияОбОсновныхСредствахСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.ВыработкаОС.Обороты(&НачалоПериода, 
	|			                  &КонецПериода, , " + ТекстУсловия + ") КАК ВыработкаОСОбороты
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = ВыработкаОСОбороты.ОсновноеСредство 
	|		 И ПервоначальныеСведенияОбОсновныхСредствахСрезПоследних.ПараметрВыработки = ВыработкаОСОбороты.ПараметрВыработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВТПараметрыАмортизации КАК ПараметрыАмортизации
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = ПараметрыАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьОС.Остатки(
	|			                  &НачалоГода, " + ТекстУсловия + ") КАК СтоимостьНачалоГода
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СтоимостьНачалоГода.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьОС.Остатки(
	|			                  &НачалоКвартала, " + ТекстУсловия + ") КАК СтоимостьНачалоКвартала
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СтоимостьНачалоКвартала.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	| 			ВТПервоеНачислениеАмортизации КАК ПервоеНачислениеАмортизации
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = ПервоеНачислениеАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОС КАК СостоянияОС
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|			И (СостоянияОС.Состояние = &СостояниеВвода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОССрезПоследних
	|		ПО СписокАмортизируемыхОС.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	|
	|ГДЕ
	|	// для тех ОС, у которых признак начисления менялся в течение месяца, смотрим на НачислятьАмортизациюВТекущемМесяце
	|	// для остальных смотрим НачислятьАмортизацию
	|	(ВЫБОР 
	|		КОГДА СписокАмортизируемыхОС.Период >= &НачалоПериода 
	|			ТОГДА СписокАмортизируемыхОС.НачислятьАмортизациюВТекущемМесяце
	|			      //ИЛИ ПервоначальныеСведенияОбОсновныхСредствахСрезПоследних.СпособНачисленияАмортизации В (&СписокУпрощенныхМетодов)
	|		ИНАЧЕ СписокАмортизируемыхОСНаНачало.НачислятьАмортизацию 
	|	 КОНЕЦ)	
	|";
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТипГодовой  = Тип ("СправочникСсылка.ГодовыеГрафикиАмортизацииОС");

	ТаблицаГрафиков = ПолучитьТаблицуГрафиков();

	Пока ВыборкаПоОС.Следующий() Цикл
		
		//Если НЕ ВыборкаПоОС.ПодлежитАмортизации Тогда
		//	
		//	Если ВыдаватьСообщения Тогда
		//		
		//		ОбщегоНазначения.СообщитьИнформацию("Упр. расчет амортизации: основное средство " 
		//						   + ВыборкаПоОС.ОсновноеСредство 
		//						   + " не подлежит амортизации!");
		//		
		//	КонецЕсли;
		//	
		//	Продолжить;
		//	
		//КонецЕсли;

		Если (ВыборкаПоОС.АмортизацияОборот <> 0) И (ВыборкаПоОС.АмортизацияОборот <> Null) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьИнформацию("Упр. расчет амортизации: для основного средства " 
				                   + ВыборкаПоОС.ОсновноеСредство 
								   + " амортизация в этом месяце уже начислялась");
				
			КонецЕсли;
			
			Продолжить; // по указанному ОС в этом месяце уже начисляли амортизацию 
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.СпособНачисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства "
				                 + ВыборкаПоОС.ОсновноеСредство + " не указан способ амортизации",
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.СтоимостьДляВычисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
				                 + ВыборкаПоОС.ОсновноеСредство + " стоимость равна 0",
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		СуммаАмортизации = 0;
		Метод_50_50      = Ложь;
		
		СтоимостьДляВычисленияАмортизации 			= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.СтоимостьДляВычисленияАмортизации);
		ЛиквидационнаяСтоимость						= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.ЛиквидационнаяСтоимость);
		АмортизируемаяСтоимость	 					= СтоимостьДляВычисленияАмортизации - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизации	= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.СрокИспользованияДляВычисленияАмортизации);
		ТекущийОбъемПродукцииРабот					= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.ТекущийОбъемПродукцииРабот);
		ОбъемПродукцииРаботДляВычисленияАмортизации	= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.ОбъемПродукцииРаботДляВычисленияАмортизации);
		НормаНалоговойАмортизации					= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.НормаНалоговойАмортизации);
		
		АмортизацияКонечныйОстаток					= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.АмортизацияКонечныйОстаток);
		СтоимостьКонечныйОстаток					= ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаПоОС.СтоимостьКонечныйОстаток);
		ОстаточнаяСтоимость                         = СтоимостьКонечныйОстаток - АмортизацияКонечныйОстаток;
		НачислятьАмортизациюВПервомМесяце	        = (ВыборкаПоОС.НачислятьАмортизациюВПервомМесяце = Истина);
		ДатаВводаВЭксплуатацию                      = ВыборкаПоОС.ДатаВводаВЭксплуатацию;
	
		Если НачислятьАмортизациюВПервомМесяце И (ДатаВводаВЭксплуатацию <> Null) Тогда
			
			//Дата ввода в эксплуатацию для срока использования
			//сдвигается на месяц назад
			
			ДатаВводаВЭксплуатацию = ДобавитьМесяц(ВыборкаПоОС.ДатаВводаВЭксплуатацию, -1);
			
		КонецЕсли;
		
		Если (ЛиквидационнаяСтоимость <> 0) 
		   И (ЛиквидационнаяСтоимость >= ОстаточнаяСтоимость) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьИнформацию(Локализация.СтрШаблон1("Упр. расчет амортизации: остаточная стоимость основного средства ¤1¤ достигла ликвидационной <¤2¤>, амортизация не начислена.", ВыборкаПоОС.ОсновноеСредство, ЛиквидационнаяСтоимость));
				
			КонецЕсли;
			
            Продолжить;
			
		КонецЕсли;
		
		
		Если ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Прямолинейный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указан срок полезного использования!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			СуммаГодовойАмортизации = АмортизируемаяСтоимость / СрокИспользованияДляВычисленияАмортизации * 12;

			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации   = СуммаГодовойАмортизации / 12;

			Иначе
				
				КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков,
				                                                                 ВыборкаПоОС.ГрафикАмортизации,
																				 ДатаРасчета);
																				 //ТипГодовой);
				СуммаАмортизации       = СуммаГодовойАмортизации * КоэффициентАмортизации;

			КонецЕсли;

		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Производственный Тогда

			Если ОбъемПродукцииРаботДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указан предполагаемый объем выработки!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			СуммаАмортизации = АмортизируемаяСтоимость * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;

		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.УменьшенияОстатка Тогда

			Если ЛиквидационнаяСтоимость = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указана ликвидационная стоимость!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтоимостьДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства "
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указана первоначальная стоимость!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указан срок полезного использования!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если Год(ВыборкаПоОС.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			СтоимостьИтоговая = ОбщегоНазначения.ПреобразоватьВЧисло(СтоимостьИтоговая);
			
 			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " + ВыборкаПоОС.ОсновноеСредство
					                 + " при расчете по способу " + ВыборкаПоОС.СпособНачисленияАмортизации
							         + " не определилась дата ввода в эксплуатацию!", Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаВводаВЭксплуатацию)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
													   
			Если (ОсталосьЭксплуатироватьВЭтомГоду < 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = СтоимостьИтоговая * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизации,
				                                                       12 / СрокИспользованияДляВычисленияАмортизации));
																	   
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!", ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации   = СуммаГодовойАмортизации / 12;
				
			Иначе
				
				КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, 
				                                                                 ВыборкаПоОС.ГрафикАмортизации,
																				 ДатаРасчета); 
																				 //ТипГодовой);
				СуммаАмортизации        = СуммаГодовойАмортизации * КоэффициентАмортизации;
				
			КонецЕсли;

		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.УскоренногоУменьшенияОстатка Тогда
			
			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации 
									 + " не указан срок полезного использования!", 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если СрокИспользованияДляВычисленияАмортизации <= 24 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.",
					ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизации),);
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если Год(ВыборкаПоОС.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьДляВычисленияАмортизации;
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоОС.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			СтоимостьИтоговая = ОбщегоНазначения.ПреобразоватьВЧисло(СтоимостьИтоговая);
			
			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!", ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаВводаВЭксплуатацию)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду <= 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = 2 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизации * 12;
				
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для основного средства ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!", ВыборкаПоОС.ОсновноеСредство, ВыборкаПоОС.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации   = СуммаГодовойАмортизации / 12;
				
			Иначе
				
				КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, 
				                                                                 ВыборкаПоОС.ГрафикАмортизации,
																				 ДатаРасчета);
																				 //ТипГодовой);
				СуммаАмортизации        = СуммаГодовойАмортизации * КоэффициентАмортизации;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Кумулятивный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " 
					                 + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " 
									 + ВыборкаПоОС.СпособНачисленияАмортизации + " не указан срок полезного использования!",
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если ДатаВводаВЭксплуатацию = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьИнформацию("Упр. расчет амортизации: для основного средства " + ВыборкаПоОС.ОсновноеСредство + " при расчете по способу " + ВыборкаПоОС.СпособНачисленияАмортизации +  " не определилась дата ввода в эксплуатацию!");
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			ЧислоЛетПользования       = Макс(1, СрокИспользованияДляВычисленияАмортизации / 12);
			ЧислоЛетПользования       = ЧислоЛетПользования 
			                            + ?(ЧислоЛетПользования - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
			
			ГодИспользования          = Год(ДатаРасчета) - Год(ДатаВводаВЭксплуатацию) + 1;
			
			Если Месяц(ДатаВводаВЭксплуатацию) >= Месяц(ДатаРасчета) Тогда
				
				ГодИспользования	  = ГодИспользования - 1;
				
			КонецЕсли; 

			СуммаГодовойАмортизации   = АмортизируемаяСтоимость * (ЧислоЛетПользования - ГодИспользования + 1)
					                    / (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
										  
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОС.ГрафикАмортизации) Тогда
				
				СуммаАмортизации = СуммаГодовойАмортизации / 12;

			Иначе
				
				КоэффициентАмортизации  = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, 
				                                                                  ВыборкаПоОС.ГрафикАмортизации, 
				                                                                  ДатаРасчета);
																				  //ТипГодовой);
				СуммаАмортизации        = СуммаГодовойАмортизации * КоэффициентАмортизации;

			КонецЕсли;

		//ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.ПоИндивидуальномуГрафику Тогда

		//	КоэффициентАмортизации = ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, ВыборкаПоОС.ГрафикАмортизации, ДатаРасчета);//, ТипГодовой);

		//	СуммаАмортизации = АмортизируемаяСтоимость * КоэффициентАмортизации;



		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
			
			СуммаАмортизации =  Макс(0, Мин(АмортизацияКонечныйОстаток, АмортизируемаяСтоимость-АмортизацияКонечныйОстаток));
			
			Метод_50_50 = Истина;
			
			ЛиквидационнаяСтоимость = 0;
			
		ИначеЕсли ВыборкаПоОС.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС._100 Тогда

			// При первом же начислении амортизации - 100%
			// Стоимость всегда должна быть полностью амортизирована
			СуммаАмортизации = ОстаточнаяСтоимость;
			
			Если СуммаАмортизации <= 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЛиквидационнаяСтоимость = 0;
			
		Иначе 
			
			Если ВыдаватьСообщения Тогда
			
				ОбщегоНазначения.СообщитьОбОшибке("Упр. расчет амортизации: для основного средства " + ВыборкаПоОС.ОсновноеСредство
				                 + " установлен способ расчета амортизации, не поддерживаемый в управленческом учете (" 
								 + ВыборкаПоОС.СпособНачисленияАмортизации +  ")!", Отказ);
			
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

 		СуммаАмортизации = Макс(0, Мин(СуммаАмортизации, ОстаточнаяСтоимость - ЛиквидационнаяСтоимость));

		СтрокаАмортизации = ТаблицаАмортизации.Добавить();

		СтрокаАмортизации.ОбъектУчета			 = ВыборкаПоОС.ОсновноеСредство;
		СтрокаАмортизации.НаправлениеАмортизации = ВыборкаПоОС.СпособыОтраженияРасходовПоАмортизации;
		СтрокаАмортизации.Местонахождение 		 = ВыборкаПоОС.Местонахождение;
		СтрокаАмортизации.Амортизация            = СуммаАмортизации;
    	СтрокаАмортизации.Метод_50_50            = Метод_50_50;

		Если СуммаАмортизации = 0 И ВыдаватьСообщения И Не Метод_50_50 Тогда
			
			ОбщегоНазначения.СообщитьИнформацию("Упр. расчет амортизации: для основного средства " + ВыборкаПоОС.ОсновноеСредство + " амортизация равна 0");
			
		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаАмортизации;

КонецФункции // РасчетАмортизацииУпр()

// Получает сводную таблицу графиков - годовых и индивидуальных одним запросом - чтобы потом можно было 
// данные ез нее дергать, а не лазить в справочник за каждым значеним
//
Функция ПолучитьТаблицуГрафиков()

	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка КАК График,
	|	Коэффициент1,
	|	Коэффициент2,
	|	Коэффициент3,
	|	Коэффициент4,
	|	Коэффициент5,
	|	Коэффициент6,
	|	Коэффициент7,
	|	Коэффициент8,
	|	Коэффициент9,
	|	Коэффициент10,
	|	Коэффициент11,
	|	Коэффициент12,
	|	ВЫРАЗИТЬ((Коэффициент1
	|	         + Коэффициент2
	|	         + Коэффициент3
	|	         + Коэффициент4
	|	         + Коэффициент5
	|	         + Коэффициент6
	|	         + Коэффициент7
	|	         + Коэффициент8
	|	         + Коэффициент9
	|	         + Коэффициент10
	|	         + Коэффициент11
	|	         + Коэффициент12) КАК ЧИСЛО(15,5)) КАК СуммаКоэффициентов
	|ИЗ
	|	Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьТаблицуГрафиков

Функция ПолучитьКоэффициентАмортизацииИзГрафика(ТаблицаГрафиков, График, ДатаРасчета)

	КоэффициентАммортизации = 0;

	СтрокаТЧ = ТаблицаГрафиков.Найти(График, "График");
	Если СтрокаТЧ = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	СуммаВсех   = СтрокаТЧ.СуммаКоэффициентов;
	СуммаОдного = СтрокаТЧ["Коэффициент" + Месяц(ДатаРасчета)];

	КоэффициентАммортизации = СуммаОдного / ?(СуммаВсех = 0 ИЛИ СуммаВсех = NULL, 1, СуммаВсех);

	Возврат КоэффициентАммортизации;

КонецФункции // ПолучитьКоэффициентАмортизацииИзГрафика()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАСЧЕТА АМОРТИЗАЦИИ НМА

// Расчитывает сумму амортизации по указаному Нематериальному активу по упр учету
//
// Параметры
//  НематериальныйАктив                         - СправочникСсылка.НематериальныеАктивы - НА, по которому 
//                                                нужно рассчитать амортизацию.
//  ДатаРасчета                                 - Дата - Дата расчета амортизации
//
// Возвращаемое значение:
//   ТаблицаЗначений начисленной амортизации
//
Функция РасчетАмортизацииНМАУпр(ДатаРасчета, НематериальныйАктив = Неопределено,
	                                ВыдаватьСообщения = Истина, Отказ = Ложь) Экспорт


	ТаблицаАмортизации = Новый ТаблицаЗначений();

	ТаблицаАмортизации.Колонки.Добавить("ОбъектУчета"           , Новый ОписаниеТипов("СправочникСсылка.НематериальныеАктивы"));
	ТаблицаАмортизации.Колонки.Добавить("НаправлениеАмортизации", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТаблицаАмортизации.Колонки.Добавить("Амортизация"			, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("Местонахождение",			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НачалоГода",    НачалоГода(ДатаРасчета));
	Запрос.УстановитьПараметр("НачалоКвартала",	НачалоКвартала(ДатаРасчета));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("НачалоПериода200911" , Дата(2009,11,01));
	Запрос.УстановитьПараметр("СостояниеВвода", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	
	//Запрос.УстановитьПараметр("Списан", Перечисления.ВидыСостоянийНМА.Списан);
	
	//СписокУпрощенныхМетодов = Новый Массив(2);
	//СписокУпрощенныхМетодов[0] = Перечисления.СпособыНачисленияАмортизацииОС._100;
	//СписокУпрощенныхМетодов[1] = Перечисления.СпособыНачисленияАмортизацииОС._50_50;
	//Запрос.УстановитьПараметр("СписокУпрощенныхМетодов", СписокУпрощенныхМетодов);
	
	Если НематериальныйАктив = Неопределено Тогда
		
		ТекстУсловия 	= "";
		ТекстУсловияГДЕ = "";
		
	Иначе
		
		Запрос.УстановитьПараметр("СписокНМА", НематериальныйАктив);
		ТекстУсловия 	= "НематериальныйАктив В (&СписокНМА)";
		ТекстУсловияГДЕ = "И НачислениеАмортизации.НематериальныйАктив В (&СписокНМА)";
		
	КонецЕсли;
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "СтоимостьНМА");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период", 				Новый Диапазон(, КонецМесяца(ДатаРасчета))); 
		
		Если НематериальныйАктив <> Неопределено Тогда
			ЗначенияБлокировки.Вставить("НематериальныйАктив", НематериальныйАктив); 
		КонецЕсли;	
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,);
		
	КонецЕсли;
	
	Запрос.Текст =
	"
	|ВЫБРАТЬ
	|	СостоянияНМА.НематериальныйАктив  			КАК НематериальныйАктив,
	|	СостоянияНМА.Период  						КАК ДатаСостояния
	|ПОМЕСТИТЬ
	|   СписокНМАПринятыхВТекущемМесяце
	|ИЗ	
	|	РегистрСведений.СостоянияНМА КАК СостоянияНМА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(
	|		            &КонецПериода,
	|		            " + ТекстУсловия + ") КАК НачислениеАмортизации
	|	ПО НачислениеАмортизации.НематериальныйАктив = СостоянияНМА.НематериальныйАктив
	|		И (НачислениеАмортизации.НачислятьАмортизацию)
	|		И СостоянияНМА.Состояние = &СостояниеВвода
	|		И (СостоянияНМА.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|		И (СостоянияНМА.Период > &НачалоПериода200911)
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив                         КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                 КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования                  КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     КАК СтоимостьДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.Период                                      КАК Период,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьОстаток, 0)                                          
	|		- ЕСТЬNULL(СтоимостьНМА.АмортизацияОстаток, 0) 					   КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СтоимостьОстаток, 0) 
	|		- ЕСТЬNULL(СтоимостьНачалоГода.АмортизацияОстаток, 0)          	   КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СтоимостьОстаток, 0) 
	|		- ЕСТЬNULL(СтоимостьНачалоКвартала.АмортизацияОстаток, 0)          КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(ВыработкаНМА.КоличествоОборот, 0)                         КАК ТекущийОбъемПродукцииРабот,
	|	МестонахождениеНМА.Местонахождение                                 КАК Местонахождение,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов                   КАК СпособыОтраженияРасходовПоАмортизации,
	|	ЕСТЬNULL(Амортизация.АмортизацияОборот, 0)                         КАК АмортизацияОборот,
	|	ПерваяАмортизация.ДатаПервойАмортизации                            КАК ДатаПервойАмортизации
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(
	|		            &НачалоПериода,
	|		            " + ТекстУсловия + ") КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|			РегистрНакопления.ВыработкаНМА.Обороты(
	|			                  &НачалоПериода,
	|			                  &КонецПериода, ,
	|			                  " + ТекстУсловия + ") КАК ВыработкаНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ВыработкаНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.СтоимостьНМА.Остатки(&КонецПериода, " + ТекстУсловия + ") КАК СтоимостьНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьНМА.Остатки(
	|			                  &НачалоГода, " + ТекстУсловия + ") КАК СтоимостьНачалоГода
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНачалоГода.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьНМА.Остатки(
	|			                  &НачалоКвартала, " + ТекстУсловия + ") КАК СтоимостьНачалоКвартала
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНачалоКвартала.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеНМА.СрезПоследних(
	|			                &НачалоПериода, " + ТекстУсловия + ") КАК МестонахождениеНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМА.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    " + ТекстУсловия + ") КАК СпособыОтраженияРасходов
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СпособыОтраженияРасходов.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.СтоимостьНМА.Обороты(&НачалоПериода, 
	|			                  &КонецПериода, , " + ТекстУсловия + ") КАК Амортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = Амортизация.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				НачислениеАмортизации.НематериальныйАктив КАК НематериальныйАктив,
	|				МИНИМУМ(НачислениеАмортизации.Период)  КАК ДатаПервойАмортизации
	|			ИЗ
	|				РегистрСведений.ПервоначальныеСведенияНМА КАК НачислениеАмортизации
	|			ГДЕ
	|				НачислениеАмортизации.НачислятьАмортизацию
	|				" + ТекстУсловияГде + "
	|		
	|			СГРУППИРОВАТЬ ПО
	|				НачислениеАмортизации.НематериальныйАктив) КАК ПерваяАмортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ПерваяАмортизация.НематериальныйАктив
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив 				КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                 	КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования                  	КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     	КАК СтоимостьДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации 	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ЛиквидационнаяСтоимость                     	КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.Период                                      	КАК Период,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     	КАК СтоимостьКонечныйОстаток,
	|	0            													   	КАК СтоимостьНаНачалоГода,
	|	0        														   	КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(ВыработкаНМА.КоличествоОборот, 0)                         	КАК ТекущийОбъемПродукцииРабот,
	|	МестонахождениеНМА.Местонахождение                                 КАК Местонахождение,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов                   	КАК СпособыОтраженияРасходовПоАмортизации,
	|	ЕСТЬNULL(Амортизация.АмортизацияОборот, 0)                    		КАК АмортизацияОборот,
	|	NULL                            									КАК ДатаПервойАмортизации
	|ИЗ
	|	СписокНМАПринятыхВТекущемМесяце
	|	ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|		РегистрСведений.ПервоначальныеСведенияНМА.СрезПервых(
	|			&НачалоПериода,
	|		    НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК ПервоначальныеСведения
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = ПервоначальныеСведения.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|		РегистрНакопления.ВыработкаНМА.Обороты(
	|	        &НачалоПериода,
	|	        &КонецПериода, ,
	|	        НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК ВыработкаНМА
	|	ПО ПервоначальныеСведения.НематериальныйАктив = ВыработкаНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеНМА.СрезПервых(
	|			                &НачалоПериода, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК МестонахождениеНМА
	|		ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМА.СрезПервых(
	|	                    &НачалоПериода,
	|	                    НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК СпособыОтраженияРасходов
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = СпособыОтраженияРасходов.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.СтоимостьНМА.Обороты(&НачалоПериода, 
	|		                  &КонецПериода, , НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК Амортизация
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = Амортизация.НематериальныйАктив
	| ГДЕ ПервоначальныеСведения.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Производственный)
	|";
	ВыборкаПоНМА = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоНМА.Следующий() Цикл
		
		Если (ВыборкаПоНМА.АмортизацияОборот > 0) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ амортизация в этом месяце уже начислялась", ВыборкаПоНМА.НематериальныйАктив));
				
			КонецЕсли;
			
			Продолжить; // по указанному НМА в этом месяце уже начисляли амортизацию 
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоНМА.СпособНачисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ не указан способ амортизации", ВыборкаПоНМА.НематериальныйАктив),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ стоимость для вычисления амортизации равна 0", ВыборкаПоНМА.НематериальныйАктив),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		СуммаАмортизации = 0;
		
		СтоимостьДляВычисленияАмортизации 			= ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
		ЛиквидационнаяСтоимость						= ВыборкаПоНМА.ЛиквидационнаяСтоимость;
		АмортизируемаяСтоимость	 					= СтоимостьДляВычисленияАмортизации - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизации	= ВыборкаПоНМА.СрокИспользованияДляВычисленияАмортизации;
		ТекущийОбъемПродукцииРабот					= ВыборкаПоНМА.ТекущийОбъемПродукцииРабот;
		ОбъемПродукцииРаботДляВычисленияАмортизации	= ВыборкаПоНМА.ОбъемПродукцииРаботДляВычисленияАмортизации;
		ДатаПервойАмортизации                       = ВыборкаПоНМА.ДатаПервойАмортизации;
		
		СтоимостьКонечныйОстаток					= ВыборкаПоНМА.СтоимостьКонечныйОстаток;
		
		Если (ЛиквидационнаяСтоимость <> 0) 
		   И (ЛиквидационнаяСтоимость >= СтоимостьКонечныйОстаток) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьИнформацию(Локализация.СтрШаблон1("Упр. расчет амортизации: остаточная стоимость нематериального актива ¤1¤ достигла ликвидационной <¤2¤>, амортизация не начислена.",
				                             ВыборкаПоНМА.НематериальныйАктив, ЛиквидационнаяСтоимость));
				
			КонецЕсли;
			
            Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Прямолинейный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!",
					                           ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			СуммаАмортизации = АмортизируемаяСтоимость / СрокИспользованияДляВычисленияАмортизации;

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Производственный Тогда

			Если ОбъемПродукцииРаботДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан предполагаемый объем выработки!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации),
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			СуммаАмортизации = АмортизируемаяСтоимость * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшенияОстатка Тогда

			Если ЛиквидационнаяСтоимость = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указана ликвидационная стоимость!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если Год(ВыборкаПоНМА.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаПервойАмортизации);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаПервойАмортизации)
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду < 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = СтоимостьИтоговая * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизации,
				                                                       12 / СрокИспользованияДляВычисленияАмортизации));
				
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			СуммаАмортизации  = СуммаГодовойАмортизации / 12;

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УскоренногоУменьшенияОстатка Тогда
			
			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если СрокИспользованияДляВычисленияАмортизации <= 24 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.",
					ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизации),);
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если Год(ВыборкаПоНМА.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаПервойАмортизации);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаПервойАмортизации)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду <= 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = 2 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизации * 12;
				
			Иначе // Срок использования исчерпан
				
				СуммаАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			СуммаАмортизации  = СуммаГодовойАмортизации / 12;
			
		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Кумулятивный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата первой амортизации!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			ЧислоЛетПользования       = Макс(1,СрокИспользованияДляВычисленияАмортизации / 12);
			ЧислоЛетПользования       = ЧислоЛетПользования + ?(ЧислоЛетПользования 
			                                                    - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
			
			ГодИспользования          = Год(ДатаРасчета) - Год(ДатаПервойАмортизации) + 1;
			
			Если Месяц(ДатаПервойАмортизации) >= Месяц(ДатаРасчета) Тогда
				
				ГодИспользования	  = ГодИспользования - 1;
				
			КонецЕсли; 

			СуммаГодовойАмортизации   = АмортизируемаяСтоимость * (ЧислоЛетПользования - ГодИспользования + 1)
					/ (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
				
			СуммаАмортизации = СуммаГодовойАмортизации / 12;
	
		Иначе 
			
			Если ВыдаватьСообщения  Тогда
			
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ установлен способ расчета амортизации, не поддерживаемый в бухгалтерском учете (¤2¤)!", ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
								 Отказ);
			
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		СуммаАмортизации  = Макс(0, Мин(СуммаАмортизации, СтоимостьКонечныйОстаток - ЛиквидационнаяСтоимость));

		СтрокаАмортизации = ТаблицаАмортизации.Добавить();

		СтрокаАмортизации.ОбъектУчета            = ВыборкаПоНМА.НематериальныйАктив;
		СтрокаАмортизации.НаправлениеАмортизации = ВыборкаПоНМА.СпособыОтраженияРасходовПоАмортизации;
    	СтрокаАмортизации.Амортизация            = СуммаАмортизации;
		СтрокаАмортизации.Местонахождение 		 = ВыборкаПоНМА.Местонахождение;

		Если СуммаАмортизации = 0 И ВыдаватьСообщения Тогда
			
			Сообщить(Локализация.СтрШаблон1("Упр. расчет амортизации: для нематериального актива ¤1¤ амортизация равна 0", ВыборкаПоНМА.НематериальныйАктив));
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаАмортизации;

КонецФункции // РасчетАмортизацииНМАУпр()

// Расчитывает сумму амортизации по указаному Нематериальному активу по бух/нал учету
//
// Параметры
//  НематериальныйАктив                         - СправочникСсылка.НематериальныеАктивы - НА, по которому 
//                                                нужно рассчитать амортизацию.
//  ДатаРасчета                                 - Дата - Дата расчета амортизации
//
// Возвращаемое значение:
//   ТаблицаЗначений начисленной амортизации
//
Функция РасчетАмортизацииНМАРегл(ДатаРасчета, Организация, НематериальныйАктив = Неопределено,
	                                ВыдаватьСообщения = Истина, Отказ = Ложь) Экспорт


	ТаблицаАмортизации = Новый ТаблицаЗначений();

	ТаблицаАмортизации.Колонки.Добавить("ОбъектУчета"           , Новый ОписаниеТипов("СправочникСсылка.НематериальныеАктивы"));
	ТаблицаАмортизации.Колонки.Добавить("СчетУчета"     		, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаАмортизации.Колонки.Добавить("СчетАмортизации"    	, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаАмортизации.Колонки.Добавить("НаправлениеАмортизации", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТаблицаАмортизации.Колонки.Добавить("Амортизация"			, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("АмортизацияНУ"			, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаАмортизации.Колонки.Добавить("НалоговоеНазначение"	, Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаАмортизации.Колонки.Добавить("Местонахождение", 			Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоГода"    , НачалоГода(ДатаРасчета));
	СтруктураПараметров.Вставить("НачалоКвартала", НачалоКвартала(ДатаРасчета));
	СтруктураПараметров.Вставить("НачалоПериода" , НачалоМесяца(ДатаРасчета));
	СтруктураПараметров.Вставить("КонецПериода"  , КонецМесяца(ДатаРасчета));
	СтруктураПараметров.Вставить("Организация"   , Организация);
	СтруктураПараметров.Вставить("НачалоПериода200911" , Дата(2009,11,01));
	
	Если НематериальныйАктив = Неопределено Тогда
		
		ТекстУсловия 	= "";
		
		ТекстУсловияПроизводственные 	= "";
		
	Иначе
		
		СтруктураПараметров.Вставить("СписокНМА", НематериальныйАктив);
		ТекстУсловия 	= "И НематериальныйАктив В (&СписокНМА)";
		
		ТекстУсловияПроизводственные 	= "И НематериальныйАктив В (&СписокНМАПроизводственные)";
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Списан", Перечисления.ВидыСостоянийНМА.Списан);
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""СписокНМА""                             КАК ТипЗаписи,
	|	НачислениеАмортизации.НематериальныйАктив КАК Поле
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация И НематериальныйАктив В
	|	                (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	                 	СостояниеНМА.НематериальныйАктив
	|	                 ИЗ	РегистрСведений.СостоянияНМАОрганизаций.СрезПоследних(&НачалоПериода,
	|	                 	                Организация = &Организация " + ТекстУсловия + ") КАК СостояниеНМА
	|	                 ГДЕ
	|	                 	СостояниеНМА.Состояние <> &Списан)) КАК НачислениеАмортизации
	|ГДЕ
	|	НачислениеАмортизации.НачислятьАмортизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчетаНачалоГода"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоГода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчетаНачалоКвартала"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоКвартала,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизацииНачалоГода"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоГода,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизацииНачалоКвартала"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоКвартала,
	|		            Организация = &Организация
	|		            " + ТекстУсловия + ") КАК СчетаБухгалтерскогоУчета
	|ИТОГИ ПО
	|	ТипЗаписи";
	
	ДеревоРезультатов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПараметров.Вставить("СписокНМА"                     , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчета"                    , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчетаНачалоГода"          , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчетаНачалоКвартала"      , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизации"              , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизацииНачалоГода"    , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизацииНачалоКвартала", Неопределено);
	
	Для каждого СтрокаТипаЗаписи Из ДеревоРезультатов.Строки Цикл
	
		СтруктураПараметров.Вставить(СтрокаТипаЗаписи.ТипЗаписи, 
		                             СтрокаТипаЗаписи.Строки.ВыгрузитьКолонку("Поле"));	
	
	КонецЦикла;

	Если СтруктураПараметров.СписокНМА <> Неопределено И 
		глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		ЗапросСчетовАмортизации = Новый Запрос;
		ЗапросСчетовАмортизации.УстановитьПараметр("ВнешнийИсточник", СтруктураПараметров.СчетаАмортизации);
		ЗапросСчетовАмортизации.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК СчетНачисленияАмортизации
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Ссылка В(&ВнешнийИсточник)";
		ИсточникДанных = ЗапросСчетовАмортизации.Выполнить();
		
		// Блокировка регистра бухгалтерии.
		
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы, ИсточникДанных", 
														"РегистрБухгалтерии", "Хозрасчетный", ИсточникДанных);
														
		СтруктураЗначенийБлокировки = Новый Структура("Период, Организация", 
													  Новый Диапазон(, КонецМесяца(ДатаРасчета)), Организация);
													  
		СтруктураИсточникаДанных = Новый Структура("Счет", "СчетНачисленияАмортизации");
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных);
		
	КонецЕсли;	
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);	
	
	Запрос.УстановитьПараметр("СостояниеВвода", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	Если НематериальныйАктив <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокНМАПроизводственные", НематериальныйАктив);	
	КонецЕсли;	
	
	Запрос.Текст =
	"
	|ВЫБРАТЬ
	|	СостоянияНМА.НематериальныйАктив  			КАК НематериальныйАктив,
	|	СостоянияНМА.Период  						КАК ДатаСостояния
	|ПОМЕСТИТЬ
	|   СписокНМАПринятыхВТекущемМесяце
	|ИЗ	
	|	РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		            &КонецПериода,
	|		            Организация = &Организация
	|		            " + ТекстУсловияПроизводственные + ") КАК НачислениеАмортизации
	|	ПО НачислениеАмортизации.Организация = СостоянияНМА.Организация
	|		И НачислениеАмортизации.НематериальныйАктив = СостоянияНМА.НематериальныйАктив
	|		И (НачислениеАмортизации.НачислятьАмортизацию)
	|		И СостоянияНМА.Состояние = &СостояниеВвода
	|		И (СостоянияНМА.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|		И (СостоянияНМА.Период > &НачалоПериода200911)
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив                         КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                 КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования                  КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.СрокПолезногоИспользования, 0)   КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.ПервоначальнаяСтоимостьНУ, 0)    КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.Период                                      КАК Период,
	|	ПервоначальныеСведенияНУ.Период                                    КАК ПериодНУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.НачислятьАмортизацию, ЛОЖЬ)      КАК НачислятьАмортизациюНУ,
	|	ПервоначальныеСведенияНУ.НалоговаяГруппаОС                         КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияНУ.НалоговоеНазначение                       КАК НалоговоеНазначение,
	|	ЕСТЬNULL(ВыработкаНМА.КоличествоОборот, 0)                         КАК ТекущийОбъемПродукцииРабот,
	|	МестонахождениеНМА.Местонахождение                                 КАК Местонахождение,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов                   КАК СпособыОтраженияРасходовПоАмортизации,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияОстатки.СуммаОстатокКт, 0)               КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаОборот, 0)                    КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоГода.СуммаОстатокКт, 0)            КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СуммаОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоКвартала.СуммаОстатокКт, 0)        КАК СтоимостьНаНачалоКвартала,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияОстатки.СуммаНУОстатокКт, 0)               КАК СтоимостьКонечныйОстатокНУ,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаНУОборотКт, 0)                    КАК АмортизацияОборотНУ,
	|	ЕСТЬNULL(СтоимостьНачалоГода.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоГода.СуммаНУОстатокКт, 0)            КАК СтоимостьНаНачалоГодаНУ,
	|	ЕСТЬNULL(СтоимостьНачалоКвартала.СуммаНУОстатокДт, 0) 
	|		- ЕСТЬNULL(АмортизацияНачалоКвартала.СуммаНУОстатокКт, 0)        КАК СтоимостьНаНачалоКварталаНУ,
	|	ПерваяАмортизация.ДатаПервойАмортизации                            КАК ДатаПервойАмортизации,
	|	СчетаБухгалтерскогоУчета.СчетУчета                                 КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации                 КАК СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация
	|		            И НематериальныйАктив В (&СписокНМА)) КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|			РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(
	|		    		        &НачалоПериода,
	|		            		Организация = &Организация
	|				            И НематериальныйАктив В (&СписокНМА)) КАК ПервоначальныеСведенияНУ
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ПервоначальныеСведенияНУ.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|			РегистрНакопления.ВыработкаНМА.Обороты(
	|			                  &НачалоПериода,
	|			                  &КонецПериода, ,
	|			                  НематериальныйАктив В (&СписокНМА)) КАК ВыработкаНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ВыработкаНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК СтоимостьОстатки
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьОстатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоГода,
	|		                       Счет В (&СчетаУчетаНачалоГода),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК СтоимостьНачалоГода
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНачалоГода.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоКвартала,
	|		                       Счет В (&СчетаУчетаНачалоКвартала),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК СтоимостьНачалоКвартала
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНачалоКвартала.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК АмортизацияОстатки
	|		ПО ПервоначальныеСведения.НематериальныйАктив = АмортизацияОстатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоГода,
	|		                       Счет В (&СчетаАмортизацииНачалоГода),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК АмортизацияНачалоГода
	|		ПО ПервоначальныеСведения.НематериальныйАктив = АмортизацияНачалоГода.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоКвартала,
	|		                       Счет В (&СчетаАмортизацииНачалоКвартала),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК АмортизацияНачалоКвартала
	|		ПО ПервоначальныеСведения.НематериальныйАктив = АмортизацияНачалоКвартала.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеНМАБухгалтерскийУчет.СрезПоследних(
	|			                &НачалоПериода, Организация = &Организация И НематериальныйАктив В (&СписокНМА)) КАК МестонахождениеНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И НематериальныйАктив В (&СписокНМА)) КАК СпособыОтраженияРасходов
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СпособыОтраженияРасходов.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|		                       СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (&СписокНМА)
	|		                       ) КАК НачисленнаяАмортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = НачисленнаяАмортизация.СубконтоКт1
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				НачислениеАмортизации.НематериальныйАктив КАК НематериальныйАктив,
	|				МИНИМУМ(НачислениеАмортизации.Период)  КАК ДатаПервойАмортизации
	|			ИЗ
	|				РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет КАК НачислениеАмортизации
	|			ГДЕ
	|				НачислениеАмортизации.Организация = &Организация
	|				И НачислениеАмортизации.НачислятьАмортизацию
	|				И НачислениеАмортизации.НематериальныйАктив В(&СписокНМА)
	|		
	|			СГРУППИРОВАТЬ ПО
	|				НачислениеАмортизации.НематериальныйАктив) КАК ПерваяАмортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ПерваяАмортизация.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		                    &НачалоПериода,
	|		                    Организация = &Организация
	|		                    И НематериальныйАктив В (&СписокНМА)) КАК СчетаБухгалтерскогоУчета
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СчетаБухгалтерскогоУчета.НематериальныйАктив
	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив 				КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                 	КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования                  	КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     	КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.СрокПолезногоИспользования, 0)    КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.ПервоначальнаяСтоимостьНУ, 0)     КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации 	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.ЛиквидационнаяСтоимость                     	КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.Период                                      	КАК Период,
	|	ПервоначальныеСведенияНУ.Период                                    КАК ПериодНУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНУ.НачислятьАмортизацию, ЛОЖЬ)      КАК НачислятьАмортизациюНУ,
	|	ПервоначальныеСведенияНУ.НалоговаяГруппаОС                         КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияНУ.НалоговоеНазначение                       КАК НалоговоеНазначение,
	|	ЕСТЬNULL(ВыработкаНМА.КоличествоОборот, 0)                         	КАК ТекущийОбъемПродукцииРабот,
	|	МестонахождениеНМА.Местонахождение                                 КАК Местонахождение,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов                   	КАК СпособыОтраженияРасходовПоАмортизации,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                     	КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаОборот, 0)                    	КАК АмортизацияОборот,
	|	0            													   	КАК СтоимостьНаНачалоГода,
	|	0        														   	КАК СтоимостьНаНачалоКвартала,
	|	ПервоначальныеСведенияНУ.ПервоначальнаяСтоимостьНУ                 	КАК СтоимостьКонечныйОстатокНУ,
	|	ЕСТЬNULL(НачисленнаяАмортизация.СуммаНУОборотКт, 0)                 КАК АмортизацияОборотНУ,
	|	0            													   	КАК СтоимостьНаНачалоГодаНУ,
	|	0        														   	КАК СтоимостьНаНачалоКварталаНУ,
	|	NULL                            									КАК ДатаПервойАмортизации,
	|	СчетаБухгалтерскогоУчета.СчетУчета                                 	КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации                 	КАК СчетНачисленияАмортизации
	|ИЗ
	|	СписокНМАПринятыхВТекущемМесяце
	|	ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|		РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПервых(
	|			&НачалоПериода,
	|		    Организация = &Организация
	|		    И НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК ПервоначальныеСведения
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = ПервоначальныеСведения.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|		РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПервых(
	|			&НачалоПериода,
	|		    Организация = &Организация
	|		    И НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК ПервоначальныеСведенияНУ
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = ПервоначальныеСведенияНУ.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ                                                                              
	|		РегистрНакопления.ВыработкаНМА.Обороты(
	|	        &НачалоПериода,
	|	        &КонецПериода, ,
	|	        НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК ВыработкаНМА
	|	ПО ПервоначальныеСведения.НематериальныйАктив = ВыработкаНМА.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.СрезПервых(
	|	                    &НачалоПериода,
	|	                    Организация = &Организация
	|	                    И НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК СпособыОтраженияРасходов
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = СпособыОтраженияРасходов.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|	                       &НачалоПериода,
	|	                       &КонецПериода, ,
	|	                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|	                       СчетКт В (&СчетаАмортизации),
	|	                       &СубконтоНМА,
	|	                       Организация = &Организация
	|	                       И СубконтоКт1 В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)
	|	                       ) КАК НачисленнаяАмортизация
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = НачисленнаяАмортизация.СубконтоКт1
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПервых(
	|	                    &НачалоПериода,
	|	                    Организация = &Организация
	|	                    И НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК СчетаБухгалтерскогоУчета
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = СчетаБухгалтерскогоУчета.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.МестонахождениеНМАБухгалтерскийУчет.СрезПервых(
	|		                &НачалоПериода, Организация = &Организация И НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ СписокНМАПринятыхВТекущемМесяце)) КАК МестонахождениеНМА
	|	ПО СписокНМАПринятыхВТекущемМесяце.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив
	| ГДЕ ПервоначальныеСведения.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Производственный)
	|";
	ВыборкаПоНМА = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоНМА.Следующий() Цикл
		
		Если (ВыборкаПоНМА.АмортизацияОборот > 0) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ амортизация в этом месяце уже начислялась';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ амортизація в цьому місяці вже нараховувалася'"), ВыборкаПоНМА.НематериальныйАктив));
				
			КонецЕсли;
			
			Продолжить; // по указанному НМА в этом месяце уже начисляли амортизацию 
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоНМА.СпособНачисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ не указан способ амортизации';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ не вказаний спосіб амортизації'"), ВыборкаПоНМА.НематериальныйАктив),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ стоимость для вычисления амортизации равна 0';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ вартість для обчислення амортизації дорівнює 0'"), ВыборкаПоНМА.НематериальныйАктив),
								 Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		НачислятьАмортизациюНУ 	= ВыборкаПоНМА.НачислятьАмортизациюНУ;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоНМА.СтоимостьДляВычисленияАмортизацииНУ) И НачислятьАмортизациюНУ Тогда
			
			НачислятьАмортизациюНУ = Ложь;	
			
		КонецЕсли;	
		
		СуммаАмортизации = 0;
		СуммаАмортизацииНУ = 0;
		
		СтоимостьДляВычисленияАмортизации 			= ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
		ЛиквидационнаяСтоимость						= ВыборкаПоНМА.ЛиквидационнаяСтоимость;
		АмортизируемаяСтоимость	 					= СтоимостьДляВычисленияАмортизации - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизации	= ВыборкаПоНМА.СрокИспользованияДляВычисленияАмортизации;
		
		СтоимостьДляВычисленияАмортизацииНУ 		= ВыборкаПоНМА.СтоимостьДляВычисленияАмортизацииНУ;
		АмортизируемаяСтоимостьНУ	 				= СтоимостьДляВычисленияАмортизацииНУ - ЛиквидационнаяСтоимость;
		СрокИспользованияДляВычисленияАмортизацииНУ	= ВыборкаПоНМА.СрокИспользованияДляВычисленияАмортизацииНУ;
		
		ТекущийОбъемПродукцииРабот					= ВыборкаПоНМА.ТекущийОбъемПродукцииРабот;
		ОбъемПродукцииРаботДляВычисленияАмортизации	= ВыборкаПоНМА.ОбъемПродукцииРаботДляВычисленияАмортизации;
		ДатаПервойАмортизации                       = ВыборкаПоНМА.ДатаПервойАмортизации;
		
		Если ВыборкаПоНМА.ДатаПервойАмортизации = NULL Тогда
	    	ДатаПервойАмортизацииНУ 				= NULL;
		Иначе	
			ДатаПервойАмортизацииНУ 				= Макс(ВыборкаПоНМА.ДатаПервойАмортизации, '20110331');
		КонецЕсли;	
		
		СтоимостьКонечныйОстаток					= ВыборкаПоНМА.СтоимостьКонечныйОстаток;
		
		СтоимостьКонечныйОстатокНУ					= ВыборкаПоНМА.СтоимостьКонечныйОстатокНУ;
		
		Если (ЛиквидационнаяСтоимость <> 0) 
		   И (ЛиквидационнаяСтоимость >= СтоимостьКонечныйОстаток) Тогда
			
			Если ВыдаватьСообщения Тогда
				
				ОбщегоНазначения.СообщитьИнформацию(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: остаточная стоимость нематериального актива ¤1¤ достигла ликвидационной <¤2¤>, амортизация не начислена.';uk='Бух. розрахунок амортизації: залишкова вартість нематеріального активу ¤1¤ досягла ліквідаційної <¤2¤>, амортизація не нарахована.'"),
				                             ВыборкаПоНМА.НематериальныйАктив, ЛиквидационнаяСтоимость));
				
			КонецЕсли;
			
            Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Прямолинейный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"),
					                           ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			СуммаАмортизации = АмортизируемаяСтоимость / СрокИспользованияДляВычисленияАмортизации;
			
			Если НачислятьАмортизациюНУ Тогда
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"),
						                           ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				СуммаАмортизацииНУ = АмортизируемаяСтоимостьНУ / СрокИспользованияДляВычисленияАмортизацииНУ;
			КонецЕсли;	

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Производственный Тогда

			Если ОбъемПродукцииРаботДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан предполагаемый объем выработки!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний передбачуваний обсяг виробітку!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации),
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			СуммаАмортизации = АмортизируемаяСтоимость * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;
			
			СуммаАмортизацииНУ = АмортизируемаяСтоимостьНУ * ТекущийОбъемПродукцииРабот / ОбъемПродукцииРаботДляВычисленияАмортизации;

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшенияОстатка Тогда

			Если ЛиквидационнаяСтоимость = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указана ликвидационная стоимость!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказана ліквідаційна вартість!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если Год(ВыборкаПоНМА.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ не зазначена дата введення в експлуатацію!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаПервойАмортизации);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаПервойАмортизации)
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду < 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаГодовойАмортизации = 12 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = СтоимостьИтоговая * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизации,
				                                                       12 / СрокИспользованияДляВычисленияАмортизации));
				
			Иначе // Срок использования исчерпан
				
				СуммаГодовойАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			СуммаАмортизации  = СуммаГодовойАмортизации / 12;
			
			Если НачислятьАмортизациюНУ Тогда
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				Если Год(ВыборкаПоНМА.ПериодНУ) = Год(ДатаРасчета) Тогда
					
					СтоимостьИтоговаяНУ = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизацииНУ;
					
				Иначе
					
					СтоимостьИтоговаяНУ = ВыборкаПоНМА.СтоимостьНаНачалоГодаНУ;
					
				КонецЕсли;
				
				Если ДатаПервойАмортизацииНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ не зазначена дата введення в експлуатацію!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				РазностьЛетНУ = Год(ДатаРасчета) - Год(ДатаПервойАмортизацииНУ);
				
				Если РазностьЛетНУ > 0 Тогда
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ 
					                                   - РазностьЛетНУ * 12
					                                   + Месяц(ДатаПервойАмортизацииНУ)
				ИначеЕсли СрокИспользованияДляВычисленияАмортизацииНУ < 12 Тогда											   
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ;
													   
				Иначе
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = 0;
													   
				КонецЕсли;
				
				Если (ОсталосьЭксплуатироватьВЭтомГодуНУ < 12) И (ОсталосьЭксплуатироватьВЭтомГодуНУ > 0)  Тогда
					
					// Последний год применяем прямолинейный метод
					
					СуммаГодовойАмортизацииНУ = 12 * (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГодуНУ
					
				ИначеЕсли ОсталосьЭксплуатироватьВЭтомГодуНУ >= 0 Тогда
					
					СуммаГодовойАмортизацииНУ = СтоимостьИтоговаяНУ * (1 - Pow(ЛиквидационнаяСтоимость / СтоимостьДляВычисленияАмортизацииНУ,
					                                                       12 / СрокИспользованияДляВычисленияАмортизацииНУ));
					
				Иначе // Срок использования исчерпан
					
					СуммаГодовойАмортизацииНУ = 0;
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
						
					КонецЕсли;
				
				КонецЕсли;
				
				СуммаАмортизацииНУ  = СуммаГодовойАмортизацииНУ / 12;
				
			КонецЕсли;

		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УскоренногоУменьшенияОстатка Тогда
			
			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если СрокИспользованияДляВычисленияАмортизации <= 24 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ вказаний строк корисного використання <¤3¤> міс.!"
"Для коректного нарахування амортизації строк використання повинен бути більше 24 місяців.'"),
					ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизации),);
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если Год(ВыборкаПоНМА.Период) = Год(ДатаРасчета) Тогда
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизации;
				
			Иначе
				
				СтоимостьИтоговая = ВыборкаПоНМА.СтоимостьНаНачалоГода;
				
			КонецЕсли;
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ не зазначена дата введення в експлуатацію!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			РазностьЛет = Год(ДатаРасчета) - Год(ДатаПервойАмортизации);
			
			Если РазностьЛет > 0 Тогда
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации 
				                                   - РазностьЛет * 12
				                                   + Месяц(ДатаПервойАмортизации)
												   
			ИначеЕсли СрокИспользованияДляВычисленияАмортизации < 12 Тогда											   
				
				ОсталосьЭксплуатироватьВЭтомГоду = СрокИспользованияДляВычисленияАмортизации;
												   
			Иначе
				
				ОсталосьЭксплуатироватьВЭтомГоду = 0;
												   
			КонецЕсли;
			
			Если (ОсталосьЭксплуатироватьВЭтомГоду <= 12) И (ОсталосьЭксплуатироватьВЭтомГоду > 0)  Тогда
				
				// Последний год применяем прямолинейный метод
				
				СуммаАмортизации = (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГоду
				
			ИначеЕсли ОсталосьЭксплуатироватьВЭтомГоду >= 0 Тогда
				
				СуммаГодовойАмортизации = 2 * (СтоимостьИтоговая - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизации * 12;
				
			Иначе // Срок использования исчерпан
				
				СуммаАмортизации = 0;
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
			
			КонецЕсли;
			
			СуммаАмортизации  = СуммаГодовойАмортизации / 12;
			
			Если НачислятьАмортизациюНУ Тогда
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ <= 24 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ указан срок полезного использования <¤3¤> мес.!"
	"Для корректного начисления амортизации срок использования должен быть более 24 месяца.';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ вказаний строк корисного використання <¤3¤> міс.!"
	"Для коректного нарахування амортизації строк використання повинен бути більше 24 місяців.'"),
						ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации, СрокИспользованияДляВычисленияАмортизацииНУ),);
						
					КонецЕсли;
					
				КонецЕсли; 
				
				Если Год(ВыборкаПоНМА.ПериодНУ) = Год(ДатаРасчета) Тогда
					
					СтоимостьИтоговаяНУ = ВыборкаПоНМА.СтоимостьДляВычисленияАмортизацииНУ;
					
				Иначе
					
					СтоимостьИтоговаяНУ = ВыборкаПоНМА.СтоимостьНаНачалоГодаНУ;
					
				КонецЕсли;
				
				Если ДатаПервойАмортизацииНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата ввода в эксплуатацию!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ не зазначена дата введення в експлуатацію!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				РазностьЛетНУ = Год(ДатаРасчета) - Год(ДатаПервойАмортизацииНУ);
				
				Если РазностьЛетНУ > 0 Тогда
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ 
					                                   - РазностьЛетНУ * 12
					                                   + Месяц(ДатаПервойАмортизацииНУ)
													   
				ИначеЕсли СрокИспользованияДляВычисленияАмортизацииНУ < 12 Тогда											   
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = СрокИспользованияДляВычисленияАмортизацииНУ;
													   
				Иначе
					
					ОсталосьЭксплуатироватьВЭтомГодуНУ = 0;
													   
				КонецЕсли;
				
				Если (ОсталосьЭксплуатироватьВЭтомГодуНУ <= 12) И (ОсталосьЭксплуатироватьВЭтомГодуНУ > 0)  Тогда
					
					// Последний год применяем прямолинейный метод
					
					СуммаАмортизацииНУ = (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / ОсталосьЭксплуатироватьВЭтомГодуНУ
					
				ИначеЕсли ОсталосьЭксплуатироватьВЭтомГодуНУ >= 0 Тогда
					
					СуммаГодовойАмортизацииНУ = 2 * (СтоимостьИтоговаяНУ - ЛиквидационнаяСтоимость) / СрокИспользованияДляВычисленияАмортизацииНУ * 12;
					
				Иначе // Срок использования исчерпан
					
					СуммаАмортизацииНУ = 0;
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ срок использования исчерпан!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку способом ¤2¤ строк використання вичерпаний!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
						
					КонецЕсли;
				
				КонецЕсли;
				
				СуммаАмортизацииНУ  = СуммаГодовойАмортизацииНУ / 12;
				
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоНМА.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Кумулятивный Тогда

			Если СрокИспользованияДляВычисленияАмортизации = 0 Тогда
				
				Если ВыдаватьСообщения Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
									 Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли; 
			
			Если ДатаПервойАмортизации = NULL Тогда
				
				Если ВыдаватьСообщения Тогда
					
					Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата первой амортизации!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не визначилася дата першої амортизації!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;

			ЧислоЛетПользования       = Макс(1,СрокИспользованияДляВычисленияАмортизации / 12);
			ЧислоЛетПользования       = ЧислоЛетПользования + ?(ЧислоЛетПользования 
			                                                    - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
			
			ГодИспользования          = Год(ДатаРасчета) - Год(ДатаПервойАмортизации) + 1;
			
			Если Месяц(ДатаПервойАмортизации) >= Месяц(ДатаРасчета) Тогда
				
				ГодИспользования	  = ГодИспользования - 1;
				
			КонецЕсли; 

			СуммаГодовойАмортизации   = АмортизируемаяСтоимость * (ЧислоЛетПользования - ГодИспользования + 1)
					/ (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
				
			СуммаАмортизации = СуммаГодовойАмортизации / 12;
			
			Если НачислятьАмортизациюНУ Тогда
				
				Если СрокИспользованияДляВычисленияАмортизацииНУ = 0 Тогда
					
					Если ВыдаватьСообщения Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не указан срок полезного использования!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не вказаний строк корисного використання!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
										 Отказ);
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли; 
				
				Если ДатаПервойАмортизацииНУ = NULL Тогда
					
					Если ВыдаватьСообщения Тогда
						
						Сообщить(Локализация.СтрШаблон1(НСтр("ru='Нал. расчет амортизации: для нематериального актива ¤1¤ при расчете по способу ¤2¤ не определилась дата первой амортизации!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ при розрахунку за способом ¤2¤ не визначилася дата першої амортизації!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации));
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;

				ЧислоЛетПользования       = Макс(1,СрокИспользованияДляВычисленияАмортизацииНУ / 12);
				ЧислоЛетПользования       = ЧислоЛетПользования + ?(ЧислоЛетПользования 
				                                                    - Цел(ЧислоЛетПользования) = 0, 0, 1); // округляем к наибольшему целому
				
				ГодИспользования          = Год(ДатаРасчета) - Год(ДатаПервойАмортизацииНУ) + 1;
				
				Если Месяц(ДатаПервойАмортизацииНУ) >= Месяц(ДатаРасчета) Тогда
					
					ГодИспользования	  = ГодИспользования - 1;
					
				КонецЕсли; 

				СуммаГодовойАмортизацииНУ   = АмортизируемаяСтоимостьНУ * (ЧислоЛетПользования - ГодИспользования + 1)
						/ (ЧислоЛетПользования * (ЧислоЛетПользования + 1) / 2 );
					
				СуммаАмортизацииНУ = СуммаГодовойАмортизацииНУ / 12;
				
			КонецЕсли;
	
		Иначе 
			
			Если ВыдаватьСообщения  Тогда
			
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ установлен способ расчета амортизации, не поддерживаемый в бухгалтерском учете (¤2¤)!';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ встановлений спосіб розрахунку амортизації, який не підтримується у бухгалтерському обліку (¤2¤)!'"), ВыборкаПоНМА.НематериальныйАктив, ВыборкаПоНМА.СпособНачисленияАмортизации), 
								 Отказ);
			
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		СуммаАмортизации  = Макс(0, Мин(СуммаАмортизации, СтоимостьКонечныйОстаток - ЛиквидационнаяСтоимость));

		Если НачислятьАмортизациюНУ Тогда
			СуммаАмортизацииНУ  = Макс(0, Мин(СуммаАмортизацииНУ, СтоимостьКонечныйОстатокНУ - ЛиквидационнаяСтоимость));
		Иначе	
			СуммаАмортизацииНУ = 0;
		КонецЕсли;	
		
		СтрокаАмортизации = ТаблицаАмортизации.Добавить();

		СтрокаАмортизации.ОбъектУчета            = ВыборкаПоНМА.НематериальныйАктив;
		СтрокаАмортизации.НаправлениеАмортизации = ВыборкаПоНМА.СпособыОтраженияРасходовПоАмортизации;
    	СтрокаАмортизации.СчетУчета	             = ВыборкаПоНМА.СчетУчета;
    	СтрокаАмортизации.СчетАмортизации	     = ВыборкаПоНМА.СчетНачисленияАмортизации;
    	СтрокаАмортизации.Амортизация            = СуммаАмортизации;
    	СтрокаАмортизации.АмортизацияНУ          = СуммаАмортизацииНУ;
		СтрокаАмортизации.НалоговоеНазначение 	 = ВыборкаПоНМА.НалоговоеНазначение;
        СтрокаАмортизации.Местонахождение 		 = ВыборкаПоНМА.Местонахождение;
		
		Если СуммаАмортизации = 0 И ВыдаватьСообщения Тогда
			
			Сообщить(Локализация.СтрШаблон1(НСтр("ru='Бух. расчет амортизации: для нематериального актива ¤1¤ амортизация равна 0';uk='Бух. розрахунок амортизації: для нематеріального активу ¤1¤ амортизація дорівнює 0'"), ВыборкаПоНМА.НематериальныйАктив));
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаАмортизации;

КонецФункции // РасчетАмортизацииНМАБухРегл()

///////////////////////////////////////////////////////////////////////////////
// РАСПРЕДЕЛЕНИЕ АМОРТИЗАЦИИ

//Получает бухгалтерскую аналитику в зависимости от переданной статьи затрат
//
// Параметры
//
//
// Возвращаемое значение
//  Структура со значениями субконто
//
Функция ПолучитьАналитикуСчетаЗатрат(ПодразделениеОрганизации,СтатьяЗатрат,НоменклатурнаяГруппа,ОбъектСтроительства,ЗнСубконто1, ЗнСубконто2, ЗнСубконто3) Экспорт
	
	СтруктураПолей = Новый Структура;

	Субконто1 = Неопределено;
	Субконто2 = Неопределено;
	Субконто3 = Неопределено;

	Если (СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы)
	 ИЛИ (СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве) Тогда

		Субконто1 = ПодразделениеОрганизации;
		Субконто2 = НоменклатурнаяГруппа;
		Субконто3 = СтатьяЗатрат;

	ИначеЕсли (СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы) 
		  ИЛИ (СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.АдминистративныеРасходы) Тогда

		Субконто1 = ПодразделениеОрганизации;
		Субконто2 = СтатьяЗатрат;

	ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда

		Субконто1 = ОбъектСтроительства;
		Субконто2 = СтатьяЗатрат;

	ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт 
		ИЛИ СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы Тогда

		Субконто1 = СтатьяЗатрат;
		Субконто2 = ПодразделениеОрганизации;

	ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие Тогда

		Субконто1 = ЗнСубконто1;
		Субконто2 = ЗнСубконто2;
		Субконто3 = ЗнСубконто3;

	КонецЕсли;

	СтруктураПолей.Вставить("Субконто1", Субконто1);
	СтруктураПолей.Вставить("Субконто2", Субконто2);
	СтруктураПолей.Вставить("Субконто3", Субконто3);

	Возврат СтруктураПолей;

КонецФункции

//Функция получает таблицу значений с указанием списка ОС и сумм амортизации
//возвращает таблицу значений с распределенными значениями амортизации
//
Функция ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ДокОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента) Экспорт

	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПериодРегистрации", ДокОбъект.Метаданные()) Тогда
		ДатаРасчета = КонецМесяца(ДокОбъект.ПериодРегистрации);
	Иначе
		ДатаРасчета = ДокОбъект.Дата;
	КонецЕсли; 

	// определим структуру выходной таблицы
	ТабЗатрат = Новый ТаблицаЗначений;
	
	ТабЗатрат.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТабЗатрат.Колонки.Добавить("СчетЗатрат");
	ТабЗатрат.Колонки.Добавить("СчетАмортизации");
	ТабЗатрат.Колонки.Добавить("ОбъектУчета");
	ТабЗатрат.Колонки.Добавить("Субконто1");
	ТабЗатрат.Колонки.Добавить("Субконто2");
	ТабЗатрат.Колонки.Добавить("Субконто3");
	
	ТабЗатрат.Колонки.Добавить("СтатьяЗатрат",            Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
	ТабЗатрат.Колонки.Добавить("НоменклатурнаяГруппа",    Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	ТабЗатрат.Колонки.Добавить("ОбъектСтроительства",     Новый ОписаниеТипов("СправочникСсылка.ОбъектыСтроительства"));
	ТабЗатрат.Колонки.Добавить("Подразделение",           Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	//ТабЗатрат.Колонки.Добавить("Заказ",                   Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));

	МассивКоэф = Новый Массив;

	// цикл по Объектам из ТабАмортизации
	Для Каждого СтрокаТЗ Из ТабАмортизации Цикл
		Если СтрокаТЗ.Амортизация = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.НаправлениеАмортизации) Тогда
			Сообщить("В Упр. учете для объекта "+ СтрокаТЗ.ОбъектУчета+" не указан способ отражения расходов по амортизации",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если СтрокаТЗ.НаправлениеАмортизации.Способы.Количество() = 0 Тогда
			Сообщить("В Упр. учете для объекта "+ СтрокаТЗ.ОбъектУчета+" в списке способов отражения расходов по амортизации нет записей",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		МассивКоэф.Очистить();
		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			МассивКоэф.Добавить(СтрокаНапр.Коэффициент);
		КонецЦикла;

		МассивСумм = ОбщегоНазначения.РаспределитьПропорционально( СтрокаТЗ.Амортизация, МассивКоэф, 2);
		Если МассивСумм = Неопределено Тогда
			Сообщить("В Упр. учете для объекта "+ СтрокаТЗ.ОбъектУчета+" в способах отражения расходов по амортизации не проставлены коэффициенты",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если МассивСумм.Количество() <> МассивКоэф.Количество() Тогда
			Сообщить("В Упр. учете для объекта "+ СтрокаТЗ.ОбъектУчета+" в способах отражения расходов по амортизации есть нулевые коэффициенты",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			
			Если ЗначениеЗаполнено(СтрокаНапр.Подразделение) Тогда
				Подразделение           = СтрокаНапр.Подразделение;
			Иначе	
				// получаем по местонахождению объекта
				Подразделение           = СтрокаТЗ.Местонахождение;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
				Сообщить("В Упр. учете для объекта "+ СтрокаТЗ.ОбъектУчета+" не указано подразделение ни при принятии к учету, ни в способах отражения расходов. Необходимо заполнить подразделение и перепровести документ.",СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;	
			
			НоваяСтрока = ТабЗатрат.Добавить();
			НоваяСтрока.СчетЗатрат 				= СтрокаНапр.СчетЗатрат;
			НоваяСтрока.ОбъектУчета 			= СтрокаТЗ.ОбъектУчета;
			НоваяСтрока.Субконто1 				= СтрокаНапр.Субконто1;
			НоваяСтрока.Субконто2 				= СтрокаНапр.Субконто2;
			НоваяСтрока.Субконто3 				= СтрокаНапр.Субконто3;

			НоваяСтрока.Подразделение           = Подразделение;

			НоваяСтрока.СтатьяЗатрат            = СтрокаНапр.СтатьяЗатрат;
			НоваяСтрока.НоменклатурнаяГруппа    = СтрокаНапр.НоменклатурнаяГруппа;
			НоваяСтрока.ОбъектСтроительства     = СтрокаНапр.ОбъектСтроительства;
			
			НоваяСтрока.Сумма 					= МассивСумм[СтрокаНапр.НомерСтроки - 1];
		КонецЦикла;
		
	КонецЦикла;

	//записи в регистра по учету затрат
	ДопПараметры = Новый Структура;

	УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ДокОбъект, ТабЗатрат, СтруктураШапкиДокумента, Неопределено, ДопПараметры);

	Возврат ТабЗатрат;

КонецФункции // ПолучитьРаспределениеАмортизацииПоНаправлениямУпр()

//Функция получает таблицу значений с указанием списка ОС или НМА и сумм амортизации
//возвращает таблицу значений с распределенными значениями амортизации
//
Функция ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ДокОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента, НомерЖурнала, ТекстПроводки = Неопределено) Экспорт

	ДатаРасчета = ДокОбъект.Дата;
	Ремонт   = (Тип("ДокументОбъект.УдалитьРемонтОС") = ТипЗнч(ДокОбъект)) ИЛИ (Тип("ДокументОбъект.МодернизацияОС") = ТипЗнч(ДокОбъект));   
	Улучшение = (Тип("ДокументОбъект.УдалитьРемонтОС") = ТипЗнч(ДокОбъект)) ИЛИ (Тип("ДокументОбъект.МодернизацияОС") = ТипЗнч(ДокОбъект));   

	// определим структуру выходной таблицы
	ТабЗатрат = Новый ТаблицаЗначений;
	ТабЗатрат.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТабЗатрат.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТабЗатрат.Колонки.Добавить("НалоговоеНазначение",      			Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТабЗатрат.Колонки.Добавить("НалоговоеНазначениеДоходовИЗатрат", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТабЗатрат.Колонки.Добавить("СчетЗатрат");
	ТабЗатрат.Колонки.Добавить("СчетАмортизации");
	ТабЗатрат.Колонки.Добавить("ОбъектУчета");
	ТабЗатрат.Колонки.Добавить("Субконто1");
	ТабЗатрат.Колонки.Добавить("Субконто2");
	ТабЗатрат.Колонки.Добавить("Субконто3");


	МассивКоэф = Новый Массив;

	// цикл по Объектам из ТабАмортизации
	Для Каждого СтрокаТЗ Из ТабАмортизации Цикл

		Если СтрокаТЗ.Сумма = 0 И СтрокаТЗ.СуммаНУ = 0 тогда
			//Распределять амортизацию не надо, так как распределять нечего.
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.НаправлениеАмортизации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для объекта ¤1¤ не указаны способы отражения расходов по амортизации", СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если СтрокаТЗ.НаправлениеАмортизации.Способы.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для объекта ¤1¤ в способах отражения затрат по амортизации нет записей", СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		МассивКоэф.Очистить();
		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			МассивКоэф.Добавить(СтрокаНапр.Коэффициент);
		КонецЦикла;

		МассивСумм = ОбщегоНазначения.РаспределитьПропорционально(СтрокаТЗ.Сумма, МассивКоэф, 2);
		МассивСуммНУ = ОбщегоНазначения.РаспределитьПропорционально(СтрокаТЗ.СуммаНУ, МассивКоэф, 2);
		Если МассивСумм = Неопределено И МассивСуммНУ = Неопределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для объекта ¤1¤ в способах отражения расходов по амортизации не проставлены коэффициенты", СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если (МассивСумм <> Неопределено И МассивСумм.Количество() <> МассивКоэф.Количество()) И (МассивСуммНУ <> Неопределено И МассивСуммНУ.Количество() <> МассивКоэф.Количество()) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для объекта ¤1¤ в способах отражения затрат по амортизации есть нулевые коэффициенты", СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			
			Если ЗначениеЗаполнено(СтрокаНапр.ПодразделениеОрганизации) Тогда
				ПодразделениеОрганизации 	= СтрокаНапр.ПодразделениеОрганизации;
			Иначе	
				// получаем по местонахождению объекта
				ПодразделениеОрганизации 	= СтрокаТЗ.Местонахождение;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
				Если СтрокаТЗ.НаправлениеАмортизации <> Справочники.СпособыОтраженияРасходовПоАмортизации.ВременнаяРазницаОСНа01042011 Тогда
					ОбщегоНазначения.СообщитьОбОшибке("В бух. учете для объекта " + СтрокаТЗ.ОбъектУчета + " не указано подразделение ни при принятии к учету, ни в способах отражения расходов. Необходимо заполнить подразделение и перепровести документ.",,, СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			НоваяСтрока = ТабЗатрат.Добавить();
			НоваяСтрока.СчетЗатрат               = СтрокаНапр.СчетЗатрат;
			НоваяСтрока.ОбъектУчета              = СтрокаТЗ.ОбъектУчета;
			НоваяСтрока.СчетАмортизации          = СтрокаТЗ.СчетАмортизации;
			НоваяСтрока.Субконто1                = СтрокаНапр.Субконто1;
			НоваяСтрока.Субконто2                = СтрокаНапр.Субконто2;
			НоваяСтрока.Субконто3                = СтрокаНапр.Субконто3;

			Если ТипЗнч(НоваяСтрока.Субконто1) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				НоваяСтрока.Субконто1 = ПодразделениеОрганизации;
			ИначеЕсли ТипЗнч(НоваяСтрока.Субконто2) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда	
				НоваяСтрока.Субконто2 = ПодразделениеОрганизации;
			ИначеЕсли ТипЗнч(НоваяСтрока.Субконто3) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда	
				НоваяСтрока.Субконто3 = ПодразделениеОрганизации;
			КонецЕсли;	
			
			Если Улучшение Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаНапр.СтатьяЗатратНаУлучшениеОС) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru='Для объекта ¤1¤ в способе отражения затрат по амортизации и улучшению не указана статья затрат на улучшение ОС';uk=""Для об'єкта ¤1¤ у способах відображення витрат по амортизації є нульові коефіцієнти"""), СтрокаТЗ.ОбъектУчета), Отказ,, СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;	
				
				Если ТипЗнч(НоваяСтрока.Субконто1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					НоваяСтрока.Субконто1 = СтрокаНапр.СтатьяЗатратНаУлучшениеОС;
				ИначеЕсли ТипЗнч(НоваяСтрока.Субконто2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда	
					НоваяСтрока.Субконто2 = СтрокаНапр.СтатьяЗатратНаУлучшениеОС;
				ИначеЕсли ТипЗнч(НоваяСтрока.Субконто3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда	
					НоваяСтрока.Субконто3 = СтрокаНапр.СтатьяЗатратНаУлучшениеОС;
				КонецЕсли;	
			КонецЕсли;

			
			Если МассивСумм <> Неопределено Тогда
				НоваяСтрока.Сумма 	= МассивСумм[СтрокаНапр.НомерСтроки - 1];
			КонецЕсли;
			
			Если МассивСуммНУ <> Неопределено Тогда
				НоваяСтрока.СуммаНУ = МассивСуммНУ[СтрокаНапр.НомерСтроки - 1];
			КонецЕсли;	
			НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат 	= СтрокаНапр.НалоговоеНазначениеДоходовИЗатрат;
			
			НоваяСтрока.НалоговоеНазначение 				= СтрокаТЗ.НалоговоеНазначение;
			
			ХарактерЗатрат = Неопределено;
			
			НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(НоваяСтрока, НоваяСтрока.СчетЗатрат, ,
																   	НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат, ,                                          
																	НоваяСтрока.НалоговоеНазначение, НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат,,Ложь,Ложь,ДатаРасчета);
																	
			Если ХарактерЗатрат = "ОПЗ" Тогда
				Если ЗначениеЗаполнено(СтрокаНапр.НалоговоеНазначение) Тогда
					НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат = СтрокаНапр.НалоговоеНазначение;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСообщенияДоп = Локализация.СтрШаблон1(НСтр("ru=' (Способ отражения: ""¤1¤"", строка № ¤2¤)';uk=' (Спосіб відбиття: ""¤1¤"", рядок № ¤2¤)'"), СтрокаТЗ.НаправлениеАмортизации, СтрокаНапр.НомерСтроки);
			
//	 		Если НоваяСтрока.СуммаНУ <> 0 Тогда
	 		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат.ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда
				Если Улучшение Тогда
					// при наличии ошибки документ не проводится
					ПроверитьСоответствиеНалоговогоНазначенияАмортизации(СтрокаТЗ.ОбъектУчета, НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат, НоваяСтрока.НалоговоеНазначение, Отказ, СтрокаСообщенияДоп);
				Иначе	
					ПроверитьСоответствиеНалоговогоНазначенияАмортизации(СтрокаТЗ.ОбъектУчета, НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат, НоваяСтрока.НалоговоеНазначение, , СтрокаСообщенияДоп);
				КонецЕсли;	
			КонецЕсли;	
//	 		КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;

	ДопПараметры = Новый Структура;
	
	//формирование проводок
	Проводки = ДокОбъект.Движения.Хозрасчетный;
	
	Для Каждого СтрокаЗатрат из ТабЗатрат Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗатрат.Сумма) И НЕ ЗначениеЗаполнено(СтрокаЗатрат.СуммаНУ) тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = Проводки.Добавить();
		
		Проводка.Период       = ДатаРасчета;
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма        = СтрокаЗатрат.Сумма;
		
		Проводка.СчетДт = СтрокаЗатрат.СчетЗатрат;
		
		Проводка.СуммаНУДт      = СтрокаЗатрат.СуммаНУ;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтрокаЗатрат.НалоговоеНазначениеДоходовИЗатрат.ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда	
			Проводка.НалоговоеНазначениеДт      = СтрокаЗатрат.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;	
		
		//Аналитика       = ПолучитьАналитикуСчетаЗатрат(СтрокаЗатрат.ПодразделениеОрганизации,СтрокаЗатрат.СтатьяЗатрат,СтрокаЗатрат.НоменклатурнаяГруппа,СтрокаЗатрат.ОбъектСтроительства,СтрокаЗатрат.Субконто1, СтрокаЗатрат.Субконто2, СтрокаЗатрат.Субконто3);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 1, СтрокаЗатрат.Субконто1); //Аналитика.Субконто1
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 2, СтрокаЗатрат.Субконто2); //Аналитика.Субконто2
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 3, СтрокаЗатрат.Субконто3); //Аналитика.Субконто3
		
		Проводка.СчетКт = СтрокаЗатрат.СчетАмортизации;
		
		Проводка.СуммаНУКт      = СтрокаЗатрат.СуммаНУ;
		Проводка.НалоговоеНазначениеКт      = СтрокаЗатрат.НалоговоеНазначение;
		
		Если Ремонт Тогда
			
			Проводка.Содержание = Локализация.СтрШаблон1("Модернизация ""¤1¤""", СтрокаЗатрат.ОбъектУчета);
			ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.ОбъектСтроительства);
			
		Иначе
			
			Проводка.Содержание = ?(НЕ ЗначениеЗаполнено(ТекстПроводки), "Начислена амортизация", ТекстПроводки);
			ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, 1, СтрокаЗатрат.ОбъектУчета);
			
		КонецЕсли;
		
	КонецЦикла;

	// Отражение амортизации на 09 счете
	
	Если НЕ Ремонт Тогда
		
		СуммаПроводки = ТабЗатрат.Итог("Сумма");
		
		Если СуммаПроводки <> 0 Тогда
			
			Проводка = Проводки.Добавить();
			
			Проводка.Период       = ДатаРасчета;
			Проводка.Содержание   = "Накопление амортизационных отчислений";
			Проводка.НомерЖурнала = НомерЖурнала;
			Проводка.Организация  = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма        = СуммаПроводки;
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.АмортизационныеОтчисления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТабЗатрат;

КонецФункции // ПолучитьРаспределениеАмортизацииПоНаправлениямРегл()

Процедура ПроверитьСоответствиеНалоговогоНазначенияАмортизации(ОбъектУчета, НалоговоеНазначениеЗатрат, НалоговоеНазначениеОбъекта, Отказ = Ложь, СтрокаСообщенияДоп = "") 
	
	НехозДеятельностьНДС = (НалоговоеНазначениеОбъекта = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	НехозДеятельностьНКУ = (НалоговоеНазначениеЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	
	ОблагаемаяВидДеятельностиЗатрат = (НалоговоеНазначениеЗатрат.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая);
	ОблагаемаяВидДеятельностиОбъекта = (НалоговоеНазначениеОбъекта.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая);
	
	НалоговоеНазначениеЗатратНДСное = НалоговоеНазначениеЗатрат.ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС;
	
	Если НЕ ЗначениеЗаполнено(НалоговоеНазначениеЗатрат) Тогда
		
		СтрокаСообщения = НСтр("ru = 'Не заполнено налоговое назначение амортизации'") + СтрокаСообщенияДоп;
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ);			
		
	ИначеЕсли НЕ ЗначениеЗаполнено(НалоговоеНазначениеОбъекта) Тогда
		
		СтрокаСообщения = НСтр("ru = 'Не заполнено налоговое назначение объекта'");
		
	ИначеЕсли НалоговоеНазначениеЗатрат = НалоговоеНазначениеОбъекта Тогда
		
		
	ИначеЕсли НЕ НалоговоеНазначениеЗатратНДСное Тогда 
		
		Если НехозДеятельностьНДС <> НехозДеятельностьНКУ Тогда
			
			СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'; uk = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'"), ОбъектУчета, НалоговоеНазначениеОбъекта, НалоговоеНазначениеЗатрат) + СтрокаСообщенияДоп;
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ);			
			
		КонецЕсли;
		
	Иначе
		
		// НалоговоеНазначениеЗатратНДСное = Истина
		Если НалоговоеНазначениеОбъекта = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
			
			Если НалоговоеНазначениеЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
				
				СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'; uk = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'"), ОбъектУчета, НалоговоеНазначениеОбъекта, НалоговоеНазначениеЗатрат) + СтрокаСообщенияДоп;
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ);			
				
			КонецЕсли;
			
		ИначеЕсли НалоговоеНазначениеОбъекта = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая Тогда
			
			Если НалоговоеНазначениеЗатрат <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая Тогда	
				
				СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'; uk = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'"), ОбъектУчета, НалоговоеНазначениеОбъекта, НалоговоеНазначениеЗатрат) + СтрокаСообщенияДоп;
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ);			
				
			КонецЕсли; 
			
		ИначеЕсли НалоговоеНазначениеЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая 
			  ИЛИ НалоговоеНазначениеЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
			  
			  // здесь НалоговоеНазначениеОбъекта - не обл. НДС (хоз или не хоз)
			  
			  СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'; uk = 'Налоговое назначение объекта ¤1¤ <¤2¤> не соответствует налоговому назначению амортизации (<¤3¤>)'"), ОбъектУчета, НалоговоеНазначениеОбъекта, НалоговоеНазначениеЗатрат) + СтрокаСообщенияДоп;
			  ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ);			
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеНалоговогоНазначенияАмортизации

Процедура ПроверитьСоответствиеНалоговогоНазначенияОбъектов(ОбъектУчетаКт, ОбъектУчетаДт, НалоговоеНазначениеКт, НалоговоеНазначениеДт, Отказ = Ложь, Заголовок = "") Экспорт
	
	СтрокаОбъектУчетаКт = "";
	Если ТипЗнч(ОбъектУчетаКт) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
		СтрокаОбъектУчетаКт = НСтр("ru = 'объекта строительства'; uk = 'объекта строительства'");
	ИначеЕсли ТипЗнч(ОбъектУчетаКт) = Тип("СправочникСсылка.Номенклатура") Тогда	
		СтрокаОбъектУчетаКт = НСтр("ru = 'оборудования'; uk = 'обладнання'");
	КонецЕсли;	

	СтрокаОбъектУчетаДт = "";
	
	Если ТипЗнч(ОбъектУчетаДт) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
		СтрокаОбъектУчетаДт = НСтр("ru = 'объекта строительства'; uk = 'объекта строительства'");
	ИначеЕсли ТипЗнч(ОбъектУчетаДт) = Тип("СправочникСсылка.Номенклатура") Тогда	
		СтрокаОбъектУчетаДт = НСтр("ru = 'оборудования'; uk = 'обладнання'");
	Иначе	
		СтрокаОбъектУчетаДт = НСтр("ru = 'основного средства'; uk = 'основного средства'");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(НалоговоеНазначениеКт) Тогда
		
		Возврат;
		
	ИначеЕсли НалоговоеНазначениеДт = НалоговоеНазначениеКт Тогда
		
		Возврат;
		
	ИначеЕсли НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
			
		Если  НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая
			И НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность Тогда
			СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'; uk = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'"), СтрокаОбъектУчетаКт, НалоговоеНазначениеКт, СтрокаОбъектУчетаДт, НалоговоеНазначениеДт);
			ОбщегоНазначения.СообщитьИнформацию(СтрокаСообщения, Заголовок);
		КонецЕсли;
		
	ИначеЕсли НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая Тогда
		
		Если  НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая Тогда
			СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'; uk = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'"), СтрокаОбъектУчетаКт, НалоговоеНазначениеКт, СтрокаОбъектУчетаДт, НалоговоеНазначениеДт);
			ОбщегоНазначения.СообщитьИнформацию(СтрокаСообщения, Заголовок);
		КонецЕсли;
		
	ИначеЕсли     (НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально)
			  ИЛИ (НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая)
				Тогда
		// здесь НалоговоеНазначениеКт - не обл. НДС (хоз или не хоз)
		
		СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'; uk = 'Налоговое назначение ¤1¤ <¤2¤> не соответствует налоговому назначению ¤3¤ <¤4¤>'"), СтрокаОбъектУчетаКт, НалоговоеНазначениеКт, СтрокаОбъектУчетаДт, НалоговоеНазначениеДт);
		ОбщегоНазначения.СообщитьИнформацию(СтрокаСообщения, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеНалоговогоНазначенияОбъектов

Процедура ПроверитьСоответствиеНалоговогоНазначенияАмортизацииОбъекта(ОбъектУчета, СпособОтраженияРасходовПоАмортизации, НалоговоеНазначение, Отказ = Ложь, Заголовок = "", Дата = '00010101') Экспорт
	
	Если НЕ ЗначениеЗаполнено(СпособОтраженияРасходовПоАмортизации) Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаНапр Из СпособОтраженияРасходовПоАмортизации.Способы Цикл
		
		СтрокаСообщенияДоп = Локализация.СтрШаблон1(НСтр("ru=' (Способ отражения: ""¤1¤"", строка № ¤2¤)';uk=' (Спосіб відбиття: ""¤1¤"", рядок № ¤2¤)'"), СпособОтраженияРасходовПоАмортизации, СтрокаНапр.НомерСтроки);
		
		НалоговоеНазначениеДоходовИЗатрат = СтрокаНапр.НалоговоеНазначениеДоходовИЗатрат;
		
		ХарактерЗатрат = Неопределено;
		НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(СтрокаНапр, СтрокаНапр.СчетЗатрат, ХарактерЗатрат,
															   	НалоговоеНазначениеДоходовИЗатрат, ,                             
																НалоговоеНазначение, СтрокаНапр.НалоговоеНазначениеДоходовИЗатрат,,,,Дата);
																
		Если ХарактерЗатрат = "ОПЗ" Тогда
			Если ЗначениеЗаполнено(СтрокаНапр.НалоговоеНазначение) Тогда
				// при неуказанном НН по НДС по 91 счету НН определяется исходя из НН 
				НалоговоеНазначениеДоходовИЗатрат = СтрокаНапр.НалоговоеНазначение;
			Иначе	
				// при неуказанном НН по НДС по 91 счету НН определяется исходя из НН 
				НалоговоеНазначениеДоходовИЗатрат = НалоговоеНазначение;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НалоговоеНазначениеДоходовИЗатрат) Тогда
			НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();	
		КонецЕсли;	
		
		ПроверитьСоответствиеНалоговогоНазначенияАмортизации(ОбъектУчета, НалоговоеНазначениеДоходовИЗатрат, НалоговоеНазначение, Отказ, СтрокаСообщенияДоп);
		
	КонецЦикла;	
		
КонецПроцедуры // ПроверитьСоответствиеНалоговогоНазначенияОбъектов

///////////////////////////////////////////////////////////////////////////////
// ОПРЕДЕЛЕНИЕ СОСТОЯНИЯ ОС

#Если Клиент Тогда

// Функция расчитывает стоимость объекта строительства по разным видам учета
// Возвращает структуру со значениями стоимостей по видам учета, поля:
// - СтоимостьБУ
// - СтоимостьНУ
//
Функция РасчитатьСтоимостьОбъектаСтроительства(ОтражатьВУправленческомУчете,ОтражатьВБухгалтерскомУчете,ОтражатьВНалоговомУчете, СчетУчетаБУВнеоборотногоАктива,
	                                           ОбъектСтроительства, Организация, Период = Неопределено) Экспорт

	СтруктураСтоимость = Новый Структура;
	СтруктураСтоимость.Вставить("СтоимостьУУ",0);
	СтруктураСтоимость.Вставить("СтоимостьБУ", 0);
	СтруктураСтоимость.Вставить("СтоимостьНУ", 0);
	
	Если НЕ ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Предупреждение("Не выбран объект строительства", 60);
		Возврат СтруктураСтоимость;
	КонецЕсли;

	Если (ОтражатьВБухгалтерскомУчете) и (НЕ ЗначениеЗаполнено(Организация)) Тогда
		Предупреждение("Не выбрана организация", 60);
		Возврат СтруктураСтоимость;
	КонецЕсли;

	Если (ОтражатьВБухгалтерскомУчете ) и (НЕ ЗначениеЗаполнено(СчетУчетаБУВнеоборотногоАктива)) Тогда
		Предупреждение("Не выбран счет бухгалтерского учета объекта строительства", 60);
		Возврат СтруктураСтоимость;
	КонецЕсли;
	
	ПериодГраница = Новый Граница (Период, ВидГраницы.Включая);
	
	Если ОтражатьВУправленческомУчете Тогда
		ВыборкаЗаписей = РегистрыНакопления.СтроительствоОбъектовОсновныхСредств.Остатки(ПериодГраница,Новый Структура("ОбъектСтроительства",ОбъектСтроительства));
		СтруктураСтоимость.СтоимостьУУ = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].Сумма,0);
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"             , ПериодГраница);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	Запрос.УстановитьПараметр("СчетУчетаБУ"        , СчетУчетаБУВнеоборотногоАктива);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ОбъектСтроительства);
	Запрос.УстановитьПараметр("СубконтоОС"         , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СтоимостьБУ,
	|	ХозрасчетныйОстатки.СуммаНУОстатокДт    КАК СтоимостьНУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, 
	|	                   Счет = &СчетУчетаБУ, &СубконтоОС,
	|	                   Организация = &Организация
	|	                   И Субконто1 = &ОбъектСтроительства) КАК ХозрасчетныйОстатки";
	ТЗ = Запрос.Выполнить().Выгрузить();


	Если ТЗ.Количество()>0 Тогда

		Если ОтражатьВБухгалтерскомУчете Тогда
			
			СтруктураСтоимость.Вставить("СтоимостьБУ", ТЗ.Итог("СтоимостьБУ"));
			СтруктураСтоимость.Вставить("СтоимостьНУ", ТЗ.Итог("СтоимостьНУ"));
			
		КонецЕсли;	
		
	КонецЕсли;

	
	Возврат СтруктураСтоимость;

КонецФункции

// Процедура выполняет стандартные действия при начале выбора состояния ОС в формах документов.
//
// Параметры:
//  ДокументОбъект                   - объект редактируемого документа;
//  ЭлементФормы                     - элемент формы документа, который надо заполнить; 
//  ВидыОпераций                     - вид операций ОС для отбора, значение перечисления ВидыОперацийОС;
//  СтандартнаяОбработка             - булево, признак выполнения стандартной (системной) обработки события,
//
Процедура НачалоВыбораЗначенияСобытийОС(ЭлементФормы, ВидыСобытий=Неопределено, СтандартнаяОбработка, ЗаблокироватьПолученныеВидыСобытий = Ложь) Экспорт

	СтандартнаяОбработка = Ложь;
	ФормаВыбора          = Справочники.СобытияОС.ПолучитьФормуВыбора( , ЭлементФормы, );
	
	Если ТипЗнч(ЭлементФормы) = Тип("ПолеВвода") Тогда
		
		ФормаВыбора.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
		
	КонецЕсли;

	Если ВидыСобытий<>Неопределено Тогда

		Если ЗаблокироватьПолученныеВидыСобытий тогда
			// Удалим из выбора "неправильные" состояния
			Если ТипЗнч(ВидыСобытий) = Тип("СписокЗначений") Тогда
				ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.ВидСравнения = ВидСравнения.НеВСписке;
			Иначе
				ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.ВидСравнения = ВидСравнения.НеРавно;
			КонецЕсли;
		Иначе
			// Оставим в выборе только "правильные" состояния
			Если ТипЗнч(ВидыСобытий) = Тип("СписокЗначений") Тогда
				ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.ВидСравнения = ВидСравнения.ВСписке;
			Иначе
				ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.ВидСравнения = ВидСравнения.Равно;
			КонецЕсли;
        КонецЕсли;
		ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.Значение         = ВидыСобытий;
		ФормаВыбора.СправочникСписок.Отбор.ВидСобытияОС.Использование    = Истина;

	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияСостоянияОС()
	
// Процедура выполняет действия при изменении события ОС в формах документов.
// Необходима для проверки разрешенных событий, если пользователь воспользовался 
// быстрым выбором в реквизите.
//
// Параметры:
//  ЭлементФормы  - элемент формы документа, который надо заполнить; 
//  ВидыСостояний - СписокЗначений или значение перечисления ВидыСобытийОС - разрешенные виды событий ОС;
//
Процедура ПриИзмененииЗначенияСобытияОС(ЭлементФормы, ВидыСобытий) Экспорт

	Если (ВидыСобытий <> Неопределено) И (ЗначениеЗаполнено(ЭлементФормы.Значение)) Тогда
		
		ВыбранныйВидСобытия = ЭлементФормы.Значение.ВидСобытияОС;
		Отказ = Ложь;
		
		Если ТипЗнч(ВидыСобытий) = Тип("СписокЗначений") Тогда
			
			Отказ = (ВидыСобытий.НайтиПоЗначению(ВыбранныйВидСобытия) = Неопределено);
			
		Иначе
			
			Отказ = (ВидыСобытий <> ВыбранныйВидСобытия);
			
		КонецЕсли;
		
		Если Отказ Тогда
			
			Сообщить("В данном контексте можно выбирать только события с видом: """ 
			         + ВидыСобытий + """.", СтатусСообщения.Важное);
			ЭлементФормы.Значение = Справочники.СобытияОС.ПустаяСсылка();
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // НачалоВыбораЗначенияСобытияОС()
	

// Процедура выполняет стандартные действия при начале выбора способов отражения расходов по амортизации формах документов.
//
// Параметры:
//  ДокументОбъект                   - объект редактируемого документа;
//  ЭлементФормы                     - элемент формы документа, который надо заполнить; 
//  ВидыОпераций                     - вид операций ОС для отбора, значение перечисления ВидыОперацийОС;
//  СтандартнаяОбработка             - булево, признак выполнения стандартной (системной) обработки события,
//
Процедура НачалоВыбораЗначенияСпособовОтраженияРасходовПоАмортизации(ЭлементФормы, Организация=Неопределено, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	ФормаВыбора          = Справочники.СпособыОтраженияРасходовПоАмортизации.ПолучитьФормуВыбора(,ЭлементФормы,);

	Если Организация<>Неопределено Тогда
		// Оставим в выборе только записи с организацией из документа и те, в которых организация вообще не указана
		СписокОрганизаций = Новый СписокЗначений;
		СписокОрганизаций.Добавить(Организация);
		СписокОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
		ФормаВыбора.СправочникСписок.Отбор.Организация.ВидСравнения = ВидСравнения.ВСписке;
		ФормаВыбора.СправочникСписок.Отбор.Организация.Значение         = СписокОрганизаций;
		ФормаВыбора.СправочникСписок.Отбор.Организация.Использование    = Истина;

	КонецЕсли;
    ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияСостоянияОС()

#КонецЕсли

// Возвращает из справочника событий ОС первую найденную запись с заданным видом события,
// иначе возвращает пустую ссылку на справочник
//
// Параметры
//  ВидСобытия (Перечисление ВидыСобытийОС): вид события
//
// Возвращаемое значение:
//   элемент справочника событий ОС
//
Функция ПолучитьСобытиеПоОСИзСправочника(ВидСобытия) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСобытияОС", ВидСобытия);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	ВидСобытияОС
	|ИЗ
	|	Справочник.СобытияОС КАК СобытияОС
	|
	|ГДЕ
	|	ВидСобытияОС = &ВидСобытияОС";
	ТаблицаСобытий = Запрос.Выполнить().Выгрузить();

	Если ТаблицаСобытий.Количество()>0 Тогда
		Возврат ТаблицаСобытий[0].Ссылка;

	Иначе
		Возврат Справочники.СобытияОС.ПустаяСсылка();

	КонецЕсли;

КонецФункции // ПолучитьСобытиеОСИзСправочника()

// Поцедура проверяет дублирование состояний ОС. 
// Если определенное состояние было установлено ранее, устанавливать его второй раз нельзя (в пределах одной организации)
Процедура ПроверкаДублированияЗаписейСостоянийОС(Организация, ТаблицаЗаписей,Отказ,Заголовок) Экспорт

	Если ТаблицаЗаписей.Количество() =0 тогда
		Возврат;
	КонецЕсли;
	
	НаборСостояний = Новый Массив();
	ОС_ПоСостояниям  = Новый Массив();
	Для каждого Состояние из Перечисления.СостоянияОС Цикл
		НаборСостояний.Добавить(Состояние);
		ОС_ПоСостояниям.Добавить(Новый массив());
	КонецЦикла;
	
	Для Каждого ТекЗапись из ТаблицаЗаписей Цикл
		
		Для А = 1 по НаборСостояний.количество() Цикл
			Если ТекЗапись.Состояние = НаборСостояний[А-1] тогда	
				ОС_ПоСостояниям[А-1].Добавить(ТекЗапись.ОсновноеСредство);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для А = 1 по НаборСостояний.количество() Цикл
		Если ОС_ПоСостояниям[А-1].Количество()>0 тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СостоянияОСОрганизаций.ОсновноеСредство,
			|	СостоянияОСОрганизаций.ДатаСостояния,
			|	СостоянияОСОрганизаций.Регистратор
			|ИЗ
			|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
			|
			|ГДЕ
			|	СостоянияОСОрганизаций.Организация = &Организация И
			|	СостоянияОСОрганизаций.Состояние = &Состояние И
			|	СостоянияОСОрганизаций.ОсновноеСредство В(&ОсновныеСредства)";

			Запрос.УстановитьПараметр("Организация",Организация );
			Запрос.УстановитьПараметр("Состояние",	НаборСостояний[А-1]);
			Запрос.УстановитьПараметр("ОсновныеСредства",ОС_ПоСостояниям[А-1]);

			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();

			Пока Выборка.Следующий() Цикл
				ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Для основного средства <¤1¤> в организации <¤2¤> уже зафиксировано состояние <¤3¤> "
" документом <¤4¤>. Дата состояния: ¤5¤", Строка(Выборка.ОсновноеСредство), Строка(Организация), Строка(НаборСостояний[А-1]), Строка(Выборка.Регистратор), Формат(Выборка.ДатаСостояния,"ДФ=dd.MM.yyyy")),Отказ,Заголовок);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
Конецпроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОПРЕДЕЛЕНИЕ СОСТОЯНИЯ НМА

// Поцедура проверяет дублирование состояний НМА. 
// Если определенное состояние было установлено ранее, устанавливать его второй раз нельзя (в пределах одной организации)
Процедура ПроверкаДублированияЗаписейСостоянийНМАУпр(Период, ТаблицаЗаписей,Отказ,Заголовок) Экспорт
	
	Если ТаблицаЗаписей.Количество() =0 тогда
		Возврат;
	КонецЕсли;
	
	НаборСостояний = Новый Массив();
	НМА_ПоСостояниям  = Новый Массив();
	Для каждого Состояние из Перечисления.ВидыСостоянийНМА Цикл
		НаборСостояний.Добавить(Состояние);
		НМА_ПоСостояниям.Добавить(Новый массив());
	КонецЦикла;
	
	Для Каждого ТекЗапись из ТаблицаЗаписей Цикл
		
		Для А = 1 по НаборСостояний.количество() Цикл
			Если ТекЗапись.Состояние = НаборСостояний[А-1] тогда	
				НМА_ПоСостояниям[А-1].Добавить(ТекЗапись.НематериальныйАктив);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекущийРегистратор = ТаблицаЗаписей.Отбор.Регистратор.Значение;
	
	Для А = 1 по НаборСостояний.Количество() Цикл
		Если НМА_ПоСостояниям[А-1].Количество()>0 тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияНМАСрезПоследних.НематериальныйАктив,
			|	СостоянияНМАСрезПоследних.Регистратор
			|ИЗ
			|	РегистрСведений.СостоянияНМА.СрезПоследних(
			|		&Период,
			|		НематериальныйАктив В (&НематериальныеАктивы)
			|		    И Состояние = &Состояние
			|		    И (НЕ Регистратор = &ТекущийРегистратор)) КАК СостоянияНМАСрезПоследних";

			Запрос.УстановитьПараметр("Состояние",	НаборСостояний[А-1]);
			Запрос.УстановитьПараметр("НематериальныеАктивы",НМА_ПоСостояниям[А-1]);
			Запрос.УстановитьПараметр("ТекущийРегистратор",ТекущийРегистратор);
			Запрос.УстановитьПараметр("Период",новый МоментВремени(Период,ТекущийРегистратор));

			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();

			Пока Выборка.Следующий() Цикл
				ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Для НМА <¤1¤> уже зафиксировано состояние <¤2¤> по управленческому учету"
" документом <¤3¤>. Дата состояния: ¤4¤", Строка(Выборка.НематериальныйАктив), Строка(НаборСостояний[А-1]), Строка(Выборка.Регистратор), Формат(Выборка.Регистратор.Дата,"ДФ=dd.MM.yyyy"))
									,Отказ,Заголовок);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Поцедура проверяет дублирование состояний НМА. 
// Если определенное состояние было установлено ранее, устанавливать его второй раз нельзя (в пределах одной организации)
Процедура ПроверкаДублированияЗаписейСостоянийНМА(Организация, Период, ТаблицаЗаписей,Отказ,Заголовок) Экспорт
	
	Если ТаблицаЗаписей.Количество() =0 тогда
		Возврат;
	КонецЕсли;
	
	НаборСостояний = Новый Массив();
	НМА_ПоСостояниям  = Новый Массив();
	Для каждого Состояние из Перечисления.ВидыСостоянийНМА Цикл
		НаборСостояний.Добавить(Состояние);
		НМА_ПоСостояниям.Добавить(Новый массив());
	КонецЦикла;
	
	Для Каждого ТекЗапись из ТаблицаЗаписей Цикл
		
		Для А = 1 по НаборСостояний.количество() Цикл
			Если ТекЗапись.Состояние = НаборСостояний[А-1] тогда	
				НМА_ПоСостояниям[А-1].Добавить(ТекЗапись.НематериальныйАктив);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекущийРегистратор = ТаблицаЗаписей.Отбор.Регистратор.Значение;
	
	Для А = 1 по НаборСостояний.Количество() Цикл
		Если НМА_ПоСостояниям[А-1].Количество()>0 тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияНМАОрганизацийСрезПоследних.НематериальныйАктив,
			|	СостоянияНМАОрганизацийСрезПоследних.Регистратор
			|ИЗ
			|	РегистрСведений.СостоянияНМАОрганизаций.СрезПоследних(
			|		&Период,
			|		Организация = &Организация
			|		    И НематериальныйАктив В (&НематериальныеАктивы)
			|		    И Состояние = &Состояние
			|		    И (НЕ Регистратор = &ТекущийРегистратор)) КАК СостоянияНМАОрганизацийСрезПоследних";

			Запрос.УстановитьПараметр("Организация",Организация );
			Запрос.УстановитьПараметр("Состояние",	НаборСостояний[А-1]);
			Запрос.УстановитьПараметр("НематериальныеАктивы",НМА_ПоСостояниям[А-1]);
			Запрос.УстановитьПараметр("ТекущийРегистратор",ТекущийРегистратор);
			Запрос.УстановитьПараметр("Период",новый МоментВремени(Период,ТекущийРегистратор));

			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();

			Пока Выборка.Следующий() Цикл
				ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Для НМА <¤1¤> в организации <¤2¤> уже зафиксировано состояние <¤3¤> по бухгалтерскому учету"
" документом <¤4¤>. Дата состояния: ¤5¤", Строка(Выборка.НематериальныйАктив), Строка(Организация), Строка(НаборСостояний[А-1]), Строка(Выборка.Регистратор), Формат(Выборка.Регистратор.Дата,"ДФ=dd.MM.yyyy"))
									,Отказ,Заголовок);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ

// Проверяет дублирование НМА или ОС в табличной части документа
//
// Параметры
//  ТабличнаяЧасть       – Тип: ТаблицаЗначений, ТабличнаяЧасть – Табличная часть документа. 
//                                             
//  ИмяКолонки           – Тип: Строка – Имя колонки, в которой содержится ОС или НМА
//                 
//  ПредставлениеКолонки – Тип: Строка – Представление колонки, в которой содержится ОС или НМА.
//                                       Для сообщений об ошибках
//                 
//  Отказ                – Тип: Булево – признак отказа
//                 
//  Заголовок            – Тип: Строка – заголовок вызывающего документа,
//                                               для сообщения об ошибке
//                 
Процедура ПроверитьДублированиеОСиНМАвТабличнойЧасти(ТабличнаяЧасть, ИмяКолонки, ПредставлениеКолонки, Отказ, Заголовок) Экспорт

	Если ТабличнаяЧасть.Количество() <= 1 Тогда
		
		Возврат
		
	КонецЕсли;
	
	Сообщение = "Дублируется " + ПредставлениеКолонки + """";
	
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		
		ТЗ = ТабличнаяЧасть.Скопировать();
		
	Иначе
		
		ТЗ = ТабличнаяЧасть.Выгрузить();
		
	КонецЕсли;

	Пока ТЗ.Количество() > 0 Цикл
		
		Элемент         = ТЗ[0][ИмяКолонки];
		СтруктураОтбора = Новый Структура(ИмяКолонки, Элемент);
		МассивСтрок     = ТЗ.НайтиСтроки(СтруктураОтбора);
		ЕстьДубли       = (МассивСтрок.Количество() > 1);
		НомераСтрок     = "";
		Разделитель     = "";
		
		Для каждого СтрокаТЧ Из МассивСтрок Цикл
		
			НомераСтрок = НомераСтрок + Разделитель + СтрокаТЧ.НомерСтроки;
			Разделитель = ", ";
			ТЗ.Удалить(СтрокаТЧ);
		
		КонецЦикла;
		
		Если ЕстьДубли Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(Сообщение + Элемент + """ в строках: " + НомераСтрок, Отказ, Заголовок);
			
		КонецЕсли;
	
	КонецЦикла;	
	
КонецПроцедуры // ПроверитьДублированиеОСиНМАвТабличнойЧасти()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ ОС

// Процедура дополняет табличную часть колонками
// СчетУчетаБУ, СчетНачисленияАмортизацииБУ, СчетУчетаНУ, СтатьяАмортизации,
// НалоговаяГруппаОС, Пообъектно, УчитываетсяКакЗапасНУ,
// НалоговоеНазначение_ОС для основных средств. 
//
// Параметры
//  ДатаДока                     – Тип: Дата, МоментВремени, Граница – Дата, на которую получать результаты
//                 
//  ТаблицаПоОС                  – Тип: ТаблицаЗначений – Таблица, в которую необходимо добавить колонки
//                 
//  СтруктураШапкиДокумента      – Тип: Структура - параметры документа
//                 
//  Отказ                        – Тип: Булево – признак отказа
//                 
//  Заголовок                    – Тип: Строка – заголовок вызывающего документа,
//                                               для сообщения об ошибке
//                 
//  ИмяКолонкиОсновногоСредства  – Тип: Строка – Наименование колонки, в которой содержаться основные средства
//                 
//
Процедура ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл(ДатаДока, ТаблицаПоОС,
	                                                        СтруктураШапкиДокумента, Отказ, Заголовок,
														    ИмяКолонкиОсновногоСредства = "ОсновноеСредство",
															ПолучатьСпособНачисленияАмортизации = Ложь) Экспорт
	
	ТаблицаПоОС.Колонки.Добавить("СчетУчетаБУ"                , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПоОС.Колонки.Добавить("СчетНачисленияАмортизацииБУ", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПоОС.Колонки.Добавить("НаправлениеБУ"              , Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТаблицаПоОС.Колонки.Добавить("СчетУчетаДооценокОС"          , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Если ПолучатьСпособНачисленияАмортизации Тогда
		
		ТаблицаПоОС.Колонки.Добавить("СпособНачисленияАмортизацииБУ", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыНачисленияАмортизацииОС"));
		
	КонецЕсли;
	
	ТекОрганизация          = СтруктураШапкиДокумента.Организация;
	ЕстьНалогНаПрибыль      = СтруктураШапкиДокумента.ЕстьНалогНаПрибыль;
	ЕстьНДС                 = СтруктураШапкиДокумента.ЕстьНДС;
	флНалоговыйУчет        	= ЕстьНалогНаПрибыль ИЛИ ЕстьНДС;
	ВидДеятельностиНепроизводственная = Справочники.ВидыНалоговойДеятельности.НеОблагаемая;
	
		
		ТаблицаПоОС.Колонки.Добавить("НалоговоеНазначение_ОС",      Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
		ТаблицаПоОС.Колонки.Добавить("ВидНалоговойДеятельности_ОС", Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговойДеятельности"));
		ТаблицаПоОС.Колонки.Добавить("ВидДеятельностиНДС_ОС",       Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиНДС"));
		ТаблицаПоОС.Колонки.Добавить("НалоговаяГруппаОС",           Новый ОписаниеТипов("СправочникСсылка.НалоговыеГруппыОсновныхСредств"));
		
	
	СписокОС = ТаблицаПоОС.ВыгрузитьКолонку(ИмяКолонкиОсновногоСредства);
	
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Запрос.УстановитьПараметр("ТекДата",        ДатаДока);
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство                         КАК ОС_БУ,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета                                КАК СчетУчетаБУ,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчетаДооценокОС                      КАК СчетУчетаДооценокОС,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации                КАК СчетНачисленияАмортизацииБУ," + ?(ПолучатьСпособНачисленияАмортизации, "
	|	ПервоначальныеСведенияОС_БУ.СпособНачисленияАмортизации             КАК СпособНачисленияАмортизацииБУ,", "") + "
	|	СпособыОтраженияБУ.СпособыОтраженияРасходовПоАмортизации            КАК НаправлениеБУ" + ?(ЕстьНалогНаПрибыль, ",
	|	ПервоначальныеСведенияОС_НУ.ОсновноеСредство                        КАК ОС_НУ,
	|	ПервоначальныеСведенияОС_НУ.НалоговаяГруппаОС                       КАК НалоговаяГруппаОС
	|	", "") + ",
	|	НалоговыеНазначенияОС.ОсновноеСредство                              КАК ОС_НУ1,
	|	НалоговыеНазначенияОС.НалоговоеНазначение                           КАК НалоговоеНазначение_ОС,
	|	НалоговыеНазначенияОС.НалоговоеНазначение.ВидНалоговойДеятельности  КАК ВидНалоговойДеятельности_ОС,
	|	НалоговыеНазначенияОС.НалоговоеНазначение.ВидДеятельностиНДС        КАК ВидДеятельностиНДС_ОС
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		            &ТекДата,
	|		            Организация = &ТекОрганизация
	|		            И ОсновноеСредство В (&СписокОС)) КАК СчетаБухгалтерскогоУчетаОС" + ?(ПолучатьСпособНачисленияАмортизации, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС_БУ
	|		ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ПервоначальныеСведенияОС_БУ.ОсновноеСредство", "") + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И ОсновноеСредство В (&СписокОС)) КАК СпособыОтраженияБУ
	|		ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = СпособыОтраженияБУ.ОсновноеСредство" + ?(ЕстьНалогНаПрибыль, ",
	|		ПОЛНОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС_НУ                  
	|		ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ПервоначальныеСведенияОС_НУ.ОсновноеСредство", "") + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И ОсновноеСредство В (&СписокОС)) КАК НалоговыеНазначенияОС
	|		ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство";
	
	ТаблицаСведенийОС  = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		ТекОС =  СтрокаТЧ[ИмяКолонкиОсновногоСредства];
		
		Если ЕстьНалогНаПрибыль Тогда
			
			Колонки = "ОС_БУ, ОС_НУ, ОС_НУ1";
			
		ИначеЕсли ЕстьНДС Тогда
			
			Колонки = "ОС_БУ, ОС_НУ1";
			
		Иначе
			
			Колонки = "ОС_БУ";
			
		КонецЕсли;
		
		СтрокаСведений = ТаблицаСведенийОС.Найти(ТекОс, Колонки);	
		
		Если СтрокаСведений = Неопределено Тогда
			
			Если флНалоговыйУчет Тогда
				ТекстСообщения = Локализация.СтрШаблон1("Строка ¤1¤."
"	Регл. учет: По основному средству ""¤2¤"" и организации ""¤3¤"" нет информации"
"	в регистрах сведений:"
"	""Счета бухгалтерского учета основных средств"""
"	""Первоначальные сведения об основных средствах (налоговый учет)"""
"	""Налоговые назначения ОС"""
"	Возможно, оно не принято к учету.", ТаблицаПоОС.Индекс(СтрокаТЧ) + 1, ТекОс, ТекОрганизация);	
			Иначе
				ТекстСообщения = Локализация.СтрШаблон1("Строка ¤1¤."
"	Регл. учет: По основному средству ""¤2¤"" и организации ""¤3¤"" нет информации"
"	в регистрах сведений:"
"	""Счета бухгалтерского учета основных средств"""
"	Возможно, оно не принято к учету.", ТаблицаПоОС.Индекс(СтрокаТЧ) + 1, ТекОс, ТекОрганизация);	
			КонецЕсли;	
			
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			Продолжить
			
		КонецЕсли;
		
		СчетУчетаБУ = СтрокаСведений.СчетУчетаБУ;
		
		Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бух. учет: По основному средству ""¤2¤"" и организации ""¤3¤"" не заполнен счет учета "
"	в регистре сведений ""Счета бухгалтерского учета основных средств""", ТаблицаПоОС.Индекс(СтрокаТЧ) + 1, ТекОс, ТекОрганизация), Отказ, Заголовок);
			
		Иначе
			
			СтрокаТЧ.СчетУчетаБУ = СчетУчетаБУ;
			
		КонецЕсли;
		
		СчетНачисленияАмортизацииБУ = СтрокаСведений.СчетНачисленияАмортизацииБУ;
		
		Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бух. учет: По основному средству ""¤2¤"" и организации ""¤3¤"" не заполнен счет начисления амортизации"
"	в регистре сведений ""Счета бухгалтерского учета основных средств""", ТаблицаПоОС.Индекс(СтрокаТЧ)+ 1, ТекОс, ТекОрганизация), Отказ, Заголовок);
			
		Иначе
			
			СтрокаТЧ.СчетНачисленияАмортизацииБУ = СчетНачисленияАмортизацииБУ;
			
		КонецЕсли;
		
		СтрокаТЧ.СчетУчетаДооценокОС = СтрокаСведений.СчетУчетаДооценокОС;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетУчетаДооценокОС) Тогда 
			СтрокаТЧ.СчетУчетаДооценокОС = ПланыСчетов.Хозрасчетный.ДооценкаОсновныхСредств; // По умолчанию 423.1
		КонецЕсли;	
		
		НаправлениеБУ = СтрокаСведений.НаправлениеБУ;
		
		// Направление будет проверяться при распределении амортизации,
		// поэтому сообщения не выдаются
		Если ЗначениеЗаполнено(НаправлениеБУ) Тогда
			
			СтрокаТЧ.НаправлениеБУ = НаправлениеБУ;
			
		КонецЕсли;
		
		Если ПолучатьСпособНачисленияАмортизации Тогда
			
			СтрокаТЧ.СпособНачисленияАмортизацииБУ = СтрокаСведений.СпособНачисленияАмортизацииБУ
			
		КонецЕсли;
		
		Если ЕстьНалогНаПрибыль ИЛИ ЕстьНДС Тогда
			
			НалоговоеНазначение_ОС      = СтрокаСведений.НалоговоеНазначение_ОС;
			ВидНалоговойДеятельности_ОС = СтрокаСведений.ВидНалоговойДеятельности_ОС;
			
			Если НЕ ЗначениеЗаполнено(НалоговоеНазначение_ОС) Тогда
				
				//НалоговоеНазначение_ОС должен быть заполнен обязательно
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Налог. учет: По Основному средству ""¤2¤"" и организации ""¤3¤"" не заполнено налоговое назначение"
"	в регистре сведений ""Налоговые назначения ОС""", ТаблицаПоОС.Индекс(СтрокаТЧ) + 1, ТекОс, ТекОрганизация), Отказ, Заголовок);
				
			Иначе
				
				СтрокаТЧ.НалоговоеНазначение_ОС      = НалоговоеНазначение_ОС;
				СтрокаТЧ.ВидНалоговойДеятельности_ОС = ВидНалоговойДеятельности_ОС;
				СтрокаТЧ.ВидДеятельностиНДС_ОС       = СтрокаСведений.ВидДеятельностиНДС_ОС;
				
			КонецЕсли;
			
			Если ЕстьНалогНаПрибыль Тогда
				
				НалоговаяГруппаОС = СтрокаСведений.НалоговаяГруппаОС;
					
				Если НЕ ЗначениеЗаполнено(НалоговаяГруппаОС) Тогда
						
						
				Иначе
						
					СтрокаТЧ.НалоговаяГруппаОС = НалоговаяГруппаОС;
						
				КонецЕсли;
								
			КонецЕсли;
				
		Иначе
			//СтрокаТЧ.НалоговоеНазначение_ОС = СтрокаСведений.НалоговоеНазначение_ОС;
		    НепроизводственныйОС = (СтрокаСведений.НалоговоеНазначение_ОС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
			Если НепроизводственныйОС Тогда
				СтрокаТЧ.НалоговоеНазначение_ОС = СтрокаСведений.НалоговоеНазначение_ОС;
			Иначе	
				СтрокаТЧ.НалоговоеНазначение_ОС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл()

// Заполняет табличную часть основных средств следующими значениями:
// (Имя колонки основных средств должно быть "ОсновноеСредство")
//
// 	Управленческий учет:
//	 	Стоимость;
//	 	Амортизация;
//	 	АмортизацияЗаМесяц;
//
// 	Бухгалтерский учет:
//	 	СтоимостьБУ;
//	 	АмортизацияБУ;
//	 	АмортизацияЗаМесяцБУ;
//
// 	Налоговый учет:
//	 	СтоимостьНУ;
//	 	АмортизацияЗаМесяцНУ;
//
// Параметры
//
//  ДатаРасчета                   - Дата - Дата расчета амортизации
//
//  ОС                            – Табличная часть – табличная часть документа для заполнения
//                 
//  ТекОрганизация                – Тип: СправочникСсылка.Организации – Организация
//                 
//  ОтражатьВУправленческомУчете  – Булево 
//                 
//  ОтражатьВБухгалтерскомУчете   – Булево 
//                 
//  ОтражатьВНалоговомУчете       – Булево 
//                 
//  ДатаИтогов                    – Дата, МоментВремени, Граница - дата получения итогов 
//                 
Процедура ЗаполнитьТабличнуюЧастьОсновныхСредств(ДатаРасчета, ОС, ТекОрганизация, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, 
	                                             ОтражатьВНалоговомУчете, ДатаИтогов = Неопределено) Экспорт
												 
	Если НЕ (ОтражатьВУправленческомУчете ИЛИ ОтражатьВБухгалтерскомУчете ИЛИ ОтражатьВНалоговомУчете) Тогда
		
		ОбщегоНазначения.СообщитьИнформацию("Для заполнения табличной части необходимо выбрать тип учета");
		Возврат
		
	КонецЕсли;												 
													 
	Если ОтражатьВБухгалтерскомУчете И НЕ ЗначениеЗаполнено(ТекОрганизация) Тогда

		ОбщегоНазначения.СообщитьИнформацию("Для заполнения табличной части по данным регламентированного учета необходимо указать организацию");
		Возврат
		
	КонецЕсли;
	
	Если ДатаИтогов = Неопределено Тогда
		ДатаИтогов = ДатаРасчета;
	КонецЕсли;	
	
	// Для компактной записи вводятся 
	// новые переменные
	УУ = ОтражатьВУправленческомУчете;
	БУ = ОтражатьВБухгалтерскомУчете;
	НУ = ОтражатьВНалоговомУчете;
												 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("ДатаИтогов" , ДатаИтогов);
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	Запрос.УстановитьПараметр("СписокОС"  , СписокОС);
	Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредварительныйЗапрос.ОС                         КАК ОС," + ?(УУ, "
	|	СУММА(ПредварительныйЗапрос.СтоимостьУУ)         КАК СтоимостьУУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияУУ)       КАК АмортизацияУУ" + ?(БУ, ",", ""), "") + ?(БУ, "
	|	СУММА(ПредварительныйЗапрос.СтоимостьБУ)         КАК СтоимостьБУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияБУ)       КАК АмортизацияБУ,
	|	СУММА(ПредварительныйЗапрос.СуммаПереоценкиБУ) 	 КАК СуммаПереоценкиБУ,
	|	СУММА(ПредварительныйЗапрос.СтоимостьНУ)         КАК СтоимостьНУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияНУ) 		 КАК АмортизацияНУ", "") + "
	|ИЗ
	|	(
	|" + ?(УУ, "
	|
	|	ВЫБРАТЬ
	|		СтоимостьУУ.ОсновноеСредство 	КАК ОС,
	|		СтоимостьУУ.СтоимостьОстаток 	КАК СтоимостьУУ,
	|		СтоимостьУУ.АмортизацияОстаток 	КАК АмортизацияУУ,
	|		0 								КАК СтоимостьБУ,
	|		0 								КАК АмортизацияБУ,
	|		0 								КАК СуммаПереоценкиБУ,
	|		0 								КАК СтоимостьНУ,
	|		0 								КАК АмортизацияНУ
	|   ИЗ 
	|	РегистрНакопления.СтоимостьОС.Остатки(&ДатаИтогов, 
	|	                  ОсновноеСредство В (&СписокОС)) КАК СтоимостьУУ
	|
	|	
	|	
	|	
	|" + ?(БУ, "ОБЪЕДИНИТЬ ВСЕ", ""), "") + ?(БУ, "
	|
	|	ВЫБРАТЬ
	|		СтоимостьБУ.Субконто1      КАК ОС,
	|		0                          КАК СтоимостьУУ,
	|		0                          КАК АмортизацияУУ,
	|		СтоимостьБУ.СуммаОстатокДт КАК СтоимостьБУ,
	|		0                          КАК АмортизацияБУ,
	|		ПереоценкаОСБУ.СуммаПереоценкиОстаток КАК СуммаПереоценкиБУ,
	|		СтоимостьБУ.СуммаНУОстатокДт КАК СтоимостьНУ,
	|		0                          КАК АмортизацияНУ
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			               &ДатаИтогов,
	|			               Счет В
	|			               	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			               	 	СчетаБухгалтерскогоУчета.СчетУчета
	|			                 ИЗ
	|			                 	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			                 	                &ДатаИтогов,
	|			                 	                Организация = &Организация
	|			                                    И ОсновноеСредство В (&СписокОС)
	|			                                    ) КАК СчетаБухгалтерскогоУчета),
	|			               &СубконтоОС,
	|			               Организация = &Организация
	|			               И Субконто1 В (&СписокОС)) КАК СтоимостьБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПереоценкаОСБухгалтерскийУчет.Остатки(
	|					&ДатаИтогов,
	|					Организация = &Организация
	|						И ОсновноеСредство В (&СписокОС)) КАК ПереоценкаОСБУ
	|			ПО СтоимостьБУ.Субконто1 = ПереоценкаОСБУ.ОсновноеСредство
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АмортизацияБУ.Субконто1,
	|		0,
	|		0,
	|		0,
	|		АмортизацияБУ.СуммаОстатокКт,
	|		0,
	|		0,
	|		АмортизацияБУ.СуммаНУОстатокКт
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			               &ДатаИтогов,
	|			               Счет В
	|			               	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			               		СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|			                 ИЗ
	|			                 	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			                 	                &ДатаИтогов,
	|			                 	                Организация = &Организация
	|			                                    И ОсновноеСредство В (&СписокОС)
	|			                                    ) КАК СчетаБухгалтерскогоУчета),
	|			               &СубконтоОС,
	|			               Организация = &Организация
	|			               И Субконто1 В (&СписокОС)) КАК АмортизацияБУ
	|	
	|", "") + "
	|	) КАК ПредварительныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйЗапрос.ОС";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
			
		Если ОтражатьВУправленческомУчете Тогда
			
			ТаблицаАмортизацииУпр = РасчетАмортизацииУпр(ДатаРасчета, СписокОС);
			
		КонецЕсли;
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			
			ТаблицаАмортизацииБух = РасчетАмортизацииРегл(ДатаРасчета, ТекОрганизация, СписокОС);
			
			ЕстьРеквизитПревышениеСуммДооценокНадСуммамиУценокБУ = (ОС.ВыгрузитьКолонки().Колонки.Найти("ПревышениеСуммДооценокНадСуммамиУценокБУ") <> Неопределено);
			
		КонецЕсли;	
		
		
		Для каждого Строка Из ОС Цикл
			
			СтрокаТЗ = ТЗ.Найти(Строка.ОсновноеСредство, "ОС"); 
			
			Если СтрокаТЗ = Неопределено Тогда
				
				//управленческий учет
				Строка.СтоимостьУУ          = 0;
				Строка.АмортизацияУУ        = 0;
				Строка.АмортизацияЗаМесяцУУ = 0;
				
				//бухгалтерский учет
				Строка.СтоимостьБУ          = 0;
				Строка.АмортизацияБУ        = 0;
				Строка.АмортизацияЗаМесяцБУ = 0;
				
				//налоговый учет
				Строка.СтоимостьНУ          = 0;
				Строка.АмортизацияБУ  		= 0;
				Строка.АмортизацияЗаМесяцНУ = 0;
				
			Иначе
				// В соответствующие поля строки запишем данные из запроса
				
				//управленческий учет
				Если ОтражатьВУправленческомУчете Тогда
					
					Строка.СтоимостьУУ            = СтрокаТЗ.СтоимостьУУ;
					Строка.АмортизацияУУ          = СтрокаТЗ.АмортизацияУУ;
					СтрокаТаблицаАмортизацииУпр = ТаблицаАмортизацииУпр.Найти(Строка.ОсновноеСредство, "ОбъектУчета");
					
					//Строка.АмортизацияЗаМесяцУУ   = ?(СтрокаТаблицаАмортизацииУпр = Неопределено, 0, СтрокаТаблицаАмортизацииУпр.Амортизация);
					
					Если СтрокаТаблицаАмортизацииУпр = Неопределено Тогда
						
						Строка.АмортизацияЗаМесяцУУ = 0;
						
					Иначе
						
						Если СтрокаТаблицаАмортизацииУпр.Метод_50_50 Тогда
							
							Строка.АмортизацияЗаМесяцУУ = СтрокаТЗ.СтоимостьУУ - СтрокаТЗ.АмортизацияУУ;
							
						Иначе
							
							Строка.АмортизацияЗаМесяцУУ = СтрокаТаблицаАмортизацииУпр.Амортизация;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
				Иначе
					
					Строка.СтоимостьУУ          = 0;
					Строка.АмортизацияУУ        = 0;
					Строка.АмортизацияЗаМесяцУУ = 0;
					
				КонецЕсли;
				
				//бухгалтерский учет
				Если ОтражатьВБухгалтерскомУчете Тогда

					Строка.СтоимостьБУ          = СтрокаТЗ.СтоимостьБУ;
					Строка.АмортизацияБУ        = СтрокаТЗ.АмортизацияБУ;
					СтрокаТаблицаАмортизацииБух = ТаблицаАмортизацииБух.Найти(Строка.ОсновноеСредство, "ОбъектУчета");
					
					Строка.СтоимостьНУ          = СтрокаТЗ.СтоимостьНУ;
					Строка.АмортизацияНУ        = СтрокаТЗ.АмортизацияНУ;
					
					Если ЕстьРеквизитПревышениеСуммДооценокНадСуммамиУценокБУ Тогда
						Строка.ПревышениеСуммДооценокНадСуммамиУценокБУ = СтрокаТЗ.СуммаПереоценкиБУ;
					КонецЕсли;	
					
					Если СтрокаТаблицаАмортизацииБух = Неопределено Тогда
						
						Строка.АмортизацияЗаМесяцБУ = 0;
						Строка.АмортизацияЗаМесяцНУ = 0;
						
					Иначе
						
						Если СтрокаТаблицаАмортизацииБух.Метод_50_50 Тогда
							
							Строка.АмортизацияЗаМесяцБУ = СтрокаТЗ.СтоимостьБУ - СтрокаТЗ.АмортизацияБУ;
							Строка.АмортизацияЗаМесяцНУ = СтрокаТЗ.СтоимостьНУ - СтрокаТЗ.АмортизацияНУ;
							
						Иначе
							
							Строка.АмортизацияЗаМесяцБУ = СтрокаТаблицаАмортизацииБух.Амортизация;
							Строка.АмортизацияЗаМесяцНУ = СтрокаТаблицаАмортизацииБух.АмортизацияНУ;
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Строка.СтоимостьБУ          = 0;
					Строка.АмортизацияБУ        = 0;
					Строка.АмортизацияЗаМесяцБУ = 0;
					
					Строка.СтоимостьНУ          = 0;
					Строка.АмортизацияНУ        = 0;
					Строка.АмортизацияЗаМесяцНУ = 0;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Сообщить("Данные для заполнения отсутствуют.");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОсновныхСредств()

// Проверяет табличную часть на наличие в ней списанных или не введенных 
// в эксплуатацию Основных средств
// (Имя колонки основных средств должно быть "ОсновноеСредство")
//
// Параметры
//  ДатаДока                     - Тип: Дата - дата, на которую проверять
//
//  ТекОрганизация               – Тип: СправочникСсылка.Организации – Организация
//                 
//  ТаблицаПоОС                  – Тип: ТаблицаЗначений – ТаблицаЗначений
//                                                        Основные средства, которой нужно проверять
//
//  Отказ                        – Тип: Булево – признак отказа
//                 
//  Заголовок                    – Тип: Строка – заголовок вызывающего документа,
//                                               для сообщения об ошибке
//
Процедура ПроверитьНаСписанность(ДатаДока, ТекОрганизация, ТаблицаПоОС, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете,
	                             Отказ, Заголовок) Экспорт
								 
	Если (НЕ ОтражатьВУправленческомУчете и Не ОтражатьВБухгалтерскомУчете) ИЛИ Отказ Тогда
									 
		Возврат
		
	КонецЕсли;								 
								 
	Упр      = ОтражатьВУправленческомУчете;						 
	Бухг     = ОтражатьВБухгалтерскомУчете;						 
    СписокОС = ТаблицаПоОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату"     , ДатаДока);
	Запрос.УстановитьПараметр("СписокОС"   , СписокОС);
	Запрос.УстановитьПараметр("Списано"    , Перечисления.СостоянияОС.СнятоСУчета);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.Текст = 
	"ВЫБРАТЬ" + ?(Упр, "
	|	СостояниеОС_УУ.ОсновноеСредство КАК ОС_УУ" + ?(Бухг, ",", ""), "") + ?(Бухг, "
	|	СостояниеОС_БУ.ОсновноеСредство КАК ОС_БУ", "") + "
	|ИЗ" + ?(Упр, "
	|	(ВЫБРАТЬ
	|		СостоянияОС.ОсновноеСредство КАК ОсновноеСредство
	|	ИЗ
	|		РегистрСведений.СостоянияОС КАК СостоянияОС
	|	ГДЕ
	|		СостоянияОС.ОсновноеСредство В(&СписокОС)
	|		И СостоянияОС.Состояние = &Списано
	|		И СостоянияОС.ДатаСостояния <= &НаДату) КАК СостояниеОС_УУ" + ?(Бухг, "
	|		ПОЛНОЕ СОЕДИНЕНИЕ", ""), "") + ?(Бухг, "
	|			(ВЫБРАТЬ
	|				СостоянияОС.ОсновноеСредство КАК ОсновноеСредство
	|			ИЗ
	|				РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|			ГДЕ
	|				СостоянияОС.Организация = &Организация
	|				И СостоянияОС.ОсновноеСредство В(&СписокОС)
	|				И СостоянияОС.Состояние = &Списано
	|				И СостоянияОС.ДатаСостояния <= &НаДату) КАК СостояниеОС_БУ" + ?(Упр, "
	|		ПО СостояниеОС_УУ.ОсновноеСредство = СостояниеОС_БУ.ОсновноеСредство", ""), "");
	ТаблицаСписанных = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаСписанных.Количество() > 0 Тогда
		
		Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
			ТекОС           = СтрокаТЧ.ОсновноеСредство;
			СписокКолонок   = ?(Упр, "ОС_УУ", "") + ?(Бухг, ?(Упр, ", ", "") + "ОС_БУ", "");
			СтрокаСписанных = ТаблицаСписанных.Найти(ТекОС, СписокКолонок);
			
			Если СтрокаСписанных <> Неопределено Тогда
				
				Если ОтражатьВУправленческомУчете и СтрокаСписанных.ОС_УУ <> Null Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Строка " + (ТаблицаПоОС.Индекс(СтрокаТЧ) + 1) + "." + Символы.ПС + Символы.Таб
									+ "Упр. учет: Основное средство """ + ТекОс + """ уже снято с учета!", Отказ, Заголовок);
					
				КонецЕсли;
				
				Если ОтражатьВБухгалтерскомУчете  и СтрокаСписанных.ОС_БУ <> Null Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке("Строка " + (ТаблицаПоОС.Индекс(СтрокаТЧ) + 1) + "." + Символы.ПС + Символы.Таб
									+ "Бухг. учет: Основное средство """ + ТекОс + """ организации """ + ТекОрганизация + """ уже снято с учета!",
									Отказ, Заголовок);
					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры // ПроверитьНаСписанность()

// Устанавливает НалоговаяГруппаОС 
// по значению СчетУчетаБУ 
// или по значению СчетУчетаБУВнеоборотногоАктива
//
Процедура УстановитьНалоговуюГруппуОС(СчетУчетаБУ, НалоговаяГруппаОС) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		Возврат;
	КонецЕсли;	
	
	ПланХозрасчетный = ПланыСчетов.Хозрасчетный;
	
	Счет10   = ПланХозрасчетный.ОсновныеСредства;
	
	Счет101 	= ПланХозрасчетный.ЗемельныеУчастки;
	Счет102 	= ПланХозрасчетный.КапитальныеЗатратыПоУлучшениюЗемель;
	Счет103 	= ПланХозрасчетный.ДомаИСооружения;
	Счет104 	= ПланХозрасчетный.МашиныИОборудование;
	Счет105 	= ПланХозрасчетный.ТранспортныеСредства;
	Счет106 	= ПланХозрасчетный.ИнструментыПриборыИИнвентарь;
	Счет107 	= ПланХозрасчетный.Животные;
	Счет108 	= ПланХозрасчетный.МноголетниеНасаждения;
	Счет109 	= ПланХозрасчетный.ДругиеОсновныеСредстваГруппа;
	
	Счет111 	= ПланХозрасчетный.БиблиотечныеФонды;
	Счет112 	= ПланХозрасчетный.МалоценныеНеоборотныеМатериальныеАктивы;
	Счет113 	= ПланХозрасчетный.ВременныеНетитульныеСооружения;
	Счет114 	= ПланХозрасчетный.ПриродныеРесурсы;
	Счет115 	= ПланХозрасчетный.ИнвентарнаяТара;
	Счет116 	= ПланХозрасчетный.ПредметыПроката;
	Счет117 	= ПланХозрасчетный.ДругиеНеоборотныеМатериальныеАктивыПодгруппа;
	Счет16 		= ПланХозрасчетный.ДолгосрочныеБиологическиеАктивы;
	
	Если СчетУчетаБУ.ПринадлежитЭлементу(Счет101) ИЛИ СчетУчетаБУ = Счет101 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа1;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет102) ИЛИ СчетУчетаБУ = Счет102 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа2;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет103) ИЛИ СчетУчетаБУ = Счет103 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа3;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет104) ИЛИ СчетУчетаБУ = Счет104 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа4;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет105) ИЛИ СчетУчетаБУ = Счет105 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа5;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет106) ИЛИ СчетУчетаБУ = Счет106 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа6;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет107) ИЛИ СчетУчетаБУ = Счет107 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа7;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет108) ИЛИ СчетУчетаБУ = Счет108 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа8;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет109) ИЛИ СчетУчетаБУ.ПринадлежитЭлементу(Счет117) ИЛИ СчетУчетаБУ = Счет109 ИЛИ СчетУчетаБУ = Счет117 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа9;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет111) ИЛИ СчетУчетаБУ = Счет111 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа10;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет112) ИЛИ СчетУчетаБУ = Счет112 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа11;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет113) ИЛИ СчетУчетаБУ = Счет113 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа12;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет114) ИЛИ СчетУчетаБУ = Счет114 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа13;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет115) ИЛИ СчетУчетаБУ = Счет115 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа14;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет116) ИЛИ СчетУчетаБУ = Счет116 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа15;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет16) ИЛИ СчетУчетаБУ = Счет116 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа16;
	КонецЕсли;	
			

КонецПроцедуры // УстановитьНалоговуюГруппуОС()

// Устанавливает НалоговаяГруппаНМА 
// по значению СчетУчетаБУ 
// или по значению СчетУчетаБУВнеоборотногоАктива
//
Процедура УстановитьНалоговуюГруппуНМА(СчетУчетаБУ, НалоговаяГруппаОС) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		Возврат;
	КонецЕсли;	
	
	ПланХозрасчетный = ПланыСчетов.Хозрасчетный;
	
	Счет12   = ПланХозрасчетный.НематериальныеАктивы;
	
	Счет121 	= ПланХозрасчетный.ПраваНаИспользованиеПриродныхРесурсов;
	Счет122 	= ПланХозрасчетный.ПраваНаИспользованиеИмущества;
	Счет123 	= ПланХозрасчетный.ПраваНаЗнакиДляТоваровИУслуг;
	Счет124 	= ПланХозрасчетный.ПраваНаОбъектыПромышленнойСобственности;
	Счет125 	= ПланХозрасчетный.АвторскиеИСмежныеСНимиПрава;
	Счет127 	= ПланХозрасчетный.ДругиеНематериальныеАктивы;
	
	Если СчетУчетаБУ.ПринадлежитЭлементу(Счет121) ИЛИ СчетУчетаБУ = Счет121 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа1;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет122) ИЛИ СчетУчетаБУ = Счет122 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа2;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет123) ИЛИ СчетУчетаБУ = Счет123 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа3;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет124) ИЛИ СчетУчетаБУ = Счет124 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа4;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет125) ИЛИ СчетУчетаБУ = Счет125 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа5;
	ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет127) ИЛИ СчетУчетаБУ = Счет127 Тогда
		НалоговаяГруппаОС = Справочники.НалоговыеГруппыОсновныхСредств.НМАГруппа6;
	КонецЕсли;	
			
КонецПроцедуры // УстановитьНалоговуюГруппуНМА()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ НМА
 
// Процедура дополняет табличную часть колонками
// СчетУчетаБУ, СчетНачисленияАмортизацииБУ,
// ВидНалоговойДеятельности_НМА  для нематериальных активов. 
//
// Параметры
//  ДатаДока                     – Тип: Дата, МоментВремени, Граница – Дата, на которую получать результаты
//                 
//  ТекОрганизация               – Тип: СправочникСсылка.Организации – Организация
//                 
//  ТаблицаПоНМА                  – Тип: ТаблицаЗначений – Таблица, в которую необходимо добавить колонки
//                 
//  СтруктураШапкиДокумента      – Тип: Структура - параметры документа
//                 
//  Отказ                        – Тип: Булево – признак отказа
//                 
//  Заголовок                    – Тип: Строка – заголовок вызывающего документа,
//                                               для сообщения об ошибке
//                 
//  ИмяКолонкиНМА                 – Тип: Строка – Наименование колонки, в которой содержаться нематериальные активы
//                 
//
Процедура ДополнитьТабличнуюЧастьСведениямиОбНМАБухНалогРегл(ДатаДока, ТаблицаПоНМА, 
	                                                         СтруктураШапкиДокумента, Отказ, Заголовок,
														     ИмяКолонкиНМА = "НематериальныйАктив") Экспорт
															 
	ТекОрганизация                    = СтруктураШапкиДокумента.Организация;
	ВидДеятельностиНепроизводственная = Справочники.ВидыНалоговойДеятельности.НеОблагаемая;
	
	ТаблицаПоНМА.Колонки.Добавить("СчетУчетаБУ"                , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПоНМА.Колонки.Добавить("СчетНачисленияАмортизацииБУ", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПоНМА.Колонки.Добавить("НаправлениеБУ"              , Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	
	ЕстьНалоговыйУчет = (СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							     ИЛИ СтруктураШапкиДокумента.ЕстьНДС);
	
		
	ТаблицаПоНМА.Колонки.Добавить("НалоговоеНазначение_НМА",      Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаПоНМА.Колонки.Добавить("ВидНалоговойДеятельности_НМА", Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговойДеятельности"));
	ТаблицаПоНМА.Колонки.Добавить("НалоговаяГруппаОС"           , Новый ОписаниеТипов("СправочникСсылка.НалоговыеГруппыОсновныхСредств"));
		
	
	СписокНМА = ТаблицаПоНМА.ВыгрузитьКолонку(ИмяКолонкиНМА);
	
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Запрос.УстановитьПараметр("ТекДата",        ДатаДока);
	Запрос.УстановитьПараметр("СписокНМА",       СписокНМА);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаУчетаБУ.НематериальныйАктив                                      КАК НМА_БУ,
	|	СчетаУчетаБУ.СчетУчета                                                КАК СчетУчетаБУ,
	|	СчетаУчетаБУ.СчетНачисленияАмортизации                                КАК СчетНачисленияАмортизацииБУ,
	|	СпособыОтраженияБУ.СпособОтраженияРасходов                            КАК НаправлениеБУ,
	|	ПервоначальныеСведенияНУ.НематериальныйАктив                          КАК НМА_НУ,
	|	ПервоначальныеСведенияНУ.НалоговоеНазначение 						  КАК НалоговоеНазначение_НМА,
	|	ПервоначальныеСведенияНУ.НалоговоеНазначение.ВидНалоговойДеятельности КАК ВидНалоговойДеятельности_НМА,
	|	ПервоначальныеСведенияНУ.НалоговаяГруппаОС                            КАК НалоговаяГруппаОС
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(&ТекДата,
	|	                Организация = &ТекОрганизация И НематериальныйАктив В (&СписокНМА))
	|	                КАК СчетаУчетаБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И НематериальныйАктив В (&СписокНМА)) КАК СпособыОтраженияБУ
	|		ПО СчетаУчетаБУ.НематериальныйАктив = СпособыОтраженияБУ.НематериальныйАктив
	|	   
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(
	|		                    &ТекДата, Организация = &ТекОрганизация 
	|		                    И НематериальныйАктив В (&СписокНМА))
	|		                    КАК ПервоначальныеСведенияНУ
	|		ПО СчетаУчетаБУ.НематериальныйАктив = ПервоначальныеСведенияНУ.НематериальныйАктив";
	ТаблицаСведенийНМА  = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		ТекНМА =  СтрокаТЧ[ИмяКолонкиНМА];
		Колонки = ?(ЕстьНалоговыйУчет, "НМА_БУ, НМА_НУ", "НМА_БУ");
		СтрокаСведений = ТаблицаСведенийНМА.Найти(ТекНМА, Колонки);	
		
		Если СтрокаСведений = Неопределено Тогда
			
			Если ЕстьНалоговыйУчет Тогда
				ТекстСообщения = Локализация.СтрШаблон1("Строка ¤1¤."
"	Регл. учет: По нематериальному активу ""¤2¤"" и организации ""¤3¤"" нет информации"
"	в регистрах сведений:"
"	""Счета бухгалтерского учета нематериальных активов"""
"	""Первоначальные сведения о НМА (налоговый учет)"""
"	Возможно, оно не принято к учету.", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация);
			Иначе
				ТекстСообщения = Локализация.СтрШаблон1("Строка ¤1¤."
"	Регл. учет: По нематериальному активу ""¤2¤"" и организации ""¤3¤"" нет информации"
"	в регистрах сведений:"
"	""Счета бухгалтерского учета нематериальных активов"""
"	Возможно, оно не принято к учету.", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация);
			КонецЕсли;	
			
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			Продолжить
			
		КонецЕсли;
		
		СчетУчетаБУ = СтрокаСведений.СчетУчетаБУ;
		
		Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бух. учет: По нематериальному активу ""¤2¤"" и организации "" "
"	¤3¤"" не заполнен счет учета "
"	в регистре сведений ""Счета бухгалтерского учета нематериальных активов""", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация),
							Отказ, Заголовок);
			
		Иначе
			
			СтрокаТЧ.СчетУчетаБУ = СчетУчетаБУ;
			
		КонецЕсли;
		
		СчетНачисленияАмортизацииБУ = СтрокаСведений.СчетНачисленияАмортизацииБУ;
		
		Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бух. учет: По нематериальному активу ""¤2¤"
"	"" и организации ""¤3¤"
"	"" не заполнен счет начисления амортизации"
"	в регистре сведений ""Счета бухгалтерского учета нематериальных активов""", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация),
							Отказ, Заголовок);
			
		Иначе
			
			СтрокаТЧ.СчетНачисленияАмортизацииБУ = СчетНачисленияАмортизацииБУ;
			
		КонецЕсли;
		
		НаправлениеБУ = СтрокаСведений.НаправлениеБУ;
		
		// Направление будет проверяться при распределении амортизации,
		// поэтому сообщения не выдаются
		Если ЗначениеЗаполнено(НаправлениеБУ) Тогда
			
			СтрокаТЧ.НаправлениеБУ = НаправлениеБУ;
			
		КонецЕсли;
			
		Если ЕстьНалоговыйУчет Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаСведений.НМА_НУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Налог. учет: По нематериальному активу """
"	¤2¤"" и организации ""¤3¤"" нет информации"
"	в регистре сведений:"
"	""Первоначальные сведения о НМА (налоговый учет)"""
"	Возможно, оно не принято к учету.", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация),
								 Отказ, Заголовок);
				Продолжить;
				
			КонецЕсли;
			
			ВидНалоговойДеятельности_НМА = СтрокаСведений.ВидНалоговойДеятельности_НМА;
			НалоговоеНазначение_НМА = СтрокаСведений.НалоговоеНазначение_НМА;
			
			Если НЕ ЗначениеЗаполнено(НалоговоеНазначение_НМА) Тогда
				
					//Вид налоговой деятельности должен быть заполнен обязательно
					ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Налог. учет: По нематериальному активу """
"	¤2¤"" и организации ""¤3¤"" не заполнено налоговое назначение"
"	в регистре сведений ""Первоначальные сведения о НМА (налоговый учет)""", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ТекНМА, ТекОрганизация),
									 Отказ, Заголовок);
				
			Иначе
									 
				СтрокаТЧ.ВидНалоговойДеятельности_НМА = ВидНалоговойДеятельности_НМА;
					
			КонецЕсли;
			
			СтрокаТЧ.НалоговоеНазначение_НМА = НалоговоеНазначение_НМА;
			НалоговаяГруппаОС = СтрокаСведений.НалоговаяГруппаОС;
			
			Если НЕ ЗначениеЗаполнено(НалоговаяГруппаОС) Тогда
				
			Иначе
									 
				СтрокаТЧ.НалоговаяГруппаОС = НалоговаяГруппаОС;
					
			КонецЕсли;
			
		Иначе
			//СтрокаТЧ.НалоговоеНазначение_НМА = СтрокаСведений.НалоговоеНазначение_НМА;
		    НепроизводственноеНМА = (СтрокаСведений.НалоговоеНазначение_НМА = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
			Если НепроизводственноеНМА Тогда
				СтрокаТЧ.НалоговоеНазначение_НМА = СтрокаСведений.НалоговоеНазначение_НМА;
			Иначе	
				СтрокаТЧ.НалоговоеНазначение_НМА = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ДополнитьТабличнуюЧастьСведениямиОбНМАБухНалогРегл()

// Заполняет табличную часть нематериальных активов следующими значениями:
// (Имя колонки нематериальный активов должно быть "НематериальныйАктив")
//
// 	Бухгалтерский учет:
//	 	СтоимостьБУ;
//	 	АмортизацияБУ;
//	 	АмортизацияЗаМесяцБУ;
//
// 	Налоговый учет:
//	 	СтоимостьНУ;
//	 	АмортизацияНУ;
//	 	АмортизацияЗаМесяцНУ;
//
// Параметры
//
//  ДатаРасчета                   - Дата - Дата расчета амортизации
//
//  НМА                            – Табличная часть – табличная часть документа для заполнения
//                 
//  ТекОрганизация                – Тип: СправочникСсылка.Организации – Организация
//                 
//  ОтражатьВБухгалтерскомУчете   – Булево 
//                 
//  ОтражатьВНалоговомУчете       – Булево 
//                 
//  ДатаИтогов                    – Дата, МоментВремени, Граница - дата получения итогов 
//                 
Процедура ЗаполнитьТабличнуюЧастьНематериальныхАктивов(ДатаРасчета, НМА, ТекОрганизация, 
												 ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете, ДатаИтогов = Неопределено) Экспорт
												 
	Если НЕ (ОтражатьВУправленческомУчете ИЛИ ОтражатьВБухгалтерскомУчете ИЛИ ОтражатьВНалоговомУчете) Тогда
		
		ОбщегоНазначения.СообщитьИнформацию("Для заполнения табличной части необходимо выбрать тип учета");
		Возврат
		
	КонецЕсли;												 
												 
	Если ОтражатьВБухгалтерскомУчете И НЕ ЗначениеЗаполнено(ТекОрганизация) Тогда

		Сообщить("Для заполнения табличной части необходимо указать организацию");
		Возврат
		
	КонецЕсли;
	
	Если ДатаИтогов = Неопределено Тогда
		ДатаИтогов = ДатаРасчета;
	КонецЕсли;	
	
	// Для компактной записи вводятся 
	// новые переменные
	УУ = ОтражатьВУправленческомУчете;
	БУ = ОтражатьВБухгалтерскомУчете;
	НУ = ОтражатьВНалоговомУчете;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("ДатаИтогов" , ДатаИтогов);
	
	СписокНМА = НМА.ВыгрузитьКолонку("НематериальныйАктив");
	Запрос.УстановитьПараметр("СписокНМА"         , СписокНМА);
	Запрос.УстановитьПараметр("СубконтоНМА"       , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);
	Запрос.Текст =				   
	"ВЫБРАТЬ
	|	ПредварительныйЗапрос.НМА                        КАК НМА," + ?(УУ, "
	|	СУММА(ПредварительныйЗапрос.СтоимостьУУ)         КАК СтоимостьУУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияУУ)       КАК АмортизацияУУ" + ?(БУ, ",", ""), "") + ?(БУ, "
	|	СУММА(ПредварительныйЗапрос.СтоимостьБУ)         КАК СтоимостьБУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияБУ)       КАК АмортизацияБУ,
	|	СУММА(ПредварительныйЗапрос.СтоимостьНУ)         КАК СтоимостьНУ,
	|	СУММА(ПредварительныйЗапрос.АмортизацияНУ)       КАК АмортизацияНУ", "") + "
	|ИЗ
	|	(
	|" + ?(УУ, "
	|
	|	ВЫБРАТЬ
	|		СтоимостьУУ.НематериальныйАктив 	КАК НМА,
	|		СтоимостьУУ.СтоимостьОстаток 		КАК СтоимостьУУ,
	|		СтоимостьУУ.АмортизацияОстаток 		КАК АмортизацияУУ,
	|		0 									КАК СтоимостьБУ,
	|		0 									КАК АмортизацияБУ,
	|		0 									КАК СтоимостьНУ,
	|		0 									КАК АмортизацияНУ
	|   ИЗ 
	|	РегистрНакопления.СтоимостьНМА.Остатки(&ДатаИтогов, 
	|	                  НематериальныйАктив В (&СписокНМА)) КАК СтоимостьУУ
	|
	|" + ?(БУ, "ОБЪЕДИНИТЬ ВСЕ", ""), "") + ?(БУ, "
	|
	|	ВЫБРАТЬ
	|		СтоимостьБУ.Субконто1      КАК НМА,
	|		0                          КАК СтоимостьУУ,
	|		0                          КАК АмортизацияУУ,
	|		СтоимостьБУ.СуммаОстатокДт КАК СтоимостьБУ,
	|		0                          КАК АмортизацияБУ,
	|		СтоимостьБУ.СуммаНУОстатокДт КАК СтоимостьНУ,
	|		0                          КАК АмортизацияНУ
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			               &ДатаИтогов,
	|			               Счет В
	|			               	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			               	 	СчетаБухгалтерскогоУчета.СчетУчета
	|			                 ИЗ
	|			                 	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|			                 	                &ДатаИтогов,
	|			                 	                Организация = &Организация
	|			                                    И НематериальныйАктив В (&СписокНМА)
	|			                                    ) КАК СчетаБухгалтерскогоУчета),
	|			               &СубконтоНМА,
	|			               Организация = &Организация
	|			               И Субконто1 В (&СписокНМА)) КАК СтоимостьБУ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АмортизацияБУ.Субконто1,
	|		0,
	|		0,
	|		0,
	|		АмортизацияБУ.СуммаОстатокКт,
	|		0,
	|		АмортизацияБУ.СуммаНУОстатокКт
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			               &ДатаИтогов,
	|			               Счет В
	|			               	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			               		СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|			                 ИЗ
	|			                 	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|			                 	                &ДатаИтогов,
	|			                 	                Организация = &Организация
	|			                                    И НематериальныйАктив В (&СписокНМА)
	|			                                    ) КАК СчетаБухгалтерскогоУчета),
	|			               &СубконтоНМА,
	|			               Организация = &Организация
	|			               И Субконто1 В (&СписокНМА)) КАК АмортизацияБУ
	|	
	|", "") + "
	|	) КАК ПредварительныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйЗапрос.НМА";
				   
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество()>0 Тогда
		
		Если ОтражатьВУправленческомУчете Тогда
			ТаблицаАмортизацииУпр = РасчетАмортизацииНМАУпр(ДатаРасчета, СписокНМА);
		КонецЕсли;	
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			ТаблицаАмортизацииБух = РасчетАмортизацииНМАРегл(ДатаРасчета, ТекОрганизация, СписокНМА);
		КонецЕсли;	
		
		
		Для каждого Строка Из НМА Цикл
			
			СтрокаТЗ = ТЗ.Найти(Строка.НематериальныйАктив, "НМА");
			
			Если СтрокаТЗ = Неопределено Тогда
				
				//управленческий учет
				Строка.СтоимостьУУ          = 0;
				Строка.АмортизацияУУ        = 0;
				Строка.АмортизацияЗаМесяцУУ = 0;
				
				//бухгалтерский учет
				Строка.СтоимостьБУ          = 0;
				Строка.АмортизацияБУ        = 0;
				Строка.АмортизацияЗаМесяцБУ = 0;
				
				//налоговый учет
				Строка.СтоимостьНУ          = 0;
				Строка.АмортизацияНУ        = 0;
				Строка.АмортизацияЗаМесяцНУ = 0;
				
			Иначе
				// В соответствующие поля строки запишем данные из запроса
				
				// управленческий учет
				Если ОтражатьВУправленческомУчете Тогда
					
					Строка.СтоимостьУУ          = СтрокаТЗ.СтоимостьУУ;
					Строка.АмортизацияУУ        = СтрокаТЗ.АмортизацияУУ;
					//СтрокаТаблицаАмортизацииУпр = Неопределено;
					СтрокаТаблицаАмортизацииУпр = ТаблицаАмортизацииУпр.Найти(Строка.НематериальныйАктив, "ОбъектУчета");
					Строка.АмортизацияЗаМесяцУУ = ?(СтрокаТаблицаАмортизацииУпр = Неопределено, 0, СтрокаТаблицаАмортизацииУпр.Амортизация);
					
				Иначе
					
					Строка.СтоимостьУУ          = 0;
					Строка.АмортизацияУУ        = 0;
					Строка.АмортизацияЗаМесяцУУ = 0;
					
				КонецЕсли;	
				
				// бухгалтерский учет
				Если ОтражатьВБухгалтерскомУчете Тогда
					
					Строка.СтоимостьБУ          = СтрокаТЗ.СтоимостьБУ;
					Строка.АмортизацияБУ        = СтрокаТЗ.АмортизацияБУ;
					
					Строка.СтоимостьНУ          = СтрокаТЗ.СтоимостьНУ;
					Строка.АмортизацияНУ        = СтрокаТЗ.АмортизацияНУ;
					
					СтрокаТаблицаАмортизацииБух = ТаблицаАмортизацииБух.Найти(Строка.НематериальныйАктив, "ОбъектУчета");
					Строка.АмортизацияЗаМесяцБУ = ?(СтрокаТаблицаАмортизацииБух = Неопределено, 0, СтрокаТаблицаАмортизацииБух.Амортизация);
					Строка.АмортизацияЗаМесяцНУ = ?(СтрокаТаблицаАмортизацииБух = Неопределено, 0, СтрокаТаблицаАмортизацииБух.АмортизацияНУ);
					
				Иначе
					
					Строка.СтоимостьБУ          = 0;
					Строка.АмортизацияБУ        = 0;
					Строка.АмортизацияЗаМесяцБУ = 0;
					
					Строка.СтоимостьНУ          = 0;
					Строка.АмортизацияНУ        = 0;
					Строка.АмортизацияЗаМесяцНУ = 0;
					
				КонецЕсли;	
					
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Сообщить("Данные для заполнения отсутствуют.");
		
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьНематериальныхАктивов()

// Проверяет табличную часть на наличие в ней списанных или не введенных 
// в эксплуатацию НМА
// (Имя колонки НМА должно быть "НематериальныйАктив")
//
// Параметры
//  ДатаДока                     - Тип: Дата - дата, на которую проверять
//
//  ТекОрганизация               – Тип: СправочникСсылка.Организации – Организация
//                 
//  ТаблицаПоНМА                 – Тип: ТаблицаЗначений – ТаблицаЗначений
//                                                        нематериальные активы, которые нужно проверять
//
//  Отказ                        – Тип: Булево – признак отказа
//                 
//  Заголовок                    – Тип: Строка – заголовок вызывающего документа,
//                                               для сообщения об ошибке
//
Процедура ПроверитьНаСписанностьНМА(ДатаДока, ТекОрганизация, ТаблицаПоНМА, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок) Экспорт
								 
	Если (НЕ ОтражатьВУправленческомУчете и Не ОтражатьВБухгалтерскомУчете) ИЛИ Отказ Тогда
									 
		Возврат
		
	КонецЕсли;								 
	
	Упр      = ОтражатьВУправленческомУчете;						 
	Бухг     = ОтражатьВБухгалтерскомУчете;						 
	
	СписокНМА = ТаблицаПоНМА.ВыгрузитьКолонку("НематериальныйАктив");
	
	Запрос   = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату"      , ДатаДока);
	Запрос.УстановитьПараметр("СписокНМА"   , СписокНМА);
	Запрос.УстановитьПараметр("СнятСУчета"  , Перечисления.ВидыСостоянийНМА.Списан);
	Запрос.УстановитьПараметр("ПринятКучету", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	Запрос.УстановитьПараметр("Организация" , ТекОрганизация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ" + ?(Упр, "
	|	СостоянияНМА_УУ.НМА 			КАК НМА_УУ,
	|	СостоянияНМА_УУ.СнятСУчета 		КАК СнятСУчета_УУ,
	|	СостоянияНМА_УУ.НеПринятКУчету 	КАК НеПринятКУчету_УУ" + ?(Бухг, ",", ""), "") + ?(Бухг, "
	|	СостоянияНМА_БУ.НМА 			КАК НМА_БУ,
	|	СостоянияНМА_БУ.СнятСУчета 		КАК СнятСУчета_БУ,
	|	СостоянияНМА_БУ.НеПринятКУчету 	КАК НеПринятКУчету_БУ", "") + "
	|ИЗ" + ?(Упр, "
	|	(ВЫБРАТЬ
	|		СостоянияНМА.НематериальныйАктив КАК НМА,
	|		ВЫБОР
	|			КОГДА СостоянияНМА.Состояние = &СнятСУчета
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК СнятСУчета,
	|		ВЫБОР
	|			КОГДА СостоянияНМА.Состояние = &ПринятКУчету
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК НеПринятКУчету
	|	ИЗ
	|		РегистрСведений.СостоянияНМА.СрезПоследних(&НаДату, 
	|													НематериальныйАктив В (&СписокНМА)
	|																) КАК СостоянияНМА) КАК СостоянияНМА_УУ" + ?(Бухг, "
	|		ПОЛНОЕ СОЕДИНЕНИЕ", ""), "") + ?(Бухг, "
	|	(ВЫБРАТЬ
	|			СостоянияНМА.НематериальныйАктив КАК НМА,
	|			ВЫБОР
	|				КОГДА СостоянияНМА.Состояние = &СнятСУчета
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ КАК СнятСУчета,
	|			ВЫБОР
	|				КОГДА СостоянияНМА.Состояние = &ПринятКУчету
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ КАК НеПринятКУчету
	|		ИЗ
	|			РегистрСведений.СостоянияНМАОрганизаций.СрезПоследних(
	|				&НаДату,
	|				Организация = &Организация
	|				И НематериальныйАктив В (&СписокНМА)) КАК СостоянияНМА) КАК СостоянияНМА_БУ" + ?(Упр, "
	|		ПО СостоянияНМА_УУ.НМА = СостоянияНМА_БУ.НМА", ""), "");
	
	ТаблицаСведений = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		ТекНМА         = СтрокаТЧ.НематериальныйАктив;
		СписокКолонок   = ?(Упр, "НМА_УУ", "") + ?(Бухг, ?(Упр, ", ", "") + "НМА_БУ", "");
		СтрокаСведений = ТаблицаСведений.Найти(ТекНМА, СписокКолонок);
		
		Если СтрокаСведений <> Неопределено Тогда
			
			Если Упр И (СтрокаСведений.НеПринятКУчету_УУ = Null ИЛИ СтрокаСведений.НеПринятКУчету_УУ) Тогда

				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Упр. учет: На ¤2¤ "
"	нематериальный актив ""¤3¤"""
"	еще не принят к учету!", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ДатаДока, ТекНМА),
								 Отказ, Заголовок);
			ИначеЕсли Упр И (СтрокаСведений.СнятСУчета_УУ = Null ИЛИ СтрокаСведений.СнятСУчета_УУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Упр. учет: На ¤2¤ "
"	нематериальный актив ""¤3¤"""
"	уже снят с учета!", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ДатаДока, ТекНМА),
								 Отказ, Заголовок);
								 
				
			КонецЕсли;
			
			Если Бухг И (СтрокаСведений.НеПринятКУчету_БУ = Null ИЛИ СтрокаСведений.НеПринятКУчету_БУ) Тогда

				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бухг. учет: На ¤2¤ "
"	нематериальный актив ""¤3¤"""
"	еще не принят к учету по организации ""¤4¤""!", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ДатаДока, ТекНМА, ТекОрганизация),
								 Отказ, Заголовок);
			ИначеЕсли Бухг И (СтрокаСведений.СнятСУчета_БУ = Null ИЛИ СтрокаСведений.СнятСУчета_БУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	Бухг. учет: На ¤2¤ "
"	нематериальный актив ""¤3¤"""
"	организации ""¤4¤"" уже снят с учета!", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ДатаДока, ТекНМА, ТекОрганизация),
								 Отказ, Заголовок);
								 
				
			КонецЕсли;
			
		Иначе
			
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Строка ¤1¤."
"	На ¤2¤ "
"	нематериальный актив ""¤3¤"""
"	еще не поступил и не принят к учету!", (ТаблицаПоНМА.Индекс(СтрокаТЧ) + 1), ДатаДока, ТекНМА),
							 Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

