#Если Клиент Тогда
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(РабочаяДата));
	Иначе 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ОбщийОтчет.ДатаКон));
	КонецЕсли;
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Истина", Истина);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Ложь", Ложь);
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = "Списки работников организации";
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.ФизЛицо КАК ФизЛицо
	|	//ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ
	|
	|{ВЫБРАТЬ
	|	// данные о работнике организации
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ПлановыеНачисленияРаботниковСрез.Показатель1 КАК Показатель1,
	|	ПлановыеНачисленияРаботниковСрез.Показатель2 КАК Показатель2,
	|	ПлановыеНачисленияРаботниковСрез.Показатель3 КАК Показатель3,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}
	|
	|ИЗ
	|   (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   ВЫБОР КОГДА НЕ (РаботникиОрганизации.Сотрудник ЕСТЬ NULL) 
	|	ТОГДА РаботникиОрганизации.Сотрудник
	|	ИНАЧЕ СотрудникиОрганизаций.Ссылка
	|   КОНЕЦ КАК Сотрудник,
	|   ВЫБОР КОГДА НЕ (РаботникиОрганизации.Сотрудник ЕСТЬ NULL) 
	|	ТОГДА РаботникиОрганизации.Сотрудник.ФизЛицо
	|	ИНАЧЕ СотрудникиОрганизаций.ФизЛицо
	|   КОНЕЦ КАК ФизЛицо,
	|	РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК Организация,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	РаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
	|	РаботникиОрганизации.Организация КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	Работники.Период КАК ПериодУпр,
	|	Работники.Подразделение КАК ПодразделениеУпр,
	|	Работники.Должность КАК ДолжностьУпр,
	|	Работники.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостоянияУпр,
	|	Работники.ГрафикРаботы КАК ГрафикРаботыУпр,
	|	Работники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокУпр
	|   ИЗ
    |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности) КАК РаботникиОрганизации
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности) КАК Работники
	|		ПО РаботникиОрганизации.Сотрудник.ФизЛицо  = Работники.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО Работники.ФизЛицо = СотрудникиОрганизаций.ФизЛицо	) КАК РаботникиОрганизации
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности) КАК СостояниеРаботниковОрганизации
	|		ПО РаботникиОрганизации.Сотрудник= СостояниеРаботниковОрганизации.Сотрудник И РаботникиОрганизации.Организация = СостояниеРаботниковОрганизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников.СрезПоследних(&ДатаАктуальности) КАК СостояниеРаботников
	|		ПО РаботникиОрганизации.Сотрудник.ФизЛицо  = СостояниеРаботников.ФизЛицо}
	|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
	|		//КОНТАКТНАЯ ИНФОРМАЦИЯ: СОЕДИНЕНИЯ
	|		//СОЕДИНЕНИЯ
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности) КАК ПлановыеНачисленияРаботниковСрез
	|		ПО РаботникиОрганизации.Сотрудник  = ПлановыеНачисленияРаботниковСрез.Сотрудник И РаботникиОрганизации.Организация = ПлановыеНачисленияРаботниковСрез.Организация
	|		 И 	ПлановыеНачисленияРаботниковСрез.Актуальность = &Истина}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатыПоследнихДвиженийРаботников.Период КАК ДатаПриема,
	|			ДатыПоследнихДвиженийРаботников.Организация,
	|			ДатыПоследнихДвиженийРаботников.Сотрудник				КАК Сотрудник,
	|			ДатыПоследнихДвиженийРаботников.Сотрудник.ФизЛицо		КАК ФизЛицо,
	|			ДанныеПоРаботникуПриНазначении.Сотрудник.ВидЗанятости КАК ВидЗанятости
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТЧРаботникиОрганизации.Организация,
	|				МАКСИМУМ(Работники.Период) КАК Период,
	|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности,) КАК ТЧРаботникиОрганизации
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|					ПО ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
	|						И ТЧРаботникиОрганизации.Организация = Работники.Организация
	|						И Работники.Период <= ТЧРаботникиОрганизации.Период
	|						И (Работники.ПричинаИзмененияСостояния = &Прием)
	|			{ГДЕ
	|				ТЧРаботникиОрганизации.Должность КАК Должность,
	|				ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
	|				ТЧРаботникиОрганизации.Сотрудник		КАК Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|				ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОбособленноеПодразделение,
	|				ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК Подразделение}
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТЧРаботникиОрганизации.Организация,
	|				ТЧРаботникиОрганизации.Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо) КАК ДатыПоследнихДвиженийРаботников
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуПриНазначении
	|				ПО ДанныеПоРаботникуПриНазначении.Период = ДатыПоследнихДвиженийРаботников.Период
	|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуПриНазначении.Сотрудник
	|					И (ДатыПоследнихДвиженийРаботников.Организация = ДанныеПоРаботникуПриНазначении.Организация)) КАК ПриказыОПриеме
	|		ПО ПриказыОПриеме.Организация = РаботникиОрганизации.Организация
	|			И ПриказыОПриеме.Сотрудник = РаботникиОрганизации.Сотрудник}
	|
	|{ГДЕ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ПлановыеНачисленияРаботниковСрез.Показатель1 КАК Показатель1,
	|	ПлановыеНачисленияРаботниковСрез.Показатель2 КАК Показатель2,
	|	ПлановыеНачисленияРаботниковСрез.Показатель3 КАК Показатель3,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}
	|
	|ИТОГИ ПО ОБЩИЕ
	|
	|{ИТОГИ ПО
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//ДОПОЛНИТЕЛЬНЫЕ ПСЕВДОНИМЫ ПОЛЕЙ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}";

	УправлениеОтчетами.ДобавитьВТекстПостроителяИнтервальныеГруппировкиФизлиц(ТекстЗапроса, ОбщийОтчет.Интервалы, ПостроительОтчета.Параметры, ОбщийОтчет.СоответствиеТиповИнтервальныхПолей,СтруктураПредставлениеПолей,"РаботникиОрганизации.ФизЛицо");
	
	// Преобразуем текст запроса для получения полной информации о физлице
	УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.СтруктураФорматаПолей, "РаботникиОрганизации");	
	
	// Таблица описания видов объектов контактной информации для возможности вывода в отчет
	ТаблицаВидовОбъектовКИ = Новый ТаблицаЗначений;
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("Представление");// представление поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ВидОбъекта");   // вид объекта-владельца контактной информации
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("СтрокаТипОбъекта");   // тип объекта-владельца контактной информации
	
	НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
	НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
	НоваяСтрока.Представление = "Работник";
	НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	НоваяСтрока.СтрокаТипОбъекта = "Справочник.ФизическиеЛица";
	
	НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
	НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Организация";
	НоваяСтрока.Представление = "Организация";
	НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.Организации;
	НоваяСтрока.СтрокаТипОбъекта = "Справочник.Организации";
	
	// Добавим строки запроса, необходимые для выборки контактной информации
	УправлениеОтчетами.ДобавитьВТекстПостроителяКонтактнуюИнформацию(ТаблицаВидовОбъектовКИ, ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.мСоответствиеНазначений, ОбщийОтчет.ПостроительОтчета.Параметры);

	// При использовании свойств и категорий в текст запроса добавляются дополнительные поля
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории Тогда

		// Свойства и категории, назначаемые пользователем:
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
		НоваяСтрока.Представление = "Работник";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;

		// Добавим строки запроса, необходимые для использования свойств и категорий
		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
				ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
				,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);
		
	КонецЕсли;						  
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
	
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
		УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
	КонецЕсли;
							  
	//представление полей запроса
	СтруктураПредставлениеПолей.Вставить("ФизЛицо", "Работник");
	СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавок", "Занято ставок (регл)");
	СтруктураПредставлениеПолей.Вставить("ВидЗанятости", "Вид занятости");
	СтруктураПредставлениеПолей.Вставить("Состояние", "Состояние (регл)");
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение (регл)");
	СтруктураПредставлениеПолей.Вставить("Должность", "Должность (регл)");
	СтруктураПредставлениеПолей.Вставить("ГоловнаяОрганизация", "Головная организация");
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботы", "График работы (регл)");
	СтруктураПредставлениеПолей.Вставить("ТабельныйНомер", "Табельный номер (регл)");
	СтруктураПредставлениеПолей.Вставить("ПриказОПриеме", "Приказ о приеме");
	СтруктураПредставлениеПолей.Вставить("ДатаПриема", "Дата приема");
	СтруктураПредставлениеПолей.Вставить("ДатаУвольнения", "Дата увольнения");
	СтруктураПредставлениеПолей.Вставить("ВидРасчета", "Начисление");
	СтруктураПредставлениеПолей.Вставить("Показатель1", "Показатель 1 начисления");
	СтруктураПредставлениеПолей.Вставить("Показатель2", "Показатель 2 начисления");
	СтруктураПредставлениеПолей.Вставить("Показатель3", "Показатель 3 начисления");
	
	СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавокУпр", "Занято ставок (упр)");
	СтруктураПредставлениеПолей.Вставить("ПодразделениеУпр", "Подразделение (упр)");
	СтруктураПредставлениеПолей.Вставить("ДолжностьУпр", "Должность (упр)");
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботыУпр", "График работы (упр)");
	СтруктураПредставлениеПолей.Вставить("СостояниеУпр", "Состояние (упр)");
	СтруктураПредставлениеПолей.Вставить("СостояниеОбщ", "Состояние");
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// ФОРМАТ ПОЛЕЙ
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаПриема", "ДФ=dd.MM.yyyy");
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаУвольнения", "ДФ=dd.MM.yyyy");
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
	
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ПодразделениеОрганизации");
	МассивОтбора.Добавить("ПодразделениеУпр");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// отбор не уволенных
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ЗанимаемыхСтавок",,"Занимаемых ставок (регл)");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Больше;
	ЭлементОтбора.Значение = 0;
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ЗанимаемыхСтавокУпр",,"Занимаемых ставок (упр)");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Больше;
	ЭлементОтбора.Значение = 0;
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("СостояниеОбщ",,"Состояние");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = "Работает";
	ЭлементОтбора.Использование = Истина;


		
	// поля по умолчанию
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("ТабельныйНомер");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ФиоПолное");
	
	// настройки отчета
	ОбщийОтчет.ИспользоватьИнтервальныеГруппировки = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	ОбщийОтчет.мРежимВводаПериода = 1; // Дата
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()


// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет = Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры
#КонецЕсли
