Перем мВалютаРегламентированногоУчета Экспорт;
Перем МетаданныеПоДокументам Экспорт;

#Если Клиент Тогда
	

// Настройка периода
Перем НП Экспорт;


// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Функция ПечатьАктаСверки()
	

	ТабДок = Новый ТабличныйДокумент;
	Макет  = ПолучитьМакет("АктСверки");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
   	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьНачОстатки   = Макет.ПолучитьОбласть("НачОстатки");
	ОбластьДоговор      = Макет.ПолучитьОбласть("Договор");
	ОбластьДоговорИтоги = Макет.ПолучитьОбласть("ДоговорИтоги");
	ОбластьОбороты      = Макет.ПолучитьОбласть("Обороты");
	ОбластьОборотыИтог  = Макет.ПолучитьОбласть("ОборотыИтог");
	ОбластьКонОстатки   = Макет.ПолучитьОбласть("КонОстатки");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	НазваниеОрганизации = Организация.НаименованиеПолное;
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = Организация;
	КонецЕсли;
	
	НаименованиеКонтрагента = Контрагент.НаименованиеПолное;
	Если ПустаяСтрока(НаименованиеКонтрагента) Тогда
		НаименованиеКонтрагента = Контрагент;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ОбластьЗаголовок.Параметры.НаименованиеКонтрагента = НаименованиеКонтрагента;
	ИмяПредставителяОрганизации = ПредставительОрганизации;
	ИмяПредсатвителяКонтрагента = ПредставительКонтрагента;
	ОписаниеПериода = "";
	Если Не ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОписаниеПериода = НСтр("ru='на ';uk='на '",КодЯзыкаПечать) + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОписаниеПериода = НСтр("ru='за период: ';uk='за період: '",КодЯзыкаПечать) + ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина; Л =" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
	КонецЕсли;	
	
	ТекстЗаголовка = НСтр("ru='взаимных расчетов по состоянию ';uk='взаємних розрахунків станом '",КодЯзыкаПечать) + ОписаниеПериода + Символы.ПС
					+ НСтр("ru='между ';uk='між '",КодЯзыкаПечать) + НазваниеОрганизации + Символы.ПС + НСтр("ru='и ';uk='і '",КодЯзыкаПечать) + НаименованиеКонтрагента;

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
		Данные = Новый Структура("ДоговорДата,ДоговорНомер,ДоговорКонтрагента,ДоговорНаименованиеДляПечати", ДоговорКонтрагента.Дата,ДоговорКонтрагента.Номер,ДоговорКонтрагента,ДоговорКонтрагента.НаименованиеДляПечати);
		СписокПараметров = "ДоговорНаименованиеДляПечати,";
		МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Данные,СписокПараметров,КодЯзыкаПечать);
        НаименованиеДоговораДляПечати = МассивСтруктурСтрок[0].ЗначениеПараметра; 

		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + НСтр("ru='по договору ';uk='за договором '",КодЯзыкаПечать) + СокрЛП(НаименованиеДоговораДляПечати);
		
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ДанныеПредставителяОрганизации = ОбщегоНазначения.ДанныеФизЛица(Организация, ПредставительОрганизации, ДатаОкончания);
	ФИОПредставителя = ?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Фамилия),"",ДанныеПредставителяОрганизации.Фамилия
					+ ?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Имя),""," "+ДанныеПредставителяОрганизации.Имя)
					+ ?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Отчество),""," "+ДанныеПредставителяОрганизации.Отчество));
	
	СтрЗаголовокТаблица = НСтр("ru='Мы, нижеподписавшиеся, ';uk='Ми, що нижче підписалися, '",КодЯзыкаПечать) + ?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Должность),"________________",ДанныеПредставителяОрганизации.Должность) + " " + НазваниеОрганизации 
				+ " " + ?(ФИОПредставителя<>"",ФИОПредставителя,"_______________________") + НСтр("ru=', с одной стороны, ';uk=', з одного боку, '",КодЯзыкаПечать)
				+ НСтр("ru='и ';uk='і '",КодЯзыкаПечать) + ?(НЕ ЗначениеЗаполнено(ПредставительКонтрагента.Должность),"________________",ПредставительКонтрагента.Должность) + " " + НаименованиеКонтрагента + " " 
				+ ?(НЕ ЗначениеЗаполнено(ПредставительКонтрагента),"_______________________",ПредставительКонтрагента) + НСтр("ru=', с другой стороны, ';uk=', з іншого боку, '",КодЯзыкаПечать)
				+ НСтр("ru='составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:';uk='склали даний акт звірення у тому, що стан взаємних розрахунків за даними обліку наступний:'",КодЯзыкаПечать);
	
	ОбластьЗаголовок.Параметры.СтрЗаголовокТаблица = СтрЗаголовокТаблица;
	ОбластьЗаголовок.Параметры.ВалютаДокумента = ВалютаДокумента;
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ИтСуммаОборотДт      = 0;
	ИтСуммаОборотКт      = 0;
	ИтСуммаОборотДтКонтр = 0;
	ИтСуммаОборотКтКонтр = 0;
	
	НачОстДебет  = ?(ОстатокНаНачало > 0, ОстатокНаНачало, 0);
	НачОстКредит = ?(ОстатокНаНачало < 0, -ОстатокНаНачало, 0);
	
	ОстатокНаКонец = ОстатокНаНачало + ПоДаннымОрганизации.Итог("Дебет") -  ПоДаннымОрганизации.Итог("Кредит");
	
	КонОстДебет  = ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0);
	КонОстКредит = ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0);
	
	ОстатокНаКонецК = -ОстатокНаНачало + ПоДаннымКонтрагента.Итог("Дебет") -  ПоДаннымКонтрагента.Итог("Кредит");
	
	КонОстДебетК  = ?(ОстатокНаКонецК > 0, ОстатокНаКонецК, 0);
	КонОстКредитК = ?(ОстатокНаКонецК < 0, -ОстатокНаКонецК, 0);
	
	ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокДт = НачОстДебет;
	ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокКт = НачОстКредит;
	ТабДок.Вывести(ОбластьНачОстатки);
	
	ОборотыДт = 0;
	ОборотыКт = 0;
	ОборотыДтКонтр = 0;
	ОборотыКтКонтр = 0;

		
	Если ПоДаннымОрганизации.Количество()>0 ИЛИ ПоДаннымКонтрагента.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВлЗапрос.Договор КАК Договор,
		|	ВлЗапрос.Дата КАК Дата,
		|	ВлЗапрос.Документ,
		|	ВлЗапрос.Представление,
		|	ВлЗапрос.ДатаК,
		|	ВлЗапрос.ПредставлениеК,
		|	Дебет как СуммаДогДт,
		|	Кредит как СуммаДогКт,
		|	ДебетК как СуммаДогДтКонтр,
		|	КредитК как СуммаДогКтКонтр	
		|Из
		|	(Выбрать"
		+?(РазбитьПоДоговорам,"
		|		ПоДаннымОрганизации.ДоговорКонтрагента КАК Договор,","
		|		NULL КАК Договор,")
		+"	
		|		ПоДаннымОрганизации.Дата как Дата,
		|		NUll как ДатаК,
		|		ПоДаннымОрганизации.Документ КАК Документ,
		|		ПоДаннымОрганизации.Представление КАК Представление,
		|		NULL КАК ПредставлениеК,
		|		ПоДаннымОрганизации.Дебет КАК Дебет,
		|		ПоДаннымОрганизации.Кредит КАК Кредит,
		|		0 КАК ДебетК,
		|		0 КАК КредитК
		|	ИЗ
		|		Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ПоДаннымОрганизации
		|	Где
		|		ПоДаннымОрганизации.Ссылка = &ТекущийДокумент
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|   
		|	Выбрать"
		+?(РазбитьПоДоговорам,"
		|		ПоДаннымКонтрагента.ДоговорКонтрагента,","
		|		NULL КАК Договор,")
		+"	
		|		NULL,
		|		ПоДаннымКонтрагента.Дата,
		|		NULL,
		|		NULL,
		|		ПоДаннымКонтрагента.Представление,
		|		0,
		|		0,
		|		ПоДаннымКонтрагента.Дебет,
		|		ПоДаннымКонтрагента.Кредит
		|
		|	ИЗ
		|		Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ПоДаннымКонтрагента
		|	Где
		|		ПоДаннымКонтрагента.Ссылка = &ТекущийДокумент
		|     
		|     
		|)	КАК ВлЗапрос
		|
		|	ИТОГИ
		|		СУММА(СуммаДогДт),
		|		СУММА(СуммаДогКт),
		|		СУММА(СуммаДогДтКонтр),
		|		СУММА(СуммаДогКтКонтр)
		|	ПО
		|		Общие,Договор";
		
		Результат = Запрос.Выполнить();		
		
		ОбходПоОбщимИтогам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Общие");
		ОбходПоОбщимИтогам.Следующий();	
		
		ОборотыДт = ОбходПоОбщимИтогам.СуммаДогДт;
		ОборотыКт = ОбходПоОбщимИтогам.СуммаДогКт;
		ОборотыДтКонтр = ОбходПоОбщимИтогам.СуммаДогДтКонтр;
		ОборотыКтКонтр = ОбходПоОбщимИтогам.СуммаДогКтКонтр;

		
		ОбходПоДоговорам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
		Пока ОбходПоДоговорам.Следующий() Цикл
			
			Если РазбитьПоДоговорам Тогда
				//Выводим заголовок с договором
				Данные = Новый Структура("ДоговорДата,ДоговорНомер,ДоговорКонтрагента,ДоговорНаименованиеДляПечати", ОбходПоДоговорам.Договор.Дата,ОбходПоДоговорам.Договор.Номер,ОбходПоДоговорам.Договор,ОбходПоДоговорам.Договор.НаименованиеДляПечати);
				СписокПараметров = "ДоговорНаименованиеДляПечати,";
				МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Данные,СписокПараметров,КодЯзыкаПечать);
				НаименованиеДоговораДляПечати = МассивСтруктурСтрок[0].ЗначениеПараметра;
				ОбластьДоговор.Параметры.Договор = НаименованиеДоговораДляПечати;
				ОбластьДоговор.Параметры.Регистратор = ОбходПоДоговорам.Договор;
				ТабДок.Вывести(ОбластьДоговор);
				ОбходПоДокументам=ОбходПоДоговорам.Выбрать();
			Иначе
				ОбходПоДокументам=Результат.Выбрать();
			КонецЕсли;		
			
			//Создадим список документов по организации и контрагенту
			СписокДокументов = новый массив;
			СписокДокументовК = новый массив;
			Пока ОбходПоДокументам.Следующий() Цикл
				Если ОбходПоДокументам.Дата<>NULL Тогда
					СписокДокументов.Добавить(новый структура("ДатаДокумента,РегистраторПредставление,Регистратор,СуммаОборотДт,СуммаОборотКт",
					ОбходПоДокументам.Дата,ОбходПоДокументам.Представление,ОбходПоДокументам.Документ,ОбходПоДокументам.СуммаДогДт,ОбходПоДокументам.СуммаДогКт));				
				КонецЕсли;
				
				Если ОбходПоДокументам.ДатаК<>NULL Тогда
					СписокДокументовК.Добавить(новый структура("ДатаДокументаКонтр,РегистраторПредставлениеКонтр,СуммаОборотДтКонтр,СуммаОборотКтКонтр",
					ОбходПоДокументам.ДатаК,ОбходПоДокументам.ПредставлениеК,ОбходПоДокументам.СуммаДогДтКонтр,ОбходПоДокументам.СуммаДогКтКонтр));				
				КонецЕсли; 
			КонецЦикла;
			
			//Для упрощения вывода, сравним списки по количеству элементов, добавив пустые
			МаксИндекс = Макс(СписокДокументов.Количество(), СписокДокументовК.Количество())-1;
			МинИндекс = Мин(СписокДокументов.Количество(), СписокДокументовК.Количество())-1;
			Если СписокДокументов.Количество()<СписокДокументовК.Количество() Тогда
				Для инд = МинИндекс По МаксИндекс-1 Цикл
					СписокДокументов.Добавить(новый структура("ДатаДокумента,РегистраторПредставление,Регистратор,СуммаОборотДт,СуммаОборотКт","","","","",""));
				КонецЦикла;
			ИначеЕсли СписокДокументов.Количество()>СписокДокументовК.Количество() Тогда 
				Для инд = МинИндекс По МаксИндекс-1 Цикл
					СписокДокументовК.Добавить(новый структура("ДатаДокументаКонтр,РегистраторПредставлениеКонтр,СуммаОборотДтКонтр,СуммаОборотКтКонтр","","","",""));
				КонецЦикла;			
			КонецЕсли;
			
			Для Инд = 0 По МаксИндекс Цикл
				ОбластьОбороты.Параметры.Заполнить(СписокДокументов[Инд]);
				ОбластьОбороты.Параметры.Заполнить(СписокДокументовК[Инд]);			
				ТабДок.Вывести(ОбластьОбороты);
			КонецЦикла;
			
			Если РазбитьПоДоговорам Тогда
				//Выводим итоги по каждому договору
				ОбластьДоговорИтоги.Параметры.Заполнить(ОбходПоДоговорам);		
				ТабДок.Вывести(ОбластьДоговорИтоги);	
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;  
		
		ОбластьОборотыИтог.Параметры.СуммаОборотДт      = ОборотыДт;
		ОбластьОборотыИтог.Параметры.СуммаОборотКт      = ОборотыКт;
		Если СверкаСогласована тогда
			ОбластьОборотыИтог.Параметры.СуммаОборотДтКонтр = ОборотыДтКонтр;
			ОбластьОборотыИтог.Параметры.СуммаОборотКтКонтр = ОборотыКтКонтр;
		КонецЕсли;
		ТабДок.Вывести(ОбластьОборотыИтог);
		
	КонецЕсли;
	
	
	
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДт = КонОстДебет;
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКт = КонОстКредит;
	
	Если СверкаСогласована тогда
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДтКонтр = КонОстДебетК;
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКтКонтр = КонОстКредитК;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьКонОстатки);
	
	// Результаты сверки
	
  	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
   	    РезультатыСверки = НСтр("ru='<не указана дата сверки>';uk='<не вказано дату звірки>'",КодЯзыкаПечать);
   	ИначеЕсли НЕ ЗначениеЗаполнено(Контрагент) Тогда
   	    РезультатыСверки = НСтр("ru='<не указан контрагент>';uk='<не вказано контрагент>'",КодЯзыкаПечать);
   	Иначе
			
	   	Если ОстатокНаКонец > 0 Тогда
			РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность в пользу ¤2¤ ¤3¤ ¤4¤';uk='на ¤1¤ заборгованість на користь  ¤2¤ ¤3¤ ¤4¤'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"), СокрЛП(НазваниеОрганизации), Формат(ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2"), строка(ВалютаДокумента));
	   	ИначеЕсли ОстатокНаКонец < 0 Тогда
			РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность в пользу ¤2¤ ¤3¤ ¤4¤';uk='на ¤1¤ заборгованість на користь  ¤2¤ ¤3¤ ¤4¤'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"), СокрЛП(НаименованиеКонтрагента), Формат(-ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2"), строка(ВалютаДокумента));
	   	Иначе
			РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность отсутствует.';uk='на ¤1¤ заборгованість відсутня.'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
	   	КонецЕсли;
	КонецЕсли;
	ОбластьПодвал.Параметры.РезультатыСверки = РезультатыСверки;
	
	Если СверкаСогласована тогда
		ОбластьПодвал.Параметры.ПоДаннымКонтрагента = НСтр("ru='По данным ';uk='За даними '",КодЯзыкаПечать) + СокрЛП(НаименованиеКонтрагента);
		
	  	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
	   	    РезультатыСверки = НСтр("ru='<не указана дата сверки>';uk='<не вказано дату звірки>'",КодЯзыкаПечать);
	   	ИначеЕсли НЕ ЗначениеЗаполнено(Контрагент) Тогда
	   	    РезультатыСверки = НСтр("ru='<не указан контрагент>';uk='<не вказано контрагент>'",КодЯзыкаПечать);
	   	Иначе
				
		   	Если ОстатокНаКонецК < 0 Тогда
				РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность в пользу ¤2¤ ¤3¤ ¤4¤';uk='на ¤1¤ заборгованість на користь  ¤2¤ ¤3¤ ¤4¤'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"), СокрЛП(НазваниеОрганизации), Формат(-ОстатокНаКонецК, "ЧЦ=21; ЧДЦ=2"), строка(ВалютаДокумента));
		   	ИначеЕсли ОстатокНаКонецК > 0 Тогда
				РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность в пользу ¤2¤ ¤3¤ ¤4¤';uk='на ¤1¤ заборгованість на користь  ¤2¤ ¤3¤ ¤4¤'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"), СокрЛП(НаименованиеКонтрагента), Формат(ОстатокНаКонецК, "ЧЦ=21; ЧДЦ=2"), строка(ВалютаДокумента));
		
		   	Иначе
				РезультатыСверки = Локализация.СтрШаблон1(НСтр("ru='на ¤1¤ задолженность отсутствует.';uk='на ¤1¤ заборгованість відсутня.'",КодЯзыкаПечать), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
		   	КонецЕсли;
	   	КонецЕсли;
		
		ОбластьПодвал.Параметры.РезультатыСверкиК = РезультатыСверки;
		
		Если ОстатокНаКонец+ОстатокНаКонецК<>0 Тогда
			 ИтогСверки = НСтр("ru='В результате сверки выявлено расхождение информации о состоянии расчетов в размере ';uk='В результаті звірення виявлена розбіжність інформації про стан розрахунків у розмірі '",КодЯзыкаПечать)+Формат(?(ОстатокНаКонец+ОстатокНаКонецК>0,1,-1)*(ОстатокНаКонец+ОстатокНаКонецК), "ЧЦ=21; ЧДЦ=2") +" "+ Строка(ВалютаДокумента);
			 ОбластьПодвал.Параметры.ИтогСверки = Символы.ПС+ ИтогСверки+Символы.ПС+" ";
		КонецЕсли; 
	КонецЕсли;
	
	ОбластьПодвал.Параметры.НазваниеОрганизации = СокрЛП(НазваниеОрганизации);
	ОбластьПодвал.Параметры.НаименованиеКонтрагента = СокрЛП(НаименованиеКонтрагента);
	
	ОбластьПодвал.Параметры.Должность = ?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Должность),"________________",ДанныеПредставителяОрганизации.Должность);
	ОбластьПодвал.Параметры.ДолжностьК = ?(НЕ ЗначениеЗаполнено(ПредставительКонтрагента.Должность),"________________",ПредставительКонтрагента.Должность);
	
	ОбластьПодвал.Параметры.ФИОПредставителя  = "("+?(НЕ ЗначениеЗаполнено(ДанныеПредставителяОрганизации.Представление),"_______________________",ДанныеПредставителяОрганизации.Представление)+")";
	ОбластьПодвал.Параметры.ФИОПредставителяК = "("+?(НЕ ЗначениеЗаполнено(ПредставительКонтрагента),"_______________________",ПредставительКонтрагента)+")";
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "АктСверки" Тогда
		
		ТабДокумент = ПечатьАктаСверки();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	
КонецПроцедуры // Печать

// Заполнение таблицы "По данным организации" по информации из бухгалтерского учета
Процедура ЗаполнитьПоДаннымБухгалтерскогоУчета() Экспорт
	
	Если ДатаОкончания < ДатаНачала Тогда
	    Предупреждение("Неверно задан период сверки расчетов.");
		Возврат;
	КонецЕсли;
	
	КоличествоСчетов = СписокСчетов.Количество();
	ФильтрСписокСчетов = Новый СписокЗначений();
	Для каждого СтрокаСчета Из СписокСчетов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСчета.Счет) или СтрокаСчета.УчаствуетВРасчетах = Ложь Тогда
			Продолжить;
		Иначе
			ФильтрСписокСчетов.Добавить(СтрокаСчета.Счет);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ФильтрСписокСчетов.Количество() = 0 Тогда
	    Предупреждение("Неверно задан список счетов,по которым производится сверка .");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(НЕ ЗначениеЗаполнено(ДатаОкончания),ДатаОкончания,КонецДня(ДатаОкончания)));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("Валюта",        ?(НЕ ЗначениеЗаполнено(ВалютаДокумента) или (ВалютаДокумента = мВалютаРегламентированногоУчета), неопределено,ВалютаДокумента));
	Запрос.УстановитьПараметр("ФильтрСписокСчетов", ФильтрСписокСчетов);
	
	БУ = ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками.ПолучитьОбъект();
	ВестиПоРасчетнымДокументамБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	АналитикаРасчетов = новый Массив();
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	ФильтрНаСделку = "";
	Если ВестиПоРасчетнымДокументамБУ Тогда
		АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
		
		ПоСчетамПоЗаказам = новый Массив;
		ПоСчетамПоЗаказам.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам);
		ПоСчетамПоЗаказам.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
		Запрос.УстановитьПараметр("ПоСчетамПоЗаказам",ПоСчетамПоЗаказам);		
		
		Если ЗначениеЗаполнено(Сделка) Тогда
			ФильтрНаСделку = " И Субконто3 = &Сделка";
			Запрос.УстановитьПараметр("Сделка",Сделка);		
		КонецЕсли;
		
	КонецЕсли;
	Запрос.УстановитьПараметр("АналитикаРасчетов",    АналитикаРасчетов);
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ?(НЕ ЗначениеЗаполнено(ДоговорКонтрагента),Неопределено,ДоговорКонтрагента));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор.Дата КАК Дата,
	|	ХозрасчетныйОбороты.Регистратор КАК Документ,
	|	ХозрасчетныйОбороты.Субконто2 КАК Договор," +
	?(ВестиПоРасчетнымДокументамБУ,"
	|	ВЫБОР КОГДА Субконто2.ВедениеВзаиморасчетов В (&ПоСчетамПоЗаказам) Тогда Субконто3 ИНАЧЕ Неопределено КОНЕЦ КАК Сделка,"
	, "
	|	Неопределено КАК Сделка,")
	+ "
	|	0 КАК ОстатокНаНачало,
	|	ВЫБОР
	|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт
	|	КОНЕЦ КАК Дебет,
	|	ВЫБОР
	|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт
	|	КОНЕЦ КАК Кредит,
	|	0 КАК ОстатокНаКонец,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Регистратор.НомерВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Регистратор.ДатаВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА (НЕ ЕСТЬNULL(ХозрасчетныйОбороты.Регистратор.НомерПоручения, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО)
	|			ТОГДА ХозрасчетныйОбороты.Регистратор.НомерПоручения
	|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.Регистратор.НомерОрдера, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК НомерДокумента,
	|	ХозрасчетныйОбороты.КорСчет,
	|	ХозрасчетныйОбороты.КорСубконто1,
	|	ХозрасчетныйОбороты.КорСубконто2,
	|	ХозрасчетныйОбороты.КорСубконто3,
	|	ХозрасчетныйОбороты.Валюта,
	|	ХозрасчетныйОбороты.ВалютнаяСуммаОборот,
	|	ХозрасчетныйОбороты.Счет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Регистратор,
	|		Счет В ИЕРАРХИИ (&ФильтрСписокСчетов),
	|		&АналитикаРасчетов,
	|		Организация = &Организация
	|			И ВЫБОР
	|				КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Валюта = &Валюта
	|			КОНЕЦ
	|			И Субконто1 = &Контрагент
	|			И ВЫБОР
	|				КОГДА &ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Субконто2 = &ДоговорКонтрагента
	|			КОНЕЦ  "+ФильтрНаСделку+")  КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&ФильтрСписокСчетов)
	|				ТОГДА ВЫБОР
	|						КОГДА &ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
	|							ТОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1 = &Контрагент)
	|						ИНАЧЕ (НЕ(ХозрасчетныйОбороты.КорСубконто1 = &Контрагент
	|									И ХозрасчетныйОбороты.КорСубконто2 = &ДоговорКонтрагента))
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Остатки"",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ХозрасчетныйОстатки.СуммаНачальныйОстаток
	|		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаНачальныйОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ХозрасчетныйОстатки.СуммаКонечныйОстаток
	|		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаКонечныйОстаток
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Период,
	|		ДвиженияИГраницыПериода,
	|		Счет В ИЕРАРХИИ (&ФильтрСписокСчетов),
	|		&АналитикаРасчетов,
	|		Организация = &Организация
	|		    И ВЫБОР
	|		        КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|		            ТОГДА ИСТИНА
	|		        ИНАЧЕ Валюта = &Валюта
	|		    КОНЕЦ
	|		    И Субконто1 = &Контрагент
	|		    И ВЫБОР
	|		        КОГДА &ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
	|		            ТОГДА ИСТИНА
	|		        ИНАЧЕ Субконто2 = &ДоговорКонтрагента
	|		    КОНЕЦ "+ФильтрНаСделку+") КАК ХозрасчетныйОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ,
	|   Дебет";
	Выборка = Запрос.Выполнить().Выбрать();
	
	// заполнять документ будем "как для печати"
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	НаборДвижений = ПоДаннымОрганизации.Выгрузить();
	
	ОстатокНаНачало = 0;
	ОстатокНаКонец  = 0;
	ТекДокумент = "Неопределено";
	НоваяСтрока = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если Выборка.Дата = "Остатки" Тогда
			ОстатокНаНачало = ОстатокНаНачало+Выборка.ОстатокНаНачало;
			ОстатокНаКонец  = ОстатокНаКонец+Выборка.ОстатокНаКонец;
			Продолжить;
		КонецЕсли; 
		
		Если Выборка.Дебет = 0 И Выборка.Кредит = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Выборка.КорСубконто1 = Контрагент 
		   И Выборка.КорСубконто2 = Выборка.Договор
		   И НЕ ФильтрСписокСчетов.НайтиПоЗначению(Выборка.КорСчет) = Неопределено Тогда
		
			// зачет аванса или подобное
			Продолжить;
		
		КонецЕсли;
		
		Если (  ВалютаДокумента = мВалютаРегламентированногоУчета
 			  И Выборка.Договор.Внешнеэкономический = Истина)
		  ИЛИ (  ВалютаДокумента <> мВалютаРегламентированногоУчета
 			  И Выборка.Договор.Внешнеэкономический <> Истина) Тогда
			  
			// договор не соответствует валюте документа
			Продолжить;
			  
		КонецЕсли;			  
		
		Если ТекДокумент = Выборка.Документ Тогда
			// новую строку добалять нет смысла
			
			Если Выборка.Дебет <> 0 Тогда
				Если НоваяСтрока.Дебет <> 0 Тогда
					НоваяСтрока.Дебет  = НоваяСтрока.Дебет + Выборка.Дебет;
				Иначе	
				    НоваяСтрока.Кредит  = НоваяСтрока.Кредит - Выборка.Дебет;
				КонецЕсли;
			КонецЕсли;
			
			Если Выборка.Кредит <> 0 Тогда
				Если НоваяСтрока.Кредит <> 0 Тогда
					НоваяСтрока.Кредит  = НоваяСтрока.Кредит + Выборка.Кредит;
				Иначе	
				    НоваяСтрока.Дебет  = НоваяСтрока.Дебет - Выборка.Кредит;
				КонецЕсли;
			КонецЕсли;
			
		Иначе	
			ТекДокумент = Выборка.Документ; 
			
			НоваяСтрока = НаборДвижений.Добавить();
			НоваяСтрока.Документ           = Выборка.Документ;
			НоваяСтрока.ДоговорКонтрагента = Выборка.Договор;
			НоваяСтрока.Сделка             = Выборка.Сделка;
			НоваяСтрока.Дата               = Выборка.Дата;
			НоваяСтрока.Дебет              = Выборка.Дебет;
			НоваяСтрока.Кредит             = Выборка.Кредит;
		КонецЕсли;
		
		
		Если ВыводитьПолныеНазванияДокументов Тогда 
			
			Если Выборка.НомерВходящегоДокумента = Неопределено тогда
				Если Выборка.НомерДокумента = Неопределено тогда
					Представление = "" + Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
														   КодЯзыкаПечать)+" №"+Символы.НПП + ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.Документ);
				Иначе			
					Представление = "" + Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
		                                                   КодЯзыкаПечать) +" №"+ Выборка.НомерДокумента;
				КонецЕсли;
			Иначе
				Представление = "" + Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
		        			                               КодЯзыкаПечать) +" ("+ ?(НЕ ЗначениеЗаполнено(Выборка.НомерВходящегоДокумента),"_______", Выборка.НомерВходящегоДокумента) +
														   НСтр("ru=' от ';uk=' від '",КодЯзыкаПечать) +
				                                           ?(НЕ ЗначениеЗаполнено(Выборка.ДатаВходящегоДокумента), "'  .  .    '", Формат(Выборка.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"))+")";
			КонецЕсли;	
			
		Иначе  
		
			// Сформируем строку представления
			Представление = "";
			
			Если Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ПолученныеШтрафыПениНеустойки)
			 ИЛИ Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ПризнанныеШтрафыПениНеустойки) Тогда
				Представление =  НСтр("ru='Санкции';uk='Санкції'",КодЯзыкаПечать);
			КонецЕсли;

			Если не ПустаяСтрока(Представление) Тогда
				 // Строка уже отработана
			
			ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы) 
	     		  или Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы) Тогда
				  
			    Если (Выборка.Дебет >0) Тогда
					Представление = "Займ";
				ИначеЕсли (Выборка.Кредит >0)Тогда
					Представление =  НСтр("ru='Возврат займа';uk='Повернення позики'",КодЯзыкаПечать);
				Иначе
					Представление =  НСтр("ru='Операции по займам';uk='Операції по позиках'",КодЯзыкаПечать);
				КонецЕсли;
				
			ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям) 
				  или Выборка.Счет = ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям	Тогда
				
				Представление =  НСтр("ru='Претензия';uk='Претензія'",КодЯзыкаПечать);
				
			ИначеЕсли Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Касса) 
				  ИЛИ Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.СчетаВБанках) 
				  ИЛИ Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами) 
				  Тогда
				
				Если (Выборка.Кредит >0) Тогда
				
					Если  Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)
					  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам) Тогда 
						Представление =  НСтр("ru='Возврат средств';uk='Повернення коштів'",КодЯзыкаПечать);
						
					ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками) 
						  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным) Тогда
						
						Представление = "Оплата";
						
					Иначе
						
						Представление =  НСтр("ru='Перевод средств';uk='Переведення  коштів'",КодЯзыкаПечать);
						
					КонецЕсли;
					
				ИначеЕсли (Выборка.Дебет >0) Тогда
					Если  Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)
					  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами)
					  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами)
					  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам) Тогда
						
						Представление = "Оплата";
						
					ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)
						  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным) Тогда
						  
						Представление =  НСтр("ru='Возврат средств';uk='Повернення коштів'",КодЯзыкаПечать);
						
					Иначе
						
						Представление =  НСтр("ru='Перевод средств';uk='Переведення  коштів'",КодЯзыкаПечать);
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками) Тогда
				Если Выборка.Дебет <>0 Тогда
					
					Представление =  НСтр("ru='Возврат';uk='Повернення'",КодЯзыкаПечать);
						
				ИначеЕсли Выборка.Кредит <>0 Тогда
					
					Представление = НСтр("ru='Поступление';uk='Надходження'",КодЯзыкаПечать);
					
				КонецЕсли;
			ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками) Тогда
				Если Выборка.Дебет <>0 Тогда
					
					Представление = НСтр("ru='Продажа';uk='Продаж'",КодЯзыкаПечать);
						
				ИначеЕсли (Выборка.Кредит <>0) Тогда
					
					Представление =  НСтр("ru='Возврат';uk='Повернення'",КодЯзыкаПечать);
					
				КонецЕсли;
			ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами)
				  ИЛИ Выборка.Счет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами) Тогда
				  
				Если Выборка.Дебет <>0 Тогда
					
					Представление =  НСтр("ru='Реализация';uk='Реалізація'",КодЯзыкаПечать);
						
				ИначеЕсли Выборка.Кредит <>0 Тогда
					
				   Если Выборка.КорСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ВычетыИзДохода)
					 ИЛИ Выборка.КорСчет = ПланыСчетов.Хозрасчетный.ВычетыИзДохода Тогда
					    Представление =  НСтр("ru='Возврат';uk='Повернення'",КодЯзыкаПечать);
				 	Иначе
						Представление = НСтр("ru='Поступление';uk='Надходження'",КодЯзыкаПечать);
					КонецЕсли;
					
				КонецЕсли;		 
			КонецЕсли;
			
			Если ПустаяСтрока(Представление)Тогда
				Если Выборка.Дебет > 0 тогда
					Представление =  НСтр("ru='Принято';uk='Прийнято'",КодЯзыкаПечать);
				ИначеЕсли Выборка.Дебет < 0 тогда
					Представление = НСтр("ru='Сторно: принято';uk='Сторно: прийняте'",КодЯзыкаПечать);
				ИначеЕсли Выборка.Кредит > 0 тогда
					Представление = "Передано";
				Иначе
					Представление = "Сторно: передано";
				КонецЕсли;
			КонецЕсли;

			Если Выборка.НомерВходящегоДокумента = Неопределено тогда
				Представление = Представление +" ("+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") +")";
			Иначе
				Представление = Представление +" ("+ ?(НЕ ЗначениеЗаполнено(Выборка.НомерВходящегоДокумента),"_______", Выборка.НомерВходящегоДокумента) + НСтр("ru=' от ';uk=' від '",КодЯзыкаПечать) +
				?(НЕ ЗначениеЗаполнено(Выборка.ДатаВходящегоДокумента), "'  .  .    '", Формат(Выборка.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"))+")";
			КонецЕсли;					  
		КонецЕсли;					  
			
		НоваяСтрока.Представление = Представление;

	КонецЦикла;
	
	НаборДвижений.Свернуть("Дата,Документ,Представление,ДоговорКонтрагента,Сделка","Дебет, Кредит");	
	
	Если РазбитьПоДоговорам Тогда		
		НаборДвижений.Сортировать("ДоговорКонтрагента, Дата,Документ,Представление");		
	Иначе	
		НаборДвижений.Сортировать("Дата,Документ,Представление");	
	КонецЕсли; 	
						  
	ПоДаннымОрганизации.Загрузить(НаборДвижений);

КонецПроцедуры

// Заполнение таблицы "По данным организации" по информации из бухгалтерского учета
Процедура ЗаполнитьПоДаннымУправленческогоУчета() Экспорт
	
	Если ДатаОкончания < ДатаНачала Тогда
	    Предупреждение("Неверно задан период сверки расчетов.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(НЕ ЗначениеЗаполнено(ДатаОкончания),ДатаОкончания,КонецДня(ДатаОкончания)));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("Валюта",        ВалютаДокумента);
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ?(НЕ ЗначениеЗаполнено(ДоговорКонтрагента),Неопределено,ДоговорКонтрагента));
	
	
	ТекстФильтра = "
	|		Организация = &Организация И Контрагент = &Контрагент ";
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстФильтра = ТекстФильтра + " И ДоговорКонтрагента = &ДоговорКонтрагента ";
	Иначе
		ТекстФильтра = ТекстФильтра + " И ДоговорКонтрагента.ВалютаВзаиморасчетов = &Валюта ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		ТекстФильтра = ТекстФильтра + " И Сделка = &Сделка ";
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыОбороты.Регистратор.Дата КАК Дата,
	|	ВзаиморасчетыОбороты.Регистратор КАК Документ,
	|	ВзаиморасчетыОбороты.ДоговорКонтрагента КАК Договор,
	|	ВзаиморасчетыОбороты.ДоговорКонтрагента КАК Сделка,
	|	0 КАК ОстатокНаНачало,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОбороты.СуммаВзаиморасчетовПриход - ВзаиморасчетыОбороты.СуммаВзаиморасчетовРасход > 0
	|			ТОГДА ВзаиморасчетыОбороты.СуммаВзаиморасчетовПриход - ВзаиморасчетыОбороты.СуммаВзаиморасчетовРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дебет,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОбороты.СуммаВзаиморасчетовПриход - ВзаиморасчетыОбороты.СуммаВзаиморасчетовРасход < 0
	|			ТОГДА -(ВзаиморасчетыОбороты.СуммаВзаиморасчетовПриход - ВзаиморасчетыОбороты.СуммаВзаиморасчетовРасход)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кредит,
	|	0 КАК ОстатокНаКонец,
	|	ЕСТЬNULL(ВзаиморасчетыОбороты.Регистратор.НомерВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(ВзаиморасчетыОбороты.Регистратор.ДатаВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА (НЕ ЕСТЬNULL(ВзаиморасчетыОбороты.Регистратор.НомерПоручения, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО)
	|			ТОГДА ВзаиморасчетыОбороты.Регистратор.НомерПоручения
	|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыОбороты.Регистратор.НомерОрдера, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Регистратор,
	|		"+ТекстФильтра+") КАК ВзаиморасчетыОбороты
	|
	|ГДЕ
	|	ВзаиморасчетыОбороты.СуммаВзаиморасчетовПриход <> ВзаиморасчетыОбороты.СуммаВзаиморасчетовРасход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Остатки"",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕстьNULL(ВзаиморасчетыОстатки.СуммаВзаиморасчетовНачальныйОстаток, 0),
	|	0,
	|	0,
	|	ЕстьNULL(ВзаиморасчетыОстатки.СуммаВзаиморасчетовКонечныйОстаток, 0),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Период,,
	|		"+ТекстФильтра+") КАК ВзаиморасчетыОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// заполнять документ будем "как для печати"
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	НаборДвижений = ПоДаннымОрганизации.Выгрузить();
	
	ОстатокНаНачало = 0;
	ОстатокНаКонец  = 0;
	Пока Выборка.Следующий() Цикл

		Если Выборка.Дата = "Остатки" Тогда
			ОстатокНаНачало = ОстатокНаНачало+Выборка.ОстатокНаНачало;
			ОстатокНаКонец  = ОстатокНаКонец+Выборка.ОстатокНаКонец;
			Продолжить;
		КонецЕсли; 
		
		Если Выборка.Дебет = 0 И Выборка.Кредит = 0 Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = НаборДвижений.Добавить();
		НоваяСтрока.Документ           = Выборка.Документ;
		НоваяСтрока.Дата               = Выборка.Дата;
		НоваяСтрока.Дебет              = Выборка.Дебет;
		НоваяСтрока.Кредит             = Выборка.Кредит;
		НоваяСтрока.ДоговорКонтрагента = Выборка.Договор;
		НоваяСтрока.Сделка             = Выборка.Сделка;
		
		Если ВыводитьПолныеНазванияДокументов Тогда 
			Если Выборка.НомерВходящегоДокумента = Неопределено тогда
				Если Выборка.НомерДокумента = Неопределено тогда
					Представление = Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
														   КодЯзыкаПечать)+" №"+Символы.НПП + ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.Документ);
				Иначе			
					Представление = Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
		                                                   КодЯзыкаПечать) +" №"+ Выборка.НомерДокумента;
				КонецЕсли;
			Иначе
				Представление = Локализация.ПолучитьЛокализованныйСинонимОбъекта(Выборка.Документ,
		        			                               КодЯзыкаПечать) +" ("+ ?(НЕ ЗначениеЗаполнено(Выборка.НомерВходящегоДокумента),"_______", Выборка.НомерВходящегоДокумента) +
														   НСтр("ru=' от ';uk=' від '",КодЯзыкаПечать) +
				                                           ?(НЕ ЗначениеЗаполнено(Выборка.ДатаВходящегоДокумента), "'  .  .    '", Формат(Выборка.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"))+")";
			КонецЕсли;	
			
		Иначе  
			// Сформируем строку представления
			Представление = "";
			
			Если Выборка.Дебет > 0 тогда
				Представление =  НСтр("ru='Принято';uk='Прийнято'",КодЯзыкаПечать);
			ИначеЕсли Выборка.Дебет < 0 тогда
				Представление = НСтр("ru='Сторно: принято';uk='Сторно: прийняте'",КодЯзыкаПечать);
			ИначеЕсли Выборка.Кредит > 0 тогда
				Представление = "Передано";
			Иначе
				Представление = "Сторно: передано";
			КонецЕсли;

			Если Выборка.НомерВходящегоДокумента = Неопределено тогда
				Представление = Представление +" ("+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") +")";
			Иначе
				Представление = Представление +" ("+ ?(НЕ ЗначениеЗаполнено(Выборка.НомерВходящегоДокумента),"_______", Выборка.НомерВходящегоДокумента) + НСтр("ru=' от ';uk=' від '",КодЯзыкаПечать) +
				?(НЕ ЗначениеЗаполнено(Выборка.ДатаВходящегоДокумента), "'  .  .    '", Формат(Выборка.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"))+")";
			КонецЕсли;					  
			
		КонецЕсли;					  
		НоваяСтрока.Представление = Представление;

	КонецЦикла;
	
	
	НаборДвижений.Свернуть("Дата,Документ,Представление,ДоговорКонтрагента,Сделка","Дебет, Кредит");	
	Если РазбитьПоДоговорам Тогда		
		НаборДвижений.Сортировать("ДоговорКонтрагента, Дата,Документ,Представление");		
	Иначе	
		НаборДвижений.Сортировать("Дата,Документ,Представление");	
	КонецЕсли; 	
	//НаборДвижений.Сортировать("Дата,Документ,Представление");	
						  
	ПоДаннымОрганизации.Загрузить(НаборДвижений);

КонецПроцедуры

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("АктСверки", "Акт сверки");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьПоДаннымОрганизации() Экспорт
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	ТабЗнач = ПоДаннымОрганизации.Выгрузить();
	ТабЗнач.Колонки.Дебет.Имя  = "КредитК";
	ТабЗнач.Колонки.Кредит.Имя = "Дебет";
	ТабЗнач.Колонки.КредитК.Имя= "Кредит";
	
	Для каждого СтрокаДвижений Из ТабЗнач Цикл
		Представление = СокрЛП(СтрокаДвижений.Представление);
		Если Лев(Представление, 8) = "Передано" Тогда
			Представление = НСтр("ru='Принято';uk='Прийнято'",КодЯзыкаПечать) + Сред(Представление, 9);
			
		ИначеЕсли Лев(Представление, 7) = "Принято" Тогда
			Представление = "Передано" + Сред(Представление, 8);
		ИначеЕсли Лев(Представление, 8) = "Прийнято" Тогда
			Представление = "Передано" + Сред(Представление, 9);
			
		ИначеЕсли Лев(Представление, 7) = "Продажа" Тогда
			Представление = "Приход" + Сред(Представление, 8);
		ИначеЕсли Лев(Представление, 6) = "Приход" Тогда
			Представление = "Продажа" + Сред(Представление, 7);
			
		ИначеЕсли Лев(Представление, 15) = "Сторно: принято" Тогда
			Представление = "Сторно: передано" + Сред(Представление, 16);
		ИначеЕсли Лев(Представление, 16) = "Сторно: прийняте" Тогда
			Представление = "Сторно: передано" + Сред(Представление, 17);

		ИначеЕсли Лев(Представление, 16) = "Сторно: передано" Тогда
			Представление = НСтр("ru='Сторно: принято';uk='Сторно: прийняте'",КодЯзыкаПечать) + Сред(Представление, 17);
			
			
		ИначеЕсли Лев(Представление, 13) = "Возврат займа" Тогда
			Представление = "Операции по займам" + Сред(Представление, 14);
		ИначеЕсли Лев(Представление, 17) = "Повернення позики" Тогда
			Представление = "Операції по позиках" + Сред(Представление, 18);
		ИначеЕсли Лев(Представление, 18) = "Операции по займам" Тогда
			Представление = "Возврат займа" + Сред(Представление, 19);
		ИначеЕсли Лев(Представление, 19) = "Операції по позиках" Тогда
			Представление = "Повернення позики" + Сред(Представление, 20);
			
			
		ИначеЕсли Лев(Представление, 11) = "Поступление" Тогда
			Представление = "Продажа" + Сред(Представление, 12);
		ИначеЕсли Лев(Представление, 11) = "Надходження" Тогда
			Представление = "Продаж" + Сред(Представление, 12);
		
		ИначеЕсли Лев(Представление, 7) = "Продажа" Тогда
			Представление = "Поступление" + Сред(Представление, 8);
		ИначеЕсли Лев(Представление, 6) = "Продаж" Тогда
			Представление = "Надходження" + Сред(Представление, 7);
		КонецЕсли;
		
		
		Поз = Найти(Представление, "от покупателя");
		Если Поз > 0 Тогда
			Представление = Лев(Представление, Поз - 1) + "поставщику" + Сред(Представление, Поз + 13);
		Иначе 
			Поз = Найти(Представление, "поставщику");
			Если Поз > 0 Тогда
				Представление = Лев(Представление, Поз - 1) + "от покупателя" + Сред(Представление, Поз + 10);
			Иначе 
				Поз = Найти(Представление, "постачальнику");
				Если Поз > 0 Тогда
					Представление = Лев(Представление, Поз - 1) + "від покупця" + Сред(Представление, Поз + 13);
				Иначе 
					Поз = Найти(Представление, "від покупця");
					Если Поз > 0 Тогда
						Представление = Лев(Представление, Поз - 1) + "постачальнику" + Сред(Представление, Поз + 11);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаДвижений.Представление = Представление;
	КонецЦикла;
	
	ПоДаннымКонтрагента.Загрузить(ТабЗнач);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
МетаданныеПоДокументам = Новый Соответствие();
