#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт	;

// Хранит структуру многостраничных разделов
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ РегламентированныйОтчет,
// хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);

мСтруктураВариантыЗаполнения      = Новый Структура;

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв2";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 166 (в редакции приказа ГНАУ от 15.06.2005 № 213)';uk='Затверджена наказом ДПАУ  30.05.97  N 166 (у редакції наказу ДПАУ від 15.06.2005 № 213)'");
НоваяФорма.ДатаНачалоДействия = '20050601';
НоваяФорма.ДатаКонецДействия  = '20070630';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв3";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 166 (в редакции приказа ГНА от 20.08.2007 № 498)';uk='Затверджена наказом ДПАУ  30.05.97  N 166 ((у редакції наказу ДПА України від 20.08.2007 № 498))'");
НоваяФорма.ДатаНачалоДействия = '20070701';
НоваяФорма.ДатаКонецДействия  = '20071231';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 166 (в редакции приказа ГНА от 17.03.2008 № 159)';uk='Затверджена наказом ДПАУ  30.05.97  N 166 ((у редакції наказу ДПА України від 17.03.2008 № 159))'");
НоваяФорма.ДатаНачалоДействия = '20080101';
НоваяФорма.ДатаКонецДействия  = '20090209';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 166 (в редакции приказа ГНА от 21.01.2009 № 8)';uk='Затверджена наказом ДПАУ  30.05.97  N 166 ((у редакції наказу ДПА України від 21.01.2009 № 8))'");
НоваяФорма.ДатаНачалоДействия = '20090131';
НоваяФорма.ДатаКонецДействия  = '20090430';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв2";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом ГНАУ  30.05.97  N 166 (в ред. приказа № 221 от 28.04.2009, с изм. по Приказу №313 от 12.05.2010)'; uk = 'Затверджена наказом ДПАУ  30.05.97  N 166 (у ред. наказу № 221 від 28.04.2009, зі змінами за Наказом №313 від 12.05.2010)'");
НоваяФорма.ДатаНачалоДействия = '20100601';
НоваяФорма.ДатаКонецДействия  = '20110228';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв2";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 166 (в редакции приказа ГНА от 28.04.2009 № 221)';uk='Затверджена наказом ДПАУ  30.05.97  N 166 ((у редакції наказу ДПА України від 28.04.2009 № 221))'");
НоваяФорма.ДатаНачалоДействия = '20090430';
НоваяФорма.ДатаКонецДействия  = '20100531';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  25.01.11  N 41';uk='Затверджена наказом ДПАУ  25.01.11  N 41'");
НоваяФорма.ДатаНачалоДействия = '20110301';
НоваяФорма.ДатаКонецДействия  = '20111231';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Министерства финансов Украины 25.11.11  № 1492'; uk = 'Затверджено Наказом Міністерства фінансів України 25.11.2011 p. № 1492'");
НоваяФорма.ДатаНачалоДействия = '20120101';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
#КонецЕсли
