////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ ПРИ ПРОВЕДЕНИИ ПРАВИЛЬНОСТИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ


// Проверяет, что организация в документе совпадает с организацией, указанной в договоре взаиморасчетов.
//  при несовпадении устанавливается флаг отказа в проведении.
//
// Параметры:
//  Организация           - ссылка на организацию, выбранную в документе,
//  ДоговорКонтрагента - ссылка на договор, выбранный в документе,
//  ДоговорОрганизация    - ссылка на Организацию, выбранную в договоре,
//  Отказ                 - флаг отказа в проведении.
//  Заголовок             - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, 
	                                                             ДоговорОрганизация, Отказ, Заголовок) Экспорт

	// Если не заполнен договор или организация, то не ругаемся.
	Если ЗначениеЗаполнено(Организация) 
	   И ЗначениеЗаполнено(ДоговорКонтрагента)
	   И Организация <> ДоговорОрганизация Тогда

		ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов()

// Для документов, у которых договор контрагента находится в табличной части
// что организация в документе совпадает с организацией, указанной в договоре взаиморасчетов.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - табличная часть документа,
//  ТаблицаЗначений   - таблица значений, содержащая данные табличной части,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ТаблицаЗначений, 
                                                    Отказ, Заголовок) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	// Цикл по строкам таблицы значений.
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

		// Если не заполнен договор или организация, то не ругаемся.
		Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
		   И ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента)
		   И ДокументОбъект.Организация <> СтрокаТаблицы.ДоговорОрганизация Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке 
			                 + " выбран договор контрагента, не соответстветствующий организации, указанной в документе!", Отказ, Заголовок);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти()

// Для документов, у которых договор контрагента и сделка находятся в табличной части
// (например, "Авансовый отчет", "Корректировка долга") проверяет заполнена ли сделка, если
// в договоре взаиморасчетов установлено ведение взаиморасчетов по заказам.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - табличная часть документа,
//  ТаблицаЗначений   - таблица значений, содержащая данные табличной части и признак услуги
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьСделкуВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ТаблицаЗначений, 
                                                    Отказ, Заголовок) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	// Цикл по строкам таблицы значений.
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл

	    СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

	    Если (СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		  ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) 
		   И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда

				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "выбран договор, по которому взаиморасчеты ведутся по заказам. " +
				                   "Необходимо заполнить заказ поставщику!", Отказ, Заголовок);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьСделкуВТабличнойЧасти()

// Проверяет возможность проведения в БУ и НУ в зависимости от договора взаиморасчетов.
//
// Параметры:
//  ДоговорКонтрагента             - ссылка на справочник договора, определяет договор с контрагентом;
//  ВалютаДокумента                - ссылка на справочник валют, определяет валюту документа;
//  ОтражатьВБухгалтерскомУчете    - булево, признак отражения документа в бух. учете;
//  ОтражатьВНалоговомУчете        - булево, признак отражения документа в налоговом учете;
//  ВалютаРегламентированногоУчета - ссылка на справочник валют, определяет валюту ведения регл. учета;
//  ЭтоДокументОплаты              - булево, определяет является ли это документом оплаты,
//                                   необязательный параметр, по умолчанию - Ложь;
//  Отказ                          - булево, признак отказа в проведении ;
//  Заголовок                      - строка, заголовок сообщения в отказе проведения;
//  ДополнениеКСообщению           - строка, дополнение к сообщению в отказе проведении, 
//                                   необязательный, по умолчанию - пустая строка;
//  ВалютаВзаиморасчетов           - ссылка на справочник валют, определяет валюту взаиморасчетов по договору,
//                                   если не передан, берется из договора;
//  РасчетыВУсловныхЕдиницах - булево, признак ведения взаиморасчетов в условных единицах,
//                                   если не передан, берется из договора.
//
// Возвращаемое значение:
//  Истина, если документ можно проводить по бух. или (и) налоговому учету, инчае - Ложь.
//
Функция ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,ОтражатьВБухгалтерскомУчете,
                          ОтражатьВНалоговомУчете, ВалютаРегламентированногоУчета, ЭтоДокументОплаты = Ложь,
                          Отказ = Ложь, Заголовок,ДополнениеКСообщению = "",
                          ВалютаВзаиморасчетов = Неопределено, РасчетыВУсловныхЕдиницах = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
		ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	Если ВалютаВзаиморасчетов = Неопределено Тогда
		ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Внешнеэкономический = ДоговорКонтрагента.Внешнеэкономический;
	
	Если ВалютаВзаиморасчетов <> ВалютаДокумента 
	   И ВалютаРегламентированногоУчета <> ВалютаДокумента Тогда

		// Документ выписан в валюте отличной от валюты регламентированного учета и валюты расчетов. 
		// Возможно только в документах оплаты.
		// Не отражается в б.у.
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ДополнениеКСообщению + " Валюта документа ("+СокрЛП(ВалютаДокумента)
			                 + ") отличается от валюты регламентированного учета (" + СокрЛП(ВалютаРегламентированногоУчета)
			                 + ") и валюты расчетов по договору """ + СокрЛП(ДоговорКонтрагента) 
			                 + """ (" + СокрЛП(ВалютаВзаиморасчетов) + ").
			|Документ не может быть проведен по бухгалтерскому учету.",Отказ,Заголовок);
			Возврат Ложь;
		КонецЕсли;

	ИначеЕсли ВалютаДокумента = ВалютаРегламентированногоУчета Тогда

		Если (Не ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета) 
		   И Внешнеэкономический Тогда

			// Документ выписан в валюте регламентированного учета. 
			// Валюта расчетов иная. Договор не внешнеэкономический. 
			// Не отражается в б.у.
			Если ОтражатьВБухгалтерскомУчете Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ДополнениеКСообщению + " Валюта расчетов по договору """ + СокрЛП(ДоговорКонтрагента) 
				                 + """ (" + СокрЛП(ВалютаВзаиморасчетов) + ") отличается от валюты регламентированного учета ("
				                 + СокрЛП(ВалютаРегламентированногоУчета) + "), договор является внешнеэкономическим.
				|В этом случае документы, отражаемые в регламентированном учете, могут быть выписаны только в валюте расчетов по договору.
				|Документ не может быть проведен по бухгалтерскому учету.",Отказ,Заголовок);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

	Иначе

		// Валюта документа равна валюте взаиморасчетов (отличной от валюты  рег. учета).
		Если НЕ (Внешнеэкономический) Тогда 

			// Для внутренних договоров (не внешнеэкономических) валюта документа должна быть равна валюте рег. учета
			// Не отражается в б.у.
			Если ОтражатьВБухгалтерскомУчете Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ДополнениеКСообщению + " Валюта документа ("+СокрЛП(ВалютаДокумента)
				                 + ") отличается от валюты регламентированного учета (" + СокрЛП(ВалютаРегламентированногоУчета)
				                 + "), договор """ + СокрЛП(ДоговорКонтрагента) +""" не является внешнеэкономическим.
				|В этом случае документы, отражаемые в регламентированном учете, могут быть выписаны только в валюте регламентированного учета.
				|Документ не может быть проведен по бухгалтерскому учету.",Отказ,Заголовок);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;

КонецФункции // ПроверкаВозможностиПроведенияВ_БУ_НУ()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ 


// Вычисляет текущий долг контрагента по заданному договору и сделке в валюте взаиморасчетов 
// по данному договору
//
// Параметры: 
//  Договор - ссылка на элемент справочника, определяет договор контрагента, по которому надо получить долг, 
//  Сделка  - ссылка на документ, определяет сделку (заказ, накладную, платежный документ) по которому надо получить долг.
//  СсылкаДокумент           - ссылка на документ, для которого рассчитывается долг.
//
// Возвращаемое значение:
//  Число -  текущий размер долга, если удалось вычислить текущий долг, иначе - 0.
//
Функция ТекущийДолг(Договор, Сделка = Неопределено, СсылкаДокумент) Экспорт

	ТекущийДолг = 0;
	СтруктураОтбора = Новый Структура(); // для отбора остатков взаиморасчетов
	СтруктураОтбора.Вставить("ДоговорКонтрагента", Договор);
	СтруктураОтбора.Вставить("Контрагент", Договор.Владелец);
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Если Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТекущийДолг = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,
						СтруктураОтбора,"ДоговорКонтрагента","СуммаВзаиморасчетов").Итог("СуммаВзаиморасчетов");
						
		Иначе // Взаиморасчеты ведутся по сделкам
			Если ЗначениеЗаполнено(Сделка) Тогда
				СтруктураОтбора.Вставить("Сделка", Сделка);
				ТекущийДолг = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,
				СтруктураОтбора,"ДоговорКонтрагента,Сделка","СуммаВзаиморасчетов").Итог("СуммаВзаиморасчетов");
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 

	Возврат ТекущийДолг;
	
КонецФункции // ТекущийДолг()

// Функция возвращает список значений видов договоров взаиморасчетов для поставщика.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика()

// Функция возвращает список значений видов договоров взяиморасчетов для покупателя.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя()

// Функция возвращает список значений видов договоров взаиморасчетов когда
// контрагент не является ни поставщиком не покупателем.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее()

// Определяет сделку, по которой надо провести документ
//
// Параметры: 
//  ДокументОбъект          - объект проводимого документа, 
//  ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа.
//  ИмяРеквизитаСделка      - необязательный параметр, имя реквизита "сделка".
//  Расчеты                 - флаг, показывающий, что сделка определяется для записи в регистр расчетов,
// при этом сделка прописывается, даже, если взаиморасчеты ведутся по договору в целом
//  ВозвратнаяТара          - флаг, показывающий, что определяется сделка для формирования движений по 
// возвратной таре регистров "Товары полученные" и "Товары переданные". В этом случае при ведении 
// взаиморасчетов по расчетным документам сделка не прописывается.
//
// Возвращаемое значение:
//  Ссылка на документ или Неопределно, т.е. значение, которое надо записать в измерение Сделка регистра.
//
Функция ОпределитьСделку(ДокументОбъект, ВыборкаПоШапкеДокумента, ИмяРеквизитаСделка = "Сделка", Расчеты = Ложь, ВозвратнаяТара = Ложь) Экспорт

	// Возвращаемое значение.
	Сделка = Неопределено;
	
	Если ВыборкаПоШапкеДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		  ИЛИ ВыборкаПоШапкеДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам 
		  ИЛИ Расчеты Тогда

		Сделка = ДокументОбъект[ИмяРеквизитаСделка];

	КонецЕсли;

	Возврат Сделка;

КонецФункции // ОпределитьСделку()

// Дополняет дерево полей запроса по шапке реквизитами договора, нужными для контроля остатков взаиморасчетов.
//
// Параметры
//  ДеревоПолейЗапросаПоШапке - дерево, дополняемое дерево полей запроса,
//  РежимПроведения           - режим проведения документа.
//
Процедура ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке, РежимПроведения) Экспорт

	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                       , "ВедениеВзаиморасчетов");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                        , "ВалютаВзаиморасчетов");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "КонтролироватьСуммуЗадолженности" , "КонтролироватьСуммуЗадолженности");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ДопустимаяСуммаЗадолженности" , "ДопустимаяСуммаЗадолженности");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ПроцентПредоплаты" , "ПроцентПредоплаты");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "КонтролироватьЧислоДнейЗадолженности" , "КонтролироватьЧислоДнейЗадолженности");
		ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ДопустимоеЧислоДнейЗадолженности" , "ДопустимоеЧислоДнейЗадолженности");
	КонецЕсли;

КонецПроцедуры // ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр()

// Возаращает вид договора с контрагентом по виду операции
//
Функция ОпределитьВидДоговораСКонтрагентом(ВидОперации=Неопределено) Экспорт
	
	СПоставщиком  	= Новый СписокЗначений;
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	СПокупателем  	= Новый СписокЗначений;
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	Прочее  		= Новый СписокЗначений;
	Прочее.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Если ЗначениеЗаполнено(ВидОперации) тогда

		//Определение вида операции

		ВидДоговораПоВидуОпераций = Новый Соответствие();

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю,СПокупателем);
			
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами,Прочее);
        ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю,СПокупателем);

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоБанковскимКредитам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты,Прочее);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю,СПокупателем);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю,СПокупателем);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю,СПокупателем);
		
		ВидДоговора=ВидДоговораПоВидуОпераций[ВидОперации];
		
		Если НЕ ВидДоговора = Неопределено Тогда
			
			Возврат ВидДоговора;
			
		Иначе
			
			Возврат Новый СписокЗначений;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Новый СписокЗначений;
		
	Конецесли;
	
КонецФункции // ОпределитьВидДоговораСКонтрагентом()

Процедура ОбработкаПодбораЗадолженностей(ДокументОбъект,СтрокаПлатеж,ЗначениеВыбора,
										ПлатежиСписком,ВалютаДокумента,КурсДокумента,КратностьДокумента, НДСПоУмолчанию="",ОтражатьВБухгалтерскомУчете=Неопределено) Экспорт									
										
	РасшифровкаПлатежа=ДокументОбъект.РасшифровкаПлатежа;									
	
	Если НЕ ЗначениеВыбора.ЕстьПодбор Тогда									
											
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("ДоговорКонтрагента",ЗначениеВыбора.ДоговорКонтрагента);
												
		Если Не ЗначениеВыбора.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтруктураОтбора.Вставить("Сделка",ЗначениеВыбора.Сделка);
		КонецЕсли;
												
		Если ЗначениеВыбора.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			СтруктураОтбора.Вставить("ДокументРасчетовСКонтрагентом",ЗначениеВыбора.ДокументРасчетовСКонтрагентом);
		КонецЕсли;
												
		МассивСтрок=РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
												
		Если Не МассивСтрок=Неопределено Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				РасшифровкаПлатежа.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
												
		Если РасшифровкаПлатежа.Количество()>0 И НЕ ЗначениеЗаполнено(РасшифровкаПлатежа[0].ДоговорКонтрагента) Тогда
			РасшифровкаПлатежа.Удалить(РасшифровкаПлатежа[0]);
		КонецЕсли;
											
	КонецЕсли;
	
	Если (НЕ (РасшифровкаПлатежа.Количество()=1 И НЕ ПлатежиСписком)) ИЛИ РасшифровкаПлатежа.Количество()=0 Тогда
		СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	СтрокаПлатеж.ДоговорКонтрагента=ЗначениеВыбора.ДоговорКонтрагента;
	СтрокаПлатеж.Сделка=ЗначениеВыбора.Сделка;
	Попытка
		СтрокаПлатеж.ДокументРасчетовСКонтрагентом=ЗначениеВыбора.ДокументРасчетовСКонтрагентом;
	Исключение
	КонецПопытки;
	
	СтрокаПлатеж.СуммаПлатежа=ЗначениеВыбора.СуммаПлатежа;
	СтрокаПлатеж.КурсВзаиморасчетов=ЗначениеВыбора.КурсВзаиморасчетов;
	СтрокаПлатеж.КратностьВзаиморасчетов=ЗначениеВыбора.КратностьВзаиморасчетов;	
	СтрокаПлатеж.СуммаВзаиморасчетов=ЗначениеВыбора.СуммаВзаиморасчетов;
	СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = ЗначениеВыбора.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
	
	Если НЕ ОтражатьВБухгалтерскомУчете=Неопределено Тогда
		
		УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРеглУчета(ДокументОбъект,СтрокаПлатеж,НДСПоУмолчанию,ОтражатьВБухгалтерскомУчете);
		
	КонецЕсли;
	
	Если ЗначениеВыбора.Свойство("ДокументПланирования") Тогда
		
		СтрокаПлатеж.ДокументПланированияПлатежа=ЗначениеВыбора.ДокументПланирования;
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=ЗначениеВыбора.СтатьяДвиженияДенежныхСредств;
		СтрокаПлатеж.Проект=ЗначениеВыбора.Проект;
		СтрокаПлатеж.КурсВзаиморасчетовПлан=ЗначениеВыбора.КурсВзаиморасчетовПлан;
		СтрокаПлатеж.СуммаПлатежаПлан=ЗначениеВыбора.СуммаПлатежаПлан;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПодбораЗадолженностей()

////////////////////////////////////////////////////////////////////////////////
// ПРИ ИЗМЕНЕНИИ


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАЧЕТА АВАНСА, ЗАКРЫТИЯ ЗАДОЛЖЕННОСТИ
//
Процедура УпорядочитьТаблицуПоДокументу(ТаблицаЗначений,КолонкаДокумента, КолонкаДаты = "ДатаДокументаРасчетов") Экспорт

	
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	КэшПоТипам = Новый Соответствие;
	
	Для каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаДокумента]) тогда 
			Продолжить;
		КонецЕсли;
		
		ТипТекущегоДокумента = ТипЗнч(СтрокаТаблицы[КолонкаДокумента]);
		Если Документы.ТипВсеСсылки().СодержитТип(ТипТекущегоДокумента)  тогда
			
			МассивТипа = КэшПоТипам[ТипТекущегоДокумента];
			Если МассивТипа = Неопределено Тогда
				МассивТипа = Новый Массив;
				КэшПоТипам.Вставить(ТипТекущегоДокумента, МассивТипа);
			КонецЕсли;
			
			МассивТипа.Добавить(СтрокаТаблицы[КолонкаДокумента]);
		КонецЕсли;
		
	КонецЦикла;
	
	Если КэшПоТипам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти(КолонкаДаты) = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить(КолонкаДаты, ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	КонецЕсли;
	
	ТаблицаЗначений.Колонки.Добавить("ДокументДляУпорядочивания", Документы.ТипВсеСсылки());
	
	ТаблицаЗначений.Индексы.Добавить(КолонкаДокумента);
	
	Запрос = новый запрос;

	Для Каждого КлючИЗначение ИЗ КэшПоТипам Цикл
		ИмяМетаданных = Метаданные.НайтиПоТипу(КлючИЗначение.Ключ).Имя;

		Запрос.Текст = Запрос.Текст+
		?(Запрос.Текст="","",
		" 
		|Объединить все")+
		"
		|	ВЫБРАТЬ
		|	Док.Ссылка Как Ссылка,
		|	Док.Дата
		|	ИЗ
		|		Документ."+ИмяМетаданных+" КАК Док
		|	Где Док.ссылка в  (&ДокументыТипа_"+ИмяМетаданных+")";
		Запрос.УстановитьПараметр("ДокументыТипа_"+ИмяМетаданных, КлючИЗначение.Значение);
		
		
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДокумента = ТаблицаЗначений.Найти(Выборка.Ссылка, КолонкаДокумента);
		СтрокаДокумента.ДокументДляУпорядочивания = Выборка.Ссылка;
		СтрокаДокумента[КолонкаДаты] = Выборка.Дата;
	КонецЦикла;
	
	СписокКолонок = КолонкаДаты + ", ДокументДляУпорядочивания";
	
	ТаблицаЗначений.Сортировать(СписокКолонок);
	
	ТаблицаЗначений.Колонки.Удалить(ТаблицаЗначений.Колонки["ДокументДляУпорядочивания"]);
	ТаблицаЗначений.Колонки.Удалить(ТаблицаЗначений.Колонки[КолонкаДаты]);

КонецПроцедуры

Функция ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(ВидДокумента,ВидОперации = неопределено, СтруктураШапкиДокумента = Неопределено)Экспорт

	ВидДействийДокумента = Новый Структура("Направление, РасчетыВозврат");
	ВидыДокументов       = Новый Соответствие();

	ВидДвиженияПоступление = Перечисления.НаправленияДвижений.Поступление;
	ВидДвиженияВыбытие     = Перечисления.НаправленияДвижений.Выбытие;
	
	
	ВидыДокументов.Вставить("ПоступлениеТоваровУслуг",     ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ПоступлениеТоваровУслугВНТТ", ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ПоступлениеДопРасходов",      ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ПоступлениеНМА",              ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ВозвратТоваровОтПокупателя",  ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ПоступлениеИзПереработки", ВидДвиженияПоступление);
	ВидыДокументов.Вставить("ГТДИмпорт"					 , ВидДвиженияПоступление);
	ВидыДокументов.Вставить("АвансовыйОтчет"			 , ВидДвиженияПоступление);

	ВидыДокументов.Вставить("РеализацияУслугПоПереработке",      ВидДвиженияВыбытие);
	ВидыДокументов.Вставить("АктОбОказанииПроизводственныхУслуг",ВидДвиженияВыбытие);
	ВидыДокументов.Вставить("ПередачаНМА",                       ВидДвиженияВыбытие);
	ВидыДокументов.Вставить("ПередачаОС",                        ВидДвиженияВыбытие);
	ВидыДокументов.Вставить("ВозвратТоваровПоставщику",          ВидДвиженияВыбытие);
	ВидыДокументов.Вставить("ВозвратТоваровПоставщикуИзНТТ", ВидДвиженияВыбытие);

	
	Если ВидДокумента = "ОтчетКомитентуОПродажах" тогда 
		Если ВидОперации= "ПоТоварам" тогда
			ВидыДокументов.Вставить("ОтчетКомитентуОПродажах", ВидДвиженияПоступление);
		Иначе
			ВидыДокументов.Вставить("ОтчетКомитентуОПродажах", ВидДвиженияВыбытие);
		КонецЕсли;
	КонецЕсли;

	Если ВидДокумента = "ОтчетКомиссионераОПродажах" тогда 
		Если ВидОперации= "ПоУслугам" тогда
			ВидыДокументов.Вставить("ОтчетКомиссионераОПродажах", ВидДвиженияПоступление);
		Иначе
			ВидыДокументов.Вставить("ОтчетКомиссионераОПродажах", ВидДвиженияВыбытие);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидДокумента = "КорректировкаДолгаПоВозвратнойТаре" тогда 
		ПереносЗадолженности = СтруктураШапкиДокумента.ПереносЗадолженности;
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкаДолгаПоВозвратнойТаре.УПокупателя Тогда
			Если ПереносЗадолженности Тогда
				ВидыДокументов.Вставить("КорректировкаДолгаПоВозвратнойТаре", ВидДвиженияПоступление);
			Иначе	
				ВидыДокументов.Вставить("КорректировкаДолгаПоВозвратнойТаре", ВидДвиженияВыбытие);
			КонецЕсли;
		Иначе
			Если НЕ ПереносЗадолженности Тогда
				ВидыДокументов.Вставить("КорректировкаДолгаПоВозвратнойТаре", ВидДвиженияПоступление);
			Иначе	
				ВидыДокументов.Вставить("КорректировкаДолгаПоВозвратнойТаре", ВидДвиженияВыбытие);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидДокумента = "РеализацияТоваровУслуг" тогда 
		Если ВидОперации= "КомиссионнаяВыручка" тогда
			ВидыДокументов.Вставить("РеализацияТоваровУслуг",     ВидДвиженияПоступление);
		Иначе
			ВидыДокументов.Вставить("РеализацияТоваровУслуг",     ВидДвиженияВыбытие);
		КонецЕсли;
	КонецЕсли;

	ВидДействийДокумента.Вставить("Направление",ВидыДокументов[ВидДокумента]);

	ВидОперацииРасчет  = Перечисления.РасчетыВозврат.Расчеты;
	ВидОперацииВозврат = Перечисления.РасчетыВозврат.Возврат;

	Если ЗначениеЗаполнено(ВидОперации) тогда

		//Определение вида операции

		РасчетВозвратПоВидуОпераций = Новый Соответствие();

		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия,      ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование,         ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства, ВидОперацииРасчет);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия,			ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРеализацияТоваров.Оборудование,				ВидОперацииРасчет);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия,	ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Оборудование,		ВидОперацииВозврат);

		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровПоставщику.ПокупкаКомиссия,		ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровПоставщику.Оборудование,		ВидОперацииВозврат);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровПоставщику.ПокупкаКомиссия,		ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийВозвратТоваровПоставщику.Оборудование,		ВидОперацииВозврат);
		
		ВидДействийДокумента.Вставить("РасчетыВозврат", РасчетВозвратПоВидуОпераций[ВидОперации]);

	Иначе

		Если    (ВидДокумента = "РеализацияУслугПоПереработке")
			или (ВидДокумента = "АктОбОказанииПроизводственныхУслуг")
			или (ВидДокумента = "РеализацияТоваровУслуг")
			или (ВидДокумента = "ПоступлениеИзПереработки")
			или (ВидДокумента = "ОтчетКомиссионераОПродажах")
			или (ВидДокумента = "ОтчетКомитентуОПродажах")
			или (ВидДокумента = "ПоступлениеНМА")
			или (ВидДокумента = "ПередачаНМА")
			или (ВидДокумента = "ПередачаОС") 
			или (ВидДокумента = "ПоступлениеДопРасходов") 
			или (ВидДокумента = "КорректировкаДолгаПоВозвратнойТаре") 
			тогда
			
			ВидДействийДокумента.Вставить("РасчетыВозврат",ВидОперацииРасчет);
			
		ИначеЕсли ВидДокумента = "ВозвратТоваровПоставщикуИзНТТ" Тогда
			
			ВидДействийДокумента.Вставить("РасчетыВозврат",ВидОперацииВозврат);
			
		КонецЕсли;

	КонецЕсли;

	Возврат ВидДействийДокумента;

КонецФункции

// Функция возвращает ссылку на сам документ, кроме случая, когда Сделка  является
// Счетом или заказом. В этом случае возвращается Сделка.
// 
// Параметры:
//  ВыборкаПоШапкеДокумента - Структра, должна содеражть значение ВедениеВзаиморасчетов договора контрагета. 
//  Ссылка - ДокументСсылка. Ссылка на документ взаиморасчетов.
//  Сделка - ДокументСсылка. Сделка, указанная в реквизите Сделка или документ расчетов с контрагентами (если стоит галочка ВестиПоРасчетныемДокументамБУ)
//
// Возвращаемое значение:
//  ДокументСсылка - документ взаиморасчетов.
// 
Функция ОпределитьДокументРасчетовСКонтрагентом(ВыборкаПоШапкеДокумента, Ссылка, Сделка = Неопределено) Экспорт

	Если ВыборкаПоШапкеДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
     ИЛИ ВыборкаПоШапкеДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда

		Возврат Сделка;

	Иначе// по расчетным документам
		
		Возврат Ссылка;
			
	КонецЕсли;
   
КонецФункции // ОпределитьДокументРасчетовСКонтрагентом()

// Выполняет зачет аванса по указанному документу
//
// Параметры
// ДокументОбъект    - ДокументОбъект или ДокументСсылка - Документ для которого выполяентся операция.
Функция ЗачетАванса(ДокументОбъект, СтруктураШапкиДокумента, ВалютаРегламентированногоУчета, ТаблицыДокумента, Отказ,Заголовок,НомерЖурнала="",УменьшитьСуммуРегл=0,УменьшитьСуммуВал=0, СчетРасчетов = Неопределено, СчетАвансов = Неопределено, Сделка = Неопределено, ОграничениеСуммыВВалютеРасчетов = Неопределено) Экспорт

	Перем ВидОперации,УчитыватьДвиженияДокумента, ЗнакОстатков;

	СтруктураШапкиДокумента.Свойство("ВидОперации", ВидОперации);
	
	// сделку можно указывать принудительно при вызове процедуры
	СделкаУказанаПриВызовеПроцедуры = НЕ (Сделка = Неопределено);		
	Если НЕ СделкаУказанаПриВызовеПроцедуры Тогда
		СтруктураШапкиДокумента.Свойство("Сделка", Сделка);
	КонецЕсли;
	
	НаправлениеДвижения = ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(ДокументОбъект.Метаданные().Имя,ВидОперации, СтруктураШапкиДокумента).Направление;
	ЭтоВозврат          = (ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(ДокументОбъект.Метаданные().Имя,ВидОперации, СтруктураШапкиДокумента).РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат);

	Организация         = СтруктураШапкиДокумента.Организация;
	ДатаДока            = СтруктураШапкиДокумента.Дата;
	МоментДокумента     = Новый МоментВремени(ДокументОбъект.Дата,ДокументОбъект.Ссылка);
	
//	КурсДокумента       = СтруктураШапкиДокумента.КурсДокумента;
//	КратностьДокумента  = СтруктураШапкиДокумента.КратностьДокумента;
	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаДокумента,СтруктураШапкиДокумента.Дата);
	КурсДокумента       = СтруктураКурсаДокумента.Курс;
	КратностьДокумента  = СтруктураКурсаДокумента.Кратность;
	
	Контрагент          = СтруктураШапкиДокумента.Контрагент;
	ДоговорКонтрагента  = СтруктураШапкиДокумента.ДоговорКонтрагента;
	Если     ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
		И НЕ ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		Сделка = Неопределено;
	КонецЕсли;
	
	Если СчетРасчетов = Неопределено Тогда
		СчетРасчетов        = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;	
	КонецЕсли; 
	Если СчетАвансов = Неопределено Тогда
		
		СчетАвансов         = СтруктураШапкиДокумента.СчетУчетаРасчетовПоАвансам;	
	КонецЕсли; 
	
	ВалютаДокумента     = СтруктураШапкиДокумента.ВалютаДокумента;
	РасчетыВВалюте      = НЕ (ВалютаДокумента = ВалютаРегламентированногоУчета);

	СуммаДокументаСНДСРегл            = 0;
	СуммаДокументаСНДСВВалютеРасчетов = 0;

	//Формирование таблицы для возврата сумм зачтенных авансов (по документам)
	ЗачетаАвансаРегл = Новый ТаблицаЗначений();
	ЗачетаАвансаРегл.Колонки.Добавить("ДокументОплаты", Документы.ТипВсеСсылки());
	ЗачетаАвансаРегл.Колонки.Добавить("Сделка",         Документы.ТипВсеСсылки());
	ЗачетаАвансаРегл.Колонки.Добавить("Сумма",          ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ЗачетаАвансаРегл.Колонки.Добавить("СуммаВал",       ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ЗачетаАвансаРегл.Колонки.Добавить("Контрагент", новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ЗачетаАвансаРегл.Колонки.Добавить("ДоговорКонтрагента",новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ЗачетаАвансаРегл.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Если  СчетАвансов = СчетРасчетов
		И ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами, "ВидСубконто") = Неопределено Тогда
		// нет расчетных документов - не нужно закрывать авансы
		Возврат ЗачетаАвансаРегл;
	КонецЕсли;
	
	Если   ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл
		И НЕ ЗначениеЗаполнено(Сделка)
		И НЕ ЭтоВозврат тогда
 		//Документ не требует обработки
		Возврат ЗачетаАвансаРегл; // Возвращена пустая таблица
	КонецЕсли;
	
	Если не ОбщегоНазначения.ПроводитьДокументПоРазделуУчета(СтруктураШапкиДокумента.Организация, Перечисления.РазделыУчета.РасчетыСКонтрагентами, СтруктураШапкиДокумента.Дата) Тогда
		//Оперативное определение состояния расчетов не требуется.
		Возврат ЗачетаАвансаРегл;
	КонецЕсли; 
		
	Для каждого ТекущаяТаблица из ТаблицыДокумента Цикл

		Если ТекущаяТаблица.Значение.Колонки.Найти("ПроводкиСуммаСНДСРегл") = Неопределено тогда

			Если ЭтоВозврат Тогда 
				ОбщегоНазначения.ОшибкаПриПроведении("Ошибка при выделении аванса.",Отказ,Заголовок);
			Иначе
				ОбщегоНазначения.ОшибкаПриПроведении("Ошибка при зачете аванса.",Отказ,Заголовок);
			КонецЕсли;	
			
			Возврат Неопределено;
        КонецЕсли;

		Если     СделкаУказанаПриВызовеПроцедуры
			И НЕ СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// это может быть только взаиморасчеты по Заказам
			// сумму зачета аванса определим только по указанной сделке
			Для каждого СтрокаТаблицы Из ТекущаяТаблица.Значение Цикл
				
				Если СтрокаТаблицы.СделкаБУ <> Сделка Тогда
					Продолжить;	
				КонецЕсли;
				
				СуммаДокументаСНДСРегл = СуммаДокументаСНДСРегл + СтрокаТаблицы.ПроводкиСуммаСНДСРегл;

				Если РасчетыВВалюте тогда
					СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов + СтрокаТаблицы.ПроводкиСуммаСНДСВал;
				КонецЕсли;
				
			
			КонецЦикла;
			
		Иначе
			
			СуммаДокументаСНДСРегл = СуммаДокументаСНДСРегл + ТекущаяТаблица.Значение.Итог("ПроводкиСуммаСНДСРегл");

			Если РасчетыВВалюте тогда
				СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов + ТекущаяТаблица.Значение.Итог("ПроводкиСуммаСНДСВал");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов - УменьшитьСуммуВал; 
	СуммаДокументаСНДСРегл 			  = СуммаДокументаСНДСРегл  		  - УменьшитьСуммуРегл;
    
	Если СуммаДокументаСНДСВВалютеРасчетов = 0 тогда
		СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСРегл;
	КонецЕсли;
	
	// Выполним ограничение зачета аванса
	Если НЕ ОграничениеСуммыВВалютеРасчетов = Неопределено Тогда
		СуммаДокументаСНДСВВалютеРасчетов = Мин(ОграничениеСуммыВВалютеРасчетов,СуммаДокументаСНДСВВалютеРасчетов);
	КонецЕсли;
	
	Если СуммаДокументаСНДСВВалютеРасчетов = 0 тогда 
		//Документ не требует обработки
		Возврат ЗачетаАвансаРегл; // Возвращена пустая таблица
	КонецЕсли;

	Если ЭтоВозврат тогда
		Если НаправлениеДвижения=Перечисления.НаправленияДвижений.Поступление тогда
			СодержаниеОперации = "Выделение аванса (оплаченная часть при возвр.)";
		Иначе
			СодержаниеОперации = "Возврат поставщику. Неоплаченная часть.";
		КонецЕслИ;
	Иначе
		Если НаправлениеДвижения=Перечисления.НаправленияДвижений.Поступление тогда
			СодержаниеОперации = "Зачет аванса поставщику";
		Иначе
			СодержаниеОперации = "Зачет аванса покупателя";
		КонецЕслИ;
	КонецЕслИ;
	
	СуфиксСчетаРасчетов = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление, "Дт", "Кт");
	СуфиксСчетаАвансов  = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление, "Кт", "Дт");

	//Если счет оплаты совпадает со счетом аванса или счет аванса не заполнен и расчеты не в у.е. - возвращаемся без зачета аванса
	Если (НЕ ЗначениеЗаполнено(СчетАвансов)) тогда
		//Проводка по бух. учету по зачету аванса не формируется
		Возврат ЗачетаАвансаРегл; // Возвращена пустая таблица
	КонецЕсли;

	Если РасчетыВВалюте Тогда
		УсловиеВалюта = ВалютаДокумента;
	Иначе
		УсловиеВалюта = Справочники.Валюты.ПустаяСсылка();

	КонецЕсли;

	ЗнакФильтрПоОстаткам = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление , 1, -1);
	
	СтруктураШапкиДокумента.Свойство("УчитыватьДвиженияДокумента",УчитыватьДвиженияДокумента);
	Если УчитыватьДвиженияДокумента = Истина Тогда
		// нужно бует расчитывать остатки включая документ;
		Период = Новый Граница(МоментДокумента,ВидГраницы.Включая);
	Иначе
		Период = МоментДокумента;
	КонецЕсли;
	
	ТаблицаАвансов       = ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,Период,?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление и ЭтоВозврат,СчетРасчетов,СчетАвансов),УсловиеВалюта ,Контрагент, ДоговорКонтрагента,Сделка,ЗнакФильтрПоОстаткам);
	
	НомерСубконтоРасчетныеДокументы = 0;
	Если НЕ СчетАвансов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто") = Неопределено тогда
		НомерСубконтоРасчетныеДокументы = СчетАвансов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто").НомерСтроки;
	КонецЕсли;
	Если НЕ НомерСубконтоРасчетныеДокументы = 0 тогда
		УпорядочитьТаблицуПоДокументу(ТаблицаАвансов,"Субконто"+НомерСубконтоРасчетныеДокументы);
	КонецЕсли;

	КорректировкиПриРасчетахВВалюте  = 0;

	Если ТаблицаАвансов.Количество()=0 тогда
		Возврат ЗачетаАвансаРегл; // Возвращена пустая таблица
	КонецЕсли;
	
	ПроводкиБУ = ДокументОбъект.Движения.Хозрасчетный;
	
	Для каждого СтрокаАванса из ТаблицаАвансов Цикл

		//Расчет суммы перекрытия задолженности на счете, определение суммовых разниц
		ТекущийАванс = Макс(0, Мин(СуммаДокументаСНДСВВалютеРасчетов,СтрокаАванса[?(РасчетыВВалюте,"ВалютнаяСуммаОстаток","СуммаОстаток")]));
		
		Если ТекущийАванс = 0 тогда 
			Продолжить;
		КонецЕсли;

		Если РасчетыВВалюте Тогда
			
			
			// считаем аванс по историческому курсу
            ИсторическийАвансРегл = (ТекущийАванс / СтрокаАванса.ВалютнаяСуммаОстаток) * СтрокаАванса.СуммаОстаток;
			ТекущийАвансРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекущийАванс, ВалютаДокумента, ВалютаРегламентированногоУчета,
				                                        КурсДокумента, 1, КратностьДокумента, 1);
														
			// на какую сумму нужно откорректировать стоимость запасов 
            КорректировкиПриРасчетахВВалюте = КорректировкиПриРасчетахВВалюте + (ИсторическийАвансРегл - ТекущийАвансРегл);
			
			ТекущийАвансРегл = ИсторическийАвансРегл;
			
		Иначе

			ТекущийАвансРегл = ТекущийАванс;

		КонецЕсли;
		
		СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов - ТекущийАванс;

		СтрокаЗачетаАванса = ЗачетаАвансаРегл.Добавить();
		СтрокаЗачетаАванса.Сумма  = ТекущийАвансРегл;
		СтрокаЗачетаАванса.Сделка = СтруктураШапкиДокумента.Ссылка;
        СтрокаЗачетаАванса.СуммаВал = ТекущийАванс;
		
		СтрокаЗачетаАванса.Контрагент = Контрагент;
        СтрокаЗачетаАванса.ДоговорКонтрагента = ДоговорКонтрагента;
		Если СтруктураШапкиДокумента.Свойство("ВалютаВзаиморасчетов") Тогда
			СтрокаЗачетаАванса.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
		Иначе
	        СтрокаЗачетаАванса.ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли; 
		
		Если не НомерСубконтоРасчетныеДокументы = 0 тогда
			СтрокаЗачетаАванса.ДокументОплаты = СтрокаАванса["Субконто"+НомерСубконтоРасчетныеДокументы];
		КонецЕсли;

		//Формирование проводки для стандартного режима зачета аванса
		Если Истина тогда
		//Если Не (ЭтоВозврат и НаправлениеДвижения=Перечисления.НаправленияДвижений.Поступление) тогда
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период       = ДатаДока;
			Проводка.Организация  = Организация;
			Проводка.НомерЖурнала = НомерЖурнала;
			Проводка.Содержание   = СодержаниеОперации;

			Проводка["Счет" + СуфиксСчетаРасчетов]= СчетРасчетов;
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "Контрагенты",        Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "Договоры",           ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "ДокументыРасчетовСКонтрагентами", ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Ссылка, Сделка));

			Проводка["Счет" + СуфиксСчетаАвансов]= СчетАвансов;
			Для НомерСубконто = 1 по 3 Цикл
				ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаАвансов], Проводка["Субконто" + СуфиксСчетаАвансов], НомерСубконто,СтрокаАванса["Субконто" + НомерСубконто]);
			КонецЦикла;

			Проводка.Сумма = ТекущийАвансРегл;

			Если СчетРасчетов.Валютный тогда
				Проводка["Валюта" + СуфиксСчетаРасчетов]        = ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Проводка["ВалютнаяСумма" + СуфиксСчетаРасчетов] = ТекущийАванс;
			Конецесли;

			Если СчетАвансов.Валютный тогда
				Проводка["Валюта" + СуфиксСчетаАвансов]        = ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Проводка["ВалютнаяСумма" + СуфиксСчетаАвансов] = ТекущийАванс;
			Конецесли;

		КонецЕсли;

	КонецЦикла;

	Если РасчетыВВалюте и КорректировкиПриРасчетахВВалюте <> 0 тогда
		
		// для случая, когда Заказы-сделки могут указываться в табличной части документов
		СделкаДляРаспределения = ?(СделкаУказанаПриВызовеПроцедуры 
								   И НЕ СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл,
								   Сделка, Неопределено);	
		
		РаспределитьКорректировкуПриРасчетахВВалюте(КорректировкиПриРасчетахВВалюте,ТаблицыДокумента,Отказ,Заголовок, Истина, СделкаДляРаспределения);

	КонецЕсли;

	Возврат ЗачетаАвансаРегл;

КонецФункции

Процедура РаспределитьКорректировкуПриРасчетахВВалюте(СуммаКорректировки,ТаблицыДокумента,Отказ,Заголовок,УвеличитьСуммуКорректировкиНаСуммуСНДС, Сделка = Неопределено)

	Если СуммаКорректировки = 0 тогда
		Возврат;
	КонецЕсли;

	СделкаУказанаПриВызовеПроцедуры	 = НЕ (Сделка = Неопределено);
	
	//Определим суммы по каждой из переданных таблиц значений
	СуммыПоТаблицамДокумента = Новый ТаблицаЗначений();
	СуммыПоТаблицамДокумента.Колонки.Добавить("ИмяТаблицы");
	СуммыПоТаблицамДокумента.Колонки.Добавить("СуммаСНДС",     ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	СуммыПоТаблицамДокумента.Колонки.Добавить("СуммаБезНДС",   ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	СуммыПоТаблицамДокумента.Колонки.Добавить("НДС",           ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	СуммыПоТаблицамДокумента.Колонки.Добавить("Корректировка", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	Для каждого ТекущаяТаблица Из ТаблицыДокумента Цикл

		СтрокаТаблицы = СуммыПоТаблицамДокумента.Добавить();

		СтрокаТаблицы.ИмяТаблицы = ТекущаяТаблица.Ключ;
		
		Если СделкаУказанаПриВызовеПроцедуры Тогда
			Для каждого СтрокаТекущейТаблицы Из ТекущаяТаблица.Значение Цикл
				Если СтрокаТекущейТаблицы.СделкаБУ = Сделка Тогда
				   СтрокаТаблицы.СуммаСНДС  = СтрокаТаблицы.СуммаСНДС  + СтрокаТекущейТаблицы.ПроводкиСуммаСНДСРегл;
				КонецЕсли;
			КонецЦикла;
		Иначе	
		    СтрокаТаблицы.СуммаСНДС  = ТекущаяТаблица.Значение.Итог("ПроводкиСуммаСНДСРегл");
		КонецЕсли;
		
		
		Если НЕ ТекущаяТаблица.Значение.Колонки.Найти("ПроводкиСуммаНДСРегл") = Неопределено тогда

	        Если СделкаУказанаПриВызовеПроцедуры Тогда
				Для каждого СтрокаТекущейТаблицы Из ТекущаяТаблица.Значение Цикл
					Если СтрокаТекущейТаблицы.СделкаБУ = Сделка Тогда
					   СтрокаТаблицы.СуммаБезНДС  = СтрокаТаблицы.СуммаБезНДС  + СтрокаТекущейТаблицы.ПроводкиСуммаБезНДСРегл;
					   СтрокаТаблицы.НДС  		  = СтрокаТаблицы.НДС		   + СтрокаТекущейТаблицы.ПроводкиСуммаНДСРегл;
					КонецЕсли;
				КонецЦикла;
			Иначе	
				СтрокаТаблицы.СуммаБезНДС = ТекущаяТаблица.Значение.Итог("ПроводкиСуммаБезНДСРегл");
				СтрокаТаблицы.НДС         = ТекущаяТаблица.Значение.Итог("ПроводкиСуммаНДСРегл");
			КонецЕсли;

		Иначе
			
			Если СделкаУказанаПриВызовеПроцедуры Тогда
				Для каждого СтрокаТекущейТаблицы Из ТекущаяТаблица.Значение Цикл
					Если СтрокаТекущейТаблицы.СделкаБУ = Сделка Тогда
					   СтрокаТаблицы.СуммаБезНДС  = СтрокаТаблицы.СуммаБезНДС  + СтрокаТекущейТаблицы.ПроводкиСуммаБезНДСРегл;
					КонецЕсли;
				КонецЦикла;
			Иначе	
				СтрокаТаблицы.СуммаБезНДС = ТекущаяТаблица.Значение.Итог("ПроводкиСуммаБезНДСРегл");
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

	//Распределим корректировку по таблицам значений
	СуммаСНДСКРаспределению = СуммаКорректировки+?(УвеличитьСуммуКорректировкиНаСуммуСНДС,СуммыПоТаблицамДокумента.Итог("СуммаСНДС"),0);

	Если СуммаСНДСКРаспределению = 0 тогда
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка в распределении корректировок при зачете аванса по расчетам в валюте.", Отказ, Заголовок);
		Возврат;
	КонецЕсли;

	НДСКРаспределению    = 0;
	БезНДСКРаспределению = 0;

	Если Не СуммыПоТаблицамДокумента.Итог("НДС") = 0 тогда
		НДСКРаспределению = Окр(СуммаСНДСКРаспределению * СуммыПоТаблицамДокумента.Итог("НДС") / СуммыПоТаблицамДокумента.Итог("СуммаСНДС"), 2);
	КонецЕсли;

	БезНДСКРаспределению = СуммаСНДСКРаспределению - НДСКРаспределению;

	Если НЕ БезНДСКРаспределению = 0 тогда
		НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(БезНДСКРаспределению,СуммыПоТаблицамДокумента.ВыгрузитьКолонку("СуммаБезНДС"));
		СуммыПоТаблицамДокумента.ЗагрузитьКолонку(НовыеСуммы,"СуммаБезНДС");
	КонецЕсли;

	Если НЕ НДСКРаспределению = 0 тогда
		НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(НДСКРаспределению,СуммыПоТаблицамДокумента.ВыгрузитьКолонку("НДС"));
		СуммыПоТаблицамДокумента.ЗагрузитьКолонку(НовыеСуммы,"НДС");
	КонецЕсли;

	Для каждого СтрокаТаблицы Из СуммыПоТаблицамДокумента Цикл
		СтрокаТаблицы.СуммаСНДС = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
	КонецЦикла;

	//Распределим корректировку в пределах каждой таблицы значений
	Для каждого СтрокаКРаспределению из СуммыПоТаблицамДокумента Цикл

		ТаблицаЗначений     = ТаблицыДокумента[СтрокаКРаспределению.ИмяТаблицы];
		СуммаКРаспределению = СтрокаКРаспределению.СуммаСНДС;

		Если СуммаКРаспределению = 0 тогда
			продолжить;
		КонецЕсли;

		Если не СтрокаКРаспределению.СуммаБезНДС = 0 тогда
			
			Если СделкаУказанаПриВызовеПроцедуры Тогда
				
				ТекущаяТаблица = ТаблицаЗначений.Скопировать(,"ПроводкиСуммаБезНДСРегл,СделкаБУ");
				Для каждого СтрокаТекущейТаблицы Из ТекущаяТаблица Цикл
					Если НЕ СтрокаТекущейТаблицы.СделкаБУ = Сделка Тогда
					   СтрокаТекущейТаблицы.ПроводкиСуммаБезНДСРегл  = 0;
					КонецЕсли;
				КонецЦикла;
				СтарыеСуммы = ТекущаяТаблица.ВыгрузитьКолонку("ПроводкиСуммаБезНДСРегл");
				НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(СтрокаКРаспределению.СуммаБезНДС, СтарыеСуммы);
				Инд = 0;
				Пока Инд < НовыеСуммы.ВГраница()+ 1 Цикл
					ЭлементМассива = НовыеСуммы[Инд];
					СтрокаТаблицы  = ТаблицаЗначений[Инд];
					
					Если СтрокаТаблицы.СделкаБУ = Сделка Тогда
					    СтрокаТаблицы.ПроводкиСуммаБезНДСРегл = ЭлементМассива;
					КонецЕсли;
					Инд = Инд + 1;
					
				КонецЦикла;
				
			Иначе	
			    СтарыеСуммы = ТаблицаЗначений.ВыгрузитьКолонку("ПроводкиСуммаБезНДСРегл");
				НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(СтрокаКРаспределению.СуммаБезНДС, СтарыеСуммы);
				
				ТаблицаЗначений.ЗагрузитьКолонку(НовыеСуммы,"ПроводкиСуммаБезНДСРегл");
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СтрокаКРаспределению.НДС = 0 тогда
			
			Если СделкаУказанаПриВызовеПроцедуры Тогда
				
				ТекущаяТаблица = ТаблицаЗначений.Скопировать(,"ПроводкиСуммаНДСРегл,СделкаБУ");
				Для каждого СтрокаТекущейТаблицы Из ТекущаяТаблица Цикл
					Если НЕ СтрокаТекущейТаблицы.СделкаБУ = Сделка Тогда
					   СтрокаТекущейТаблицы.ПроводкиСуммаНДСРегл  = 0;
					КонецЕсли;
				КонецЦикла;
				
				СтарыеСуммы = ТекущаяТаблица.ВыгрузитьКолонку("ПроводкиСуммаНДСРегл");
				НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(СтрокаКРаспределению.НДС,СтарыеСуммы);
				
				Инд = 0;
				Пока Инд < НовыеСуммы.ВГраница() + 1 Цикл
					ЭлементМассива = НовыеСуммы[Инд];
					СтрокаТаблицы  = ТаблицаЗначений[Инд];
					Если СтрокаТаблицы.СделкаБУ = Сделка Тогда
					    СтрокаТаблицы.ПроводкиСуммаНДСРегл = ЭлементМассива;
					КонецЕсли;
					Инд = Инд + 1;
				КонецЦикла;
				
			Иначе	
				
				СтарыеСуммы = ТаблицаЗначений.ВыгрузитьКолонку("ПроводкиСуммаНДСРегл");
				НовыеСуммы = ОбщегоНазначения.РаспределитьПропорционально(СтрокаКРаспределению.НДС,СтарыеСуммы);
				ТаблицаЗначений.ЗагрузитьКолонку(НовыеСуммы,"ПроводкиСуммаНДСРегл");
				
			КонецЕсли;
			
		КонецЕсли;

		Для каждого СтрокаТаблицы  Из ТаблицаЗначений Цикл
			СтрокаТаблицы.ПроводкиСуммаСНДСРегл = СтрокаТаблицы.ПроводкиСуммаБезНДСРегл + СтрокаТаблицы.ПроводкиСуммаНДСРегл;
		КонецЦикла; 

	КонецЦикла;

Конецпроцедуры

//Дополнить записи регистра бухгалтерии или регистра накопления записями таблицы
Функция ДополнитьНабораЗаписейРегистраЗаписямиТаблицы(НаборЗаписей,ТаблицаДополнений)Экспорт

	ОтрабатыватьСубконто =  Метаданные.РегистрыБухгалтерии.Содержит(НаборЗаписей.Метаданные());
	Если Метаданные.РегистрыБухгалтерии.Содержит(НаборЗаписей.Метаданные()) тогда
		//Это регистр бухгалтерии
		ТаблицаНабораЗаписей = РегистрыБухгалтерии[НаборЗаписей.Метаданные().Имя].СоздатьНаборЗаписей().Выгрузить();
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(НаборЗаписей.Метаданные()) тогда
		ТаблицаНабораЗаписей = РегистрыНакопления[НаборЗаписей.Метаданные().Имя].СоздатьНаборЗаписей().Выгрузить();
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(НаборЗаписей.Метаданные()) тогда
		ТаблицаНабораЗаписей = РегистрыСведений[НаборЗаписей.Метаданные().Имя].СоздатьНаборЗаписей().Выгрузить();
	Иначе
		ТаблицаНабораЗаписей = Неопределено;
	КонецЕсли;

	Для каждого Строка из ТаблицаДополнений Цикл

		НоваяЗапись = НаборЗаписей.Добавить();

		Для каждого Колонка из ТаблицаДополнений.Колонки Цикл

			Если Колонка.Имя = "МоментВремени" или Колонка.Имя = "НомерСтроки" тогда
				Продолжить;
			КонецЕсли;

			Если ОтрабатыватьСубконто и Найти(Колонка.Имя,"Субконто")>0 тогда

				Если Найти(Колонка.Имя,"ВидСубконто") > 0 тогда
					//ВидСубконто - вспомогательная колонка. Обрабатывается вместе с Субконто
					Продолжить;
				Иначе

					НомерСубконто = Прав(Колонка.Имя,1);

					Если Найти(Колонка.Имя, "Дт") + Найти(Колонка.Имя, "Кт")>0 тогда
						СторонаСчета = Лев(Прав(Колонка.Имя,3),2);
					Иначе
						СторонаСчета = "";
					КонецЕсли;

					ЕстьКолонкаСВидомСубконто = Не(ТаблицаДополнений.Колонки.Найти("Вид"+Колонка.Имя) = Неопределено);

					Если ЕстьКолонкаСВидомСубконто тогда
						ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(Строка["Счет" + СторонаСчета], НоваяЗапись["Субконто"+СторонаСчета], Строка["Вид"+Колонка.Имя], Строка[Колонка.Имя]);

					Иначе
						ОбщегоНазначения.УстановитьСубконто(Строка["Счет" + СторонаСчета], НоваяЗапись["Субконто"+СторонаСчета], Число(НомерСубконто), Строка[Колонка.Имя]);

					КонецЕсли;

				КонецЕсли;

			Иначе

				Если ТаблицаНабораЗаписей = Неопределено тогда
					Попытка
						НоваяЗапись[Колонка.Имя] =  Строка[Колонка.Имя];
					Исключение
						//Не смогли заполнить реквизит... Видно его нет.
					КонецПопытки;
				Иначе
					Если ТаблицаНабораЗаписей.Колонки.Найти(Колонка.Имя) = Неопределено тогда
						//Нет такой колонки!
					Иначе
						НоваяЗапись[Колонка.Имя] =  Строка[Колонка.Имя];
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат НаборЗаписей;

КонецФункции

Функция ФИФОПоРасчетам(ТаблицаИтогов, ТаблицаКРаспределению,ТаблицаОстатков,СтруктураШапкиДокумента,КолонкаСчетаФильтра, ТаблицаСуммовыхРазниц=Неопределено, НаправлениеДвижения, Заголовок, РазрешитьСторнирующиеПроводки = Истина) Экспорт

	//Разделение каждой строки на оплату задолженности и аванс
	Для каждого ТекущийПлатеж из ТаблицаКРаспределению Цикл

		СчетФильтра  = ТекущийПлатеж[КолонкаСчетаФильтра];

		НомерСубконтоРасчетныеДокументы = 0;
		Если не СчетФильтра.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто")=Неопределено тогда
			НомерСубконтоРасчетныеДокументы = СчетФильтра.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто").НомерСтроки;
		КонецЕсли;

		СчетОстатков = ТекущийПлатеж[?(КолонкаСчетаФильтра="СчетОплаты","СчетАванса","СчетОплаты")];
		Контрагент = ТекущийПлатеж.Контрагент;
		ДоговорКонтрагента = ТекущийПлатеж.ДоговорКонтрагента;

		КлючЗадолженности = Новый Структура();
		КлючЗадолженности.Вставить("Контрагент"         ,ТекущийПлатеж.Контрагент);
		КлючЗадолженности.Вставить("ДоговорКонтрагента" ,ТекущийПлатеж.ДоговорКонтрагента);
		КлючЗадолженности.Вставить(КолонкаСчетаФильтра  ,СчетФильтра);
		Если ТекущийПлатеж.ВестиПоДокументамРасчетовСКонтрагентомРегл 
			  ИЛИ ТекущийПлатеж.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
			  ИЛИ ТекущийПлатеж.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			КлючЗадолженности.Вставить("Сделка", ТекущийПлатеж.Сделка);
		КонецЕсли; 

		СуммаКРаспределению = ТекущийПлатеж.СуммаВзаиморасчетов;
		
		Если СуммаКРаспределению<0 Тогда
			Если ТаблицаИтогов.Колонки.Найти("НомерПоПорядку") = неопределено Тогда
				ТаблицаИтогов.Колонки.Добавить("НомерПоПорядку");
			КонецЕсли; 
			
			Для НПП = 1 по ТаблицаИтогов.Количество() Цикл
				ТаблицаИтогов[НПП-1].НомерПоПорядку = НПП;
				
				
			КонецЦикла; 
			
			Построитель = новый ПостроительЗапроса();
			ОписаниеИсточника = новый ОписаниеИсточникаДанных(ТаблицаИтогов.Скопировать());
			
			Построитель.ИсточникДанных = ОписаниеИсточника;
			Построитель.Порядок.Добавить("НомерПоПорядку",,,НаправлениеСортировки.Убыв);
			
			ОтборПостроитель = Построитель.Отбор;
			Для каждого КлючОтбора Из КлючЗадолженности Цикл
				ОтборПостроитель.Добавить(КлючОтбора.Ключ);
				ОтборПостроитель[КлючОтбора.Ключ].Значение= КлючОтбора.Значение;
				ОтборПостроитель[КлючОтбора.Ключ].Использование = Истина;
			КонецЦикла; 
			
			Построитель.Выполнить();

			ЗадолженностьПоСтрокеПлатежа = Построитель.Результат.Выгрузить();
			ЗадолженностьПоСтрокеПлатежа.Колонки.Удалить(ЗадолженностьПоСтрокеПлатежа.Колонки["СуммаОстаток"]);
			ЗадолженностьПоСтрокеПлатежа.Колонки.Удалить(ЗадолженностьПоСтрокеПлатежа.Колонки["ВалютнаяСуммаОстаток"]);
			ЗадолженностьПоСтрокеПлатежа.Колонки.ГривневаяСумма.Имя = "СуммаОстаток";
			ЗадолженностьПоСтрокеПлатежа.Колонки.ВалютнаяСумма.Имя = "ВалютнаяСуммаОстаток";
			РаспределениеОтрицательнойСтроки = Истина;
		Иначе 	
			ЗадолженностьПоСтрокеПлатежа = ТаблицаОстатков.НайтиСтроки(КлючЗадолженности);
			РаспределениеОтрицательнойСтроки = Ложь;
		КонецЕсли; 

		ОстаткиВВалюте = НЕ (ТекущийПлатеж.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета) 
			             И СчетФильтра.Валютный;

		
		// Учет закрытия задолженности
		Для каждого ЗадолженностьСтрока из ЗадолженностьПоСтрокеПлатежа Цикл
			СуммоваяРазница=0;
			
			Задолженность = ЗадолженностьСтрока[?(ОстаткиВВалюте,"ВалютнаяСуммаОстаток","СуммаОстаток")];
			Если не РаспределениеОтрицательнойСтроки Тогда
				Если СуммаКРаспределению >= Задолженность Тогда
					НужноЗаплатить = Задолженность;
				Иначе
					НужноЗаплатить = СуммаКРаспределению;
				КонецЕсли;
			Иначе
				Если -СуммаКРаспределению >= Задолженность Тогда
					НужноЗаплатить = Задолженность;
				Иначе
					НужноЗаплатить = -СуммаКРаспределению;
				КонецЕсли;
			КонецЕсли; 
			
			Если НужноЗаплатить=0 тогда 
				Продолжить;
			КонецЕсли;
			
			Если ОстаткиВВалюте тогда
				СуммоваяРазница = -Окр(НужноЗаплатить*ЗадолженностьСтрока.СуммаОстаток/ЗадолженностьСтрока.ВалютнаяСуммаОстаток,2);
				ЗадолженностьСтрока.СуммаОстаток = ЗадолженностьСтрока.СуммаОстаток - Окр(НужноЗаплатить*ЗадолженностьСтрока.СуммаОстаток/ЗадолженностьСтрока.ВалютнаяСуммаОстаток,2);
				ЗадолженностьСтрока.ВалютнаяСуммаОстаток = ЗадолженностьСтрока.ВалютнаяСуммаОстаток - НужноЗаплатить;
			Иначе
				ЗадолженностьСтрока.СуммаОстаток = ЗадолженностьСтрока.СуммаОстаток - НужноЗаплатить;
			КонецЕсли;
			
			СтрокаТаблицыИтогов = ТаблицаИтогов.Добавить();
			//Заполнить строчку по текущим данным
			Для каждого Колонка из ТаблицаИтогов.Колонки Цикл
				Если Колонка.Имя = "ГривневаяСумма" или Колонка.Имя = "ВалютнаяСумма" или Колонка.Имя = "СуммаВзаиморасчетов" тогда
					Продолжить;
				КонецЕсли;
				
				Если Не(ТаблицаОстатков.Колонки.Найти(Колонка.Имя)=Неопределено) тогда
					СтрокаТаблицыИтогов[Колонка.Имя] = ЗадолженностьСтрока[Колонка.Имя];
				ИначеЕсли Не(ТаблицаКРаспределению.Колонки.Найти(Колонка.Имя)=Неопределено) тогда
					 СтрокаТаблицыИтогов[Колонка.Имя] = ТекущийПлатеж[Колонка.Имя];                                      
				КонецЕслИ;
			КонецЦикла;

			СтрокаТаблицыИтогов.СуммаВзаиморасчетов	= НужноЗаплатить*?(РаспределениеОтрицательнойСтроки,-1,1);
			
			СтрокаТаблицыИтогов.ВалютнаяСумма 	= окр(НужноЗаплатить * (ТекущийПлатеж.ВалютнаяСумма/ТекущийПлатеж.СуммаВзаиморасчетов),2)*?(РаспределениеОтрицательнойСтроки,-1,1);
			СтрокаТаблицыИтогов.ГривневаяСумма	= окр(НужноЗаплатить *(ТекущийПлатеж.ГривневаяСумма/ТекущийПлатеж.СуммаВзаиморасчетов),2)*?(РаспределениеОтрицательнойСтроки,-1,1);
			
			Если РаспределениеОтрицательнойСтроки Тогда
				СтрокаТаблицыИтогов.РезультатРаспределения = ЗадолженностьСтрока.РезультатРаспределения;
			иначе
				СтрокаТаблицыИтогов.РезультатРаспределения = Истина;	
			КонецЕсли; 
			
			Если Не(НомерСубконтоРасчетныеДокументы = 0) тогда
				СтрокаТаблицыИтогов.Сделка = СтрокаТаблицыИтогов["Субконто"+НомерСубконтоРасчетныеДокументы];
			КонецЕсли;
			
			СуммаКРаспределению = СуммаКРаспределению - НужноЗаплатить*?(РаспределениеОтрицательнойСтроки,-1,1);
			
			ТекущийПлатеж.ГривневаяСумма			= ТекущийПлатеж.ГривневаяСумма - СтрокаТаблицыИтогов.ГривневаяСумма;
			ТекущийПлатеж.ВалютнаяСумма			= ТекущийПлатеж.ВалютнаяСумма - СтрокаТаблицыИтогов.ВалютнаяСумма;
			ТекущийПлатеж.СуммаВзаиморасчетов	= ТекущийПлатеж.СуммаВзаиморасчетов - СтрокаТаблицыИтогов.СуммаВзаиморасчетов;
			
			Если РаспределениеОтрицательнойСтроки Тогда
				СуммоваяРазница = 0;
			ИначеЕсли ОстаткиВВалюте тогда
				СуммоваяРазница = СуммоваяРазница + СтрокаТаблицыИтогов.ГривневаяСумма;
			КонецЕсли;
			
			ПараметрыСчета = РегистрыСведений.НемонетарныеСчета.Выбрать(новый структура("Счет",СтрокаТаблицыИтогов.Счет));
			
			ФлагНужноРаспределять = ПараметрыСчета.Следующий() И ((ПараметрыСчета.ТолькоДебет = Ложь И ПараметрыСчета.ТолькоКредит = Ложь) ИЛИ
									// если счет расчетов в Кт
									(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление И ПараметрыСчета.ТолькоДебет) ИЛИ 
									// если счет расчетов в Дт
									((НЕ НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление) И ПараметрыСчета.ТолькоКредит));
									
			Если не (СуммоваяРазница=0) и ФлагНужноРаспределять тогда
				Если ТаблицаСуммовыхРазниц=Неопределено тогда
					СтрокаТаблицыИтогов.ГривневаяСумма = СтрокаТаблицыИтогов.ГривневаяСумма-СуммоваяРазница;
					Если не ОстаткиВВалюте тогда
						СтрокаТаблицыИтогов.СуммаВзаиморасчетов = СтрокаТаблицыИтогов.СуммаВзаиморасчетов+СуммоваяРазница;
					КонецЕсли;
				КонецЕслИ;
			КонецЕслИ;

			Если СуммаКРаспределению = 0 тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;

		
		Если ТекущийПлатеж.СуммаВзаиморасчетов=0 тогда
			//Распределили полностью!
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыИтогов = ТаблицаИтогов.Добавить();
		//Заполнить строчку по текущим данным
		Для каждого Колонка из ТаблицаИтогов.Колонки Цикл
			Если Не(ТаблицаКРаспределению.Колонки.Найти(Колонка.Имя)=Неопределено) тогда
				 СтрокаТаблицыИтогов[Колонка.Имя] = ТекущийПлатеж[Колонка.Имя];                                      
			КонецЕслИ;
		КонецЦикла;
	КонецЦикла;

КонецФункции

// Выполняет зачет аванса по указанному документу
//
// Параметры
// ДокументОбъект    - ДокументОбъект или ДокументСсылка - Документ для которого выполяентся операция.
Функция ЗачетАвансаПодотчетника(ДокументОбъект, СтруктураШапкиДокумента, ВалютаРегламентированногоУчета, ТаблицыДокумента, Отказ,СчетРасчетов) Экспорт

	Организация         = СтруктураШапкиДокумента.Организация;
	ДатаДока            = СтруктураШапкиДокумента.Дата;
	МоментДокумента     = Новый МоментВремени(ДокументОбъект.Дата,ДокументОбъект.Ссылка);
	КурсДокумента       = СтруктураШапкиДокумента.КурсВалютыДокумента;
	КратностьДокумента  = СтруктураШапкиДокумента.КратностьВалютыДокумента;
	Контрагент          = СтруктураШапкиДокумента.ФизЛицо;
	
	ВалютаДокумента     = СтруктураШапкиДокумента.ВалютаДокумента;
	
	СуммаДокументаСНДСРегл            = 0;
	СуммаДокументаСНДСВВалютеРасчетов = 0;

	Для каждого ТекущаяТаблица из ТаблицыДокумента Цикл

		Если ТекущаяТаблица.Значение.Колонки.Найти("ПроводкиСуммаСНДСРегл") = Неопределено тогда

			ОбщегоНазначения.ОшибкаПриПроведении("Ошибка при зачете аванса.",Отказ);
			Возврат Неопределено;
        КонецЕсли;

		СуммаДокументаСНДСРегл = СуммаДокументаСНДСРегл + ТекущаяТаблица.Значение.Итог("ПроводкиСуммаСНДСРегл");
        СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов + ТекущаяТаблица.Значение.Итог("ПроводкиСуммаСНДСВал");
				
	КонецЦикла;
	 
	СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов; 
	СуммаДокументаСНДСРегл = СуммаДокументаСНДСРегл;

	Если СуммаДокументаСНДСРегл = 0 тогда 
		//Документ не требует обработки
		Возврат Неопределено; 
	КонецЕсли;

    УсловиеВалюта = ВалютаДокумента;
	ЗнакФильтрПоОстаткам = 1;
	
	Период = МоментДокумента;
		
	ТаблицаАвансов       = ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,Период,СчетРасчетов,УсловиеВалюта ,Контрагент,,,ЗнакФильтрПоОстаткам);
	
	СуммаЗачетаАвансаРегл            = 0;
	СуммаЗачетаАвансаВВалютеРасчетов = 0;
	КорректировкиПриРасчетахВВалюте  = 0;

	Если ТаблицаАвансов.Количество()=0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для каждого СтрокаАванса из ТаблицаАвансов Цикл

		//Расчет суммы перекрытия задолженности на счете, определение суммовых разниц
		ТекущийАванс = Макс(0, Мин(СуммаДокументаСНДСВВалютеРасчетов,СтрокаАванса["ВалютнаяСуммаОстаток"]));
		
		Если ТекущийАванс = 0 тогда 
			Продолжить;
		КонецЕсли;

		// считаем аванс по историческому курсу
		ИсторическийАвансРегл = (ТекущийАванс / СтрокаАванса.ВалютнаяСуммаОстаток) * СтрокаАванса.СуммаОстаток;
		ТекущийАвансРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекущийАванс, ВалютаДокумента, ВалютаРегламентированногоУчета,
														КурсДокумента, 1, КратностьДокумента, 1);
														
		// на какую сумму нужно откорректировать 
		КорректировкиПриРасчетахВВалюте = КорректировкиПриРасчетахВВалюте + (ИсторическийАвансРегл - ТекущийАвансРегл);
		
		ТекущийАвансРегл = ИсторическийАвансРегл;
			
		
		СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов - ТекущийАванс;
		СуммаЗачетаАвансаВВалютеРасчетов  = СуммаЗачетаАвансаВВалютеРасчетов + ТекущийАванс;
		СуммаЗачетаАвансаРегл             = СуммаЗачетаАвансаРегл + ТекущийАвансРегл;

	КонецЦикла;

	Если КорректировкиПриРасчетахВВалюте <> 0 тогда
		
		РаспределитьКорректировкуПриРасчетахВВалюте(КорректировкиПриРасчетахВВалюте,ТаблицыДокумента,Отказ,, Истина);

	КонецЕсли;

	Возврат КорректировкиПриРасчетахВВалюте;

КонецФункции

// Функция возвращает возможные счета учета расчетов с контрагентом
//
// Параметры:
//  Организация - по которой выполняется поиск
//  Контрагент  - по которому выполняется поиск
//  Договор     - по которому выполняется поиск
//
// Возвращаемое значение:
//  Структура - структура содержащая счета учета расчетов
// 
Функция ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор, ВалютаРегламентированногоУчета = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) тогда
		ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	Результат = Новый Структура("
	|СчетРасчетов, СчетАвансов,
	|СчетРасчетовПокупателя, СчетАвансовПокупателя,
	|СчетУчетаТары, СчетУчетаТарыПокупателя,
	|СчетАвансовПоТаре, СчетАвансовПоТареПокупателя,
	|СчетРасчетовПриБартере, СчетАвансовПриБартере,
	|СчетРасчетовПокупателяПриБартере, СчетАвансовПокупателяПриБартере,
	|СчетУчетаНДСПриобретений,СчетУчетаНДСПриобретенийПодтвержденный,
	|СчетУчетаНДСПродаж,СчетУчетаНДСПродажПодтвержденный,
	|НалоговоеНазначениеПриобретений,НалоговоеНазначениеПриобретенийПоТаре,
	|НалоговоеНазначениеПродаж, НалоговоеНазначениеПродажПоТаре,
	|СтавкаНДСПриобретений,СтавкаНДСПродаж,
	|Организация, Контрагент, Договор, ВидРасчетовПоДоговору, Амортизируется");

	ВидРасчетовПоДоговору = БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеВидаРасчетовПоПараметрамДоговора(Договор,ВалютаРегламентированногоУчета);

	СписокГруппКонтрагентов = ПолучитьСписокВышестоящихГрупп(Контрагент);
	
	СписокГруппДоговоров = ПолучитьСписокВышестоящихГрупп(Договор);
	
	Запрос    = Новый Запрос();
	Запрос.УстановитьПараметр("Организация",       Организация);
	Запрос.УстановитьПараметр("Контрагент",        Контрагент);
	Запрос.УстановитьПараметр("Договор",           Договор);
	Запрос.УстановитьПараметр("ВидРасчетов",       ВидРасчетовПоДоговору);
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКонтрагент",  Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойДоговор",     Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойВидРасчетов", Перечисления.ВидыРасчетовПоДоговорам.ПустаяСсылка());
	
	ШаблонЗапросаБезГде =",
	|	СчетУчетаРасчетовСПоставщиком,
	|	СчетУчетаАвансовВыданных,
	|	СчетУчетаРасчетовСПокупателем,
	|	СчетУчетаАвансовПолученных,
	|	СчетУчетаРасчетовПоТареСПоставщиком,
	|	СчетУчетаАвансовПоТареВыданных,
	|	СчетУчетаРасчетовПоТареСПокупателем,
	|	СчетУчетаАвансовПоТареПолученных,
	|	СчетУчетаРасчетовСПоставщикомПриБартере,
	|	СчетУчетаРасчетовСПокупателемПриБартере,
	|	СчетУчетаНДСПриобретений,
	|	СчетУчетаНДСПриобретенийПодтвержденный,
	|	СчетУчетаНДСПродаж,
	|	СчетУчетаНДСПродажПодтвержденный,
	|	НалоговоеНазначениеПриобретений,
	|	НалоговоеНазначениеПриобретенийПоТаре,
	|	НалоговоеНазначениеПродаж,
	|   НалоговоеНазначениеПродажПоТаре,
	|	СтавкаНДСПриобретений,
	|	СтавкаНДСПродаж,
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Амортизируется,
	|  	ВидРасчетовПоДоговору
	|
	|ИЗ
	|	РегистрСведений.СчетаУчетаРасчетовСКонтрагентами
	|";
	
	Индекс = 1;
		
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") + " КАК Приоритет" +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	
	|	Организация = &Организация И
	|	Контрагент  = &Контрагент И
	|	Договор     = &Договор И НЕ &Договор = &ПустойДоговор
	|";
	
	Индекс = Индекс + 1;
	
	Для Каждого ГруппаДоговоров Из СписокГруппДоговоров Цикл
		
		Запрос.УстановитьПараметр("ГруппаДоговоров" + Индекс, ГруппаДоговоров);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ	
		|
		|ВЫБРАТЬ
		|	" + Формат(Индекс,"ЧГ=0") +
		ШаблонЗапросаБезГде + "
		|ГДЕ
		|	ВидРасчетовПоДоговору = &ВидРасчетов И
		|	Организация 		  = &Организация И
		|	Контрагент  		  = &Контрагент И
		|	Договор     		  = &ГруппаДоговоров" + Индекс + "
		|";
	
		Индекс = Индекс + 1;
	
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ	
	|
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	ВидРасчетовПоДоговору = &ВидРасчетов И
	|	Организация 		  = &Организация И
	|	Контрагент  		  = &Контрагент И
	|	Договор     		  = &ПустойДоговор
	|";
	
	Индекс = Индекс + 1;
	
	Для Каждого ГруппаКонтрагентов Из СписокГруппКонтрагентов Цикл
		
		Запрос.УстановитьПараметр("ГруппаКонтрагентов" + Индекс, ГруппаКонтрагентов);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	" + Формат(Индекс,"ЧГ=0") +
		ШаблонЗапросаБезГде + "
		|ГДЕ
		|	ВидРасчетовПоДоговору = &ВидРасчетов И
		|	Организация 		  = &Организация И
		|	Контрагент            = &ГруппаКонтрагентов" + Индекс + " И
		|	Договор     		  = &ПустойДоговор
		|";
	
		Индекс = Индекс + 1;
	
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	ВидРасчетовПоДоговору = &ВидРасчетов И
	|	Организация 		  = &Организация И
	|	Контрагент  		  = &ПустойКонтрагент И
	|	Договор     		  = &ПустойДоговор
	|";
	
	Индекс = Индекс + 1;
	
	Для Каждого ГруппаДоговоров Из СписокГруппДоговоров Цикл
		
		Запрос.УстановитьПараметр("ГруппаДоговоров" + Индекс, ГруппаДоговоров);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	" + Формат(Индекс,"ЧГ=0") +
		ШаблонЗапросаБезГде + "
		|ГДЕ
		|	ВидРасчетовПоДоговору = &ВидРасчетов И
		|	Организация 	 	  = &ПустаяОрганизация И
		|	Контрагент            = &Контрагент И
		|	Договор               = &ГруппаДоговоров" + Индекс + "
	    |";
		
		Индекс = Индекс + 1;
	
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	ВидРасчетовПоДоговору = &ВидРасчетов И
	|	Организация 		  = &ПустаяОрганизация И
	|	Контрагент 			  = &Контрагент И
	|	Договор     		  = &ПустойДоговор
	|";
	
	Индекс = Индекс + 1;
	
	Для Каждого ГруппаКонтрагентов Из СписокГруппКонтрагентов Цикл
		
		Запрос.УстановитьПараметр("ГруппаКонтрагентов" + Индекс, ГруппаКонтрагентов);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	" + Формат(Индекс,"ЧГ=0") +
		ШаблонЗапросаБезГде + "
		|ГДЕ
		|	ВидРасчетовПоДоговору = &ВидРасчетов И
		|	Организация           = &ПустаяОрганизация И
		|	Контрагент            = &ГруппаКонтрагентов" + Индекс + " И
		|	Договор               = &ПустойДоговор
		|";
		
		Индекс = Индекс + 1;
	
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	ВидРасчетовПоДоговору = &ВидРасчетов И
	|	Организация           = &ПустаяОрганизация И
	|	Контрагент            = &ПустойКонтрагент И
	|	Договор               = &ПустойДоговор
	|";
	
	Индекс = Индекс + 1;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + Формат(Индекс,"ЧГ=0") +
	ШаблонЗапросаБезГде + "
	|ГДЕ
	|	ВидРасчетовПоДоговору = &ПустойВидРасчетов И
	|	Организация           = &ПустаяОрганизация И
	|	Контрагент            = &ПустойКонтрагент И
	|	Договор               = &ПустойДоговор
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Результат.СчетРасчетов                     = Выборка.СчетУчетаРасчетовСПоставщиком;
		Результат.СчетАвансов                      = Выборка.СчетУчетаАвансовВыданных;
		Результат.СчетРасчетовПокупателя           = Выборка.СчетУчетаРасчетовСПокупателем;
		Результат.СчетАвансовПокупателя            = Выборка.СчетУчетаАвансовПолученных;
		
		Результат.СчетУчетаТары                    = Выборка.СчетУчетаРасчетовПоТареСПоставщиком;
		Результат.СчетАвансовПоТаре                = Выборка.СчетУчетаАвансовПоТареВыданных;
		Результат.СчетУчетаТарыПокупателя          = Выборка.СчетУчетаРасчетовПоТареСПокупателем;
		Результат.СчетАвансовПоТареПокупателя      = Выборка.СчетУчетаАвансовПоТареПолученных;
		
		Результат.СчетРасчетовПриБартере           = Выборка.СчетУчетаРасчетовСПоставщикомПриБартере;
		Результат.СчетАвансовПриБартере            = Выборка.СчетУчетаРасчетовСПокупателемПриБартере;
		Результат.СчетРасчетовПокупателяПриБартере = Выборка.СчетУчетаРасчетовСПокупателемПриБартере;
		Результат.СчетАвансовПокупателяПриБартере  = Выборка.СчетУчетаРасчетовСПоставщикомПриБартере;
				
		Результат.СчетУчетаНДСПриобретений            		= Выборка.СчетУчетаНДСПриобретений;
		Результат.СчетУчетаНДСПриобретенийПодтвержденный 	= Выборка.СчетУчетаНДСПриобретенийПодтвержденный;
		Результат.СчетУчетаНДСПродаж             			= Выборка.СчетУчетаНДСПродаж;
		Результат.СчетУчетаНДСПродажПодтвержденный          = Выборка.СчетУчетаНДСПродажПодтвержденный;
		
		Результат.НалоговоеНазначениеПриобретений    		= Выборка.НалоговоеНазначениеПриобретений;
		Результат.НалоговоеНазначениеПриобретенийПоТаре     = Выборка.НалоговоеНазначениеПриобретенийПоТаре;
		Результат.НалоговоеНазначениеПродаж    			    = Выборка.НалоговоеНазначениеПродаж;
		Результат.НалоговоеНазначениеПродажПоТаре           = Выборка.НалоговоеНазначениеПродажПоТаре;
				
		Результат.СтавкаНДСПриобретений	                = Выборка.СтавкаНДСПриобретений;
		Результат.СтавкаНДСПродаж            			= Выборка.СтавкаНДСПродаж;
		
		Результат.Амортизируется            			= Выборка.Амортизируется;
		
		Результат.Организация						= Выборка.Организация;
		Результат.Контрагент            			= Выборка.Контрагент;
		Результат.Договор            				= Выборка.Договор;
		Результат.ВидРасчетовПоДоговору            	= Выборка.ВидРасчетовПоДоговору;
		
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПолучитьСчетаРасчетовСКонтрагентом()

// Функция возвращает массив вышестоящих групп указанного элемента.
// 
// Переметры:
//  Элемент      - Элемент справочника, для которого ищется родитель
//
// Возвращаемое значение
//  Массив вышестояших групп
//
Функция ПолучитьСписокВышеСтоящихГрупп(ЭлементСправочника) Экспорт
	
	Результат = Новый Массив;		
	
	Если НЕ ЗначениеЗаполнено(ЭлементСправочника) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ  Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементСправочника)) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МетаданныеСправочника = ЭлементСправочника.Метаданные();
	Если НЕ МетаданныеСправочника.Иерархический Тогда
		Возврат Результат;
	КонецЕсли;
	ИмяСправочника = МетаданныеСправочника.Имя;	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Справочник1.Родитель КАК Родитель1,
	|	Справочник2.Родитель КАК Родитель2,
	|	Справочник3.Родитель КАК Родитель3,
	|	Справочник4.Родитель КАК Родитель4,
	|	Справочник5.Родитель КАК Родитель5
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Справочник1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Справочник2
	|		ПО (Справочник2.Ссылка = Справочник1.Родитель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Справочник3
	|		ПО (Справочник3.Ссылка = Справочник2.Родитель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Справочник4
	|		ПО (Справочник4.Ссылка = Справочник3.Родитель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Справочник5
	|		ПО (Справочник5.Ссылка = Справочник4.Родитель)
	|ГДЕ
	|	Справочник1.Ссылка = &Ссылка";
	
	ТекущийЭлемент = ЭлементСправочника;
	
	Пока ЗначениеЗаполнено(ТекущийЭлемент) Цикл		
		Запрос.УстановитьПараметр("Ссылка", ТекущийЭлемент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Для Индекс = 1 по 5 Цикл
				ТекущийЭлемент = Выборка["Родитель" + Индекс];
				Если ЗначениеЗаполнено(ТекущийЭлемент) Тогда
					Результат.Добавить(ТекущийЭлемент);
				Иначе
					Прервать;
				КонецЕсли;				
			КонецЦикла;
		Иначе
			ТекущийЭлемент = Неопределено;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции диалогов расчетных документов

#Если Клиент Тогда
	
Процедура ВыборРасчетногоДокумента(СтруктураПараметров,Элемент,ТипыДокументов) Экспорт

	ФормаВыбора = Документы.ДокументРасчетовСКонтрагентом.ПолучитьФорму("ФормаВыбора",Элемент);

	Если СтруктураПараметров.Свойство("Организация") Тогда 
		ФормаВыбора.Организация        = СтруктураПараметров.Организация;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Контрагент") Тогда 
		ФормаВыбора.Контрагент         = СтруктураПараметров.Контрагент;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ДоговорКонтрагента") Тогда 
		ФормаВыбора.ДоговорКонтрагента = СтруктураПараметров.ДоговорКонтрагента;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ЭтоНовыйДокумент")Тогда 
		Если СтруктураПараметров.ЭтоНовыйДокумент Тогда
			ФормаВыбора.КонПериода         = КонецДня(РабочаяДата);
		Иначе
			ФормаВыбора.КонПериода         = СтруктураПараметров.КонецПериода;
		КонецЕсли;
	Иначе
		ФормаВыбора.КонПериода         = СтруктураПараметров.КонецПериода;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("НачалоПериода") Тогда
		ФормаВыбора.НачПериода         = СтруктураПараметров.НачалоПериода;
		ФормаВыбора.мПереданИнтервал = Истина;
	Иначе
		ФормаВыбора.мПереданИнтервал = Ложь;
	КонецЕсли; 
	
	Если СтруктураПараметров.Свойство("СчетДляОпределенияОстатков") Тогда
		ФормаВыбора.Счет               = СтруктураПараметров.СчетДляОпределенияОстатков;
	КонецЕсли; 
		
	Если СтруктураПараметров.Свойство("СторонаСчета") Тогда		
		ФормаВыбора.ОстаткиОбороты     = СтруктураПараметров.СторонаСчета;
	КонецЕсли; 
	
	ФормаВыбора.РежимВыбора        = Истина;
	ФормаВыбора.мТипыДокументов    = ТипыДокументов;

	ФормаВыбора.Открыть();

КонецПроцедуры

// Процедура подготавливает необходимые данные и вызывает процедуру заполнения табличной части 
// документов расчетов с контрагентами ("Предоплата", "Документы поступления", "Документы реализации") 
//
Процедура ЗаполнитьПредоплату(ДокументОбъект, СтруктураПараметров) Экспорт
	//Если ДокументОбъект.Проведен И ДокументОбъект.ДокументыРасчетовСКонтрагентом.Количество() > 0 Тогда
	//	ТекстПредупреждения = "Для заполнения табличной части нужно сначала сделать документ непроведенным!";
	//	Предупреждение(ТекстПредупреждения);
	//	Возврат;
	//КонецЕсли;
	
	Если ДокументОбъект.ДокументыРасчетовСКонтрагентом.Количество() > 0 Тогда
		
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ДокументОбъект.Метаданные().Представление());
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		
		ДокументОбъект.ДокументыРасчетовСКонтрагентом.Очистить();
	КонецЕсли;
	
	ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ДокументОбъект, СтруктураПараметров);
	ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ДокументОбъект, СтруктураПараметров);
	
КонецПроцедуры
#КонецЕсли


/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБСЛУЖИВАНИЯ ВЕДЕНИЯ ВЗАИМОРАСЧЕТОВ ПО ДОКУМЕНТАМ
// РАСЧЕТОВ С КОНТРАГЕНТАМИ


// Функция возвращает возможность проведения документа без контроля взаиморасчетов
//
// Параметры:
//  нет.
//
// Возвращаемое значение:
//  Истина - если можно проводить, иначе Ложь.
//
Функция ЕстьРазрешениеПроводитьБезКонтроляВзаиморасчетов() Экспорт

	СписокФильтров = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьПроведениеБезКонтроляВзаиморасчетов, Истина);

	Возврат НЕ СписокФильтров.НайтиПоЗначению(Истина) = Неопределено;
	
КонецФункции // ЕстьРазрешениеПроводитьБезКонтроляВзаиморасчетов()

Процедура ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ДокументОбъект, СтруктураШапкиДокумента, 
	                                                    СтруктураПараметров, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                    ВидДвижения, Отказ, Заголовок) Экспорт
													  
	// По регистру ВзаиморасчетыСКонтрагентами
	
	Если ТаблицаПоВзаиморасчетам.Количество() > 0 Тогда
		
		НаборДвиженийВзаиморасчеты = ДокументОбъект.Движения.ВзаиморасчетыСКонтрагентами;
		
		ТаблицаДвижений = НаборДвиженийВзаиморасчеты.Выгрузить();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВзаиморасчетам, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
		
		НаборДвиженийВзаиморасчеты.мПериод          = СтруктураШапкиДокумента.Дата;
		НаборДвиженийВзаиморасчеты.мТаблицаДвижений = ТаблицаДвижений;
		
		// Проверка остатков при оперативном проведении
		ОтключитьКонтрольВзаиморасчетов = СтруктураШапкиДокумента.Свойство("ОтключитьКонтрольВзаиморасчетов") 
		                                И СтруктураШапкиДокумента.ОтключитьКонтрольВзаиморасчетов;
		Если СтруктураШапкиДокумента.РежимПроведения = РежимПроведенияДокумента.Оперативный
			И НЕ ОтключитьКонтрольВзаиморасчетов Тогда
			НаборДвиженийВзаиморасчеты.КонтрольОстатков(ДокументОбъект, "ДокументыРасчетовСКонтрагентом", СтруктураШапкиДокумента, Отказ, Заголовок, "СуммаВзаиморасчетов");
		КонецЕсли;
		
		Если Не Отказ Тогда
			ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборДвиженийВзаиморасчеты, ВидДвижения);
		КонецЕсли;
		
	КонецЕсли;
	
	// По регистру РасчетыСКонтрагентами
	
	Если ТаблицаПоРасчетам.Количество() > 0 Тогда
		
		НаборДвиженийРасчеты = ДокументОбъект.Движения.РасчетыСКонтрагентами;
		
		ТаблицаДвижений = НаборДвиженийРасчеты.Выгрузить();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоРасчетам, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
		
		Если СтруктураПараметров.Свойство("ЭтоВозврат") И СтруктураПараметров.ЭтоВозврат Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Возврат, "РасчетыВозврат");
		Иначе
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Расчеты, "РасчетыВозврат");
		КонецЕсли;
		
		НаборДвиженийРасчеты.мПериод          = СтруктураШапкиДокумента.Дата;
		НаборДвиженийРасчеты.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборДвиженийРасчеты, ВидДвижения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если НЕ СтруктураПараметров.Свойство("СтруктураТабличныхЧастей") Тогда
		СтруктураТабЧастей = Новый Структура;
		Для каждого ТабЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
			Если ТабЧасть.Имя <> "ВозвратнаяТара" И ТабЧасть.Имя <> "ДокументыРасчетовСКонтрагентом" Тогда
				СтруктураТабЧастей.Вставить(ТабЧасть.Имя);
			КонецЕсли;
		КонецЦикла;
		СтруктураПараметров.Вставить("СтруктураТабличныхЧастей", СтруктураТабЧастей);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И НЕ СтруктураПараметров.Свойство("ИмяЗаказаВТабличныхЧастях") Тогда
		СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("Направление") Тогда
		СтруктураПараметров.Вставить("Направление", "Поступление");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ВидЗаполнения") Тогда
		СтруктураПараметров.Вставить("ВидЗаполнения", "только по заказам");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("УчетСуммыДокумента") Тогда
		СтруктураПараметров.Вставить("УчетСуммыДокумента", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		СтруктураПараметров.Вставить("Дата", ДокументОбъект.Дата);
	Иначе
		СтруктураПараметров.Вставить("Дата", КонецДня(ОбщегоНазначения.ПолучитьРабочуюДату()));	
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", МетаданныеДокумента) Тогда
	    СтруктураПараметров.Вставить("ОтражатьВУправленческомУчете", ДокументОбъект.ОтражатьВУправленческомУчете);
	Иначе
	    СтруктураПараметров.Вставить("ОтражатьВУправленческомУчете", Истина);
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", МетаданныеДокумента) Тогда
	    СтруктураПараметров.Вставить("ОтражатьВБухгалтерскомУчете", ДокументОбъект.ОтражатьВБухгалтерскомУчете);
	КонецЕсли;
	
	Если МетаданныеДокумента.Имя = "КорректировкаДолгаПоВозвратнойТаре" Тогда
		СтруктураПараметров.ОтражатьВБухгалтерскомУчете = Истина;
		СтруктураПараметров.ОтражатьВУправленческомУчете= Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента) Тогда
	    СтруктураПараметров.Вставить("СуммаВключаетНДС", ДокументОбъект.СуммаВключаетНДС);
	Иначе
	    СтруктураПараметров.Вставить("СуммаВключаетНДС", Истина);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетов",    ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	СтруктураПараметров.Вставить("КурсВзаиморасчетов",      ДокументОбъект.КурсВзаиморасчетов);
	СтруктураПараметров.Вставить("КратностьВзаиморасчетов", ДокументОбъект.КратностьВзаиморасчетов);
	
	СтруктураПараметров.Вставить("ВалютаДокумента", ДокументОбъект.ВалютаДокумента);
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
	СтруктураПараметров.Вставить("КурсДокумента",      КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента", КратностьДокумента);
	
	СтруктураПараметров.Вставить("ВедениеВзаиморасчетов", ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов);
	
	Если     ДокументОбъект.ОтражатьВБухгалтерскомУчете
		И НЕ МетаданныеДокумента.ТабличныеЧасти.Найти("ВозвратнаяТара") = Неопределено Тогда
		СтруктураПараметров.Вставить("СтруктураТабличныхЧастейТара", Новый Структура("ВозвратнаяТара"));	
	Иначе
		СтруктураПараметров.Вставить("СтруктураТабличныхЧастейТара", Новый Структура(""));	
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВестиПоДокументамРасчетовСКонтрагентомРегл",    ДокументОбъект.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл);
	СтруктураПараметров.Вставить("СложныйНалоговыйУчет",    					  ДокументОбъект.ДоговорКонтрагента.СложныйНалоговыйУчет);
	СтруктураПараметров.Вставить("Внешнеэкономический",    					  	  ДокументОбъект.ДоговорКонтрагента.Внешнеэкономический);
	
	Если НЕ СтруктураПараметров.Свойство("СчетУчетаРасчетовПоАвансам") Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СчетУчетаРасчетовПоАвансам", МетаданныеДокумента) Тогда
			СтруктураПараметров.Вставить("СчетУчетаРасчетовПоАвансам", ДокументОбъект.СчетУчетаРасчетовПоАвансам);
		Иначе
			СтруктураПараметров.Вставить("СчетУчетаРасчетовПоАвансам", ПланыСчетов.Хозрасчетный.ПустаяСсылка());		
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("СчетУчетаРасчетовПоТареПоАвансам") Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СчетУчетаРасчетовПоТареПоАвансам", МетаданныеДокумента) Тогда
			СтруктураПараметров.Вставить("СчетУчетаРасчетовПоТареПоАвансам", ДокументОбъект.СчетУчетаРасчетовПоТареПоАвансам);	
		Иначе
			СтруктураПараметров.Вставить("СчетУчетаРасчетовПоТареПоАвансам", ПланыСчетов.Хозрасчетный.ПустаяСсылка());		
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаСделок = СформироватьТаблицуСделок(ДокументОбъект, СтруктураПараметров);
	
	СтруктураПараметров.Вставить("ТаблицаСделок", ТаблицаСделок);
	
КонецПроцедуры
                           
// Процедура выполняет заполение ТЧ "Документы расчетов с контрагентом"
// Параметры:
//	ДокументОбъект
//	СтруктураПараметров - структура, включающая следующие параметры
//			- СтруктураТабличныхЧастей - структура, ключами которой являются имена табличных частей;
//										в качестве значений структуры могут передаваться 
//										таблицы значений, содержащие данные самих табличных частей
//							
//			- СуммаВключаетНДС         - признак включения НДС в сумму
//			- ВалютаВзаиморасчетов     - валюта взаиморасчетов (ссылка на элемент справочника "Валюты")
//			- СуммаВзаиморасчетов
//			- ВалютаДокумента
//			- КурсВзаиморасчетов
//			- КратностьВзаиморасчетов
//			- ДоговорКонтрагента
//			- ОтражатьВБухгалтерскомУчете
//			- ОтражатьВНалоговомУчете
//			- ВедениеВзаиморасчетов
//			- Дата - дата документа
//	Направление - направление взаиморасчетов: "поступление" или "реализация"
//	УчетЗаказов - учет заказов при ведении взаиморасчетов по договору в целом:
//					- "только по заказу"      - если указан заказ, то заполнение происходит только документами, связанными с этим заказом
//                  - "по заказу и свободные" - заполняется сначала документами по заказу, а затем документами, в которых не был указан заказ
//					- "приоритет заказа"      - заполняется сначала документами по заказу, затем документами в которых заказ не был указан, затем документами по другим заказам
//					- "не учитывать"          - не учитываются заказы
//	УчетСуммыДокумента - учитывать сумму документа при заполнении или заполнять всеми остатками, предоставив пользователю право выбора
//
Процедура ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДоговорКонтрагента) Тогда
		ДокументОбъект.ДокументыРасчетовСКонтрагентом.Очистить();
		Возврат;
	КонецЕсли;

	ТаблицаСделок = СтруктураПараметров.ТаблицаСделок;
	Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		ТаблицаСделок.ЗаполнитьЗначения(Неопределено, "Сделка");
		//ТаблицаСделок.Свернуть("Сделка", "СуммаВзаиморасчетов");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ДокументОбъект.ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("Дата", КонецДня(СтруктураПараметров.Дата));
		Запрос.УстановитьПараметр("МоментВремени", КонецДня(СтруктураПараметров.Дата) + 1);
	Иначе
		Запрос.УстановитьПараметр("Дата", КонецДня(СтруктураПараметров.Дата));
		Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(СтруктураПараметров.Дата,ДокументОбъект.Ссылка));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтруктураПараметров.ДоговорКонтрагента);
	
	Направление        = СтруктураПараметров.Направление;
	ВидЗаполнения      = СтруктураПараметров.ВидЗаполнения;
	УчетСуммыДокумента = СтруктураПараметров.УчетСуммыДокумента;
	
	Если Направление = "Поступление" Тогда
		МножительНаправления = 1;
	Иначе
		МножительНаправления = -1;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ЭтоВозврат") Тогда
		МножительВозврата = ?(СтруктураПараметров.ЭтоВозврат = Истина, -1, 1);
		Запрос.УстановитьПараметр("ЭтоВозврат", ?(ТипЗнч(СтруктураПараметров.ЭтоВозврат) = Тип("Булево"), СтруктураПараметров.ЭтоВозврат, Ложь));
	Иначе
		МножительВозврата = 1;
		Запрос.УстановитьПараметр("ЭтоВозврат", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("МножительВозврата", МножительВозврата);

	СделкиДокумента = УчетНДС.УдалитьПовторяющиесяЭлементыМассива(ТаблицаСделок.ВыгрузитьКолонку("Сделка"));
	Запрос.УстановитьПараметр("СделкиДокумента", СделкиДокумента);
	
	ВидРасчетовСКонтрагентом = ?(Направление = "Поступление", Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению,
								 Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	
	Множитель = МножительНаправления * МножительВозврата;
	Запрос.УстановитьПараметр("Множитель", Множитель);
	
	Если ВидЗаполнения = "только по заказам" Тогда
		МаксПриоритет = 1;
	ИначеЕсли ВидЗаполнения = "по заказам и свободные" Тогда
		МаксПриоритет = 2;
	Иначе
		МаксПриоритет = 3;
	КонецЕсли;
	Запрос.УстановитьПараметр("МаксПриоритет", МаксПриоритет);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	// заполнение будет различным в зависимости от того, в каком учете отражается документ и как ведутся расчеты по документам
	// в регл. учете
	Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		// заполняем по данным налогового учета
			
		Если СтруктураПараметров.Направление = "Реализация" Тогда
			
			ИмяРегистраНал = "ПродажиНалоговыйУчет";
			
			СобытиеОплата   = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем;
			СобытиеОтгрузка = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
			
		Иначе
			
			ИмяРегистраНал = "ПриобретенияНалоговыйУчет";
			
			СобытиеОплата   = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
			СобытиеОтгрузка = Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;
			
		КонецЕсли;
		Запрос.УстановитьПараметр("СобытиеОплата",СобытиеОплата);
		Запрос.УстановитьПараметр("СобытиеОтгрузка",СобытиеОтгрузка);
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Неопределено 	КАК Сделка,
		|   СтавкаНДС 		КАК СтавкаНДС,
		|   ВозвратнаяТара 	КАК ВозвратнаяТара,";
		Если ИмяРегистраНал = "ПриобретенияНалоговыйУчет" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|   ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
			|   ВидДеятельностиНДС КАК ВидДеятельностиНДС,
			|   Амортизируется КАК Амортизируется,";
		Иначе
			Запрос.Текст = Запрос.Текст + "	
			|   NULL КАК ДляХозяйственнойДеятельности,
			|   NULL КАК ВидДеятельностиНДС,
			|   NULL КАК Амортизируется,";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "	
		|	ВзаиморасчетыПоДокументамОстатки.Сделка КАК ДокументРасчетовСКонтрагентом,
		|	СУММА(ВЫБОР КОГДА  Событие = &СобытиеОплата ТОГДА ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток ИНАЧЕ - ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток КОНЕЦ) * &МножительВозврата КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ЭтоВозврат
		|			ТОГДА &ПустаяДата
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.Сделка.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.Сделка.Дата), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОплаты,
		|	1     КАК Приоритет
		|  ПОМЕСТИТЬ ВложенныйЗапрос
		|ИЗ
		|	РегистрНакопления."+ИмяРегистраНал+".Остатки(
		|		&МоментВремени,
		|			  ДоговорКонтрагента = &ДоговорКонтрагента
		|			И (Событие = &СобытиеОплата ИЛИ Событие = &СобытиеОтгрузка)) КАК ВзаиморасчетыПоДокументамОстатки
		|СГРУППИРОВАТЬ ПО 
		|	ВзаиморасчетыПоДокументамОстатки.Сделка,
		|	ВЫБОР
		|		КОГДА &ЭтоВозврат
		|			ТОГДА &ПустаяДата
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.Сделка.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.Сделка.Дата), ДЕНЬ)
		|	КОНЕЦ,
		|   СтавкаНДС,
		|   ВозвратнаяТара";
		Если ИмяРегистраНал = "ПриобретенияНалоговыйУчет" Тогда
		Запрос.Текст = Запрос.Текст + "	,
		|   ДляХозяйственнойДеятельности,
		|   ВидДеятельностиНДС,
		|   Амортизируется
		|";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|ВЫБРАТЬ
		| 	Сделка,
		| 	ДокументРасчетовСКонтрагентом,
		|	Сумма,
		| 	ДатаОплаты,
		| 	Приоритет,
		|	СтавкаНДС,
		|	ВозвратнаяТара,
		|   ДляХозяйственнойДеятельности,
		|   ВидДеятельностиНДС,
		|	ВЫБОР КОГДА ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПропорциональныйНДС,
		|   Амортизируется
		| ИЗ ВложенныйЗапрос
		|ГДЕ
		|	  ВложенныйЗапрос.Сумма > 0
		|	И ДатаОплаты <= &Дата
	    |
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	ДатаОплаты,
		|	ДокументРасчетовСКонтрагентом
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ИначеЕсли СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		// заполняем по данным бухг. учета	
		
		Субконто = новый Массив();
		Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
		Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
		Запрос.УстановитьПараметр("Субконто", Субконто);
		
		Счета = Новый Массив();
		Счета.Добавить(СтруктураПараметров.СчетУчетаРасчетовПоТареПоАвансам);
		Счета.Добавить(СтруктураПараметров.СчетУчетаРасчетовПоАвансам);
		
		Запрос.УстановитьПараметр("Счета", Счета);
		Запрос.УстановитьПараметр("СчетТовары", СтруктураПараметров.СчетУчетаРасчетовПоАвансам);		
		Если СтруктураПараметров.Направление = "Реализация" Тогда
				
			Если МножительВозврата = -1 Тогда
				// возврат
				СторонаСчетБУ = "Дт";
			Иначе
				// отгрузка					
				СторонаСчетБУ = "Кт";
			КонецЕсли; 
			
		Иначе
			
			Если МножительВозврата = -1 Тогда
				// возврат
				СторонаСчетБУ = "Кт";
			Иначе
				// отгрузка					
				СторонаСчетБУ = "Дт";
			КонецЕсли; 
			
		КонецЕсли;
		
		Если СтруктураПараметров.ДоговорКонтрагента.Внешнеэкономический = Ложь Тогда
			ПризнакВалютнойСуммы = "";
		Иначе
		    ПризнакВалютнойСуммы = "Валютная";			
		КонецЕсли;
	
		
		Запрос.Текст ="
		|ВЫБРАТЬ
		|	Неопределено 	КАК Сделка,
		|	ВзаиморасчетыПоДокументамОстатки.Субконто2 КАК ДокументРасчетовСКонтрагентом,
		|	ВЫБОР КОГДА ВзаиморасчетыПоДокументамОстатки.СЧЕТ В (&СчетТовары) ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ВозвратнаяТара,
		|	СУММА(ВзаиморасчетыПоДокументамОстатки."+ПризнакВалютнойСуммы+"СуммаОстаток"+СторонаСчетБУ+") КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ЭтоВозврат
		|			ТОГДА &ПустаяДата
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.Субконто2.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.Субконто2.Дата), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОплаты,
		|	1     КАК Приоритет
		|  ПОМЕСТИТЬ ВложенныйЗапрос
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		&МоментВремени, Счет В (&Счета), &Субконто,
		|			  Субконто1 = &ДоговорКонтрагента) КАК ВзаиморасчетыПоДокументамОстатки
		|СГРУППИРОВАТЬ ПО 
		|	ВзаиморасчетыПоДокументамОстатки.Субконто2,
		|	ВЫБОР
		|		КОГДА &ЭтоВозврат
		|			ТОГДА &ПустаяДата
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.Субконто2.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.Субконто2.Дата), ДЕНЬ)
		|	КОНЕЦ,
		|	ВЫБОР КОГДА ВзаиморасчетыПоДокументамОстатки.СЧЕТ В (&СчетТовары) ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ
		|;
		|
		|ВЫБРАТЬ
		| 	Сделка,
		| 	ДокументРасчетовСКонтрагентом,
		| 	Сумма,
		| 	ДатаОплаты,
		| 	Приоритет,
		|	ВозвратнаяТара
		| ИЗ ВложенныйЗапрос
		|ГДЕ
		|	  ВложенныйЗапрос.Сумма > 0
		|	И ДатаОплаты <= &Дата
	    |
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	ДатаОплаты,
		|	ДокументРасчетовСКонтрагентом
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Иначе

		// для расчета управленчекой суммы взаимопрасчетов
		Если    СтруктураПараметров.КурсДокумента = 0 
			ИЛИ СтруктураПараметров.КратностьВзаиморасчетов = 0 ТОгда
			Курс = 1;
		Иначе
			Курс = СтруктураПараметров.КурсВзаиморасчетов / СтруктураПараметров.КратностьВзаиморасчетов / СтруктураПараметров.КурсДокумента * СтруктураПараметров.КратностьДокумента;
		КонецЕсли;
		Запрос.УстановитьПараметр("Курс", Курс);
		
		// Выбираем из оперативных итогов все остатки по документам с датой оплаты меньше даты поступления (реализации)
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыПоДокументамОстатки.Сделка КАК Сделка,
		|	ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
		|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель * &Курс КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ЭтоВозврат
		|			ТОГДА &ПустаяДата
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка В (&СделкиДокумента)
		|			ТОГДА 1
		|		КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка = НЕОПРЕДЕЛЕНО
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
		|		&МоментВремени,
		|		ДоговорКонтрагента = &ДоговорКонтрагента
		|		    И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом) КАК ВзаиморасчетыПоДокументамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(УчетнаяПолитика.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.УчетнаяПолитика КАК УчетнаяПолитика) КАК АктуальнаяУчетнаяПолитика
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитика КАК УчетнаяПолитика
		|			ПО АктуальнаяУчетнаяПолитика.Период = УчетнаяПолитика.Период
		|		ПО ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата >= АктуальнаяУчетнаяПолитика.Период
		|ГДЕ
		|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель > 0
		|	И ВЫБОР
		|			КОГДА &ЭтоВозврат
		|				ТОГДА ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата
		|			ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ)
		|		КОНЕЦ <= &Дата
		|	И ВЫБОР
		|			КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка В (&СделкиДокумента)
		|				ТОГДА 1
		|			КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка = НЕОПРЕДЕЛЕНО
		|				ТОГДА 2
		|			ИНАЧЕ 3
		|		КОНЕЦ <= &МаксПриоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Сделка,
		|	ДатаОплаты,
		|	ДокументРасчетовСКонтрагентом
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
	КонецЕсли;
	
	ТаблицаПредоплат = ДокументОбъект.ДокументыРасчетовСКонтрагентом.ВыгрузитьКолонки();

	Результат = Запрос.Выполнить();
	ТаблицаОстатков = Результат.Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Приоритет, Сделка");
	
	Если МаксПриоритет = 3 И НЕ УчетСуммыДокумента Тогда
		// Заполняем всеми доступными остатками. Выбрать нужные должен будет пользователь,
		// удалив лишние строки или откорректировав суммы
		Для каждого СтрокаОстатка Из ТаблицаОстатков Цикл
			НоваяСтрокаПредоплаты = ТаблицаПредоплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПредоплаты, СтрокаОстатка);
		КонецЦикла;
		
	Иначе
		// Заполняем доступными остатками на сумму, не превышающую сумму документа
		// в соответствии с заданными приоритетами
		Для Приоритет = 1 По МаксПриоритет Цикл
			
			Для каждого СтрокаСделки Из ТаблицаСделок Цикл
				
				Если СтрокаСделки.СуммаВзаиморасчетов = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Приоритет = 1 Тогда
					СтруктураОтбораОстатков = Новый Структура("Приоритет, Сделка", 1, СтрокаСделки.Сделка);
					
					Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
						И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
						И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
						
						СтруктураОтбораОстатков.Вставить("ВозвратнаяТара", СтрокаСделки.ВозвратнаяТара);
						Если НЕ СтрокаСделки.ВозвратнаяТара Тогда
							СтруктураОтбораОстатков.Вставить("СтавкаНДС", СтрокаСделки.СтавкаНДС);
						
							Если НЕ СтруктураПараметров.Направление = "Реализация" Тогда
								СтруктураОтбораОстатков.Вставить("Амортизируется", 				 СтрокаСделки.Амортизируется);	
								СтруктураОтбораОстатков.Вставить("ВидДеятельностиНДС", 			 СтрокаСделки.НалоговоеНазначение.ВидДеятельностиНДС);	
								СтруктураОтбораОстатков.Вставить("ДляХозяйственнойДеятельности", НЕ (СтрокаСделки.НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая));	
							КонецЕсли;
						
						КонецЕсли; 
						
					ИначеЕсли СтруктураПараметров.ОтражатьВБухгалтерскомУчете
						И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда

						СтруктураОтбораОстатков.Вставить("ВозвратнаяТара", СтрокаСделки.ВозвратнаяТара);
						
					КонецЕсли;
					
					СтрокиСОтбором = ТаблицаОстатков.НайтиСтроки(СтруктураОтбораОстатков);
				ИначеЕсли Приоритет = 2 Тогда
					СтруктураОтбораОстатков = Новый Структура("Приоритет", 2);
					
					Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
						И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
						И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
						
						СтруктураОтбораОстатков.Вставить("ВозвратнаяТара", СтрокаСделки.ВозвратнаяТара);
						Если НЕ СтрокаСделки.ВозвратнаяТара Тогда
							СтруктураОтбораОстатков.Вставить("СтавкаНДС", СтрокаСделки.СтавкаНДС);
						
							Если НЕ СтруктураПараметров.Направление = "Реализация" Тогда
								СтруктураОтбораОстатков.Вставить("Амортизируется", 				 СтрокаСделки.Амортизируется);	
								СтруктураОтбораОстатков.Вставить("ВидДеятельностиНДС", 			 СтрокаСделки.НалоговоеНазначение.ВидДеятельностиНДС);	
								СтруктураОтбораОстатков.Вставить("ДляХозяйственнойДеятельности", НЕ (СтрокаСделки.НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая));	
							КонецЕсли;
						
						КонецЕсли; 
						
					ИначеЕсли СтруктураПараметров.ОтражатьВБухгалтерскомУчете
						И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда

						СтруктураОтбораОстатков.Вставить("ВозвратнаяТара", СтрокаСделки.ВозвратнаяТара);
						
					КонецЕсли;
					
					СтрокиСОтбором = ТаблицаОстатков.НайтиСтроки(СтруктураОтбораОстатков);
				Иначе
					СтрокиСОтбором = ТаблицаОстатков;
				КонецЕсли;
				
				Для каждого СтрокаОстатка Из СтрокиСОтбором Цикл
					
					Если СтрокаСделки.Сумма = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Если СтрокаОстатка.Сумма = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрокаПредоплаты = ТаблицаПредоплат.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПредоплаты, СтрокаОстатка);
					
					ОпределитьДатуОплатыДокументаРасчетовСКонтрагентом(НоваяСтрокаПредоплаты);
					
					Если  НЕ СтруктураПараметров.Направление = "Реализация" 
						И    СтруктураПараметров.ОтражатьВБухгалтерскомУчете
						И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
						И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
						НоваяСтрокаПредоплаты.НалоговоеНазначение = СтрокаСделки.НалоговоеНазначение;
					КонецЕсли;
					
					НоваяСтрокаПредоплаты.Сумма = Мин(СтрокаСделки.Сумма, СтрокаОстатка.Сумма);
					
					Если НоваяСтрокаПредоплаты.Сумма  = СтрокаСделки.Сумма Тогда
					
						НоваяСтрокаПредоплаты.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов;
						
					Иначе							
						
						НоваяСтрокаПредоплаты.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов * НоваяСтрокаПредоплаты.Сумма /СтрокаСделки.Сумма; 
						НоваяСтрокаПредоплаты.СуммаВзаиморасчетов = Окр(НоваяСтрокаПредоплаты.СуммаВзаиморасчетов,2);
						
					КонецЕсли;
					
					СтрокаСделки.Сумма  			  = СтрокаСделки.Сумма 				 - НоваяСтрокаПредоплаты.Сумма;
					СтрокаСделки.СуммаВзаиморасчетов  = СтрокаСделки.СуммаВзаиморасчетов - НоваяСтрокаПредоплаты.СуммаВзаиморасчетов;
					
					СтрокаОстатка.Сумма 			  = СтрокаОстатка.Сумма - НоваяСтрокаПредоплаты.Сумма;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
		
	ДокументОбъект.ДокументыРасчетовСКонтрагентом.Загрузить(ТаблицаПредоплат);

КонецПроцедуры // ЗаполнитьДокументыРасчетовСКонтрагентом()

Процедура ИзменитьЗнакКолонокТаблицы(Таблица, СтруктураКолонок) Экспорт

	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для каждого ОписаниеКолонки Из СтруктураКолонок Цикл
		
			ИмяКолонки = ОписаниеКолонки.Ключ;
			ЗначениеКолонки = СтрокаТаблицы[ИмяКолонки];
			Если ТипЗнч(ЗначениеКолонки) = Тип("Число") Тогда
				СтрокаТаблицы[ИмяКолонки] = -1 * ЗначениеКолонки;
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Процедура заполняет поле ДатаОплаты в строке табличной части ДокументыРасчетовСКонтрагентом 
// при изменении документа расчетов
//
Процедура ОпределитьДатуОплатыДокументаРасчетовСКонтрагентом(ДанныеСтроки) Экспорт

	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДокументРасчетовСКонтрагентом) Тогда
		ДанныеСтроки.ДатаОплаты = '00010101';
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДанныеСтроки.ДокументРасчетовСКонтрагентом.Метаданные();
	
	Запрос = Новый Запрос;
	ЕстьДатаОплаты = ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаОплаты", МетаданныеДокумента);
	Если ЕстьДатаОплаты Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШапкаДокумента.Дата КАК ДатаДокумента,
		|	ШапкаДокумента.ДатаОплаты КАК ДатаОплаты
		|ИЗ
		|	Документ." + МетаданныеДокумента.Имя + " КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &ДокументРасчетов";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШапкаДокумента.Дата КАК ДатаДокумента,
		|	ШапкаДокумента.Дата КАК ДатаОплаты
		|ИЗ
		|	Документ." + МетаданныеДокумента.Имя + " КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &ДокументРасчетов";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументРасчетов", ДанныеСтроки.ДокументРасчетовСКонтрагентом);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеСтроки.ДатаОплаты = УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Выборка.ДатаДокумента, Выборка.ДатаОплаты);
	
КонецПроцедуры

// Движения документов поступления и реализации по регистру оперативных расчетов по документам
//
// Параметры
//  СтруктураШапкиДокумента		- <Структура> – Структура шапки документа
//  БазоваяТаблицаЗадолженности	– <ТаблицаЗначений> –  Таблица значений с информацией о задолженности по документу
//  ТаблицаРасчетовПоДокументам	– <ТаблицаЗначений> –  Таблица значений с информацией о зачитываемых авансах
//  ВидРасчетовПоОперации		- <ПеречислениеСсылка.ВидыРасчетовСКонтрагентами>
//  ВидДвиженияРасчетов			- <ПеречислениеСсылка.ВидыДвиженийБухгалтерии>
//	ДоговорКонтрагента			- <СправочникСсылка.ДоговорыКонтрагентов> - необязательный параметр. 
//									Для документов, отражающих движения по нескольким договорам
//  Движения 					- <Коллекция движений или структура с соответствующими свойствами>
//								– Движения документа по регистрам (в т.ч. по регистру оперативных взаиморасчетов)
//  Отказ						- <Булево> – признак ошибки при проведения для остановки проведения документа
//  Заголовок					- <Строка> – Представление заголовка документа для использования при формировании сообщения об ошибках
//
Процедура ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаВзаиморасчетов, ВидРасчетовСКонтрагентом, ВидДвижения, Движения, Отказ, Заголовок) Экспорт
	
	ВестиПоДокументамРасчетовСКонтрагентом = СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом;
	Если НЕ ВестиПоДокументамРасчетовСКонтрагентом Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка             = СтруктураШапкиДокумента.Ссылка;
	ДатаДвижений       = СтруктураШапкиДокумента.Дата;
	МоментВремени      = Новый МоментВремени(ДатаДвижений, Ссылка);
	Организация        = СтруктураШапкиДокумента.Организация;
	Контрагент         = СтруктураШапкиДокумента.Контрагент;
	ДоговорКонтрагента = СтруктураШапкиДокумента.ДоговорКонтрагента;
	ЗнакОстатка        = ?(ВидДвижения = ВидДвиженияНакопления.Приход, -1, 1);
	
	ЭтоВозврат = СтруктураШапкиДокумента.Свойство("ЭтоВозврат") И СтруктураШапкиДокумента.ЭтоВозврат;
	Множитель = ?(ЭтоВозврат, -1, 1);
	ЗнакОстатка = ЗнакОстатка * Множитель;
	
	НетСделкиВТаблице = ТаблицаВзаиморасчетов.Колонки.Найти("Сделка") = Неопределено;
	Если НетСделкиВТаблице Тогда
		ТаблицаВзаиморасчетов.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
			|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), "Сделка");
	КонецЕсли;
	Для Каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтрокаВзаиморасчетов.Сделка = Неопределено;
		ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам ИЛИ НетСделкиВТаблице Тогда
			СтрокаВзаиморасчетов.Сделка = СтруктураШапкиДокумента.Сделка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом) Тогда
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	// Определение состояния расчетов по документам
	
	Запрос = Новый Запрос;
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Сделка,
	|	Таб.ДокументРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаВзаиморасчетов
	|ИЗ
	|	&ТаблицаВзаиморасчетов КАК Таб
	|ГДЕ 
	|	НЕ (Таб.ДокументРасчетовСКонтрагентом = &Ссылка)";
	
	Запрос.УстановитьПараметр("ТаблицаВзаиморасчетов", ТаблицаВзаиморасчетов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
						
		СтруктураПараметровБлокировки = Новый Структура(
			"ИмяТаблицы, ИсточникДанных, ИмяВременнойТаблицы", 
			"ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов", МенеджерВремТаблиц, "ТаблицаВзаиморасчетов");
		СтруктураЗначенийБлокировки   = Новый Структура(
			"Период, ВидРасчетовСКонтрагентом, Организация, Контрагент, ДоговорКонтрагента", 
			Новый Диапазон(, ДатаДвижений), ВидРасчетовСКонтрагентом, Организация, Контрагент, ДоговорКонтрагента);
		СтруктураИсточникаДанных      = Новый Структура(
			"Сделка, ДокументРасчетовСКонтрагентом", 
			"Сделка", "ДокументРасчетовСКонтрагентом");
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
		
	КонецЕсли;	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.Организация,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.Контрагент,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.Сделка,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.ВидРасчетовСКонтрагентом,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка КАК СуммаВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&МоментВремени 
	|		, 
	|		Организация = &Организация
	|			И Контрагент = &Контрагент
	|			И ДоговорКонтрагента = &ДоговорКонтрагента
	|			И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|			И (Сделка, ДокументРасчетовСКонтрагентом) В (ВЫБРАТЬ Сделка, ДокументРасчетовСКонтрагентом ИЗ ТаблицаВзаиморасчетов)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка > 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("ЗнакОстатка",ЗнакОстатка);
	
	ОстаткиПоРасчетам = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейВзаиморасчетыПоДокументам = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов;
	ТаблицаДвижений = НаборЗаписейВзаиморасчетыПоДокументам.ВыгрузитьКолонки();
	
	Если СтруктураШапкиДокумента.Свойство("РежимПроведения") Тогда
		РежимПроведения = СтруктураШапкиДокумента.РежимПроведения;
	Иначе
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	ЗапрещатьПревышениеОстатков   = РежимПроведения = РежимПроведенияДокумента.Оперативный;

	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		
		ЭтоПогашениеКредДокумента = СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом <> Ссылка;
		
		Если ЭтоПогашениеКредДокумента Тогда
			
			ОтборПоОстаткам = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Сделка, 
			| ДокументРасчетовСКонтрагентом, ВидРасчетовСКонтрагентом", 
			Организация, Контрагент, ДоговорКонтрагента, СтрокаВзаиморасчетов.Сделка, 
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом, ВидРасчетовСКонтрагентом);
			
			СтрокиОстатка = ОстаткиПоРасчетам.НайтиСтроки(ОтборПоОстаткам);
			
			ОстатокСуммыВзаиморасчетов = 0;
			Для каждого ОстатокЗадолженности из СтрокиОстатка Цикл
				ОстатокСуммыВзаиморасчетов = ОстатокСуммыВзаиморасчетов + ОстатокЗадолженности.СуммаВзаиморасчетов;
			КонецЦикла;
			
			Если ОстатокСуммыВзаиморасчетов < СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель Тогда
			
				ВалютаПредставление = Строка(ДоговорКонтрагента.ВалютаВзаиморасчетов);
				СделкаПредставление = ?(НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка), "не указана", Строка(СтрокаВзаиморасчетов.Сделка));
				ТекстСообщения = "Указана сумма взаиморасчетов, превышающая непогашенный остаток по документу расчетов с контрагентом!
				               | Сделка: " + СделкаПредставление + ", документ расчетов: " + СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом + "; 
				               | Остаток " + ОстатокСуммыВзаиморасчетов + " " + ВалютаПредставление + "; "
				               + " указана сумма " + (СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель) + " " + ВалютаПредставление + "; "
				               + " превышение " + (СтрокаВзаиморасчетов.СуммаВзаиморасчетов  * Множитель - ОстатокСуммыВзаиморасчетов) + " " + ВалютаПредставление;
			
				Если ЗапрещатьПревышениеОстатков Тогда
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
					Возврат;
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , Заголовок);
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЕсли; 
				
		Движение = ТаблицаДвижений.Добавить();
		
		Движение.Организация            	   = Организация;
		Движение.Контрагент            		   = Контрагент;
		Движение.ДоговорКонтрагента            = ДоговорКонтрагента;
		Движение.Сделка                        = СтрокаВзаиморасчетов.Сделка;
		Движение.ДокументРасчетовСКонтрагентом = СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом;
		Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
		
		Движение.СуммаВзаиморасчетов = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
		
	КонецЦикла; 
	
	НаборЗаписейВзаиморасчетыПоДокументам.мТаблицаДвижений = ТаблицаДвижений;
	НаборЗаписейВзаиморасчетыПоДокументам.мПериод = ДатаДвижений;
	
	Если Не Отказ Тогда
		ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборЗаписейВзаиморасчетыПоДокументам, ВидДвижения);
	КонецЕсли;

КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПРОВЕДЕНИЯ ДОКУМЕНТОВ ПО РЕГИСТРУ РАСЧЕТОВ ПО ДОКУМЕНТАМ


// Движения документов оплаты по регистру оперативных расчетов по документам
//
// Параметры
//  СтруктураШапкиДокумента		– <Структура> – структура с данными шапки документа и другими, необходимыми для формирования движений
//  ДатаДвижений				– <Дата> – дата и время формирования движений
//  ИмяТаблицыПлатежейИлиТаблица– <Строка> –  Имя табличной части документа оплаты с расшифровкой платежей
//								или <ТаблицаЗначений> - подготовленная таблица платежей по расчетным документам
//  ВидРасчетовСКонтрагентом	- <ПеречислениеСсылка.ВидыРасчетовСКонтрагентами>
//  ВидДвижения					- <ВидДвиженияНакопления>
//  Движения 					- <Коллекция движений или структура с соответствующими свойствами>
//								– Движения документа по регистрам (в т.ч. по регистру оперативных взаиморасчетов)
//  Отказ						- <Булево> – признак ошибки при проведения для остановки проведения документа
//  Заголовок					- <Строка> – Представление заголовка документа для использования при формировании сообщения об ошибках
//
Процедура ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ИмяТаблицыПлатежейИлиТаблица, ВидРасчетовСКонтрагентом, ВидДвижения, Движения, Отказ, Заголовок, ВыдаватьСообщенияОбОшибках = Истина) Экспорт
	
	Ссылка = СтруктураШапкиДокумента.Ссылка;
	МетаданныеДокумента = Ссылка.Метаданные();
	ИмяДокумента = МетаданныеДокумента.Имя;
	
	ПереданоИмяТаблицы =  ТипЗнч(ИмяТаблицыПлатежейИлиТаблица) = Тип("Строка");
	Если ПереданоИмяТаблицы Тогда // Таблицу платежей получаем запросом
		
		ИмяТаблицыПлатежей = ИмяТаблицыПлатежейИлиТаблица;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаПлатежей.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента) КАК ДоговорКонтрагентаПредставление,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.Сделка
		|	КОНЕЦ КАК Сделка,
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.Сделка
		|		КОНЕЦ) КАК СделкаПредставление,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|	КОНЕЦ КАК ДокументРасчетовСКонтрагентом,
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|		КОНЕЦ) КАК ДокументРасчетовСКонтрагентомПредставление,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов) КАК ВалютаВзаиморасчетовПредставление,
		|	СУММА(ТаблицаПлатежей.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|	МИНИМУМ(ТаблицаПлатежей.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ." + ИмяДокумента + "." + ИмяТаблицыПлатежей + " КАК ТаблицаПлатежей
		// Пример:
		//|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ТаблицаПлатежей
		|ГДЕ
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом = ИСТИНА
		|	И ТаблицаПлатежей.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПлатежей.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.Сделка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|	КОНЕЦ,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов),
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.Сделка
		|		КОНЕЦ),
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|		КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаПлатежей.СуммаПлатежа", "ТаблицаПлатежей.Сумма");
		КонецЕсли; 
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ПоДоговоруВЦелом", Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		
		РеквизитыМетаданныхТабЧастиДокумента = МетаданныеДокумента.ТабличныеЧасти[ИмяТаблицыПлатежей].Реквизиты;
		ТипыСделок = РеквизитыМетаданныхТабЧастиДокумента.Сделка.Тип.Типы();
		МассивПустыхСделок = Новый Массив;
		Для каждого Элемент Из ТипыСделок Цикл
			МассивПустыхСделок.Добавить(Новый(Элемент));
		КонецЦикла;
		
		ТипыРасчетныхДокументов = РеквизитыМетаданныхТабЧастиДокумента.ДокументРасчетовСКонтрагентом.Тип.Типы();
		МассивПустыхРасчетныхДокументов = Новый Массив;
		Для каждого Элемент Из ТипыРасчетныхДокументов Цикл
			МассивПустыхРасчетныхДокументов.Добавить(Новый(Элемент));
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ПустыеСделки",             МассивПустыхСделок);
		Запрос.УстановитьПараметр("ПустыеРасчетныеДокументы", МассивПустыхРасчетныхДокументов);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаПлатежей = Результат.Выгрузить();
		
	Иначе // Может быть передана готовая таблица платежей (например, для документа КорректировкаДолга)
		
		ПереданаТаблица =  ТипЗнч(ИмяТаблицыПлатежейИлиТаблица) = Тип("ТаблицаЗначений");
		Если НЕ ПереданаТаблица Тогда
			Возврат;
		КонецЕсли;
	
		ТаблицаПлатежей = ИмяТаблицыПлатежейИлиТаблица;
	
	КонецЕсли;
	
	ЗнакОстатка = ?(ВидДвижения = ВидДвиженияНакопления.Расход, 1, -1);
	
	// Определение состояния расчетов по документам
	
	Запрос = Новый Запрос;
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.ДоговорКонтрагента,
	|	Таб.Сделка,
	|	Таб.ДокументРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаПлатежей
	|ИЗ
	|	&ТаблицаПлатежей КАК Таб
	|ГДЕ 
	|	НЕ (Таб.ДокументРасчетовСКонтрагентом = &Ссылка)
	|		И НЕ (Таб.ДокументРасчетовСКонтрагентом = НЕОПРЕДЕЛЕНО)";
	
	Запрос.УстановитьПараметр("ТаблицаПлатежей", ТаблицаПлатежей);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		
		СтруктураПараметровБлокировки = Новый Структура(
			"ИмяТаблицы, ИсточникДанных, ИмяВременнойТаблицы", 
			"ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов", МенеджерВремТаблиц, "ТаблицаПлатежей");
		СтруктураЗначенийБлокировки   = Новый Структура(
			"ВидРасчетовСКонтрагентом, Организация", 
			ВидРасчетовСКонтрагентом, СтруктураШапкиДокумента.Организация);
		СтруктураИсточникаДанных      = Новый Структура(
			"ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом", 
			"ДоговорКонтрагента", "Сделка", "ДокументРасчетовСКонтрагентом");
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоДокументамОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыПоДокументамОстатки.Сделка,
	|	ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка КАК СуммаВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, 
	|		Организация = &Организация
	|			И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|			И (ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом) В (ВЫБРАТЬ ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом ИЗ ТаблицаПлатежей)) КАК ВзаиморасчетыПоДокументамОстатки
	|ГДЕ
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка > 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки";
	
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("ЗнакОстатка",ЗнакОстатка);
	
	ОстаткиПоРасчетам = Запрос.Выполнить().Выгрузить();
	
	ДвиженияРегистраОперативныхРасчетов = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов;
	
	Если СтруктураШапкиДокумента.Свойство("РежимПроведения") Тогда
		РежимПроведения = СтруктураШапкиДокумента.РежимПроведения;
	Иначе
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	ЗапрещатьПревышениеОстатков = РежимПроведения = РежимПроведенияДокумента.Оперативный;
	
	Для каждого СтрокаПлатежа Из ТаблицаПлатежей Цикл
		
		ЭтоПогашениеКредДокумента = СтрокаПлатежа.ДокументРасчетовСКонтрагентом <> Неопределено;
		
		Если ЭтоПогашениеКредДокумента Тогда
			
			ОтборПоОстаткам = Новый Структура("ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом", 
			СтрокаПлатежа.ДоговорКонтрагента, СтрокаПлатежа.Сделка, СтрокаПлатежа.ДокументРасчетовСКонтрагентом);
			
			СуммаВзаиморасчетовОстаток = 0;
			СтрокиОстатка = ОстаткиПоРасчетам.НайтиСтроки(ОтборПоОстаткам);
			Для каждого ОстатокАванса Из СтрокиОстатка Цикл
				СуммаВзаиморасчетовОстаток = СуммаВзаиморасчетовОстаток + СтрокиОстатка[0].СуммаВзаиморасчетов;
			КонецЦикла;
				
			Если   ВыдаватьСообщенияОбОшибках = Истина
				И СтрокаПлатежа.СуммаВзаиморасчетов > СуммаВзаиморасчетовОстаток Тогда
				
				ТекстСообщения = "Указана сумма взаиморасчетов, превышающая непогашенный остаток по документу расчетов с контрагентом!
				| Договор: " + СтрокаПлатежа.ДоговорКонтрагентаПредставление + 
				?(НЕ ЗначениеЗаполнено(СтрокаПлатежа.СделкаПредставление),", сделка не указана",", сделка: " + СтрокаПлатежа.СделкаПредставление)+ 
				", документ расчетов: " + СтрокаПлатежа.ДокументРасчетовСКонтрагентомПредставление + "; 
				| Остаток " + СуммаВзаиморасчетовОстаток + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление + "; "
				+ " указана сумма " + СтрокаПлатежа.СуммаВзаиморасчетов + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление + "; "
				+ " превышение " + (СтрокаПлатежа.СуммаВзаиморасчетов - СуммаВзаиморасчетовОстаток) + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление;
				
				Если ЗапрещатьПревышениеОстатков Тогда
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
					Возврат;
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , Заголовок);
				КонецЕсли;
			КонецЕсли;
			
			Движение = ДвиженияРегистраОперативныхРасчетов.Добавить();
			
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период	     = ДатаДвижений;
			
			Движение.ДоговорКонтрагента            = СтрокаПлатежа.ДоговорКонтрагента;
			Движение.Контрагент            		   = СтрокаПлатежа.ДоговорКонтрагента.Владелец;
			Движение.Организация            	   = СтрокаПлатежа.ДоговорКонтрагента.Организация;


			Движение.Сделка                        = СтрокаПлатежа.Сделка;
			Движение.ДокументРасчетовСКонтрагентом = СтрокаПлатежа.ДокументРасчетовСКонтрагентом;
			Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
			
			Движение.СуммаВзаиморасчетов = СтрокаПлатежа.СуммаВзаиморасчетов;
			
		Иначе
			
			// Делаем движение с указанием документа-регистратора в качестве документа расчетов 
			Движение = ДвиженияРегистраОперативныхРасчетов.Добавить();
			
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период      = ДатаДвижений;
			
			Движение.ДоговорКонтрагента            = СтрокаПлатежа.ДоговорКонтрагента;
			Движение.Контрагент            		   = СтрокаПлатежа.ДоговорКонтрагента.Владелец;
			Движение.Организация            	   = СтрокаПлатежа.ДоговорКонтрагента.Организация;

			Движение.Сделка                        = СтрокаПлатежа.Сделка;
			Движение.ДокументРасчетовСКонтрагентом = Ссылка;
			Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
			
			Движение.СуммаВзаиморасчетов = СтрокаПлатежа.СуммаВзаиморасчетов;
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры

Процедура ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                      ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
														  
	Если СтруктураПараметров.Свойство("ПроводитьПоВзаиморасчетам") И НЕ СтруктураПараметров.ПроводитьПоВзаиморасчетам Тогда
		ТаблицаПоВзаиморасчетам = Новый ТаблицаЗначений;
		ТаблицаПоРасчетам       = Новый ТаблицаЗначений;
		Возврат;
	КонецЕсли; 
	
	ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ТаблицаСделок = СформироватьТаблицуСделокДляПроведенияПоВзаиморасчетам(СтруктураПараметров, СтруктураШапкиДокумента);
	
	ТаблицаПоВзаиморасчетам = ПодготовитьТаблицуПоВзаиморасчетам(ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, ТаблицаСделок, Отказ, Заголовок);
	
	ТаблицаПоРасчетам = ПодготовитьТаблицуПоРасчетам(ТаблицаСделок, СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам()

Функция ПодготовитьТаблицуПоВзаиморасчетам(ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, ТаблицаСделокДокумента, Отказ, Заголовок)
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаСделок = ТаблицаСделокДокумента.Скопировать();
	Для каждого СтрокаСделки Из ТаблицаСделок Цикл
		Если СтрокаСделки.СуммаУпр = 0 Тогда
			СтрокаСделки.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаСделки.СуммаВзаиморасчетов, 
			                        СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
			                        СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		    	                    СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТаблицаСделок.ЗаполнитьЗначения(Неопределено, "Сделка");
		Иначе //.ПоСчетам
			ТаблицаСделок.ЗаполнитьЗначения(СтруктураШапкиДокумента["Сделка"], "Сделка");
		КонецЕсли;
		ТаблицаСделок.Свернуть("Сделка", "СуммаВзаиморасчетов, СуммаУпр");
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		
		ТаблицаПоВзаиморасчетам = ТаблицаСделок.Скопировать();
		
		Возврат ТаблицаПоВзаиморасчетам;
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		СделкаДляВзаиморасчетов = Неопределено;
	Иначе //.ПоСчетам или .ПоЗаказам (по заказам - если в ТЧ ДокументыРасчетовСКонтрагентом нет колонки Сделка)
		СделкаДляВзаиморасчетов = СтруктураШапкиДокумента["Сделка"];
	КонецЕсли;
	
	// Создаем колонки таблицы явным образом, а не загружаем таб.часть документа,
	// чтобы не устанавливалось ограничение типов колонок в соответствие с типом реквизитов документа
	ТаблицаПоВзаиморасчетам = Новый ТаблицаЗначений;
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
		|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), "Сделка");
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("ДокументРасчетовСКонтрагентом", Новый ОписаниеТипов(Документы.ТипВсеСсылки(), "Неопределено"), "ДокументРасчетовСКонтрагентом");
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("ДатаОплаты", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("СуммаУпр", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ЕстьРасчетыЗаТару = НЕ (ДокументОбъект.ДокументыРасчетовСКонтрагентом.ВыгрузитьКолонки().Колонки.Найти("ВозвратнаяТара") = Неопределено);
	
	Для каждого СтрокаТабЧасти Из ДокументОбъект.ДокументыРасчетовСКонтрагентом Цикл
		
		Если  ЕстьРасчетыЗаТару 
			И СтрокаТабЧасти.ВозвратнаяТара = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаТабЧасти);
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка) Тогда
			СтрокаВзаиморасчетов.Сделка = СделкаДляВзаиморасчетов;
		КонецЕсли;
		СтрокаВзаиморасчетов.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаВзаиморасчетов.СуммаВзаиморасчетов, 
		                                СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
	КонецЦикла;
	
	ЭтоВозврат = СтруктураПараметров.Свойство("ЭтоВозврат") И СтруктураПараметров.ЭтоВозврат;
	Если ЭтоВозврат Тогда
		ИзменитьЗнакКолонокТаблицы(ТаблицаПоВзаиморасчетам, Новый Структура("СуммаВзаиморасчетов, СуммаУпр"));
	КонецЕсли;
		
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		
		ВсегоСуммаВзаиморасчетов = ТаблицаСделок.Итог("СуммаВзаиморасчетов");
		ВсегоСуммаПредоплаты     = ТаблицаПоВзаиморасчетам.Итог("СуммаВзаиморасчетов");
		Если ВсегоСуммаВзаиморасчетов <> ВсегоСуммаПредоплаты Тогда
			СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
			
			СтрокаВзаиморасчетов.Сделка                        = СделкаДляВзаиморасчетов;
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = ДокументОбъект.Ссылка;
			
			СтрокаВзаиморасчетов.СуммаВзаиморасчетов = ВсегоСуммаВзаиморасчетов - ВсегоСуммаПредоплаты;
			СтрокаВзаиморасчетов.СуммаУпр            = ТаблицаСделок.Итог("СуммаУпр") - ТаблицаПоВзаиморасчетам.Итог("СуммаУпр");
		КонецЕсли; 
		
	Иначе //.ПоЗаказам
		
		// Рассчитаем неоплаченные суммы по каждой строке таблицы сделок
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			Для каждого СтрокаВзаиморасчетов Из ТаблицаПоВзаиморасчетам Цикл
				Если СтрокаСделки.Сделка = СтрокаВзаиморасчетов.Сделка Тогда
					СтрокаСделки.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
					СтрокаСделки.СуммаУпр            = СтрокаСделки.СуммаУпр - СтрокаВзаиморасчетов.СуммаУпр;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Теперь по каждой строке таблицы сделок, где предоплата не совпадает с реализацией (поступлением), 
		// добавляем строки в таблицу взаиморасчетов со ссылкой на проводимый документ
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			Если СтрокаСделки.СуммаВзаиморасчетов <> 0 Тогда
				СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаСделки);
				
				СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = ДокументОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Множитель = ?(ЭтоВозврат, -1, 1);
	Для каждого СтрокаВзаиморасчетов Из ТаблицаПоВзаиморасчетам Цикл
		
		Если СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель < 0 Тогда
			ПредставлениеСделки = ?(НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка), "не указана", Строка(СтрокаВзаиморасчетов.Сделка));
			ОбщегоНазначения.СообщитьОбОшибке("Указана сумма предоплаты (сделка: " + ПредставлениеСделки + ") больше возможной по документу на " 
			+ (-1 * СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель) + " " + СтруктураШапкиДокумента.ВалютаВзаиморасчетов, Отказ, Заголовок);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ТаблицаПоВзаиморасчетам;
	
КонецФункции // ПодготовитьТаблицуПоВзаиморасчетам()

Функция ПодготовитьТаблицуПоРасчетам(ТаблицаСделок, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если Отказ ИЛИ НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаПоРасчетам = ТаблицаСделок.Скопировать();
	
	УдаляемыеСтроки = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаПоРасчетам Цикл
		
		ДолжноБытьДвижениеПоРасчетам = НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) 
		                           ИЛИ (ТипЗнч(СтрокаТаблицы.Сделка) <> Тип("ДокументСсылка.ЗаказПокупателя") 
								     И ТипЗнч(СтрокаТаблицы.Сделка) <> Тип("ДокументСсылка.ЗаказПоставщику"));
		Если НЕ ДолжноБытьДвижениеПоРасчетам Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		ТаблицаПоРасчетам.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Для каждого СтрокаСделки Из ТаблицаПоРасчетам Цикл
		Если СтрокаСделки.СуммаУпр = 0 Тогда
			СтрокаСделки.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаСделки.СуммаВзаиморасчетов, 
				СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
				СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
				СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПоРасчетам;

КонецФункции

// Преобразует значение системного перечисления ВидСравнения в текст для запроса
//
// Параметры
//  СтруктураОтбора		–	<Структура>
//							Структура параметров отбора. Если есть элемент структуры с ключом "ВидСравненияОтбора",
//							значение этого элемента преобразуется в текст для запроса.
//							Необязательный элемент, по умолчанию ВидСравнения.Равно
//
// Возвращаемое значение:
//   <Строка> – текст сравнения для запроса
//
Функция ПолучитьВидСравненияДляЗапроса(СтруктураОтбора)

	Если НЕ СтруктураОтбора.Свойство("ВидСравненияОтбора") Тогда
		Возврат "=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Равно Тогда
		Возврат "=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеРавно Тогда
		Возврат "<>";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСписке Тогда
		Возврат "В";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСписке Тогда
		Возврат "НЕ В";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВИерархии Тогда
		Возврат "В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии Тогда
		Возврат "В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСпискеПоИерархии Тогда
		Возврат "НЕ В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВИерархии Тогда
		Возврат "НЕ В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Больше Тогда
		Возврат ">";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.БольшеИлиРавно Тогда
		Возврат ">=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Меньше Тогда
		Возврат "<";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.МеньшеИлиРавно Тогда
		Возврат "<=";
	Иначе // другие варианты 
		Возврат "=";
	КонецЕсли;

КонецФункции // ПолучитьВидСравненияДляЗапроса()

// Процедура формирует структуру с итоговыми данными взаиморасчетов по документу
Функция ПолучитьСтруктуруВзаиморасчетовПоДокументу(ДокументОбъект, СуммаВзаиморасчетовПоДокументу) Экспорт
	
	СтруктураВзаиморасчетов = Новый Структура;
	
	ТаблицаДокументов = ДокументОбъект.ДокументыРасчетовСКонтрагентом.Выгрузить();
	СтруктураВзаиморасчетов.Вставить("ПоДокументуВал", СуммаВзаиморасчетовПоДокументу);
	
	СтруктураВзаиморасчетов.Вставить("ПредоплатаВал", ТаблицаДокументов.Итог("СуммаВзаиморасчетов"));
	
	ОстатокВал = СуммаВзаиморасчетовПоДокументу - СтруктураВзаиморасчетов.ПредоплатаВал;
	СтруктураВзаиморасчетов.Вставить("ОстатокВал", ОстатокВал);
	
	Возврат СтруктураВзаиморасчетов;
	
КонецФункции

// Проверяет правильность заполнения строк табличной части "Документы расчетов с контрагентом".
//
// Параметры:
// Параметры: 
//  ДокументОбъект          - документ, табличная часть которого проверяется
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если Не Отказ И СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		
		// Укажем, что надо проверить:
		СтруктураОбязательныхПолей = Новый Структура("ДокументРасчетовСКонтрагентом, СуммаВзаиморасчетов");
		
		// Теперь вызовем общую процедуру проверки.
		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, "ДокументыРасчетовСКонтрагентом", СтруктураОбязательныхПолей, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом()

// Процедура заполняет поля СуммаВзаиморасчетов и Сумма
// в строке табличной части ДокументыРасчетовСКонтрагентом
// Параметры:
// СуммаВзаиморасчетовУказанаВСтроке - <Булево>. Если Истина - рассчитываем только сумму регл.учета
//                                     по указанной в строке сумме взаиморасчетов.
//                                     Если Ложь - рассчитываем обе суммы
//
Процедура РассчитатьПогашаемыеСуммыПоДокументуРасчетов(ДокументОбъект, ДанныеСтроки, СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Новый МоментВремени(СтруктураПараметров.Дата,ДокументОбъект.Ссылка));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДокументРасчетовСКонтрагентом", ДанныеСтроки.ДокументРасчетовСКонтрагентом);
	
	Если СтруктураПараметров.Свойство("ЭтоВозврат") Тогда
		МножительВозврата = ?(СтруктураПараметров.ЭтоВозврат, -1, 1);
	Иначе
		МножительВозврата = 1;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МножительВозврата", МножительВозврата);
	
	ОплатаПоНесколькимСделкам = Ложь;
	Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		
		ТекСделка = Неопределено;
		
		Если СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
				
			Субконто = новый Массив();
			Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
			Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
			Запрос.УстановитьПараметр("Субконто", Субконто);
			
			Если ДанныеСтроки.ВозвратнаяТара Тогда
				Запрос.УстановитьПараметр("Счет", СтруктураПараметров.СчетУчетаРасчетовПоТареПоАвансам);
			Иначе
				Запрос.УстановитьПараметр("Счет", СтруктураПараметров.СчетУчетаРасчетовПоАвансам);	
			КонецЕсли;
			
			Если СтруктураПараметров.Направление = "Реализация" Тогда
				
				ИмяРегистраНал = "ПродажиНалоговыйУчет";
				ДопУсловияНал  = " И СтавкаНДС = &СтавкаНДС";
				СобытиеОплата   = Перечисления.СобытияПродажиНалоговыйУчет.ОплатаПокупателем;
				СобытиеОтгрузка = Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю;
				
				Если МножительВозврата = -1 Тогда
					// возврат
					СторонаСчетБУ = "Дт";
				Иначе
					// отгрузка					
					СторонаСчетБУ = "Кт";
				КонецЕсли; 
				
			Иначе
				
				ИмяРегистраНал = "ПриобретенияНалоговыйУчет";
				ДопУсловияНал  = " И Амортизируется = &Амортизируется
								|  И ДляХозяйственнойДеятельности = &ДляХозяйственнойДеятельности
								|  И ВидДеятельностиНДС = &ВидДеятельностиНДС
								|  И СтавкаНДС= &СтавкаНДС"; 
								
				Запрос.УстановитьПараметр("Амортизируется", 			  ДанныеСтроки.Амортизируется);				
				Запрос.УстановитьПараметр("ВидДеятельностиНДС", 		  ДанныеСтроки.НалоговоеНазначение.ВидДеятельностиНДС);				
				Запрос.УстановитьПараметр("ДляХозяйственнойДеятельности", НЕ (ДанныеСтроки.НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая));				
								
				СобытиеОплата   = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
				СобытиеОтгрузка = Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика;
				Если МножительВозврата = -1 Тогда
					// возврат
					СторонаСчетБУ = "Кт";
				Иначе
					// отгрузка					
					СторонаСчетБУ = "Дт";
				КонецЕсли; 
			КонецЕсли;
		    Запрос.УстановитьПараметр("СобытиеОплата",   СобытиеОплата);
			Запрос.УстановитьПараметр("СобытиеОтгрузка", СобытиеОтгрузка);
			Запрос.УстановитьПараметр("СтавкаНДС",       ДанныеСтроки.СтавкаНДС);
			Запрос.УстановитьПараметр("ВозвратнаяТара", ДанныеСтроки.ВозвратнаяТара);	
			Если ДанныеСтроки.ВозвратнаяТара Тогда
				// достаточно фильтра по Возвратной таре
				ДопУсловияНал = "";
			КонецЕсли;

		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		ТекСделка = ДокументОбъект.Сделка;
	Иначе //.ПоЗаказам
		Если СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
			ТекСделка = ДанныеСтроки.Сделка;
			ОплатаПоНесколькимСделкам = Истина;
		Иначе
			ТекСделка = ДокументОбъект.Сделка;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Сделка", ТекСделка);
	
	Если СтруктураПараметров.Направление = "Реализация" Тогда
		МножительНаправления = -1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	ИначеЕсли СтруктураПараметров.Направление = "Поступление" Тогда
		МножительНаправления = 1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	Иначе
		МножительНаправления= 1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	Множитель = МножительНаправления * МножительВозврата;
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("Множитель", Множитель);
	
	Запрос.Текст = 
	"
	|ВЫБРАТЬ
	|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток, 0) * &Множитель > 0
	|			ТОГДА ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	0	  КАК СуммаВзаиморасчетовБух,
	|	0     КАК СуммаВзаиморасчетовНал
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|		&Дата,
	|		ДоговорКонтрагента = &ДоговорКонтрагента
	|		    И Сделка = &Сделка
	|		    И ДокументРасчетовСКонтрагентом = &ДокументРасчетовСКонтрагентом
	|		    И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом) КАК ВзаиморасчетыПоДокументамОстатки
	|";
	
	Если  СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл
		И СтруктураПараметров.ОтражатьВБухгалтерскомУчете Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	0	  КАК СуммаВзаиморасчетов,
		|	ОстаткиБух.СуммаОстаток"+СторонаСчетБУ+" КАК СуммаВзаиморасчетовБух,
		|	0  КАК СуммаВзаиморасчетовНал
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		&Дата, Счет = &Счет, &Субконто,
		|			  Субконто1 = &ДоговорКонтрагента
		|		    И Субконто2 = &ДокументРасчетовСКонтрагентом ) КАК ОстаткиБух
		|";
		
	КонецЕсли;
	
	Если     СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл 
		И    СтруктураПараметров.ОтражатьВБухгалтерскомУчете 
		И Не СтруктураПараметров.СложныйНалоговыйУчет Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	0	  КАК СуммаВзаиморасчетов,
		|	0	  КАК СуммаВзаиморасчетовБух,
		|	СУММА(ВЫБОР КОГДА  Событие = &СобытиеОплата ТОГДА ОстаткиНал.СуммаВзаиморасчетовОстаток ИНАЧЕ - ОстаткиНал.СуммаВзаиморасчетовОстаток КОНЕЦ) * &МножительВозврата КАК СуммаВзаиморасчетовНал
		|ИЗ
		|	РегистрНакопления."+ИмяРегистраНал+".Остатки(
		|		&Дата,
		|			  ДоговорКонтрагента = &ДоговорКонтрагента
		|		    И Сделка = &ДокументРасчетовСКонтрагентом
		|			И (Событие = &СобытиеОплата ИЛИ Событие = &СобытиеОтгрузка)
		|			И ВозвратнаяТара = &ВозвратнаяТара
		|			"+ ДопУсловияНал + ") КАК ОстаткиНал
		|";
	
	КонецЕсли;
	
    Запрос.Текст = Запрос.Текст + "
	| ИТОГИ Сумма(СуммаВзаиморасчетов), Сумма(СуммаВзаиморасчетовБух), Сумма(СуммаВзаиморасчетовНал), МАКСИМУМ(ДоговорКонтрагента) 
	| ПО ОБЩИЕ
	|";

	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	
	// приведем все суммы из запроса к валюте документа:
	Если СтруктураПараметров.Внешнеэкономический Тогда
		СуммаНал = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаВзаиморасчетовНал, 
									СтруктураПараметров.ВалютаВзаиморасчетов, СтруктураПараметров.ВалютаДокумента,
									СтруктураПараметров.КурсВзаиморасчетов, СтруктураПараметров.КурсДокумента, 
									СтруктураПараметров.КратностьВзаиморасчетов, СтруктураПараметров.КратностьДокумента);
	Иначе	
		СуммаНал = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаВзаиморасчетовНал, 
									ДокументОбъект.мВалютаРегламентированногоУчета, СтруктураПараметров.ВалютаДокумента,
									1, СтруктураПараметров.КурсДокумента, 
									1, СтруктураПараметров.КратностьДокумента);
	КонецЕсли;
	Если СуммаНал < 0 Тогда
		СуммаНал = 0;
	КонецЕсли;		
									
	СуммаБух = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаВзаиморасчетовБух, 
									ДокументОбъект.мВалютаРегламентированногоУчета, СтруктураПараметров.ВалютаДокумента,
									1, СтруктураПараметров.КурсДокумента, 
									1, СтруктураПараметров.КратностьДокумента);
	Если СуммаБух < 0 Тогда
		СуммаБух = 0;
	КонецЕсли;								
									
	СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаВзаиморасчетов, 
									СтруктураПараметров.ВалютаВзаиморасчетов, СтруктураПараметров.ВалютаДокумента,
									СтруктураПараметров.КурсВзаиморасчетов, СтруктураПараметров.КурсДокумента, 
									СтруктураПараметров.КратностьВзаиморасчетов, СтруктураПараметров.КратностьДокумента);
	
							
	
	ДанныеСтроки.Сумма          	 = 0;
	ДанныеСтроки.СуммаВзаиморасчетов = 0;
	
	ТаблицаСделокДокумента = СтруктураПараметров.ТаблицаСделок;
	ТаблицаСделокДокумента.Индексы.Добавить("Сделка");
	Если НЕ ОплатаПоНесколькимСделкам Тогда
		Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТаблицаСделокДокумента.ЗаполнитьЗначения(Неопределено, "Сделка");
		Иначе
			ТаблицаСделокДокумента.ЗаполнитьЗначения(ДокументОбъект.Сделка, "Сделка");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Сделка", ТекСделка);
	Если СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		СтруктураПоиска.Вставить("ВозвратнаяТара", ДанныеСтроки.ВозвратнаяТара);
	КонецЕсли;
	Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		
		Если Не ДанныеСтроки.ВозвратнаяТара Тогда
			СтруктураПоиска.Вставить("СтавкаНДС", ДанныеСтроки.СтавкаНДС);
			Если СтруктураПараметров.Направление = "Поступление" Тогда
				СтруктураПоиска.Вставить("НалоговоеНазначение", ДанныеСтроки.НалоговоеНазначение);
				СтруктураПоиска.Вставить("Амортизируется", ДанныеСтроки.Амортизируется);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокиТекущейСделки = ТаблицаСделокДокумента.НайтиСтроки(СтруктураПоиска);
	Если СтрокиТекущейСделки.Количество() > 0 Тогда
		
		СуммаДокументаПоСделке = 0;
		Для каждого СтрокаТаблицыСделок Из СтрокиТекущейСделки Цикл
			СуммаДокументаПоСделке = СуммаДокументаПоСделке + СтрокаТаблицыСделок.Сумма;	
		КонецЦикла; 
		
		СуммаПредоплатыПоСделке = 0;
		СтрокиПредоплатыПоСделке = ДокументОбъект.ДокументыРасчетовСКонтрагентом.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаПредоплатыПоСделке Из СтрокиПредоплатыПоСделке Цикл
			СуммаПредоплатыПоСделке = СуммаПредоплатыПоСделке + СтрокаПредоплатыПоСделке.Сумма;
		КонецЦикла;
		ОстСумма = СуммаДокументаПоСделке - СуммаПредоплатыПоСделке;
		
		// закрываем суммы исходя из приортиета НАЛ > Бух > УПР.
		// сделано для того, чтобы при отсутствии причин для расхождения между учетами расхождения не возникали.
		Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
			И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
			И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			
			ПогашаемаяСумма = Мин(СуммаНал, ОстСумма); 
			ПогашаемаяСуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ПогашаемаяСумма, 
												СтруктураПараметров.ВалютаДокумента,    СтруктураПараметров.ВалютаВзаиморасчетов,
												СтруктураПараметров.КурсДокумента,      СтруктураПараметров.КурсВзаиморасчетов,
												СтруктураПараметров.КратностьДокумента, СтруктураПараметров.КратностьВзаиморасчетов);
			
		ИначеЕсли СтруктураПараметров.ОтражатьВБухгалтерскомУчете
			 И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			 
			 ПогашаемаяСумма = Мин(СуммаБух, ОстСумма); 
			 ПогашаемаяСуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ПогашаемаяСумма, 
												СтруктураПараметров.ВалютаДокумента,    СтруктураПараметров.ВалютаВзаиморасчетов,
												СтруктураПараметров.КурсДокумента,      СтруктураПараметров.КурсВзаиморасчетов,
												СтруктураПараметров.КратностьДокумента, СтруктураПараметров.КратностьВзаиморасчетов);
			 
		Иначе

			ПогашаемаяСумма = Мин(СуммаУпр, ОстСумма);
			Если ПогашаемаяСумма = СуммаУпр Тогда
				ПогашаемаяСуммаВзаиморасчетов	= Выборка.СуммаВзаиморасчетов;
			ИначеЕсли СуммаУпр = 0 Тогда
				ПогашаемаяСуммаВзаиморасчетов	= 0;
			Иначе	
				ПогашаемаяСуммаВзаиморасчетов	= Выборка.СуммаВзаиморасчетов / СуммаУпр * ПогашаемаяСумма;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеСтроки.Сумма = ПогашаемаяСумма;
		
		ДанныеСтроки.СуммаВзаиморасчетов = ПогашаемаяСуммаВзаиморасчетов;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуСделок(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = СтруктураПараметров.СуммаВключаетНДС;
	ИначеЕсли ДокументОбъект.Метаданные().Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено Тогда
		СуммаВключаетНДС = ДокументОбъект.СуммаВключаетНДС;
	Иначе
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	
	КолонкиСуммирования = "Сумма, СуммаНДС";
	
	МогутБытьЗаказыВТабличныхЧастях = СтруктураПараметров.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	Если МогутБытьЗаказыВТабличныхЧастях 
		И СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
		ЕстьЗаказыВТабличныхЧастях = Истина;
		ИмяКолонкиСделка = СтруктураПараметров.ИмяЗаказаВТабличныхЧастях;
	Иначе
		ЕстьЗаказыВТабличныхЧастях = Ложь;
		ИмяКолонкиСделка = "Сделка";	
	КонецЕсли;
	
	ТаблицаСделок = Новый ТаблицаЗначений;
	ТаблицаСделок.Колонки.Добавить(ИмяКолонкиСделка);
	ТаблицаСделок.Колонки.Добавить("Сумма");
	ТаблицаСделок.Колонки.Добавить("СуммаНДС");
	
	КолонкиРеглРазрезов = "";
	КолонкиРеглРазрезовТара = "";
	Если СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
	
		КолонкиРеглРазрезов = ",ВозвратнаяТара";	
		ТаблицаСделок.Колонки.Добавить("ВозвратнаяТара", Новый ОписаниеТипов("Булево"));
	
	КонецЕсли;
	
	Если     СтруктураПараметров.ОтражатьВБухгалтерскомУчете
		И НЕ СтруктураПараметров.СложныйНалоговыйУчет 
		И    СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		
		КолонкиРеглРазрезов = КолонкиРеглРазрезов + ",СтавкаНДС";	
		ТаблицаСделок.Колонки.Добавить("СтавкаНДС");
		Если СтруктураПараметров.Направление = "Поступление" Тогда
			КолонкиРеглРазрезов 	= КолонкиРеглРазрезов + ",НалоговоеНазначение,Амортизируется";	
			Если НЕ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре") Тогда
				КолонкиРеглРазрезовТара = КолонкиРеглРазрезовТара + ",НалоговоеНазначение";
			КонецЕсли; 
			ТаблицаСделок.Колонки.Добавить("НалоговоеНазначение");
			ТаблицаСделок.Колонки.Добавить("Амортизируется");
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ИмяСделкиВШапкеДокумента") Тогда
		ИмяСделкиВШапкеДокумента = "Сделка";
	Иначе // Например, для документа ПолучениеУслугПоПереработке это "Заказ"
		ИмяСделкиВШапкеДокумента = СтруктураПараметров.ИмяСделкиВШапкеДокумента;
	КонецЕсли;
	
	КолонкиДопРасходов = "";
	КолонкаБазиса = "";
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходов") И ДокументОбъект.Сумма <> 0 Тогда
		
		КолонкаБазиса       = ?( ДокументОбъект.СпособРаспределения = Перечисления.СпособыРаспределенияДопРасходов.ПоВесу,       "Вес",
							  ?( ДокументОбъект.СпособРаспределения = Перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству, "Количество", "СуммаТовара"));;
							  
		Если КолонкаБазиса = "Вес" Тогда
			КолонкиДопРасходов = ",ЕдиницаИзмерения, Вес";
			ТаблицаСделок.Колонки.Добавить("Вес");
		Иначе	
			КолонкиДопРасходов = "," + КолонкаБазиса;
		КонецЕсли;								  
		ТаблицаСделок.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаСделок.Колонки.Добавить("Количество");
		ТаблицаСделок.Колонки.Добавить("СуммаТовара");
		
	КонецЕсли;
	
	Для каждого ТабЧасть Из СтруктураПараметров.СтруктураТабличныхЧастей Цикл
	
		ТекТабЧасть = ДокументОбъект[ТабЧасть.Ключ].Выгрузить();
		ТекТабЧасть.Колонки.Добавить("ВозвратнаяТара");		         
		
		Если НЕ ЕстьЗаказыВТабличныхЧастях ИЛИ ТекТабЧасть.Колонки.Найти(ИмяКолонкиСделка) = Неопределено Тогда
			Если ТекТабЧасть.Колонки.Найти(ИмяКолонкиСделка) = Неопределено Тогда
				ТекТабЧасть.Колонки.Добавить(ИмяКолонкиСделка);
			КонецЕсли;
			ТекТабЧасть.ЗаполнитьЗначения(ДокументОбъект[ИмяСделкиВШапкеДокумента], ИмяКолонкиСделка);
		КонецЕсли;
		
		Если СтруктураПараметров.Направление = "Поступление" Тогда
		    ТекТабЧасть.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));	
		КонецЕсли;
		ЗаполнениеПризнакаАмортизируется = ТабЧасть.Значение;
		Если ЗначениеЗаполнено(ЗаполнениеПризнакаАмортизируется) Тогда
			
			Если ЗаполнениеПризнакаАмортизируется = Истина Тогда
				ТекТабЧасть.ЗаполнитьЗначения(ЗаполнениеПризнакаАмортизируется, "Амортизируется");
			ИначеЕсли ТипЗнч(ЗаполнениеПризнакаАмортизируется) = Тип("Строка") Тогда
				
				Если ВРЕГ(Лев(ЗаполнениеПризнакаАмортизируется, 7)) = ВРЕГ("Ссылка.") Тогда
				     СчетЗатрат = ДокументОбъект[Сред(ЗаполнениеПризнакаАмортизируется, 8)];
					 ХарактерЗатратНУ = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат, Неопределено);
					 ТекТабЧасть.ЗаполнитьЗначения((ХарактерЗатратНУ  = "Строительство"), "Амортизируется");
				Иначе	
					Для каждого СтрокаТабЧасти Из ТекТабЧасть Цикл
						ХарактерЗатратНУ = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СтрокаТабЧасти[ЗаполнениеПризнакаАмортизируется], Неопределено);
						СтрокаТабЧасти.Амортизируется = (ХарактерЗатратНУ  = "Строительство");
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
			ТекТабЧасть.Колонки.Добавить("СтавкаНДС");
			ТекТабЧасть.ЗаполнитьЗначения(ДокументОбъект["СтавкаНДС"], "СтавкаНДС");
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеНМА") Тогда
			ТекТабЧасть.Колонки.Добавить("НалоговоеНазначение");
			Для каждого СтрокаТабЧасти Из ТекТабЧасть Цикл
				СтрокаТабЧасти.НалоговоеНазначение = СтрокаТабЧасти.НематериальныйАктив.НалоговоеНазначение;
			КонецЦикла;
		КонецЕсли;
		
		ТекТабЧасть.Свернуть(ИмяКолонкиСделка+КолонкиРеглРазрезов+КолонкиДопРасходов, КолонкиСуммирования);
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТекТабЧасть, ТаблицаСделок);
	
	КонецЦикла;
	
	// В шапке документа "Поступление доп. расходов" может быть указана дополнительная сумма,
	// которую надо провести по взаиморасчетам
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходов") И ДокументОбъект.Сумма <> 0 Тогда 
		СуммаКРаспредлению = ДокументОбъект.Сумма;	
		СуммаКРаспредлению = СуммаКРаспредлению + ?(ДокументОбъект.СуммаВключаетНДС, 0, ДокументОбъект.СуммаНДС);
		
		Если КолонкаБазиса = "Вес" Тогда
			Для каждого СтрокаТаблицы из ТаблицаСделок Цикл
				СтрокаТаблицы.Вес = СтрокаТаблицы.ЕдиницаИзмерения.Вес * СтрокаТаблицы.Количество;
			КонецЦикла;
		КонецЕсли;
		
		БазисРаспределения = ТаблицаСделок.ВыгрузитьКолонку(КолонкаБазиса);
		ИтогРаспределения  = ОбщегоНазначения.РаспределитьПропорционально(СуммаКРаспредлению,БазисРаспределения);
		
		Если НЕ ИтогРаспределения = Неопределено Тогда
			Для к= 0 По ТаблицаСделок.Количество() - 1 Цикл
				ТаблицаСделок[к].Сумма = ТаблицаСделок[к].Сумма + ИтогРаспределения[К];
		    КонецЦикла
		КонецЕсли;	
	КонецЕсли;
	
	Для каждого ТабЧасть Из СтруктураПараметров.СтруктураТабличныхЧастейТара Цикл
	
		ТекТабЧасть = ДокументОбъект[ТабЧасть.Ключ].Выгрузить();
		Если НЕ ЕстьЗаказыВТабличныхЧастях Тогда
			Если ТекТабЧасть.Колонки.Найти(ИмяКолонкиСделка) = Неопределено Тогда
				ТекТабЧасть.Колонки.Добавить(ИмяКолонкиСделка);
			КонецЕсли;
			ТекТабЧасть.ЗаполнитьЗначения(ДокументОбъект[ИмяСделкиВШапкеДокумента], ИмяКолонкиСделка);
		КонецЕсли;
		ТекТабЧасть.Свернуть(ИмяКолонкиСделка+КолонкиРеглРазрезовТара, "Сумма");
		ТекТабЧасть.Колонки.Добавить("ВозвратнаяТара");
		ТекТабЧасть.ЗаполнитьЗначения(Истина, "ВозвратнаяТара");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТекТабЧасть, ТаблицаСделок);
	
	КонецЦикла;
	
	ТаблицаСделок.Свернуть(ИмяКолонкиСделка+КолонкиРеглРазрезов, КолонкиСуммирования);
	
	ТаблицаСделок.Колонки[ИмяКолонкиСделка].Имя = "Сделка";
	ТаблицаСделок.Колонки.Добавить("СуммаВзаиморасчетов");
	
	Для каждого СтрокаТаблицы из ТаблицаСделок Цикл
		
		Если НЕ СуммаВключаетНДС Тогда
			СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС;
		КонецЕсли;
			
		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, 
		                                    СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаВзаиморасчетов,
		                                    СтруктураПараметров.КурсДокумента, СтруктураПараметров.КурсВзаиморасчетов, 
		                                    СтруктураПараметров.КратностьДокумента, СтруктураПараметров.КратностьВзаиморасчетов);
	КонецЦикла;
	
	Возврат ТаблицаСделок;
	
КонецФункции

Функция СформироватьТаблицуСделокДляПроведенияПоВзаиморасчетам(СтруктураПараметров, СтруктураШапкиДокумента) 
	
	МогутБытьЗаказыВТабличныхЧастях = СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	Если МогутБытьЗаказыВТабличныхЧастях 
		И СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
		ЕстьЗаказыВТабличныхЧастях = Истина;
		ИмяКолонкиСделка = СтруктураПараметров.ИмяЗаказаВТабличныхЧастях;
	Иначе
		ЕстьЗаказыВТабличныхЧастях = Ложь;
		ИмяКолонкиСделка = "Сделка";
	КонецЕсли;
	
	ТаблицаСделок = Новый ТаблицаЗначений;
	ТаблицаСделок.Колонки.Добавить(ИмяКолонкиСделка, Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
		|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), ИмяКолонкиСделка);
	
	ОбщиеЧисловыеКолонки = "СуммаВзаиморасчетов, СуммаУпр";
	Если СтруктураШапкиДокумента.ВидДокумента = "ПоступлениеДопРасходов" Тогда
		ДопЧисловыеКолонки = "СуммаВзаиморасчетовРаспределения, ";
	КонецЕсли;
	ЧисловыеКолонки = ОбщиеЧисловыеКолонки + ", " + ДопЧисловыеКолонки;
	СтруктураЧисловыхКолонок = Новый Структура(ЧисловыеКолонки);
	Для каждого ЧисловаяКолонка Из СтруктураЧисловыхКолонок Цикл
		ТаблицаСделок.Колонки.Добавить(ЧисловаяКолонка.Ключ, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	КонецЦикла;
	
	Если НЕ СтруктураПараметров.Свойство("ИмяСделкиВШапкеДокумента") Тогда
		ИмяСделкиВШапкеДокумента = "Сделка";
	Иначе // Например, для некоторых документов это может быть "Заказ"
		ИмяСделкиВШапкеДокумента = СтруктураПараметров.ИмяСделкиВШапкеДокумента;
	КонецЕсли;
	
	Для каждого ПодготовленнаяТаблица Из СтруктураПараметров.СтруктураПодготовленныхТаблиц Цикл
		
		ИмяТаблицы = ПодготовленнаяТаблица.Ключ;
		Таблица    = ПодготовленнаяТаблица.Значение;
		
		Для каждого СтрокаТаблицы Из Таблица Цикл
			СтрокаСделки = ТаблицаСделок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСделки, СтрокаТаблицы);
			Если НЕ ЕстьЗаказыВТабличныхЧастях Тогда
				СтрокаСделки[ИмяКолонкиСделка] = СтруктураШапкиДокумента[ИмяСделкиВШапкеДокумента];
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидДокумента = "ПоступлениеДопРасходов" Тогда
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			СтрокаСделки.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов + СтрокаСделки.СуммаВзаиморасчетовРаспределения;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаСделок.Свернуть(ИмяКолонкиСделка, ОбщиеЧисловыеКолонки);
	
	ТаблицаСделок.Колонки[ИмяКолонкиСделка].Имя = "Сделка";
	
	Возврат ТаблицаСделок;
	
КонецФункции

// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или пустая ссылка
//
// Параметры
//  ВладелецДоговора	–	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  ОрганизацияДоговора	–	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	–	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоровКонтрагентов> 
//							Нужные виды договора
//  СтруктураПараметров	–	<Структура>
//							Структура дополнительных параметров отбора договоров по реквизитам.
//							Элементы структуры СтруктураПараметров:
//							Ключ - имя реквизита договора, Значение - еще одна структура
//							
//							Элементы структуры, которая находится в Значение:
//							Ключ - "ЗначениеОтбора", Значение - значение реквизита договора для отбора. Обязательный элемент.
//							Ключ - "ВидСравненияОтбора", Значение - <ВидСравнения>. Необязательный элемент, по умолчанию ВидСравнения.Равно
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> – найденный счет или пустая ссылка
//
Функция УстановитьДоговорКонтрагента(ДоговорКонтрагента,ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора=неопределено, СтруктураПараметров = Неопределено) Экспорт

	НовыйДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка,
	|	ВЫБОР
	|		КОГДА СправочникВладелец.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникВладелец
	|		ПО ДоговорыКонтрагентов.Владелец = СправочникВладелец.Ссылка
	|			И ДоговорыКонтрагентов.Ссылка = СправочникВладелец.ОсновнойДоговорКонтрагента
	|ГДЕ
	|	&ТекстФильтра
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ВладелецДоговора", ВладелецДоговора);
	Запрос.УстановитьПараметр("ОрганизацияДоговора", ОрганизацияДоговора);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	ТекстФильтра = "
	|	ДоговорыКонтрагентов.Владелец = &ВладелецДоговора
	|	И ДоговорыКонтрагентов.Организация = &ОрганизацияДоговора
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ"
	+?(СписокВидовДоговора<>неопределено,"
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)","");
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Для каждого Параметр Из СтруктураПараметров Цикл
			ИмяРеквизита = Параметр.Ключ;
			СтруктураОтбора = Параметр.Значение;
			ВидСравненияЗапроса = ПолучитьВидСравненияДляЗапроса(СтруктураОтбора);
			ТекстФильтра = ТекстФильтра + "
			|	И ДоговорыКонтрагентов." + ИмяРеквизита + " " + ВидСравненияЗапроса + " (&" + ИмяРеквизита + ")";
			Запрос.УстановитьПараметр(ИмяРеквизита, СтруктураОтбора.ЗначениеОтбора);
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстФильтра", ТекстФильтра);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НайденОсновнойДоговор = Выборка.Приоритет = 1;
		НайденОдинДоговор     = Выборка.Количество() = 1;
		
		Если НайденОсновнойДоговор ИЛИ НайденОдинДоговор Тогда
			НовыйДоговор = Выборка.Ссылка;
		КонецЕсли;
	
	КонецЕсли;
	
	Если (ДоговорКонтрагента.Владелец<>ВладелецДоговора ИЛИ ДоговорКонтрагента.Организация<>ОрганизацияДоговора) ИЛИ (не ЗначениеЗаполнено(ДоговорКонтрагента)) Тогда	
		ДоговорКонтрагента = НовыйДоговор;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьДоговорКонтрагента()

Процедура УстановитьНадписьОВеденииВзаиморасчетовПоДокументамРасчетов(ЭлементыФормы, 
																		ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете, 
																		ВестиПоДокументамРасчетовСКонтрагентом, ВестиПоДокументамРасчетовСКонтрагентомРегл,
																		СложныйНалоговыйУчет) Экспорт
	
	ВсеУчеты = Истина;
	
	ИнфНадпись = "Взаиморасчеты по расчетным документам ведутся в: ";
	
	Если ОтражатьВУправленческомУчете Тогда
		Если ВестиПоДокументамРасчетовСКонтрагентом Тогда
			ИнфНадпись = ИнфНадпись + "упр.,";
		Иначе
			ВсеУчеты = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		Если ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			ИнфНадпись = ИнфНадпись + "бух.,";
		Иначе
			ВсеУчеты = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	Если Прав(ИнфНадпись,1) = "," Тогда
		ИнфНадпись = Лев(ИнфНадпись, СтрДлина(ИнфНадпись) - 1);	
	КонецЕсли;
	ИнфНадпись = ИнфНадпись + " учете";
	
	ЭлементыФормы.ИнфНадписьВестиПоРасчетнымДокументам.Заголовок = ИнфНадпись;
	Если НЕ ВсеУчеты Тогда
		ЭлементыФормы.ИнфНадписьВестиПоРасчетнымДокументам.ЦветТекста = WebЦвета.Красный;
	Иначе
		ЭлементыФормы.ИнфНадписьВестиПоРасчетнымДокументам.ЦветТекста = WebЦвета.DarkGreen;
	КонецЕсли;

КонецПроцедуры
 