
Процедура СформироватьНаименование()
	Наименование = "";
	Если ЗначениеЗаполнено(Объект.Улица.Наименование) тогда
		Наименование = Объект.Улица.Наименование;
		Если ЗначениеЗаполнено(Объект.Дом) тогда
			Наименование = Наименование + ", "  + Объект.Дом;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Объект.Квартира) тогда
			Наименование = Наименование + ", кв."  + Объект.Квартира;
		КонецЕсли;	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Комментарий) тогда
		Наименование = СокрЛП(Наименование) + ?(СокрЛП(Наименование) = "", "", " ") + "(" + СокрЛП(Объект.Комментарий) + ")"
	КонецЕсли;	
	Объект.Наименование = СокрЛП(Наименование);
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Ф = ПолучитьФорму("Справочник.ЛМ_Улицы.Форма.ФормаВыбора", Новый Структура("Владелец",ГлКонтрагентАдресаДоставки),Элемент);
	Ф.Владелец = ГлКонтрагентАдресаДоставки; 
	Ф.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонецПроцедуры

&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
			Объект.Владелец = ГлКонтрагентАдресаДоставки;
		КонецЕсли;
	КонецПроцедуры
