
&НаСервере
Процедура ВыполнитьОбменНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ВыполнитьОбменКонтактнойИнформацией();
	Сообщить(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлючОбработки = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	Объект.ПолныйАдресРесурса =  ХранилищеОбщихНастроек.Загрузить(КлючОбработки, "ПолныйАдресРесурса", , "ПолныйАдресРесурса");	 
КонецПроцедуры

&Насервере
Процедура СохранитьНастройкиСервер()
	КлючОбработки = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	ХранилищеОбщихНастроек.Сохранить(КлючОбработки,"ПолныйАдресРесурса",Объект.ПолныйАдресРесурса,,"ПолныйАдресРесурса");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	СохранитьНастройкиСервер();
КонецПроцедуры
