
функция ПолучитьМассивУзлов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Б_ОбменССайтом.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.Б_ОбменССайтом КАК Б_ОбменССайтом
	|ГДЕ
	|	(Б_ОбменССайтом.Ссылка <> &ЭтотУзел)	
	|";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.Б_ОбменССайтом.ЭтотУзел());
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивУзлов; 
	
КонецФункции

Функция ПолучитьПараметрыСоединения() Экспорт
   Структура = Новый Структура("Тип, Сервер, База, Файл, Строка"); 
    
   СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); 
   Структура.Строка = СтрокаСоединения; 
    
   СтрокаСоединения = СтрЗаменить(СтрокаСоединения, ";", Символы.ПС); 
    
   Стр1 = СтрПолучитьСтроку(СтрокаСоединения, 1); 
   Стр2 = СтрПолучитьСтроку(СтрокаСоединения, 2); 
    
   Если Лев(Стр1, 4) = "Srvr" Тогда 
       Структура.Тип = "Сервер"; 
       Структура.Сервер = Сред(Стр1, 7, СтрДлина(Стр1) - 7); 
       Структура.База = Сред(СтрПолучитьСтроку(СтрокаСоединения, 2), 6, СтрДлина(Стр2) - 6); 
   Иначе 
       Структура.Тип = "Файл"; 
       Структура.Файл = Сред(Стр1, 6, СтрДлина(Стр1) - 6); 
   КонецЕсли;     
    
   Возврат Структура; 
КонецФункции 

Функция ПолучитьПредопределенныйИдОбъекта(ИдОбъекта) Экспорт  //язык проверяем отдельно, т.к. есть ситуции, когда локализация не поможет
	
	Локализация = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьЛокализациюКонфигурации();
	
	Если ИдОбъекта = "ИдСвойстваФискальныйПризнак" и Локализация = "RUS" тогда
		Результат = "FISCAL_SIGN";	
	ИначеЕсли ИдОбъекта = "ИдСвойствАдресСайта" и Локализация = "RUS" тогда
		Результат = "URL";	
	ИначеЕсли ИдОбъекта = "ИдСвойствРегНомерККТ" и Локализация = "RUS" тогда
		Результат = "REG_NUMBER_KKT";	
	ИначеЕсли ИдОбъекта = "ИдСвойствПечатьЧека" и Локализация = "RUS" тогда
		Результат = "PRINT_CHECK";	
	Иначе
		Результат = "";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
