
Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	ТипЦены                   = Константы.ТипЦенЄпицентр                      .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс                    .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиЭпицетр              .Получить();
	
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,);
	Остатки = ОстаткиКВыгрузке.Остатки;	
	//Комплектующие = ОстаткиКВыгрузке.Комплектующие;
	
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");
	Если СтрДлина(Врем)= 7 Тогда
		Врем = Лев(Врем,4);
	Иначе
		Врем = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 

	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+""">");

	Остатки.Сортировать("Номенклатура, Характеристика");
	
	ТД.ЗаписатьСтроку("<offers>");	
	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияЭпицентр", ПроверятьРазбитиеРостовок, ВариантВыгрузки,);
	
	Для Каждого Стр из ТаблицаХарактеристик Цикл 		
		ЗаписатьНоменклатуру(Стр, ТД);
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, ТД)
	
	Цена = Стр.Цена;	
	СпрГруппыЦветов	= Стр.ГруппаЦвета;
	Номенклатура = Стр.Номенклатура;
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	Характеристика = Стр.Характеристика;
	ХарактеристикаОбъект = Стр.Характеристика.ПолучитьОбъект();
	Ид = Стр.ИД;	
	Доступна = Стр.Доступна;
	ШтрихКод = Стр.ШтрихКод;
	Скидка = Стр.Скидка;	
	Наценка = Стр.Наценка;		
	ПерваяЦена  = стр.ПерваяЦена;

		
	available = ?(Доступна,"true","false");
	ТД.ЗаписатьСтроку("<offer id="""+ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.Код)+ОбщегоНазначения.УбратьНоликиСлева(Стр.Характеристика.Код)+""" available="""+available+""">");
				
	ТД.ЗаписатьСтроку("<category code="""+ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.КатегорияЭпицентр.Код)+""">"""+Стр.Номенклатура.КатегорияЭпицентр.Наименование+"""</category>");
	ТД.ЗаписатьСтроку("<attribute_set code="""+ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.КатегорияЭпицентр.Код)+""">"""+Стр.Номенклатура.КатегорияЭпицентр.Наименование+"""</attribute_set>");
	
	// наименование рус
	НаимРус = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Истина, Истина);
	ТД.ЗаписатьСтроку("<name lang=""ru"">"+НаимРус+"</name>");

	// Наименование укр
	НаимУкр = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Ложь, Истина);
	ТД.ЗаписатьСтроку("<name lang=""ua"">"+НаимУкр+"</name>");
	
	//Скидка	
	ЦенаБезСкидки = ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="));
	Если Скидка>0 Или Наценка < 70 Тогда
		ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price_old>");
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</price>");
	Иначе
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");
	КонецЕсли;
	
	/// Рус Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Истина);	
	Описание = "<![CDATA["+ОписаниеМодели+"]]>";
	ТД.ЗаписатьСтроку("<description lang=""ru"">"+Описание+"</description>");
	
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Ложь);
	Описание = "<![CDATA["+ОписаниеМодели+"]]>";
	ТД.ЗаписатьСтроку("<description lang=""ua"">"+Описание+"</description>");

	
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов,Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			Если Фот.НеВыгружать ИЛИ Фот.НеВыгружатьРозница Тогда 
				Продолжить;
			КонецЕсли;

			
			ИмяФото = Фот.Наименование;
			
			ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
			
		КонецЦикла;
		
	КонецЕсли;	

	ТД.ЗаписатьСтроку("<country_of_origin code=""ukr"">Україна</country_of_origin>");
	ТД.ЗаписатьСтроку("<param name=""Асортимент"" paramcode=""5240"" valuecode=""666e16c6edeb8ba0dbb7f6bf37873174"">Нова колекція</param>");
	
	ТД.ЗаписатьСтроку("<vendor code=""019e054813684e249926b590fd43036e"">Cvetkov</vendor>"); 
	ТД.ЗаписатьСтроку("<param name=""Бренд"" paramcode=""445860"" valuecode=""019e054813684e249926b590fd43036e"">Cvetkov</param>");

	ТД.ЗаписатьСтроку("<param name=""Одиниця виміру та кількість"" paramcode=""measure"" valuecode=""measure_pcs"">шт.</param>");
	ТД.ЗаписатьСтроку("<param name=""Мінімальна кратність товару"" paramcode=""ratio"">1</param>");
	
	ТД.ЗаписатьСтроку("<param name=""Штрих код"" paramcode=""barcodes"">"+Штрихкод+"</param>");	
	
	ТД.ЗаписатьСтроку("<param name=""Цвет производителя"" paramcode=""78"" valuecode=""ff8cwdpi"">черный</param>");	
	ТД.ЗаписатьСтроку("<param name=""Базовый цвет"" paramcode=""12097"" valuecode=""3ec160321d45b95cf3a540ad3a2bf896"">Черный</param>");	

		
	

	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Эпицентр");	
	Свойство = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Номенклатура.КатегорияЭпицентр, Характеристика,"name","paramcode","valuecode");	
	Тд.ЗаписатьСтроку(Свойство);
	
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры
