Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

// используется при заполнении документа из других объектов 
Перем мВидОперацииДляЗаполнения Экспорт;
Перем мЗаполнятьВозвратнуюТару  Экспорт;

Перем мНеОткрыватьФормуДокумента Экспорт;

Перем мУдалятьДвижения;      

Перем КонтрагентНеРезидент;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	

// Функция формирует табличный документ с регламентированной печатной формой 
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Ложь
						,ИмяМакета = "НалоговаяНакладнаяАльбом"
						) Экспорт	
	
	Если Дата >= глЗначениеПеременной("ДатаВступленияВСилуПриказа1379")   Тогда
	    Возврат ПечатьДокументаНалоговыйКодекс2012(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы
													,ИмяМакета
													);
	Иначе	
		Возврат ПечатьДокументаНалоговыйКодекс(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы);
	КонецЕсли;
	
КонецФункции // ПечатьДокумента()

Функция ПечатьДокументаНалоговыйКодекс(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5_");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
		СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ВключенаВЕдиныйРеестрНалоговыхНакладных,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	ОбособленноеПодразделение.Префикс КАК ОбособленноеПодразделениеПрефикс,
	|	Дата,
	|	Контрагент,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СимволДляПустыхПоказателей = "X";
	ВыводитьНомерДоговораБезКлеточек = Ложь;
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если НЕ УчетнаяПолитикаНеЗадана тогда
		СимволДляПустыхПоказателей = УчетнаяПолитика.СимволПустыхПоказателейВНалоговойНакладной;
		ВыводитьНомерДоговораБезКлеточек = УчетнаяПолитика.ВыводитьНомерДоговораБезКлеточек;
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_НалоговаяНакладная";

	Макет = ПолучитьМакет("НалоговаяНакладная2011");
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОС	  , ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоНМА	  , ТаблицаНоменклатуры);	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, ТекстДляПечатиВКолонкеКоличество, Характеристика, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	Для Страница = 1 По 2 Цикл
	
		// Выводим область оригинал/копия
		Если Страница = 1 Тогда
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
				
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
				
				// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			Иначе
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
		ИначеЕсли Страница = 2 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
			ТабДокумент.Вывести(ОбластьМакета);
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		КонецЕсли;
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим
		ТекНомерФилиал = "" + Шапка.ОбособленноеПодразделениеПрефикс;
		Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
			ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
		ИначеЕсли ЗначениеЗаполнено(ТекНомерФилиал) Тогда
			// если не указан спец. режим, то поставим в первом разряде " ", чтобы не сливались спец.режимные НН с обычными,
			// которые выписаны на филиалы с кодами на 2...4
			ТекНомерФилиал = " " + ТекНомерФилиал;
		КонецЕсли;
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
				
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			ИННОрганизации					= "0";
			НомерСвидетельстваОрганизации	= "0"	
		Иначе	
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
		КонецЕсли;
		ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		// телефон
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);

		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		ИННОрганизации = Прав("            " + ИННОрганизации, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		
		НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
		КонецЦикла; 
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		Иначе
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		КонецЕсли; 
		
		ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
		// телефон
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);

		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		
		НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
   			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
			НомерСвидетельстваКонтрагента = "0";
		КонецЕсли; 
		НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
		КонецЦикла; 

		ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
   			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "0";
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
			Для Инд = 1 По 6 Цикл
				ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		
		Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
			ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
		    ОбластьНомера.Объединить();
			ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
		КонецЕсли;
		
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	""+ОбластьМакетаЗаголовок.Параметры.ТипПричины1+ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	"");
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2,3));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVSEL",НомерСвидетельстваОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVBUY",НомерСвидетельстваКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	Шапка.КтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;

			Если ПродажаНижеОбычнойЦены Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG",		СтруктураПоказателей.НалоговыйДокумент.HORIG);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",		СтруктураПоказателей.НалоговыйДокумент.HORIG1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HERPN",		СтруктураПоказателей.НалоговыйДокумент.HERPN);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",		1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",		СтруктураПоказателей.НалоговыйДокумент.HCOPY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",		СтруктураПоказателей.НалоговыйДокумент.HFILL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",		СтруктураПоказателей.НалоговыйДокумент.HNUM);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",		СтруктураПоказателей.НалоговыйДокумент.HNUM1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",		СтруктураПоказателей.НалоговыйДокумент.HNUM2);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	СтруктураПоказателей.НалоговыйДокумент.HNAMESEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	СтруктураПоказателей.НалоговыйДокумент.HNAMEBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		СтруктураПоказателей.НалоговыйДокумент.HKSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		СтруктураПоказателей.НалоговыйДокумент.HKBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVSEL",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVBUY",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	СтруктураПоказателей.НалоговыйДокумент.HLOCSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	СтруктураПоказателей.НалоговыйДокумент.HLOCBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	СтруктураПоказателей.НалоговыйДокумент.HTELSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	СтруктураПоказателей.НалоговыйДокумент.HTELBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",		СтруктураПоказателей.НалоговыйДокумент.H01G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",		СтруктураПоказателей.НалоговыйДокумент.H01G2D);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",		СтруктураПоказателей.НалоговыйДокумент.H01G3S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",		СтруктураПоказателей.НалоговыйДокумент.H02G1S);
                СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",		СтруктураПоказателей.НалоговыйДокумент.H10G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	СтруктураПоказателей.НалоговыйДокумент.R003G10S);
			
			КонецЕсли;
			
		КонецЕсли;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
			КонецЕсли;
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
				СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"_");
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");

		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					
			// Итоги
			ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			ИначеЕсли СуффиксКолонки = "0Укр"
				  ИЛИ СуффиксКолонки = "0Эксп" Тогда
				// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
				ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
		
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				// накладная остается у поставщика
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			    ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
			Иначе	
				ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
			КонецЕсли;
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "" + Шапка.ОбособленноеПодразделениеПрефикс;
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			ИначеЕсли ЗначениеЗаполнено(ТекНомерФилиал) Тогда
				// если не указан спец. режим, то поставим в первом разряде " ", чтобы не сливались спец.режимные НН с обычными,
				// которые выписаны на филиалы с кодами на 2...4
				ТекНомерФилиал = " " + ТекНомерФилиал;
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
					
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				ИННОрганизации					= "0";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
				ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);

			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
 			КонецЦикла;
			
			ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			Иначе
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			// телефон
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);

			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
			НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 

			ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
			ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
				Для Инд = 1 По 6 Цикл
					ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
				ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
			    ОбластьНомера.Объединить();
				ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
			КонецЕсли;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				КонецЕсли;
			
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")") +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены);
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
					СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10",	СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;

КонецФункции // ()

Функция ПечатьДокументаНалоговыйКодекс2012(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы
											,ИмяМакета = "НалоговаяНакладнаяАльбом"
											)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА;
	
	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если НЕ ТолькоФормироватьСтруктуруПоказателейПечатнойФормы 	= Истина
		  И ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных 	= Истина
		  И ВключенаВЕдиныйРеестрНалоговыхНакладных 			= Ложь Тогда
	
		Сообщить(Локализация.СтрШаблон1(НСтр("ru='¤1¤ должна быть зарегистрирована в Едином реестре!"
"Нельзя выдавать покупателю печатный документ до регистрации в Едином реестре!';uk='¤1¤ має бути зареєстрована у Єдиному реєстрі податкових накладних!"
"Не можна видавати покупцю друкований документ до реєстрації у Єдиному реєстрі!'")
									   , Ссылка)
			   , СтатусСообщения.ОченьВажное);			
	
	КонецЕсли;

	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5_");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
		СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ВключенаВЕдиныйРеестрНалоговыхНакладных,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Дата,
	|	Контрагент,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	УслугиНерезидентаДляНехозДеят КАК УслугиНерезидентаДляНехозДеят,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СимволДляПустыхПоказателей = "X";
	ПечататьКодУКТВЭДБезПробелов = Ложь;
	ПечататьДатыБезРазделителей = Ложь;
	ДополнитьНазваниеНомеромГТД = Ложь;
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если НЕ УчетнаяПолитикаНеЗадана тогда
		СимволДляПустыхПоказателей    	 = УчетнаяПолитика.СимволПустыхПоказателейВНалоговойНакладной; 
		ПечататьКодУКТВЭДБезПробелов     = УчетнаяПолитика.ПечататьКодУКТВЭДБезПробелов; 
		ПечататьДатыБезРазделителей    	 = НЕ УчетнаяПолитика.ПечататьДатыВНалоговыхНакладныхСРазделителями; 
		ДополнитьНазваниеНомеромГТД    	 = НЕ УчетнаяПолитика.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах; 
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_НалоговаяНакладная";
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_" + ИмяМакета;

	МакетПромежуточный = ПолучитьМакет("НалоговаяНакладная2012");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		МакетПромежуточный = ПолучитьМакет("НалоговаяНакладная2012Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	МакетПромежуточный.КодЯзыкаМакета = "ru";
	
	Макет = Новый ТабличныйДокумент;
	Макет.ВставитьОбласть(МакетПромежуточный.Область(), , , Ложь);
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОС	  , ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоНМА	  , ТаблицаНоменклатуры);	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, КодУКТВЭД, НомерГТД, ДатаГТД, ТекстДляПечатиВКолонкеКоличество, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	Для Страница = 1 По 2 Цикл
		
		Если  Страница = 2
			И ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// печатаем в одном экземпляре
			Продолжить;
		КонецЕсли;
		
		// Выводим область оригинал/копия
		Если Страница = 1 Тогда
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
				
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
				
				// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			Иначе
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
		ИначеЕсли Страница = 2 Тогда
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("ПерваяКопия");
			ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		КонецЕсли;
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("0000" + СокрЛП(Шапка.Префикс), 4), "");  //число, сведущими нулями, 4 символа 
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;

		Для Инд = 1 По 5 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
				
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
			НомерСвидетельстваОрганизации	= "0"	
		Иначе	
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
		КонецЕсли;
		ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			ОбластьМакета.Параметры.НазваниеОрганизации = ОбластьМакета.Параметры.НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		// телефон
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		ИННОрганизации = Прав("            " + ИННОрганизации, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
		КонецЦикла; 
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		Иначе
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			СведенияОГоловномКонтрагентеПокупателя = Неопределено;
			Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
				СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);
			КонецЕсли;
		КонецЕсли; 
		
		ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
		Если НЕ СведенияОГоловномКонтрагентеПокупателя = Неопределено Тогда
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 			+ " - " + ОбластьМакета.Параметры.НазваниеКонтрагента;
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	+ " - " + ОбластьМакета.Параметры.АдресКонтрагента;
		КонецЕсли;
		
		// телефон
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		
		НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
			НомерСвидетельстваКонтрагента = "0";
		КонецЕсли; 
		НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
		КонецЦикла; 

		ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "0";
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
		
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	""+ОбластьМакетаЗаголовок.Параметры.ТипПричины1+ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	"");
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVSEL",НомерСвидетельстваОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVBUY",НомерСвидетельстваКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	Шапка.КтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;

			Если ПродажаНижеОбычнойЦены Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG",		СтруктураПоказателей.НалоговыйДокумент.HORIG);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",		СтруктураПоказателей.НалоговыйДокумент.HORIG1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HERPN",		СтруктураПоказателей.НалоговыйДокумент.HERPN);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",		1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",		СтруктураПоказателей.НалоговыйДокумент.HCOPY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",		СтруктураПоказателей.НалоговыйДокумент.HFILL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",		СтруктураПоказателей.НалоговыйДокумент.HNUM);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",		СтруктураПоказателей.НалоговыйДокумент.HNUM1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",		СтруктураПоказателей.НалоговыйДокумент.HNUM2);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	СтруктураПоказателей.НалоговыйДокумент.HNAMESEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	СтруктураПоказателей.НалоговыйДокумент.HNAMEBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		СтруктураПоказателей.НалоговыйДокумент.HKSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		СтруктураПоказателей.НалоговыйДокумент.HKBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVSEL",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVBUY",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	СтруктураПоказателей.НалоговыйДокумент.HLOCSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	СтруктураПоказателей.НалоговыйДокумент.HLOCBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	СтруктураПоказателей.НалоговыйДокумент.HTELSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	СтруктураПоказателей.НалоговыйДокумент.HTELBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",		СтруктураПоказателей.НалоговыйДокумент.H01G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",		СтруктураПоказателей.НалоговыйДокумент.H01G2D);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",		СтруктураПоказателей.НалоговыйДокумент.H01G3S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",		СтруктураПоказателей.НалоговыйДокумент.H02G1S);
                СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",		СтруктураПоказателей.НалоговыйДокумент.H10G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	СтруктураПоказателей.НалоговыйДокумент.R003G10S);
			
			КонецЕсли;
			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
		Если ПечататьДатыБезРазделителей Тогда
			ОбластьМакета.Области.ДатаОтгрузкиОплаты.Формат = "ДФ=ddMMyyyy";	
		КонецЕсли;
		
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если ПечататьКодУКТВЭДБезПробелов Тогда
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
			КонецЕсли;
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
												 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
												 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "");
												 ;
			
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				
				СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
				СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					
			// Итоги
			ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			ИначеЕсли СуффиксКолонки = "0Укр"
				  ИЛИ СуффиксКолонки = "0Эксп" Тогда
				// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
				ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	"Без ПДВ");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2
				И ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
		
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
				// накладная остается у поставщика
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				
				// безоплатная поставка тип причины - "12"
				Если СуммаДокумента = 0 Тогда
					ОбластьМакета.Параметры.ТипПричины1 = "1";
					ОбластьМакета.Параметры.ТипПричины2 = "2";
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			    ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
			Иначе	
				ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
			КонецЕсли;
			
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			ТекНомерФилиал = "";
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("0000" + СокрЛП(Шапка.Префикс), 4), "");  //число, сведущими нулями, 4 символа 
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;

			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
					
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
				ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
				ОбластьМакета.Параметры.НазваниеОрганизации = ОбластьМакета.Параметры.НазваниеОрганизации + Шапка.НаименованиеФилиала;	
			КонецЕсли;
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			Иначе
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				СведенияОГоловномКонтрагентеПокупателя = Неопределено;
				Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
					СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);
				КонецЕсли;
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			Если НЕ СведенияОГоловномКонтрагентеПокупателя = Неопределено Тогда
				ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 			+ " - " + ОбластьМакета.Параметры.НазваниеКонтрагента;
				ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	+ " - " + ОбластьМакета.Параметры.АдресКонтрагента;
			КонецЕсли;
			
			// телефон
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
	   			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
			НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 

			ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента = ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
			ИначеЕсли    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
	   			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
			ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			Если ПечататьДатыБезРазделителей Тогда
				ОбластьМакета.Области.ДатаОтгрузкиОплаты.Формат = "ДФ=ddMMyyyy";	
			КонецЕсли;
			
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ПечататьКодУКТВЭДБезПробелов Тогда
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				КонецЕсли;
			
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "")
													 +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены
													 ;
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					
					СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
					СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10",	"Без ПДВ");
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции // ()

//Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
		// такие операции не предусматривают выписки налоговых накладных
		Возврат	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если  ИмяМакета = "НалоговаяНакладная" 
	    ИЛИ ИмяМакета = "НалоговаяНакладнаяАльбом"
		Тогда
		ТабДокумент = ПечатьДокумента(, ИмяМакета);
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СписокМакетов = Новый Структура("НалоговаяНакладная", "Налоговая накладная");
	СписокМакетов.Вставить("НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)");
	
	Возврат СписокМакетов

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьРеквизитыНалоговогоУчетаНДСРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета) Экспорт

	Если ИмяТабЧасти = "Товары" Тогда
		ЗаполнитьУКТВЭДВСтрокеТоваров(СтрокаТЧ)
	КонецЕсли;
    				
КонецПроцедуры

Процедура ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(СтрокаТЧ, ИмяТабЧасти) Экспорт
	
	МетаданныеДокумента = Метаданные();
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, ИмяТабЧасти) Тогда
			Возврат
	КонецЕсли;

	Если  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20ПоставкаОФ;
		Иначе	
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОНерезидентУслуги;	
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		
		// 20%
		Если (ИмяТабЧасти = "ОС" ИЛИ ИмяТабЧасти = "НМА") Тогда
		
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20ПоставкаОФ;	
		
		Иначе		
			
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
			
		КонецЕсли;
			
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		
		// 0%
		Если ЗначениеЗаполнено(ДоговорКонтрагента) 
			   И ДоговорКонтрагента.Внешнеэкономический Тогда
			
			// договор - внешнеэкономический
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Экспорт;	
			
		ИначеЕсли Контрагент.НеЯвляетсяРезидентом Тогда
			// хоть документ и в гривне, но считаем это поставкой на экспорт
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Экспорт;
			
		Иначе
			
			// на терриории Украины
			СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Другие;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		
		// освобожденные операции (п.5 Закона)
		СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НООсвобожден;
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
		
		// операция не является объектом налогообложения (п.3 Закона)
		СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОНеОбъектНалог;
		
	Иначе
		
		//в строке ТЧ не указаны ставка НДС
		СтрокаТЧ.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти) Экспорт

	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура);

	ЗаполнитьРеквизитыНалоговогоУчетаНДСРегл(СтрокаТЧ, ИмяТабЧасти, СчетаУчета);
    ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(СтрокаТЧ, ИмяТабЧасти);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти) Экспорт

	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

// Обновляет значение реквизита ЛьготаНДС при изменении номенклатуры или вида операции
Процедура ОбновитьЗначениеЛьготыНДС(СтрокаТабличнойЧасти = Неопределено) Экспорт
	Если Не (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		     ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		     ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации) Тогда
		Возврат;
	КонецЕсли; 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
		
			ОбновитьЗначениеЛьготыНДС(СтрокаТЧ);
		
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из Услуги Цикл
		
			ОбновитьЗначениеЛьготыНДС(СтрокаТЧ);
		
		КонецЦикла;
		
	Иначе
		
		ЛьготаНДС = СокрЛП(ЛьготаНДС);

		ЛьготаТовара = СокрЛП(СтрокаТабличнойЧасти.Номенклатура.ЛьготаНДС);
		Если СтрДлина(ЛьготаТовара) = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		Если Найти(ЛьготаНДС, ЛьготаТовара) = 0 Тогда
			
			Если СтрДлина(ЛьготаНДС) = 0 Тогда
			    ЛьготаНДС = ЛьготаТовара;
			Иначе	
			    ЛьготаНДС = ЛьготаНДС + ", " + ЛьготаТовара;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли
	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткам(ТабличнаяЧасть, МоментВремени = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если МоментВремени = Неопределено Тогда
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Иначе	
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("Сделка", ОпределитьСделкуЛокально());
	
	Если ТабличнаяЧасть = Товары Тогда
		Запрос.УстановитьПараметр("ВозвратнаяТара", Ложь);
		Запрос.УстановитьПараметр("СтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Иначе
		Запрос.УстановитьПараметр("ВозвратнаяТара", Истина);
		Запрос.УстановитьПараметр("СтавкиНДС", Перечисления.СтавкиНДС.НеНДС);
	КонецЕсли;
	
	СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация; 
	ВалютаВзаиморасчетовНУ = ?(ДоговорКонтрагента.Внешнеэкономический, ДоговорКонтрагента.ВалютаВзаиморасчетов,мВалютаРегламентированногоУчета);
		
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда	
		// в регистре информация по НДС начисленному при условной продаже хранится отдельно
		
		СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа; 
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Запрос.УстановитьПараметр("Сделка", 			Неопределено);
		ВалютаВзаиморасчетовНУ = мВалютаРегламентированногоУчета;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда	
		  
		СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.РеализацияРозница; 
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Запрос.УстановитьПараметр("Сделка", 			Неопределено);
		ВалютаВзаиморасчетовНУ = мВалютаРегламентированногоУчета;
	  
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СобытиеНДС", СобытиеНДС);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкаНДС,
	|	СуммаНДСОстаток,
	|	БазаНДСОстаток
	|ИЗ
	|	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПродаж.Остатки(&МоментВремени, 
	|											  			Организация 		= &Организация 
	|											 		  И ДоговорКонтрагента 	= &ДоговорКонтрагента 
	|													  И СтавкаНДС 			В (&СтавкиНДС)
	|													  И СобытиеНДС  		= &СобытиеНДС 
	|													  И Сделка		  		= &Сделка 
	|													  И ВозвратнаяТара 		= &ВозвратнаяТара) КАК НДСПриобретенийОстатки
	|ГДЕ
	|	  СуммаНДСОстаток >= 0
	|   И БазаНДСОстаток  >= 0
	|";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДанныеОВалютеВзаиморасчетовНУ = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовНУ, Дата);
	Пока Выборка.Следующий() Цикл
		
		Если ТабличнаяЧасть = Товары Тогда
			СтрокаТабличнойЧасти = Товары.Добавить();
				
			Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НоменклатураДляЗаполненияНалоговыхНакладных");	
			Если НЕ ЗначениеЗаполнено(Товар) Тогда
				Сообщить("Для пользователя не указано значение ""Номенклатура для автоматического заполнения налоговых накладных"" в индивидуальных настройках!", СтатусСообщения.Важное);
			КонецЕсли; 
			
			СтрокаТабличнойЧасти.Номенклатура	  = Товар;
			
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = Товар.ЕдиницаХраненияОстатков;
			СтрокаТабличнойЧасти.Коэффициент	  = Товар.ЕдиницаХраненияОстатков.Коэффициент;
			СтрокаТабличнойЧасти.Количество		  = 1;
			
			СтрокаТабличнойЧасти.СтавкаНДС       	= Выборка.СтавкаНДС;
			
			СуммаНДС 	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДСОстаток, 
													ВалютаВзаиморасчетовНУ, ВалютаДокумента, 
													ДанныеОВалютеВзаиморасчетовНУ.Курс, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
													ДанныеОВалютеВзаиморасчетовНУ.Кратность, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
													
			СтрокаТабличнойЧасти.СуммаНДС = СуммаНДС;										
			
			СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.БазаНДСОстаток, 
													ВалютаВзаиморасчетовНУ, ВалютаДокумента, 
													ДанныеОВалютеВзаиморасчетовНУ.Курс, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
													ДанныеОВалютеВзаиморасчетовНУ.Кратность, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
			
			СтрокаТабличнойЧасти.Сумма = СуммаБезНДС + ?(СуммаВключаетНДС, СуммаНДС, 0);
			
			ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(СтрокаТабличнойЧасти, "Товары");

			ОбновитьЗначениеЛьготыНДС(СтрокаТабличнойЧасти);
			
		Иначе
			
			СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
			
			СтрокаТабличнойЧасти.Сумма	= Выборка.БазаНДСОстаток;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьТовары(Основание = Неопределено) Экспорт

	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	МетаданныеДокумента = Основание.Метаданные();
	Если МетаданныеДокумента.ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = МетаданныеДокумента.Имя;
	
	ЕстьПроцентСкидкиНаценки		= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ПроцентСкидкиНаценки") <> Неопределено; 
	ЕстьПроцентАвтоматическихСкидок	= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ПроцентАвтоматическихСкидок") <> Неопределено; 
	ЕстьЕдиницаИзмеренияМест		= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмеренияМест") <> Неопределено; 
	ЕстьКоличествоМест				= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("КоличествоМест") <> Неопределено; 
	ОснованиемЯвляетсяЧекККМ		= ( ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") );
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);

	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.ЕдиницаИзмерения,
	|	Основание.Количество,
	|	Основание.Коэффициент,
	|	Основание.Номенклатура,
	|	Основание.ХарактеристикаНоменклатуры,
	|	Основание.Цена,
	|	Основание.Сумма,";
	Если ЕстьКоличествоМест Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.КоличествоМест,";
	КонецЕсли;
	Если ЕстьЕдиницаИзмеренияМест Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ЕдиницаИзмеренияМест,";
	КонецЕсли;
	Если ЕстьПроцентСкидкиНаценки Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентСкидкиНаценки,";
	КонецЕсли;
	Если ЕстьПроцентАвтоматическихСкидок Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентАвтоматическихСкидок,";
	Иначе
		ТекстЗапроса = 	ТекстЗапроса +"
	|	0 КАК ПроцентАвтоматическихСкидок,";
	КонецЕсли;

	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = 	ТекстЗапроса +"
	|	&ВалютаРеглУчета КАК	ВалютаДокумента,
	|	1 КАК					КурсДокумента,
	|	1 КАК					КратностьДокумента,
	|	Основание.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 						КАК СуммаНДС,
	|	ИСТИНА 					КАК УчитыватьНДС,
	|	ИСТИНА 					КАК СуммаВключаетНДС,";
	Иначе
		ТекстЗапроса = 	ТекстЗапроса +"
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,";
	КонецЕсли; 

	ТекстЗапроса = 	ТекстЗапроса +"
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование";
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|   И Основание.Номенклатура.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|   И Основание.Номенклатура.Услуга = Ложь";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"	
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		Если ЕстьЕдиницаИзмеренияМест Тогда		
			НоваяСтрока.ЕдиницаИзмеренияМест   = Выборка.ЕдиницаИзмеренияМест;		
		КонецЕсли;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = Выборка.Количество;
		
		Если ЕстьКоличествоМест Тогда
			НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;
		КонецЕсли; 

		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
				
		Если ЕстьПроцентСкидкиНаценки Тогда		
			НоваяСтрока.ПроцентСкидкиНаценки     = Выборка.ПроцентСкидкиНаценки;		
		КонецЕсли;
		
		Если ЕстьПроцентАвтоматическихСкидок Тогда		
			НоваяСтрока.ПроцентАвтоматическихСкидок = Выборка.ПроцентАвтоматическихСкидок;		
		КонецЕсли;

		Если НоваяСтрока.ПроцентСкидкиНаценки + НоваяСтрока.ПроцентАвтоматическихСкидок = 100 Тогда
			НоваяСтрока.Цена = 0;
		ИначеЕсли НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма 
			/ ((1 - (НоваяСтрока.ПроцентСкидкиНаценки + НоваяСтрока.ПроцентАвтоматическихСкидок)/ 100)
			* НоваяСтрока.Количество);
		КонецЕсли;	
		
		Если НЕ ОснованиемЯвляетсяЧекККМ Тогда
			НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
															  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
															  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		Иначе
			
			НоваяСтрока.СуммаНДС  = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(Выборка.Сумма,
																			 УчитыватьНДС,
																			 СуммаВключаетНДС,
																			 Выборка.СтавкаНДС,
																			 ПогрешностиОкругления);
		КонецЕсли;
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Товары");
		ЗаполнитьУКТВЭДВСтрокеТоваров(НоваяСтрока);
	КонецЦикла;

КонецПроцедуры // СкопироватьТовары()

Процедура СкопироватьТоварыИзИзмененияНалоговогоНазначенияЗапасов(Основание)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("Метод",Перечисления.МетодыКорректировкиНалоговогоКредита.НаНалоговыеОбязательства);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура,
	|	Основание.КоличествоМест,
	|	Основание.ЕдиницаИзмерения,
	|	Основание.Коэффициент,
	|	Основание.Количество,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.Дата КАК ДатаОтгрузки
	|ИЗ
	|	Документ.ИзменениеНалоговогоНазначенияЗапасов.Товары КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование
	|   И Основание.СуммаНДС > 0
	|	И Основание.МетодКорректировкиНалоговогоКредита = &Метод 
	|";

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		
		НоваяСтрока.Количество                 = Выборка.Количество;
		Если НоваяСтрока.Количество = 0  Тогда
			НоваяСтрока.Количество = 1;
		КонецЕсли; 
		
		НоваяСтрока.СтавкаНДС                  = Перечисления.СтавкиНДС.НДС20;

		НоваяСтрока.СуммаНДС 				   = Выборка.СуммаНДС;
														  
		СуммаБезНДС = Окр(НоваяСтрока.СуммаНДС*100/УчетНДС.ПолучитьСтавкуНДС(Перечисления.СтавкиНДС.НДС20), 2);
		
		НоваяСтрока.Сумма = СуммаБезНДС + ?(СуммаВключаетНДС, НоваяСтрока.СуммаНДС, 0);
		НоваяСтрока.Цена = НоваяСтрока.Сумма/НоваяСтрока.Количество;
			
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
			
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Товары");
			
	КонецЦикла;

КонецПроцедуры


Процедура СкопироватьТоварыИзИзменениеНалоговогоНазначенияТЗР(Основание)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("Метод",Перечисления.МетодыКорректировкиНалоговогоКредита.НаНалоговыеОбязательства);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|   ""Умовне постачання ТЗВ"" КАК Затрата,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.Дата КАК ДатаОтгрузки
	|ИЗ
	|	Документ.ИзменениеНалоговогоНазначенияТЗР.Затраты КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование
	|   И Основание.СуммаНДС > 0
	|	И Основание.МетодКорректировкиНалоговогоКредита = &Метод 
	|";

	Запрос.Текст = ТекстЗапроса;
	
	Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НоменклатураДляЗаполненияНалоговыхНакладных");	
	Если НЕ ЗначениеЗаполнено(Товар) Тогда
		Сообщить(НСтр("ru='Для пользователя не указано значение ""Номенклатура для автоматического заполнения налоговых накладных"" в индивидуальных настройках!';uk='Для користувача не вказане значення ""Номенклатура для автоматичного заповнення податкових накладних"" в індивідуальних настройках!'"), СтатусСообщения.Важное);
	КонецЕсли; 
	ЕдиницыИзмерения = Товар.БазоваяЕдиницаИзмерения;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		
		НоваяСтрока.Номенклатура               = Товар;
		НоваяСтрока.Содержание                 = Выборка.Затрата;
		НоваяСтрока.Количество				   = 1;
		
		НоваяСтрока.СтавкаНДС                  = Перечисления.СтавкиНДС.НДС20;

		НоваяСтрока.СуммаНДС 				   = Выборка.СуммаНДС;
														  
		СуммаБезНДС = Окр(НоваяСтрока.СуммаНДС*100/УчетНДС.ПолучитьСтавкуНДС(Перечисления.СтавкиНДС.НДС20), 2);
		
		НоваяСтрока.Сумма = СуммаБезНДС + ?(СуммаВключаетНДС, НоваяСтрока.СуммаНДС, 0);
		НоваяСтрока.Цена = НоваяСтрока.Сумма/НоваяСтрока.Количество;
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
			
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Услуги");
			
	КонецЦикла;

КонецПроцедуры


Процедура СкопироватьТоварыИзИзмененияНалоговогоНазначенияОС(Основание)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("Метод",Перечисления.МетодыКорректировкиНалоговогоКредита.НаНалоговыеОбязательства);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.ОсновноеСредство,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.Дата КАК ДатаОтгрузки
	|ИЗ
	|	Документ.ИзменениеНалоговогоНазначенияОС.ОС КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование
	|   И Основание.СуммаНДС > 0
	|	И Основание.МетодКорректировкиНалоговогоКредита = &Метод 
	|";

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОС.Добавить();
		НоваяСтрока.ОсновноеСредство		   = Выборка.ОсновноеСредство;

		НоваяСтрока.СтавкаНДС                  = Перечисления.СтавкиНДС.НДС20;

		НоваяСтрока.СуммаНДС 				   = Выборка.СуммаНДС;
														  
		СуммаБезНДС = Окр(НоваяСтрока.СуммаНДС*100/УчетНДС.ПолучитьСтавкуНДС(Перечисления.СтавкиНДС.НДС20), 2);
		
		НоваяСтрока.Сумма = СуммаБезНДС + ?(СуммаВключаетНДС, НоваяСтрока.СуммаНДС, 0);
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
			
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "ОС");
			
	КонецЦикла;

КонецПроцедуры

// Данная процедура предназначена для заполнения ТЧ в особом случае - по документу Корректировка долга по возвратной таре
Процедура СкопироватьТаруВТовары() Экспорт
	
	// это может быть только Корректировка долга по таре
	ВидДокумента = ДокументОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияМест,
	|	Основание.Количество,
	|	Основание.Количество КАК КоличествоМест,
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	Основание.Номенклатура,
	|	NULL КАК ХарактеристикаНоменклатуры,
	|	Основание.Цена,
	|	0 КАК ПроцентСкидкиНаценки,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	Основание.Сумма,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС КАК СуммаНДС,
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС
	|ИЗ
	|	Документ."+ВидДокумента+".ВозвратнаяТара КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|";

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = Выборка.Количество;
		НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;

		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
								МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
									Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
									Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
									Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
									Выборка.СуммаВключаетНДС,
									УчитыватьНДС,
									СуммаВключаетНДС,
									УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
				
		НоваяСтрока.ПроцентСкидкиНаценки             = Выборка.ПроцентСкидкиНаценки;		
		
		Если НоваяСтрока.ПроцентСкидкиНаценки = 100 Тогда
			НоваяСтрока.Цена = 0;
		ИначеЕсли НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма 
			/ ((1 - НоваяСтрока.ПроцентСкидкиНаценки / 100)
			* НоваяСтрока.Количество);
		КонецЕсли;	
		
		НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
														  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
														  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Товары");
		
	КонецЦикла;

КонецПроцедуры // СкопироватьТаруВТовары()

Процедура СкопироватьВозвратнуюТару(Основание = Неопределено) Экспорт
		
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ВозвратнаяТара") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Количество,
	|	Основание.Номенклатура,
	|	Основание.Сумма,
	|	Основание.Цена,
	|	Основание.Ссылка.ВалютаДокумента	КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента
	|ИЗ
	|	Документ."+ВидДокумента+".ВозвратнаяТара КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|";

	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ВозвратнаяТара.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество   = Выборка.Количество;
		НоваяСтрока.Цена  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена, Выборка.ВалютаДокумента, ВалютаДокумента, Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
							Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
		
	КонецЦикла;

КонецПроцедуры // СкопироватьВозвратнуюТару()

Процедура СкопироватьУслуги(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	ОснованиемЯвляетсяЧекККМ = ( ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") );
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		
		ЕстьСодержаниеУслуги = Ложь;
		
	иначе
		
		Если Основание.Метаданные().ТабличныеЧасти.Найти("Услуги") = Неопределено Тогда
			// нет такой табличной части
			Возврат
		КонецЕсли;
		
		ЕстьСодержаниеУслуги = Основание.Метаданные().ТабличныеЧасти.Услуги.Реквизиты.Найти("Содержание")   <> Неопределено; 
		
	КонецЕсли; 
	
	ЭтоРаботыОтНерезидента = (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента);	
	ЕстьПроцентАвтоматическихСкидок	= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ПроцентАвтоматическихСкидок") <> Неопределено; 

	Если ОснованиемЯвляетсяЧекККМ Тогда
		ЕстьСодержаниеУслуги   = Ложь; 
	Иначе	
		ЕстьСодержаниеУслуги   = Основание.Метаданные().ТабличныеЧасти.Услуги.Реквизиты.Найти("Содержание")   <> Неопределено; 
	КонецЕсли;

	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);

	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Количество,
	|	Основание.Номенклатура,
	|	Основание.Цена,
	|	Основание.Сумма,";
	Если ЕстьСодержаниеУслуги Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Содержание,";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Номенклатура.Представление КАК Содержание,";
	КонецЕсли;
	Если  НЕ ЭтоРаботыОтНерезидента Тогда 
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентСкидкиНаценки,";	
	Иначе
	ТекстЗапроса = ТекстЗапроса +"
	|	0 КАК ПроцентСкидкиНаценки,";	
	КонецЕсли;
	Если ЕстьПроцентАвтоматическихСкидок
		И НЕ ЭтоРаботыОтНерезидента Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентАвтоматическихСкидок,";
	Иначе
		ТекстЗапроса = 	ТекстЗапроса +"
	|	0 КАК ПроцентАвтоматическихСкидок,";
	КонецЕсли;
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	&ВалютаРеглУчета 		КАК ВалютаДокумента,
	|	1 						КАК КурсДокумента,
	|	1 						КАК КратностьДокумента,
	|	Основание.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 						КАК СуммаНДС,
	|	ИСТИНА 					КАК УчитыватьНДС,
	|	ИСТИНА 					КАК СуммаВключаетНДС,";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КратностьДокумента,	
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС,
	|	Основание.СуммаНДС,";
		Если ЭтоРаботыОтНерезидента Тогда
			// НДС на стоимость услуг начисляется исходя из их стоимости.
			// Документ поступления не должен учитывать НДС.
			ТекстЗапроса = ТекстЗапроса +"
		|	ЛОЖЬ КАК СуммаВключаетНДС,";
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
		|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,";
		КонецЕсли;
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+?(ОснованиемЯвляетсяЧекККМ,".Товары",".Услуги")+" КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|   И Основание.Номенклатура.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|   И Основание.Номенклатура.Услуга = Истина";
	ИначеЕсли НЕ ЭтоРаботыОтНерезидента Тогда
		ТекстЗапроса = ТекстЗапроса +"	
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)";
	КонецЕсли;

	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.Содержание                 = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;
		НоваяСтрока.ПроцентСкидкиНаценки	   = Выборка.ПроцентСкидкиНаценки;
		Если ЕстьПроцентАвтоматическихСкидок Тогда		
			НоваяСтрока.ПроцентАвтоматическихСкидок = Выборка.ПроцентАвтоматическихСкидок;		
		КонецЕсли;
		Если ЭтоРаботыОтНерезидента Тогда
			НоваяСтрока.СтавкаНДС 			   = Перечисления.СтавкиНДС.НДС20;
		Иначе
			НоваяСтрока.СтавкаНДС 			   = Выборка.СтавкаНДС;
		КонецЕсли;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НоваяСтрока, ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		Если НЕ ОснованиемЯвляетсяЧекККМ Тогда
			
			Если ЭтоРаботыОтНерезидента Тогда
				
				НоваяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(НоваяСтрока.Сумма,
																			УчитыватьНДС,
																			СуммаВключаетНДС,
																			НоваяСтрока.СтавкаНДС,
																			ПогрешностиОкругления);
			Иначе	

				НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
																  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
																
			КонецЕсли;			
		
		Иначе
			
			НоваяСтрока.СуммаНДС  = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(Выборка.Сумма,
																			 УчитыватьНДС,
																			 СуммаВключаетНДС,
																			 Выборка.СтавкаНДС,
																			 ПогрешностиОкругления);
		КонецЕсли;

		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Услуги");
	
	КонецЦикла;

КонецПроцедуры // СкопироватьУслуги()

Процедура СкопироватьОС(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ОС") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.ОсновноеСредство,";
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияОС") Тогда
	ТекстЗапроса = ТекстЗапроса +"
	|	&ВалютаРеглУчета 	КАК ВалютаДокумента,
	|	1 					КАК КурсДокумента,
	|	1					КАК КратностьДокумента,";
	Иначе
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Ссылка.ВалютаДокумента 	   КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КратностьДокумента,";
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Сумма,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС
	|ИЗ
	|	Документ."+ВидДокумента+".ОС 	   КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОС.Добавить();
		НоваяСтрока.ОсновноеСредство           = Выборка.ОсновноеСредство;
		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
														  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
														  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
													  
														  
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;

		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "ОС");
	
	КонецЦикла;
	
КонецПроцедуры // СкопироватьОС()

Процедура СкопироватьНематериальныеАктивы(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;

	Если Основание.Метаданные().ТабличныеЧасти.Найти("НМА") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.НематериальныйАктив,
	|	Основание.Ссылка.ВалютаДокумента 	   КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КратностьДокумента,
	|	Основание.Сумма,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС
	|ИЗ
	|	Документ."+ВидДокумента+".НМА 	   КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НМА.Добавить();
		НоваяСтрока.НематериальныйАктив        = Выборка.НематериальныйАктив;
		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
														  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
														  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
													  
														  
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "НМА");
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьНематериальныеАктивы()

Процедура СкопироватьУслугуПоКомиссии(Основание = Неопределено) Экспорт
		
		Если Основание = Неопределено Тогда
			Основание = ДокументОснование;
		КонецЕсли;
		
		Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Возврат;
		КонецЕсли; 
	
		СтрокаУслуг = Услуги.Добавить();
		
		Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУслугаКомиссии");	
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Сообщить("Для пользователя не указано значение ""Основная номенклатура-услуга по комиссии"" в индивидуальных настройках!", СтатусСообщения.Важное);
		КонецЕсли; 
		
		СтрокаУслуг.Номенклатура = Товар;
		СтрокаУслуг.Содержание 	 = Товар.НаименованиеПолное;
		
		СтрокаУслуг.Количество 		= 1;
		СтрокаУслуг.СтавкаНДС  		= Основание.СтавкаНДСВознаграждения;
		
		СтрокаУслуг.Цена 			= Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
												МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Товары.Итог("СуммаВознаграждения"), Основание.ВалютаДокумента, ВалютаДокумента,
																		   Основание.КурсВзаиморасчетов, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																		   Основание.КратностьВзаиморасчетов, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
												Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
												Основание.СуммаВключаетНДС,
												УчитыватьНДС,
												СуммаВключаетНДС,
												УчетНДС.ПолучитьСтавкуНДС(СтрокаУслуг.СтавкаНДС));

		
		СтрокаУслуг.Сумма 			= СтрокаУслуг.Цена;
		СтрокаУслуг.СуммаНДС 		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Товары.Итог("СуммаНДСВознаграждения"), Основание.ВалютаДокумента, ВалютаДокумента,
																 Основание.КурсВзаиморасчетов, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																 Основание.КратностьВзаиморасчетов, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
											  
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(СтрокаУслуг, "Услуги");
		
КонецПроцедуры

Процедура СкопироватьУслугиКомиссииОтНерезидента(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;

	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		// эта процедура работет только с документом  ОтчетКомиссионераОПродажах
		Возврат
	КонецЕсли;
	
	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Ссылка.УслугаКомиссии КАК Товар,
	|	1 КАК Количество,
	|	Основание.СуммаВознаграждения КАК Цена,
	|	Основание.СуммаВознаграждения КАК Сумма,
	|	""Продаж "" + ВЫРАЗИТЬ(Основание.Номенклатура.Наименование КАК СТРОКА(100)) КАК Содержание,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ КАК КратностьДокумента,
	|	ЛОЖЬ  КАК СуммаВключаетНДС,
	|	Основание.Ссылка.Дата КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	
	Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУслугаКомиссии");	
	ВыдаватьСообщениеОбОшибке = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		
		НоваяСтрока.Номенклатура = Выборка.Товар;
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			
			Если НЕ ЗначениеЗаполнено(Товар) Тогда
				
				Если ВыдаватьСообщениеОбОшибке Тогда
					Сообщить("Для пользователя не указано значение ""Основная номенклатура-услуга по комиссии"" в индивидуальных настройках!", СтатусСообщения.Важное);	
					ВыдаватьСообщениеОбОшибке = Ложь;
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.Номенклатура = Товар;	
				
			КонецЕсли; 
			
		КонецЕсли;
		
		НоваяСтрока.Содержание                 = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;

		НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
										МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
										Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
										Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
										Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
										Выборка.СуммаВключаетНДС,
										УчитыватьНДС,
										СуммаВключаетНДС,
										УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НоваяСтрока, ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		НоваяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(НоваяСтрока.Сумма,
																	УчитыватьНДС,
																	СуммаВключаетНДС,
																	НоваяСтрока.СтавкаНДС,
																	ПогрешностиОкругления);
															  
		
		Если Выборка.ДатаОтгрузки < Дата Тогда
			НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		КонецЕсли;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Услуги");
			
	КонецЦикла;

КонецПроцедуры // СкопироватьУслуги()

Процедура ЗаполнитьОСПоСписаниюОС(Основание)
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ОС") = Неопределено Тогда
		// странно, нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", мВалютаРегламентированногоУчета);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.ОсновноеСредство	КАК ОсновноеСредство,
	|	&ВалютаРеглУчета 			КАК ВалютаДокумента,
	|	1							КАК КурсДокумента,
	|	1							КАК КратностьДокумента,
	|	Основание.СтоимостьБУ - Основание.АмортизацияБУ - Основание.АмортизацияЗаМесяцБУ КАК Сумма,
	|	Основание.Ссылка.Дата		КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".ОС КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОС.Добавить();
		НоваяСтрока.ОсновноеСредство = Выборка.ОсновноеСредство;
		НоваяСтрока.СтавкаНДС        = Перечисления.СтавкиНДС.НДС20;
		НоваяСтрока.Сумма 			 = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
											 МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
																		Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																		Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
											Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
											Ложь,
											УчитыватьНДС,
											СуммаВключаетНДС,
											УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
											
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
														  
		НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;

		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "ОС");
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьНМАПоСписаниюНМА(Основание)
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("НМА") = Неопределено Тогда
		// странно, нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", мВалютаРегламентированногоУчета);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.НематериальныйАктив	КАК НематериальныйАктив,
	|	&ВалютаРеглУчета 			КАК ВалютаДокумента,
	|	1							КАК КурсДокумента,
	|	1							КАК КратностьДокумента,
	|	Основание.СтоимостьБУ - Основание.АмортизацияБУ - Основание.АмортизацияЗаМесяцБУ КАК Сумма,
	|	Основание.Ссылка.Дата		КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".НМА КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НМА.Добавить();
		НоваяСтрока.НематериальныйАктив = Выборка.НематериальныйАктив;
		НоваяСтрока.СтавкаНДС        = Перечисления.СтавкиНДС.НДС20;
		НоваяСтрока.Сумма 			 = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
											 МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
																		Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																		Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
											Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
											Ложь,
											УчитыватьНДС,
											СуммаВключаетНДС,
											УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
											
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
														  
		НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;

		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "НМА");
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТоварыПоСписаниюМалоценкиИзЭксплуатации(Основание)

	Если Основание.Метаданные().ТабличныеЧасти.Найти("Малоценка") = Неопределено Тогда
		// странно нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", 	Основание);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура,
	|	Основание.Количество                           КАК КоличествоМест,
	|	Основание.Количество,
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,                                   
	|	1                                              КАК Коэффициент,
	|	Основание.Ссылка.Дата 	                       КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".Малоценка КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = Выборка.Количество;
		НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;

		НоваяСтрока.СтавкаНДС                  = Перечисления.СтавкиНДС.НДС20;
		
		НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		
		ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(НоваяСтрока, "Товары");
			
	КонецЦикла;	

КонецПроцедуры

// Процедура выполняет заполнение текста условий продажи.
//
// Параметры:
//   Нет.
//
Процедура ЗаполнитьУсловиеПродажи(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;	
	
	УсловиеПродажи = "";
	
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации	Тогда
		
		НаименованиеДоговора = ДоговорКонтрагента.НаименованиеДляПечати;
		
		Если НЕ ЗначениеЗаполнено(НаименованиеДоговора) Тогда
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента.Номер) Тогда
			
				НаименованиеДоговора = "№ " + ДоговорКонтрагента.Номер;
			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента.Дата) Тогда
			
				НаименованиеДоговора = НаименованиеДоговора +" від " + Формат(ДоговорКонтрагента.Дата, "ДФ='дд.ММ.гггг'");
			
			КонецЕсли;
		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НаименованиеДоговора) Тогда
			УсловиеПродажи = "Договiр "+СокрЛП(НаименованиеДоговора);	
		КонецЕсли;
		
	КонецЕсли; 
	
	ТекстСделки = "";
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		Если   ТипЗнч(Сделка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			ТекстСделки = "рахунок № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Сделка)+" вiд "+Формат(Сделка.Дата, "ДФ='дд.ММ.гггг'");
		ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
			ТекстСделки = "замовлення № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Сделка)+" вiд "+Формат(Сделка.Дата, "ДФ='дд.ММ.гггг'");
		КонецЕсли;
	КонецЕсли;
	
	УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + ТекстСделки; 
	
	// заполним текстовые реквизиты по-украински
	Если    ТипЗнч(Основание) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "акт № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЕстьТовары = (Основание.Товары.Количество() > 0);
		ЕстьУслуги = (Основание.Услуги.Количество() > 0);
		
		Если ЕстьУслуги И НЕ ЕстьТовары Тогда
			УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "акт № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		//ИначеЕсли НЕ ЕстьУслуги И ЕстьТовары Тогда
	 	Иначе	
			УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "накладна № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		//Иначе
		//	УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "накладна(акт) № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаОС")
		ИЛИ   ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаНМА") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "накладна № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Если НЕ Сделка = Основание Тогда
		
			УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "рахунок № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");	
		
		КонецЕсли; 
	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "звіт комісіонера № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "звіт комітенту № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияЗапасов")
		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияТЗР") Тогда	
		
		УсловиеПродажи = "Умовний продаж ";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		УсловиеПродажи = "Касовий чек № "+Основание.НомерЧекаККМ+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	КонецЕсли;		 
	
КонецПроцедуры // ЗаполнитьУсловиеПродажи()

Процедура ЗаполнитьВидДоговора() Экспорт

	ВидДоговора = ДоговорКонтрагента.ВидДоговораПоГК;

КонецПроцедуры

Процедура УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Дата  Тогда
			ТипПричиныНевыдачиПокупателю = 2;
		Иначе	
			ТипПричиныНевыдачиПокупателю = 14;
		КонецЕсли;
		
	ИначеЕсли  НЕ ВалютаДокумента = мВалютаРегламентированногоУчета
		И ДоговорКонтрагента.Внешнеэкономический = Истина
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		ТипПричиныНевыдачиПокупателю = 7;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
		
		Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Дата  Тогда
			ТипПричиныНевыдачиПокупателю = 4;
		Иначе	
			ТипПричиныНевыдачиПокупателю = 13;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
		
	    ТипПричиныНевыдачиПокупателю = 5;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		
	    ТипПричиныНевыдачиПокупателю = 11;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Контрагент.ИНН)
   		    ИЛИ Найти("0123456789",Лев(СокрЛ(Контрагент.ИНН),1)) = 0 Тогда		
		
		ТипПричиныНевыдачиПокупателю = 2;
		
	ИначеЕсли ПродажаНижеОбычнойЦены Тогда
		
		ТипПричиныНевыдачиПокупателю = 1;
		
	Иначе	
		
		ТипПричиныНевыдачиПокупателю = 0;
		
	КонецЕсли;
	
	Если ТипПричиныНевыдачиПокупателю > 0 Тогда
		ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Функция по СтавкеНДС определяет суффикс имени параметра табличного документа:
// фактически колонку таблицы налоговой накладной 20%, 0%... где должна отображаться соответствующая сумма
//
Функция ОпределитьКолонкуТаблицы(СтавкаНДС=Неопределено)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	    Возврат "20"
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Если ВалютаДокумента = мВалютаРегламентированногоУчета
			// если это поставка на экспорт в гривнях - определим это по признаку нерезидентности контрагента
			И НЕ КонтрагентНеРезидент = Истина 
			Тогда
			Возврат "0Укр";
		Иначе
			Возврат "0Эксп";
		КонецЕсли;
	ИначеЕсли  СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат "БезНДС";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ОпределитьДопустимыеСтавкиНДС() Экспорт
	СписокСтавокНДС = Новый СписокЗначений();
	
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации Тогда
				
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС0);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
		
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
		
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НеНДС);
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		
	КонецЕсли;
		
	Возврат СписокСтавокНДС;
	
КонецФункции

Функция ОпределитьВозможныеВидыОперацийПоОснованию(Основание)
	
	ТаблицаВидовОпераций = Новый ТаблицаЗначений();
	ТаблицаВидовОпераций.Колонки.Добавить("ВидОперации", ,"Вид операции",60);

	ОснованиеЧек = (ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ"));
	
	Если НЕ ОснованиеЧек Тогда
		
		// теперь функция работает только для ЧекККМ
		Возврат ТаблицаВидовОпераций;
		
	КонецЕсли;
		
	ТекстЗапроса =  "";
				
	Если Основание.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
		Если ОснованиеЧек Тогда
			ТекстЗапроса = " 
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Номенклатура.СтавкаНДС КАК СтавкаНДС
			|ИЗ 
			|	Документ." + Основание.Метаданные().Имя + ".Товары КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание
			|";
		Иначе
			ТекстЗапроса = " 
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.СтавкаНДС
			|ИЗ 
			|	Документ." + Основание.Метаданные().Имя + ".Товары КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание
			|";
		КонецЕсли;
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".Услуги КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ОС") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".ОС КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("НематериальныеАктивы") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".НематериальныеАктивы КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если ТекстЗапроса = "" Тогда
		// в этом документе нет обрабатываемых подходящих табличных частей
		Возврат ТаблицаВидовОпераций;
	КонецЕсли;
	
	ЗапросПоСтавкамНДС = Новый Запрос(ТекстЗапроса);
	ЗапросПоСтавкамНДС.УстановитьПараметр("Основание", Основание); 
	
	Выборка = ЗапросПоСтавкамНДС.Выполнить().Выбрать();	
	
	ВключатьОблагаемыеОперации = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
			Если ОснованиеЧек Тогда
				СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации;
			Иначе
				СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации;
			КонецЕсли;
		ИначеЕсли Выборка.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
			СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации;
		Иначе
			//0% или 20% - один вид операции
			ВключатьОблагаемыеОперации = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если  ВключатьОблагаемыеОперации Тогда
		СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
		Если ОснованиеЧек Тогда
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации;
		Иначе
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаВидовОпераций;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Процедура заполняет колонки таблицы товаров, которые будут в дальнейшем использоваться
// для формирования движений  и печати
Процедура ДобавитьКолонкиТоваровРеглЛокально(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение) Экспорт
	
	//добавим недостающие колонки
	Если ТаблицаТоваров.Колонки.Найти("Характеристика") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
		ТаблицаТоваров.ЗаполнитьЗначения(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");	
	КонецЕсли; 
	
	Если ТаблицаТоваров.Колонки.Найти("ПроцентСкидкиНаценки") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПроцентСкидкиНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
		ТаблицаТоваров.ЗаполнитьЗначения(0, "ПроцентСкидкиНаценки");	
	КонецЕсли; 
	
	Если ТаблицаТоваров.Колонки.Найти("ПроцентАвтоСкидкиНаценки") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПроцентАвтоСкидкиНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
		ТаблицаТоваров.ЗаполнитьЗначения(0, "ПроцентАвтоСкидкиНаценки");	
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ТекстДляПечатиВКолонкеКоличество") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ТекстДляПечатиВКолонкеКоличество", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(150));	
		ТаблицаТоваров.ЗаполнитьЗначения("", "ТекстДляПечатиВКолонкеКоличество");	
	КонецЕсли; 
	
	
	// Суммы в документе в валюте документа
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСВал"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСВал"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСВал"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСРегл"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСРегл"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСРегл"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСПревышенияРегл"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСПревышенияРегл"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСПревышенияРегл"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Колонки, необходимые для печати документа
	ТаблицаТоваров.Колонки.Добавить("ЦенаМестаБезНДСБезСкидкиРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18,5));
	ТаблицаТоваров.Колонки.Добавить("СуммаСкидкиБезНДСРегл"   	  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСБезСкидкиРегл"	  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
	
	ТаблицаТоваров.Колонки.Добавить("ЦенаБезНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18,2));
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		// Рассчитаем суммы в документе в валюте документа
		СтрокаТаблицы.СуммаСНДСВал    = СтрокаТаблицы.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.НДС);
		СтрокаТаблицы.СуммаНДСВал     = СтрокаТаблицы.НДС;
		СтрокаТаблицы.СуммаБезНДСВал  = СтрокаТаблицы.СуммаСНДСВал - СтрокаТаблицы.СуммаНДСВал;
		
		// Рассчитаем суммы в документе в валюте регл. учета
		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСРегл = СтрокаТаблицы.СуммаСНДСВал;
			СтрокаТаблицы.СуммаНДСРегл  = СтрокаТаблицы.СуммаНДСВал;
		Иначе
			
			СтрокаТаблицы.СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаСНДСВал, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
												СтруктураШапкиДокумента.КурсДокумента, 
												1,
												СтруктураШапкиДокумента.КратностьДокумента,
												1,
												, ПогрешностиОкругления, "СуммаСНДСРегл");
			СтрокаТаблицы.СуммаНДСРегл  = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы.СуммаСНДСРегл,
												СтруктураШапкиДокумента.УчитыватьНДС,
												Истина,
												СтрокаТаблицы.СтавкаНДС,
												ПогрешностиОкругления);
		КонецЕсли;
		СтрокаТаблицы.СуммаБезНДСРегл = СтрокаТаблицы.СуммаСНДСРегл - СтрокаТаблицы.СуммаНДСРегл;
		
		// Рассчитаем суммы в документе в валюте регл. учета
		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСПревышенияРегл = СтрокаТаблицы.СуммаПревышения + СтрокаТаблицы.СуммаНДСПревышения;
			СтрокаТаблицы.СуммаНДСПревышенияРегл = СтрокаТаблицы.СуммаНДСПревышения;
		Иначе
			
			СтрокаТаблицы.СуммаСНДСПревышенияРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаПревышения + СтрокаТаблицы.СуммаНДСПревышения, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
												СтруктураШапкиДокумента.КурсДокумента, 
												1,
												СтруктураШапкиДокумента.КратностьДокумента,
												1,
												, ПогрешностиОкругления, "СуммаСНДСРегл");
			
			СтрокаТаблицы.СуммаНДСПревышенияРегл  = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы.СуммаНДСПревышения,
												СтруктураШапкиДокумента.УчитыватьНДС,
												Истина,
												СтрокаТаблицы.СтавкаНДС,
												ПогрешностиОкругления);
		КонецЕсли;
		СтрокаТаблицы.СуммаБезНДСПревышенияРегл = СтрокаТаблицы.СуммаСНДСПревышенияРегл - СтрокаТаблицы.СуммаНДСПревышенияРегл;
		
		// Поля, используемые при печати документа
		// Скидка
		ПроцентСкидкиНаценки 	 = СтрокаТаблицы.ПроцентСкидкиНаценки + СтрокаТаблицы.ПроцентАвтоСкидкиНаценки;
		Если ПроцентСкидкиНаценки = 100  Тогда
			СтрокаТаблицы.СуммаСкидкиБезНДСРегл = 0;
		Иначе
			СтрокаТаблицы.СуммаСкидкиБезНДСРегл = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.СуммаБезНДСРегл * ПроцентСкидкиНаценки / (100 - ПроцентСкидкиНаценки), 2);			
		КонецЕсли;
		
		// Суммы
		СтрокаТаблицы.СуммаБезНДСБезСкидкиРегл 		= СтрокаТаблицы.СуммаБезНДСРегл + СтрокаТаблицы.СуммаСкидкиБезНДСРегл;
		Если  СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета 
			И НЕ СтруктураШапкиДокумента.СуммаВключаетНДС Тогда
			СтрокаТаблицы.ЦенаМестаБезНДСБезСкидкиРегл = СтрокаТаблицы.Цена;
		Иначе
			СтрокаТаблицы.ЦенаМестаБезНДСБезСкидкиРегл 	= СтрокаТаблицы.СуммаБезНДСБезСкидкиРегл /?(СтрокаТаблицы.Количество = 0, 1, СтрокаТаблицы.Количество);	 
		КонецЕсли;
		
		Если СтрокаТаблицы.Количество = 0 Тогда
			СтрокаТаблицы.ЦенаБезНДСРегл = СтрокаТаблицы.СуммаБезНДСРегл; 
		Иначе	
			Если     СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета 
				И НЕ СтруктураШапкиДокумента.СуммаВключаетНДС
				И    СтрокаТаблицы.СуммаСкидкиБезНДСРегл = 0 Тогда
				СтрокаТаблицы.ЦенаБезНДСРегл = 	СтрокаТаблицы.Цена;
			Иначе	
				СтрокаТаблицы.ЦенаБезНДСРегл = СтрокаТаблицы.СуммаБезНДСРегл / СтрокаТаблицы.Количество; 
			КонецЕсли;
		КонецЕсли;
		
		// 
		
	КонецЦикла;
	
КонецПроцедуры


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	ДобавитьКолонкиТоваровРеглЛокально(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	Возврат ПодготовитьТаблицуТоваров(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

КонецФункции // ПодготовитьТаблицуТоваров()

Функция ПодготовитьТаблицуОС(РезультатЗапросаПоОС, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	ТаблицаПоОС = РезультатЗапросаПоОС.Выгрузить();
	
	ДобавитьКолонкиТоваровРеглЛокально(ТаблицаПоОС, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	Возврат ТаблицаПоОС;

КонецФункции // ПодготовитьТаблицуОС()

Функция ПодготовитьТаблицуНМА(РезультатЗапросаПоНМА, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	ТаблицаПоНМА = РезультатЗапросаПоНМА.Выгрузить();
	
	ДобавитьКолонкиТоваровРеглЛокально(ТаблицаПоНМА, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	Возврат ТаблицаПоНМА;

КонецФункции // ПодготовитьТаблицуНМА()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();
	
	ТаблицаТары.Колонки.Добавить("СтавкаНДС", 	  Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаТары.Колонки.Добавить("СуммаСНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("СуммаСНДСВал", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("СуммаБезНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("СуммаБезНДСВал", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Надо заполнить новые колонки.
	ТаблицаТары.ЗаполнитьЗначения(Перечисления.СтавкиНДС.НеНДС, "СтавкаНДС");
	
	ВалРегл = мВалютаРегламентированногоУчета;
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалРегл, Дата);

	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		СтрокаТаблицы.СуммаСНДСВал   = СтрокаТаблицы.Сумма;
		
		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСРегл = СтрокаТаблицы.Сумма;
		Иначе
			СтрокаТаблицы.СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												СтруктураШапкиДокумента.КурсДокумента, 
												Данные.Курс,
												СтруктураШапкиДокумента.КратностьДокумента,
												Данные.Кратность,
												,ПогрешностиОкругления, "СуммаСНДСРегл");
		КонецЕсли;

		СтрокаТаблицы.СуммаБезНДСРегл = СтрокаТаблицы.СуммаСНДСРегл;
		СтрокаТаблицы.СуммаБезНДСВал  = СтрокаТаблицы.СуммаСНДСВал;
		
	КонецЦикла;
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если  НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		// по фирме не ведется учет НДС, проводить документ не имеет смысла
		ОбщегоНазначения.ОшибкаПриПроведении("Фирма не является плательщиком НДС!", Отказ, Заголовок);
	КонецЕсли;
	
	// Укажем, что надо проверить:
	Если  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
	  
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента, СчетНДС, СчетУчетаНДС");	
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
			СтруктураОбязательныхПолей.Удалить("СчетУчетаНДС");
		КонецЕсли;
		        
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
	      ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда 
		  
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента, Контрагент, СчетНДС, СчетУчетаНДС");
		
	Иначе
		
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента, Контрагент, ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, СчетНДС, СчетУчетаНДС");
		
		Если 	ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			ИЛИ (ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл И НЕ ДоговорКонтрагента.СложныйНалоговыйУчет) Тогда
			
			СтруктураОбязательныхПолей.Вставить("Сделка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураОбязательныхПолей.Вставить("ВидОперации");
	
	Если ПродажаНижеОбычнойЦены 
	 ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда					   
		СтруктураОбязательныхПолей.Вставить("СчетДт");
		
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
			
			//проверим указание субконто для заполнения декларации по прибыли
			Если ЗначениеЗаполнено(СчетДт) Тогда
				
				ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
				Для НомСубконто = 1 По 3 Цикл
					Если СчетДт.ВидыСубконто.Количество()<НомСубконто Тогда
						Прервать;
					КонецЕсли;
					
					ВидСубконто = СчетДт.ВидыСубконто[НомСубконто-1].ВидСубконто;
					Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
						 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
						 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
						ЕстьСубконтоСтатьяЗатратДоходов = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
					СтруктураОбязательныхПолей.Вставить("СубконтоДт" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто); 	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключаетсяВУточняющийРасчет Тогда
		СтруктураОбязательныхПолей.Вставить("УточняемыйПериод");
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если НЕ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		СтруктураОбязательныхПолей.Вставить("Сделка");	
	КонецЕсли;
	
	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, Сумма, СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства");
	
	Если СуммаДокумента = 0 И ПродажаНижеОбычнойЦены Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	// в итоговых розниных накладных количество может быть и не указано
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации Тогда
		
		СтруктураОбязательныхПолей.Удалить("Количество");
		
	КонецЕсли;
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()


// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, 
	                                              Отказ, Заголовок)

	ИмяТабличнойЧасти = "Услуги";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Содержание, Количество, Сумма, СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства");
	                                                                                                       
	Если СуммаДокумента = 0 И ПродажаНижеОбычнойЦены Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

Процедура ПроверитьЗаполнениеТабличнойЧастиОС(ТаблицаПоОС, СтруктураШапкиДокумента, Отказ, Заголовок)
   	ИмяТабличнойЧасти = "ОС";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОсновноеСредство, Сумма, СтатьяДекларацииНДСНалоговыеОбязательства");
	
	Если СуммаДокумента = 0 И ПродажаНижеОбычнойЦены Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиНематериальныеАктивы(ТаблицаПоНМА, СтруктураШапкиДокумента, Отказ, Заголовок)
   	ИмяТабличнойЧасти = "НМА";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("НематериальныйАктив, Сумма, СтатьяДекларацииНДСНалоговыеОбязательства");
	
	Если СуммаДокумента = 0 И ПродажаНижеОбычнойЦены Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, 
                                                          Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвратнаяТара";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Сумма");

	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА,
							  Отказ, Заголовок)
	
	ПроводкиПоНДС(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоТаре, ТаблицаПоОС, ТаблицаПоНМА, Отказ);

	ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА, Отказ);
	
	ДвиженияПоРегиструНДСНалоговыеОбязательства(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА, Отказ);
	
						  
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ПроводкиПоНДС(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоТаре, ТаблицаПоОС, ТаблицаПоНМА, Отказ)
	
	Если  НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации 
	    И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// По необлагаемым и освобожденным от НДС операциям проводки не формируются
		
		Возврат
	КонецЕсли;
	
	ПроводкиБУ = Движения.Хозрасчетный;

	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	ТаблицаКопия.Свернуть("","СуммаНДСРегл, СуммаНДСПревышенияРегл");
	ТаблицаДвижений = ТаблицаКопия.Скопировать();
	
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	ТаблицаКопия.Свернуть("","СуммаНДСРегл, СуммаНДСПревышенияРегл");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	// ОС
	ТаблицаКопия = ТаблицаПоОС.Скопировать();
	ТаблицаКопия.Свернуть("","СуммаНДСРегл, СуммаНДСПревышенияРегл");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	// НМА
	ТаблицаКопия = ТаблицаПоНМА.Скопировать();
	ТаблицаКопия.Свернуть("","СуммаНДСРегл, СуммаНДСПревышенияРегл");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.Свернуть("","СуммаНДСРегл, СуммаНДСПревышенияРегл");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
		
		Если    СтрокаТаблицы.СуммаНДСРегл <> 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.СуммаНДСРегл;
			Проводка.Содержание                 = "НДС: налоговое обязательство: налоговая накладная";
			Проводка.НомерЖурнала               = "";

			Если НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры"   , СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", ОпределитьСделкуЛокально());
				
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
					Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУДт = СтрокаТаблицы.СуммаНДСПревышенияРегл;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоДт3);
			КонецЕсли;
			
			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоКт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоКт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоКт3);

			
		КонецЕсли;

	КонецЦикла;
	
	// проводки на сумму начисленых обязательств по НДС в связи с продажей по цене ниже обычной
	Если ПродажаНижеОбычнойЦены Тогда
		 ТаблицаДвижений.Свернуть("", "СуммаНДСПревышенияРегл");
		 Для каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
			Если  СтрокаТаблицы.СуммаНДСПревышенияРегл <> 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период                     = СтруктураШапкиДокумента.Дата;
				Проводка.Активность                 = Истина;
				Проводка.Организация                = СтруктураШапкиДокумента.Организация;
				Проводка.Сумма                      = СтрокаТаблицы.СуммаНДСПревышенияРегл;
				Проводка.Содержание                 = "НДС: налоговое обязательство: продажа ниже ОЦ";
				Проводка.НомерЖурнала               = "";

				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоДт3);

				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
					Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУДт = СтрокаТаблицы.СуммаНДСПревышенияРегл;
					КонецЕсли;
				КонецЕсли;
				
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоКт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоКт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоКт3);

				
			КонецЕсли;
		 КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА, Отказ)

	Если  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		// при данных операциях регистр не двигается
		Возврат;
	КонецЕсли;	
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаДвиженийТара 	  = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийОплата 	  = ТаблицаДвижений.Скопировать();
	
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
	ТаблицаПродаж = ТаблицаКопия.Скопировать();
	
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПродаж);
	
	// ОС
	ТаблицаКопия = ТаблицаПоОС.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПродаж);

	// НМА
	ТаблицаКопия = ТаблицаПоНМА.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПродаж);
	
	ТаблицаПродаж.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
	ТаблицаПродаж.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
	ТаблицаПродаж.Колонки.СуммаНДСВал   .Имя = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродаж, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(ОпределитьСделкуЛокально(), "Сделка");
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
		
		СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
		
		СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.РеализацияРозница;

	Иначе	
		
		СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация;
		
	КонецЕсли; 
	ТаблицаДвижений.ЗаполнитьЗначения(СобытиеНДС, "СобытиеНДС");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ПодтвержденныйНДС, "КодОперации");
	
	// ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал");
	ТаблицаКопия.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ОпределитьСделкуЛокально(), "Сделка");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина            , "ВозвратнаяТара");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация, "СобытиеНДС");
	
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ПодтвержденныйНДС, "КодОперации");

	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьРасход();
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.Записать();
		
	КонецЕсли;
	
	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
	
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьРасход();
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж()							  

Процедура ДвиженияПоРегиструНДСНалоговыеОбязательства(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА, Отказ)
			
	НаборДвижений = Движения.НДСНалоговыеОбязательства;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	// ОС
	ТаблицаКопия = ТаблицаПоОС.Скопировать();
    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	// НМА
	ТаблицаКопия = ТаблицаПоНМА.Скопировать();
    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСРегл, СуммаНДСРегл");
	ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	Если ПродажаНижеОбычнойЦены Тогда
		// ТОВАРЫ
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
		// УСЛУГИ
		ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		// ОС
		ТаблицаКопия = ТаблицаПоОС.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		// НМА
		ТаблицаКопия = ТаблицаПоНМА.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыеОбязательства", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	КонецЕсли;	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.НДСНалоговыеОбязательства.ДобавитьДвижение();
	
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТипОснования = ТипЗнч(Основание);
	ДокументВводаНаОсновании = Основание;
	
	Если ТипОснования = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ДокументВводаНаОсновании =  "Чек ККМ";
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ТаблицаВидовОпераций = ОпределитьВозможныеВидыОперацийПоОснованию(Основание);
		
		Если ТаблицаВидовОпераций.Количество() > 1 Тогда
			ВыбранныйВидОперации = ТаблицаВидовОпераций.ВыбратьСтроку("Выберите операцию для формирования налоговой накладной");
		ИначеЕсли ТаблицаВидовОпераций.Количество() = 1 Тогда
			ВыбранныйВидОперации = ТаблицаВидовОпераций[0];
		Иначе
			//в документе-основании нет строк с заполненной СтавкойНДС
			ВыбранныйВидОперации = Неопределено;
		КонецЕсли;
			
		Если ВыбранныйВидОперации = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВидОперации = ВыбранныйВидОперации[0];
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		
		ЗаполнитьУсловиеПродажи(Основание);
		ЗаполнитьВидДоговора();
		
		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
		
		// в документе Чек нет некоторых реквизитов...  установим вручную
		Организация = Основание.КассаККМ.Владелец;
		ОбособленноеПодразделение = Основание.КассаККМ.ОбособленноеПодразделение;
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
		СуммаВключаетНДС = Истина;
		АвторасчетНДС = Истина;
		
		ФормаРасчетов = "";
		
		СуммаБезналичнойОплаты = 0;
		Для каждого СтрокаОплаты Из Основание.Оплата Цикл
			
			Если НЕ СтрокаОплаты.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
				СуммаБезналичнойОплаты = СуммаБезналичнойОплаты + СтрокаОплаты.Сумма;
			КонецЕсли;
		
		КонецЦикла;
		
		
		Если СуммаБезналичнойОплаты > 0 Тогда
			
			ФормаРасчетов = "Безготівковий розрахунок";
			
		КонецЕсли;
		Если Основание.СуммаДокумента - СуммаБезналичнойОплаты > 0 Тогда
			
			Если ФормаРасчетов = "" Тогда
				ФормаРасчетов = "Готівка";
			Иначе
				ФормаРасчетов = ФормаРасчетов + ", готівка";
			КонецЕсли; 
			
		КонецЕсли;
		
		// В качестве документа-основания не имеет смысл выбирать документ ЧекККМ
		// с видом операции "Чек на возврат"
		Если   Основание.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
	    	Сообщить("Нельзя вводить документ Налоговая накладная на основании Чека на возврат! ", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		
		СкопироватьТовары(Основание);
		СкопироватьУслуги(Основание);

		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеТоваров")  Тогда
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;
		ДокументОснование = Основание;
		
		// Заполняется только количество, т.к. бухгалтерской себестоимости у нас нет
		
		Для каждого СтрокаТЧ Из Основание.Товары Цикл
			
		 	НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура				=	СтрокаТЧ.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры	=	СтрокаТЧ.ХарактеристикаНоменклатуры;
			НоваяСтрока.Количество					=	СтрокаТЧ.Количество;
			НоваяСтрока.ЕдиницаИзмерения			=	СтрокаТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент					=	СтрокаТЧ.Коэффициент;
			
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ЭтотОбъект, "Реализация");
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Товары");
			
		КонецЦикла; 
		
		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
	
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") 
		    И Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
#Если Клиент Тогда			
	
			
			// имеет смысл вводить налоговую только на услуги нерезидента. 
			// с 2011 года налоговые выписываются при передаче товаров комиссионеру (поставке)
			Выбор = Новый Структура("Значение", 2);
			
			Если Выбор = Неопределено Тогда
				//отказались от выбора
				мНеОткрыватьФормуДокумента = Истина;
				Возврат;
			ИначеЕсли Выбор.Значение = 2 Тогда
			
				// Заполним реквизиты из стандартного набора по документу основанию.
				ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
				
				ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента;
				
				// Этот документ всегда имеет установленный флаг УчитыватьНДС
				УчитыватьНДС = Истина;
				
				СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
				
				//Заполним ТЧ
				СкопироватьУслугиКомиссииОтНерезидента(Основание);
		
				УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
				
				Возврат;
			
			Иначе// Выбор = 1;
				//Стандартное заполнение с помощью обработки
			КонецЕсли;
#КонецЕсли		

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияЗапасов")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияТЗР") Тогда	
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		
		СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
		
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
		
		//Заполним ТЧ
		Если ТипОснования = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияЗапасов") Тогда
			СкопироватьТоварыИзИзмененияНалоговогоНазначенияЗапасов(Основание);
		Иначе	
			СкопироватьТоварыИзИзменениеНалоговогоНазначенияТЗР(Основание);
		КонецЕсли; 

		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
		
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияОС") Тогда	
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;

		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		СуммаВключаетНДС = Ложь;

		ДокументОснование = Основание;
		СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
		
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
		
		//Заполним ТЧ
		СкопироватьТоварыИзИзмененияНалоговогоНазначенияОС(Основание);
		
		ТипПричиныНевыдачиПокупателю = 6;
		
		Возврат;
	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеОС") 
		  ИЛИ ТипОснования = Тип("ДокументСсылка.СписаниеМалоценкиИзЭксплуатации") 
		  ИЛИ ТипОснования = Тип("ДокументСсылка.СписаниеНМА") Тогда	
		  
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС;
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		СуммаВключаетНДС = Ложь;
		
		ДокументОснование = Основание;
		СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
		
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
		
		//Заполним в ТЧ номенклатуру
		Если ТипОснования = Тип("ДокументСсылка.СписаниеОС") Тогда
			ЗаполнитьОСПоСписаниюОС(Основание);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеНМА") Тогда
			ЗаполнитьНМАПоСписаниюНМА(Основание);
		Иначе
			ЗаполнитьТоварыПоСписаниюМалоценкиИзЭксплуатации(Основание);
		КонецЕсли;
		
		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
		
		Возврат;

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ") Тогда	
		
		Если НЕ Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
			
			Сообщить("На основании документа ""Поступление товаров и услуг"" можно вводить ""Налоговую накладную"" только при поставке от нерезидента!");
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
			
		КонецЕсли;	
			       
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ДокументОснование = Основание;
		
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента;
		
		ДокументОснование = Основание;
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		
		СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
		
		//Заполним ТЧ
		СкопироватьУслуги(Основание);
		
		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();

		Возврат;
		
	ИначеЕсли (ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") И Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка)
	       ИЛИ ТипОснования = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда	
			
		мНеОткрыватьФормуДокумента = Истина;
		
		ОбработкаФормированияНН = Обработки.ФормированиеНалоговыхНакладныхПоРознице.ПолучитьФорму();
		ОбработкаФормированияНН.Открыть();
		
		ОбработкаФормированияНН.ЭтотОбъект.Организация = Основание.Организация;
		ОбработкаФормированияНН.ЭтотОбъект.Дата 	   = Основание.Дата;
		
		Возврат;
		
	ИначеЕсли  ТипОснования = Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре") Тогда
		Если Основание.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолгаПоВозвратнойТаре.УПокупателя Тогда
			Сообщить("Нельзя вводить Налоговую накладную на основании документа Корректировка долга по возвратной таре с видом операции ""списание тары покупателя"" ", СтатусСообщения.Внимание);
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		КонецЕсли;
		
		// списание тары поставщика влечет появление налоговых обязательст (условная продажа)
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;
		
		ДокументОснование = Основание;
		СкопироватьТаруВТовары();
	      
		Возврат;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			  И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		// налоговые обязательства возникают по поставке.
		// заполним документ на основании.
		
		// возможно, в документе указаны облагаемые и не облагаемые НДС товары
		ЕстьОблагаемыеОперации = Истина;
		ЕстьНеОблагаемыеОперации = Истина;
		ЕстьНеНДСперации = Истина;
		СтавкиНДС = Основание.Товары.ВыгрузитьКолонку("СтавкаНДС");
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС20) = Неопределено
			И СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0) = Неопределено Тогда
			ЕстьОблагаемыеОперации = Ложь;	
		КонецЕсли;
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.БезНДС) = Неопределено Тогда
			ЕстьНеОблагаемыеОперации = Ложь;	
		КонецЕсли;
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.НеНДС) = Неопределено Тогда
			ЕстьНеНДСперации = Ложь;	
		КонецЕсли;
		
		Если  НЕ ЕстьОблагаемыеОперации 
			И НЕ ЕстьНеОблагаемыеОперации
			И НЕ ЕстьНеНДСперации Тогда
		
			//Сообщить("Нет данных для заполнения документа!");
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		
		КонецЕсли;
		
		ТекущийДокументЗаполнен = Ложь;
		Если ЕстьОблагаемыеОперации Тогда
		
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
			ДокументОснование = Основание;
			ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
			Дата = Основание.Дата;
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			УчитыватьНДС = Истина;
			
			СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
			
			ЗаполнитьВидДоговора();
			ЗаполнитьУсловиеПродажи();
			Если ЗначениеЗаполнено(ДоговорКонтрагента.ФормаРасчетов) Тогда
				ФормаРасчетов = ДоговорКонтрагента.ФормаРасчетов;
			Иначе	
				ФормаРасчетов = "Оплата з поточного рахунку";
				Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= Дата Тогда
					ФормаРасчетов = "Оплата з поточного рахунка";
				КонецЕсли;			
			КонецЕсли;			
			УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				СкопироватьВозвратнуюТару(Основание);
			КонецЕсли;
		
		КонецЕсли;
		
		Если ЕстьНеОблагаемыеОперации Тогда
			
			Если ТекущийДокументЗаполнен Тогда
				новДок = Документы.НалоговаяНакладная.СоздатьДокумент();
			Иначе
				новДок = ЭтотОбъект;
			КонецЕсли;
			
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(новДок, Основание);
			новДок.ДокументОснование = Основание;
			новДок.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации;
			новДок.Дата = Основание.Дата;
			
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			новДок.УчитыватьНДС = Истина;
			
			новДок.СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
			
			новДок.ЗаполнитьВидДоговора();
			новДок.ЗаполнитьУсловиеПродажи();
			Если ЗначениеЗаполнено(новДок.ДоговорКонтрагента.ФормаРасчетов) Тогда
				новДок.ФормаРасчетов = новДок.ДоговорКонтрагента.ФормаРасчетов;
			Иначе	
				новДок.ФормаРасчетов = "Оплата з поточного рахунку";
				Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= новДок.Дата Тогда
					новДок.ФормаРасчетов = "Оплата з поточного рахунка";
				КонецЕсли;
			КонецЕсли;
			новДок.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			новДок.Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			новДок.СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				новДок.СкопироватьВозвратнуюТару(Основание);
			Иначе
				ФормаНовДок = НовДок.ПолучитьФорму(,,Новый УникальныйИдентификатор);
				ФормаНовДок.Открыть();
			КонецЕсли;
		
		КонецЕсли;
		
		Если ЕстьНеНДСперации Тогда
			
			Если ТекущийДокументЗаполнен Тогда
				новДок = Документы.НалоговаяНакладная.СоздатьДокумент();
			Иначе
				новДок = ЭтотОбъект;
			КонецЕсли;
			
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(новДок, Основание);
			новДок.ДокументОснование = Основание;
			новДок.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации;
			новДок.Дата = Основание.Дата;
			
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			новДок.УчитыватьНДС = Истина;
			
			новДок.СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;	
			
			новДок.ЗаполнитьВидДоговора();
			новДок.ЗаполнитьУсловиеПродажи();
			Если ЗначениеЗаполнено(новДок.ДоговорКонтрагента.ФормаРасчетов) Тогда
				новДок.ФормаРасчетов = новДок.ДоговорКонтрагента.ФормаРасчетов;
			Иначе	
				новДок.ФормаРасчетов = "Оплата з поточного рахунку";
				Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= новДок.Дата Тогда
					новДок.ФормаРасчетов = "Оплата з поточного рахунка";
				КонецЕсли;
			КонецЕсли;
			новДок.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			новДок.Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			новДок.СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				новДок.СкопироватьВозвратнуюТару(Основание);
			Иначе
				ФормаНовДок = НовДок.ПолучитьФорму(,,Новый УникальныйИдентификатор);
				ФормаНовДок.Открыть();
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ТекущийДокументЗаполнен Тогда
			ТекстПредупреждения = "Нет данных для заполнения документа!";
			#Если Клиент Тогда
				Предупреждение(ТекстПредупреждения);
			#Иначе
				Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
			#КонецЕсли
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
		    И НЕ Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
			
			ТекстПредупреждения = "С 2011 года налоговые обязательства в комиссионной торговле возникают при поставке товаров на комиссию (необходимо вводить Налоговую накладную на основании документа ""Реализация товаров и услуг""!
					 |По отчету комиссионера можно вводить Приложение 2 к Налоговой накладной на разницу в цене передачи и реализации товаров.";
			#Если Клиент Тогда
				Предупреждение(ТекстПредупреждения);
			#Иначе
				Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
			#КонецЕсли
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
			
	КонецЕсли;
	
	// при вводе на основании запускается специальная обработка, которая и
	// формирует налоговые накладные
	мНеОткрыватьФормуДокумента = Истина;
		
	Если ((    ТипОснования = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"))
		  И Основание.ВидОперации <> Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя)
		  ИЛИ
		  (  ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
		   И Основание.ВидОперации <> Перечисления.ВидыОперацийПКО.ОплатаПокупателя) Тогда
		   
#Если Клиент Тогда
			Предупреждение("По данному документу не возникают налоговые обязательства!");
#Иначе
			Сообщить("По данному документу не возникают налоговые обязательства!", СтатусСообщения.Информация);
#КонецЕсли

			Возврат;
			
	КонецЕсли; 	
	
	
	ОбработкаФормированияНН = Обработки.ФормированиеНалоговыхНакладных.Создать();
	
	ОбработкаФормированияНН.мДокументВводаНаОсновании 	= Основание;
	ОбработкаФормированияНН.Дата						= Основание.Дата;
	
	Если НЕ ЗначениеЗаполнено(Основание.Организация) Тогда
		Сообщить("В документе не указана организация! Заполнение невозможно.");
		Возврат;
	Иначе
		ОбработкаФормированияНН.Организация = Основание.Организация;
	КонецЕсли;
	
	// Основание может содержать номенклатуру для заполнения налоговой накладной
	ОснованиеСодержитНоменклатуру = Ложь;
  	Для каждого ДопустимыйТип Из ОбработкаФормированияНН.ДопустимыеТипыДокументов Цикл
		Если ТипОснования = ДопустимыйТип Тогда
			ОснованиеСодержитНоменклатуру = Истина;
			Прервать;
  		КонецЕсли;
   	КонецЦикла; 

	ОтборДоговоров = Новый ТаблицаЗначений;
	ОтборДоговоров.Колонки.Добавить("РасчетыВозврат");
	ОтборДоговоров.Колонки.Добавить("ДоговорКонтрагента");
	ОтборДоговоров.Колонки.Добавить("Сделка");                                           
	ОтборДоговоров.Колонки.Добавить("Дата", 		Новый ОписаниеТипов("Дата"));	
	ОтборДоговоров.Колонки.Добавить("ЗаТару", 		Новый ОписаниеТипов("Булево"));
	ОтборДоговоров.Колонки.Добавить("СтавкаНДС", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	
	Если ОснованиеСодержитНоменклатуру Тогда
		
		Если НЕ ЗначениеЗаполнено(Основание.ДоговорКонтрагента) Тогда
			
			Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
			
		КонецЕсли;	
			
		СтрокаОтбора 					= ОтборДоговоров.Добавить();
		
		СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
		СтрокаОтбора.Дата               = Основание.Дата;
		
		Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
			 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			СделкаНалоговыйУчет  = Основание;	
			Если  Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
				И ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				
				СделкаНалоговыйУчет = Основание.ЗаказПокупателя;
				
			КонецЕсли;			
			
			СтрокаОтбора.Дата 	 = '00010101';	
			ОбработкаФормированияНН.Дата = '00010101';	
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
				
			СделкаНалоговыйУчет = Основание.СделкаПоРеализации;
			// налоговые обязательства - по оплате
			СтрокаОтбора.Дата 	 		 = '00010101';	
			ОбработкаФормированияНН.Дата = '00010101';	
				
		Иначе
					
			СделкаНалоговыйУчет = Основание.Сделка;	
					
		КонецЕсли;
					
		Если    Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			
			СтрокаОтбора.Сделка = СделкаНалоговыйУчет;
			
			
		ИначеЕсли Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
			// возможно указание заказов в табличной части.		
			СтрокаОтбора.Сделка = СделкаНалоговыйУчет;
			 
			Если ОбработкаФормированияНН.мОтбиратьНоменклатуруПоЗаказам Тогда
				
				ОтборДоговоров.Удалить(СтрокаОтбора);
				
				МетаданныеОснования = Основание.Метаданные();
				
				МассивЗаказов = Новый Массив;
				Для каждого ТЧОснования Из МетаданныеОснования.ТабличныеЧасти Цикл
					Если НЕ (ТЧОснования.Реквизиты.Найти("ЗаказПокупателя") = Неопределено) Тогда
						Для каждого СтрокаТЧ Из Основание[ТЧОснования.Имя] Цикл
							МассивЗаказов.Добавить(СтрокаТЧ.ЗаказПокупателя);
						КонецЦикла;
					ИначеЕсли ЗначениеЗаполнено(СделкаНалоговыйУчет) Тогда
						МассивЗаказов.Добавить(СделкаНалоговыйУчет);
					КонецЕсли;						
				КонецЦикла;
				МассивЗаказов = УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивЗаказов);				
				
				Для каждого Заказ Из МассивЗаказов Цикл
				
					СтрокаОтбора = ОтборДоговоров.Добавить();
					СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
					СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
					СтрокаОтбора.Сделка 			= Заказ;
					Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
						 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
						 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
                        СтрокаОтбора.Дата 				= '00010101';
					Иначе
						СтрокаОтбора.Дата 				= Основание.Дата;
					КонецЕсли;
				
				КонецЦикла;				
			КонецЕсли;			
					
		ИначеЕсли НЕ Основание.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл 
			     ИЛИ Основание.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
			// по расч. док. + слож. налоговый учет
			СтрокаОтбора.Сделка = Неопределено;
					
		Иначе
			
			Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
				 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				 
				Сообщить("Взаиморасчеты ведутся по расчетным документам! Заполнение на основании Счета (заказа) невозможно.");
				Возврат;
				 
			Иначе
				 
				СтрокаОтбора.Сделка = Основание;
				
				Если ОбщегоНазначения.ЕстьТабЧастьДокумента("ДокументыРасчетовСКонтрагентом", Основание.Метаданные()) Тогда
					
					Для каждого СтрокаДокРасчетов Из Основание.ДокументыРасчетовСКонтрагентом Цикл
					
						// по документу может быть два "первых события" по расчетному документу и по ссылке.
						СтрокаОтбора = ОтборДоговоров.Добавить();
						СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
						СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
						СтрокаОтбора.Сделка 			= СтрокаДокРасчетов.ДокументРасчетовСКонтрагентом;
						СтрокаОтбора.Дата 				= Основание.Дата;
					
					КонецЦикла;
				
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЕсли;
			
	Иначе
		
	   Если НЕ Основание.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") = Неопределено Тогда
				
			// платежные документы
			Для каждого СтрокаТЧ Из Основание.РасшифровкаПлатежа  Цикл
				СтрокаОтбора = ОтборДоговоров.Добавить();
									
				СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
				СтрокаОтбора.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
				СтрокаОтбора.Дата 				= Основание.Дата;
					
				СделкаНалоговыйУчет 			= СтрокаТЧ.Сделка;	
					
				Если    СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
					ИЛИ СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
					
					СтрокаОтбора.Сделка = СделкаНалоговыйУчет
					
				ИначеЕсли НЕ Основание.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл 
					     ИЛИ Основание.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
					// по расч. док. + слож. налоговый учет
					СтрокаОтбора.Сделка = Неопределено;
					
				Иначе
					
					СтрокаОтбора.Сделка = СтрокаТЧ.ДокументРасчетовСКонтрагентом;
					
					// добавим еще строку по ссылке - по ней тоже может быть 1-е событие
					СтрокаОтбора = ОтборДоговоров.Добавить();
					СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
					СтрокаОтбора.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
					СтрокаОтбора.Сделка 			= Основание;
					СтрокаОтбора.Дата 				= Основание.Дата;
						
				КонецЕсли;
					
			КонецЦикла;
			
			ОтборДоговоров.Свернуть("Сделка, ДоговорКонтрагента, РасчетыВозврат, Дата, Затару, СтавкаНДС","");
			
		Иначе
			
			Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
				
		КонецЕсли;		
		
	КонецЕсли;

	// получим данные регистра ОжидаемыйИПодтвержденныйНДСПродаж на текущий момент
	ОбработкаФормированияНН.ОбновитьДоговора(ОтборДоговоров);
	
	// укажем номенклатурный состав
	Для каждого СтрокаОтбора Из ОтборДоговоров Цикл
		
		ДокументИсточникНоменклатуры = Неопределено;
	
		Если ОснованиеСодержитНоменклатуру Тогда
				
			ДокументИсточникНоменклатуры = Основание; 	
				
		Иначе
				
			СделкаСодержитНоменклатуру = Ложь;
				
			Для каждого ДопустимыйТип Из ОбработкаФормированияНН.ДопустимыеТипыДокументов Цикл
				Если ТипЗнч(СтрокаОтбора.Сделка) = ДопустимыйТип Тогда
					СделкаСодержитНоменклатуру = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Если СделкаСодержитНоменклатуру Тогда
				ДокументИсточникНоменклатуры = СтрокаОтбора.Сделка;
			КонецЕсли;
				
		КонецЕсли;
						
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Документ", 			ДокументИсточникНоменклатуры);
		СтруктураОтбора.Вставить("ДоговорКонтрагента", 	СтрокаОтбора.ДоговорКонтрагента);
		СтруктураОтбора.Вставить("Сделка", 				СтрокаОтбора.Сделка);
		СтруктураОтбора.Вставить("РасчетыВозврат", 		СтрокаОтбора.РасчетыВозврат);
		СтруктураОтбора.Вставить("Дата", 				СтрокаОтбора.Дата);
		
		Если НЕ ДокументИсточникНоменклатуры = Неопределено Тогда
			
			СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.Документ 			= ДокументИсточникНоменклатуры;
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента = СтрокаОтбора.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.Сделка 			= СтрокаОтбора.Сделка;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 	= СтрокаОтбора.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Дата			 	= СтрокаОтбора.Дата;
				
			ОбработкаФормированияНН.ЗаполнитьТабличныеЧасти(СтруктураОтбора);
			
		КонецЕсли;
			
	КонецЦикла;	
	
	МожноФормироватьНалоговыеНакладные  = Истина;
	БудутСформированыНалоговыеНакладные = Истина;

	// Проверим, можно ли не открывать форму обработки для корректировок
	Для каждого СтрокаОтбора Из ОтборДоговоров Цикл
						
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("ДоговорКонтрагента", 	СтрокаОтбора.ДоговорКонтрагента);
		СтруктураОтбора.Вставить("Сделка", 				СтрокаОтбора.Сделка);
		СтруктураОтбора.Вставить("РасчетыВозврат", 		СтрокаОтбора.РасчетыВозврат);
		СтруктураОтбора.Вставить("Дата", 				СтрокаОтбора.Дата);
		
		ТаблицаЧастичнойОтгрузки = Неопределено;
		ОбязательствБольшеЧемНоменклатуры = ОбработкаФормированияНН.МожноФормироватьНалоговыеНакладные(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
		
		Если  ТаблицаЧастичнойОтгрузки.Количество() = 0 Тогда
			
			// вообще нет номенклатуры для заполнения
			МожноФормироватьНалоговыеНакладные = Ложь;
			Прервать;
			
		ИначеЕсли НЕ ОбязательствБольшеЧемНоменклатуры Тогда                     
			
			МожноФормироватьНалоговыеНакладные  = Ложь;
			
			// есть номенклатурный состав для заполнения
			Если НЕ ОбработкаФормированияНН.БудутСформированыНалоговыеНакладные(ТаблицаЧастичнойОтгрузки) Тогда
				
				БудутСформированыНалоговыеНакладные = Ложь;
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Если МожноФормироватьНалоговыеНакладные Тогда
			
	ИначеЕсли НЕ БудутСформированыНалоговыеНакладные Тогда
				  
#Если Клиент Тогда
		Ответ = Вопрос("По данному документу не возникают налоговые обязательства. Открыть форму обработки заполнения налоговой накладной номенклатурным составом?", РежимДиалогаВопрос.ДаНет);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
#Иначе
		Сообщить("По данному документу не возникают налоговые обязательства!", СтатусСообщения.Информация);
		Возврат;
#КонецЕсли
				
				
	Иначе
#Если Клиент Тогда
			Если  ОтборДоговоров.Количество() = 1 И (НЕ ДокументИсточникНоменклатуры = Неопределено) Тогда
		    	ВариантыОтвета = РежимДиалогаВопрос.ДаНетОтмена;
			Иначе
				ВариантыОтвета = РежимДиалогаВопрос.ОКОтмена;
			КонецЕсли;
	
			Ответ = Вопрос("Заполнить налоговую накладную номенклатурным составом невозможно. Открыть форму обработки заполнения налоговой накладной номенклатурным составом?", ВариантыОтвета);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
					
				// открываем НН заполненную строками "частичная отгрузка"
				СтруктураОтбора.Вставить("Документ", ДокументИсточникНоменклатуры);
				
				ОбработкаФормированияНН.ПодготовитьНоменклатурныйСоставПриЧастичнойОтгрузке(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
				ОбработкаФормированияНН.ОткрыватьДокументы = Истина;
				ОбработкаФормированияНН.СформироватьНалоговыеДокументы();	
					
				Возврат;	
				
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли; 
#Иначе
			Сообщить("Заполнить налоговую накладную номенклатурным составом невозможно!", СтатусСообщения.Информация);
#КонецЕсли

	КонецЕсли;
	
	// сюда мы попадаем только, если по всем договорам можно сформировать налоговые накладные
	Если МожноФормироватьНалоговыеНакладные Тогда
				
		ОбработкаФормированияНН.ОткрыватьДокументы = Истина;
				
		// сформированные документы не будут записаны в базу
		ОбработкаФормированияНН.мНеЗаписыватьДокументы = Истина;
				
		ОбработкаФормированияНН.СформироватьНалоговыеДокументы();	
		Возврат;	

	КонецЕсли;	
	
	// необходимо подкорректировать номенклатурный состав.
	// откроем обработку. Но в ТЧ Договора может не быть строк - если остатков по регистру НДСПродаж не текущий момент нет
	// Добавим строки при необходимости
	Для каждого СтрокаОтбораДоговоров Из ОтборДоговоров Цикл
		
		Если ОбработкаФормированияНН.Договора.НайтиСтроки(Новый Структура("ДоговорКонтрагента, Сделка",СтрокаОтбораДоговоров.ДоговорКонтрагента,СтрокаОтбораДоговоров.Сделка)).Количество() = 0 Тогда
			
			СтрокаДоговоров = ОбработкаФормированияНН.Договора.Добавить();
			СтрокаДоговоров.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаДоговоров.Сделка 				= СтрокаОтбораДоговоров.Сделка;
			СтрокаДоговоров.РасчетыВозврат 		= СтрокаОтбораДоговоров.РасчетыВозврат;
			СтрокаДоговоров.Дата 				= СтрокаОтбораДоговоров.Дата;

			
			СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.Сделка 				= СтрокаОтбораДоговоров.Сделка;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= СтрокаОтбораДоговоров.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Дата 					= СтрокаОтбораДоговоров.Дата;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ФормаОбоработки =  ОбработкаФормированияНН.ПолучитьФорму();
	ФормаОбоработки.ВосстанавливатьЗначенияПриОткрытии = Ложь;
	ФормаОбоработки.ОткрыватьДокументы = Истина;
	ФормаОбоработки.Открыть();
	ФормаОбоработки.ЭлементыФормы.Панель.ТекущаяСтраница = ФормаОбоработки.ЭлементыФормы.Панель.Страницы.Данные;
		
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() > 0
	   И (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента) Тогда
		Товары.Очистить();
	КонецЕсли;
	
	// Если это спец операции -  надо почистить закладки
	Если ВозвратнаяТара.Количество() > 0
		И (ДоговорКонтрагента.Внешнеэкономический 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда

		ВозвратнаяТара.Очистить();

	КонецЕсли;
	Если Услуги.Количество() > 0
		И ( ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда

		Услуги.Очистить();

	КонецЕсли;	
	Если ОС.Количество() > 0
		И ( ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации) Тогда

		ОС.Очистить();

	КонецЕсли;	
	Если НМА.Количество() > 0
		И ( ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента) Тогда

		НМА.Очистить();

	КонецЕсли;	
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
		//очистим колонки СчетУчетаНДС в ТЧ товары и ОС
		СчетУчетаНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка();		
	КонецЕсли;
	
	Если НЕ ПродажаНижеОбычнойЦены Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		Для каждого СтрокаТЧ Из Услуги Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		Для каждого СтрокаТЧ Из ОС Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		Для каждого СтрокаТЧ Из НМА Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если АвторасчетНДС Тогда
		// соответствие для хранения погрешностей округлений
		ПогрешностиОкругления = Новый Соответствие();
		// пересчет сумм НДС с учетом ошибок округления
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Товары, 	ЭтотОбъект, ПогрешностиОкругления, "Товары");
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Услуги, 	ЭтотОбъект, ПогрешностиОкругления, "Услуги");
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(ОС, 		ЭтотОбъект, ПогрешностиОкругления, "ОС");
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(НМА, 	ЭтотОбъект, ПогрешностиОкругления, "НМА");
	КонецЕсли;
	
	// Посчитать суммы документа и записать их в соответствующие реквизиты шапки для показа в журналах
	СуммаДокумента 	  = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект,, Ложь); //с учетом стоимости возвратнонй тары
	СуммаНДСДокумента = УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если УчетнаяПолитикаНеЗадана тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ 
		ИЛИ УчетнаяПолитикаНеЗадана 
		ИЛИ НЕ УчетнаяПолитика.ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам = Истина  Тогда
		// манипуляций со служебной налоговой не делаем
	ИначеЕсли ПродажаНижеОбычнойЦены Тогда
		
		Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			
			Если НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект() = Неопределено Тогда
				НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Неопределено;
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			
			
			// в начале получим номер, если его еще нет, т.к. хорошо бы номер основной налоговой был меньше налоговой по ОЦ
			Если НЕ ЗначениеЗаполнено(Номер) Тогда
				УстановитьНовыйНомер();
			КонецЕсли;	
			
			Док = Документы.НалоговаяНакладная.СоздатьДокумент();	
			ЗаполнитьЗначенияСвойств(Док, ЭтотОбъект);
			
			Док.Номер = "";
			Док.ПродажаНижеОбычнойЦены = Ложь;
			Док.ПодтверждаетсяГТД = Ложь;
			Док.Проведен = Ложь;
			Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
			Док.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены 		   = Неопределено;
			
			Док.УстановитьНовыйНомер();
			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Запись);
			
			// пропишем вспомогательный документ для номера в реквизит
			НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Док.Ссылка; 
			
		Иначе	
			
			// возможно нужно изменить номер документа (при изменении даты/организации)
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			Док.Дата = Дата;
			Док.Организация = Организация;
			ОбщегоНазначения.ПроверитьНомерНалоговогоДокумента(Док);
			Если Не ЗначениеЗаполнено(Док.Номер) Тогда
				Док.УстановитьНовыйНомер();
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			// "освободим" сформированную налоговую
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
			Док.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены 		   = Неопределено;
			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Неопределено;
		
	КонецЕсли;
	
	// поставим флаг "Требует регистрация в реестре"
	Если ТипПричиныНевыдачиПокупателю > 0 Тогда
		// мы не управляем флажком ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных
		// для налоговых накладных, которые не выдаются покупателю
		// согласно разъяснению ЕБНЗ такие налоговые не должны регистрироваться в Едином реестре
		
	Иначе	
		
		ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
		Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			НДСРегл = СуммаНДСДокумента;	
		Иначе 
			НДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСДокумента, ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												1,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		КонецЕсли;
		Если Дата >= '20120101' Тогда
			// или сумма НДС в документе больше 10 000 грн
			Если НДСРегл > 10000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
				
			// или имеются подакцизные/импортированные товары
			// этот факт определим так - если в строке указан код УКТЗЭД - считаем что условие выполняется.
			ИначеЕсли   Товары.НайтиСтроки(Новый Структура("КодУКТВЭД", Справочники.КлассификаторУКТВЭД.ПустаяСсылка())).Количество() 	<> Товары.Количество()
					ИЛИ ОС.    НайтиСтроки(Новый Структура("КодУКТВЭД", Справочники.КлассификаторУКТВЭД.ПустаяСсылка())).Количество() 	<> ОС.Количество()
					ИЛИ НМА.   НайтиСтроки(Новый Структура("КодУКТВЭД", Справочники.КлассификаторУКТВЭД.ПустаяСсылка())).Количество() 	<> НМА.Количество() Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110701' Тогда
			// сумма НДС в документе больше 100 000 грн
			Если НДСРегл > 100000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110401' Тогда
			// сумма НДС в документе больше 500 000 грн
			Если НДСРегл > 500000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110101' Тогда
			// сумма НДС в документе больше 1 000 000 грн
			Если НДСРегл > 1000000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если УчетнаяПолитикаНеЗадана тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ 
	   И НЕ УчетнаяПолитикаНеЗадана 
	   И УчетнаяПолитика.ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам = Истина   
	   И ПродажаНижеОбычнойЦены Тогда
	   
	   // установим в служебном документе ссылку на текущую накладную.
		Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			
			Если НЕ Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Ссылка Тогда
				Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Ссылка;
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(СтруктураШапкиДокумента.Дата), Отказ, СтруктураШапкиДокумента.Организация, "Нал");
		
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , УчетнаяПолитика.ЕстьНалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитика.ЕстьНДС);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

Функция ПодготовитьСтруктуруШапкиДокумента(Отказ, Заголовок = "")
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента;

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"                  , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета"              , "КурсВалютыУправленческогоУчета");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                      , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                      , "ВидДоговора");		
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"             , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"					   , "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Внешнеэкономический"                     , "Внешнеэкономический");	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// дополним структуру значением виртуального реквизита
	СтруктураШапкиДокумента.Вставить("ОтражатьВНалоговомУчете", Истина);
	
	// Прежде всего, проверим заполнение реквизита Организация в шапке документа
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	// Теперь позовем общую процедуру проверки
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Организация не заполнена, получать учетную политику нет смысла
	Если Отказ Тогда
		Возврат СтруктураШапкиДокумента;
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		СтруктураШапкиДокумента.Вставить("ЕстьНДС", мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС = Истина);
	КонецЕсли;
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции

Процедура ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА)
	
	
	ПогрешностиОкругления     		= Новый Соответствие;
	ПогрешностиОкругленияПревышение = Новый Соответствие;
	ПогрешностиОкругленияТара 		= Новый Соответствие;

	
	// ТОВАРЫ
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей        = Новый Структура();
    СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура.НаименованиеПолное");
	СтруктураПолей.Вставить("КодУКТВЭД"              	, "КодУКТВЭД");
	СтруктураПолей.Вставить("НомерГТД"              	, "НомерГТД.Код");
	СтруктураПолей.Вставить("ДатаГТД"              	    , "НомерГТД.Дата");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "ЕдиницаИзмерения.Наименование");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Количество"	           	, "Количество");	
	СтруктураПолей.Вставить("Цена"                      , "Цена");	
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоСкидкиНаценки"  , "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("Характеристика"			, "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыеОбязательства" , "СтатьяДекларацииНДСНалоговыеОбязательства");
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	
	СтруктураПолей.Вставить("ТекстДляПечатиВКолонкеКоличество", "Номенклатура.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);
	
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		ТаблицаПоТоварам.ЗаполнитьЗначения("", "Количество,ЕдиницаИзмерения,ЦенаМестаБезНДСБезСкидкиРегл");
	КонецЕсли;
	
	// УСЛУГИ
	// Получим необходимые данные для проведения и проверки заполенения данных 
	// по табличной части "Услуги".
	СтруктураПолей        = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Номенклатура"              , "Содержание");
	СтруктураПростыхПолей.Вставить("КодУКТВЭД"  		, "");
	СтруктураПростыхПолей.Вставить("НомерГТД"           , "");
	СтруктураПростыхПолей.Вставить("ДатаГТД"            , "");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "Номенклатура.ЕдиницаХраненияОстатков.Наименование");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Количество"            	, "Количество");
	СтруктураПолей.Вставить("Цена"                      , "Цена");		
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоСкидкиНаценки"  , "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыеОбязательства"  		, "СтатьяДекларацииНДСНалоговыеОбязательства");	
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	
	СтруктураПолей.Вставить("ТекстДляПечатиВКолонкеКоличество", "Номенклатура.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной");

	РезультатЗапросаПоУслугам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей, СтруктураПростыхПолей);
	
	// Подготовим таблицу Услуг для проведения или печати
	ТаблицаПоУслугам = ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	
	// ОСНОВНЫЕ СРЕДСТВА
	// Получим необходимые для проведения и проверки заполнения данные 
	// по табличной части "ОС".
	СтруктураПолей        = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Номенклатура"              , "ОсновноеСредство.НаименованиеПолное");
	СтруктураПолей.Вставить("КодУКТВЭД"              	, "КодУКТВЭД");
	СтруктураПолей.Вставить("НомерГТД"              	, "НомерГТД.Код");
	СтруктураПолей.Вставить("ДатаГТД"              	    , "НомерГТД.Дата");
	СтруктураПолей.Вставить("Цена"                      , "Сумма");			
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыеОбязательства"  		, "СтатьяДекларацииНДСНалоговыеОбязательства");	
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	СтруктураПростыхПолей.Вставить("ЕдиницаИзмерения", "шт.");
	СтруктураПростыхПолей.Вставить("Количество"  , 1);	
	
	РезультатЗапросаПоОС = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей, СтруктураПростыхПолей);
	
	// Подготовим таблицу Основных Средств для проведения или печати
	ТаблицаПоОС = ПодготовитьТаблицуОС(РезультатЗапросаПоОС, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	// НЕМАТЕРИАЛЬНЫЕ АКТИВЫ
	// Получим необходимые для проведения и проверки заполнения данные 
	// по табличной части "НМА".
	СтруктураПолей        = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Номенклатура"              , "НематериальныйАктив.НаименованиеПолное");
	СтруктураПолей.Вставить("КодУКТВЭД"              	, "КодУКТВЭД");
	СтруктураПолей.Вставить("НомерГТД"              	, "НомерГТД.Код");
	СтруктураПолей.Вставить("ДатаГТД"              	    , "НомерГТД.Дата");
	СтруктураПолей.Вставить("Цена"                      , "Сумма");			
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыеОбязательства"  		, "СтатьяДекларацииНДСНалоговыеОбязательства");	
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	СтруктураПростыхПолей.Вставить("ЕдиницаИзмерения", "шт.");
	СтруктураПростыхПолей.Вставить("Количество"  , 1);	
	
	РезультатЗапросаПоНМА = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НМА", СтруктураПолей, СтруктураПростыхПолей);
	
	// Подготовим таблицу Нематериальных активов для проведения или печати
	ТаблицаПоНМА = ПодготовитьТаблицуНМА(РезультатЗапросаПоНМА, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	// ТАРА
	// Получим необходимые данные для проведения и проверки заполенения данных 
	// по табличной части "ВозвратнаяТара".
	СтруктураПолей        = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Сумма"         , "Сумма");
	
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура.НаименованиеПолное");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	
	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей, СтруктураПростыхПолей);

	// Подготовим таблицу тары для проведения или печати.
	ТаблицаПоТаре = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругленияТара);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА;
	
	Если ЗначениеЗаполнено(ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	// Подготовим структуру шапки документа
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ, Заголовок);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Подготовим таблицы
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА);
	
	// Проверить заполнение ТЧ .
	ПроверитьЗаполнениеТабличнойЧастиТовары			(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиУслуги			(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара	(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиОС				(ТаблицаПоОС, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиНематериальныеАктивы(ТаблицаПоНМА, СтруктураШапкиДокумента, Отказ, Заголовок);

	
	//Проверим на возможность проведения в БУ и НУ.
	УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,
		                                     Истина, Истина, мВалютаРегламентированногоУчета, 
		                                     Ложь, Отказ, Заголовок, "", СтруктураШапкиДокумента.ВалютаВзаиморасчетов);

	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре,
							ТаблицаПоУслугам, ТаблицаПоОС, ТаблицаПоНМА, Отказ, Заголовок);
	КонецЕсли;

	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// копия общей процедуры НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(). С одним отличием - Упрощ. нал. учет по расчетным документом в 
// качестве сделки всегда возвращает указанную в документе сделку
// 
Функция ОпределитьСделкуЛокально() Экспорт

	
	Если 	  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда

        Возврат Неопределено;
		
	ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		
		Если НЕ ДоговорКонтрагента.СложныйНалоговыйУчет 
			  И ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			  
			Возврат Сделка;

			
		Иначе
			
			Возврат Неопределено;
						
		КонецЕсли;
		
	Иначе

		Возврат Сделка;

	КонецЕсли;
   
КонецФункции // УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом()

Процедура ЗаполнитьУКТВЭДВСтрокеТоваров(СтрокаТабличнойЧасти) Экспорт
	НоменклатураГТДХарактеристики = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.НоменклатураГТД;
	
	Если СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.ОтечественныйНеподакцизныйТовар = Истина Тогда
		
		СтрокаТабличнойЧасти.КодУКТВЭД = Неопределено;
		СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(НоменклатураГТДХарактеристики) Тогда
		СтрокаТабличнойЧасти.КодУКТВЭД = НоменклатураГТДХарактеристики.КодУКТВЭД;
		СтрокаТабличнойЧасти.НомерГТД  = НоменклатураГТДХарактеристики.НомерГТД;
	Иначе
		СтрокаТабличнойЧасти.КодУКТВЭД = СтрокаТабличнойЧасти.Номенклатура.НоменклатураГТД.КодУКТВЭД;
		СтрокаТабличнойЧасти.НомерГТД  = СтрокаТабличнойЧасти.Номенклатура.НоменклатураГТД.НомерГТД;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Неопределено;	
	ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
	ВключенаВЕдиныйРеестрНалоговыхНакладных = Ложь;

КонецПроцедуры

мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВидОперацииДляЗаполнения = Неопределено;
мЗаполнятьВозвратнуюТару  = Истина;

мНеОткрыватьФормуДокумента = Ложь;
