Перем мВалютаРегламентированногоУчета Экспорт;

Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;
Перем мИспользоватьОборотнуюНоменклатуру Экспорт;
Перем мРазделятьПоСтавкамНДС Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;


Перем мПараметрыСвязиСтрокТЧ Экспорт;

Перем мУдалятьДвижения;

Перем мУказаниеСкладовВТЧ Экспорт;

// Хранит структуру, содержащую параметры для определения договора, доступного в данном документе:
//    список допустимых видов договоров;
//    список допустимых способов ведения взаиморасчетов.
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;

// Хранит валюту взаиморасчетов, установленную в текущем договоре взаиморасчетов,
// используется для определения необходимости пересчетов при изменении договора.
Перем мТекущаяВалютаВзаиморасчетов Экспорт;

// Хранит текущий договор контрагента
// используется для восстановления старого договора в случае некорректного выбора нового
Перем мТекущийДоговорКонтрагента Экспорт;

// Хранит текущее значение склада для контроля учетной политики розничная торговля облагается ЕНВД
Перем мТекущийСклад Экспорт;

Перем мСтруктураПараметровВзаиморасчетов Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьВозвратаПоставщику()

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Артикул";
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Код";
		ТекстКодАртикул = "Код";
	Иначе
		ВыводитьКоды    = Ложь;
		Колонка         = "";
		ТекстКодАртикул = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ДоговорКонтрагента,
	|	ДоговорКонтрагента.ВидДоговора КАК ВидДоговораКонтрагента,
	|	ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ДоговорВедениеВзаиморасчетов,
	|	ДоговорКонтрагента.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,	
	|	ДоговорКонтрагента.ВыводитьИнформациюОСделкеПриПечатиДокументов КАК ПечататьСделку,	
    |	Сделка,
	|	ПредставительОрганизации КАК ПредставительПоставщика,
	|	ВЫРАЗИТЬ(МестоСоставленияДокумента КАК СТРОКА(1000)) КАК МестоСоставленияДокумента,
	|	Контрагент КАК Поставщик,
	|	Организация,
	|	Организация КАК Покупатель,
	|   ДоверенностьСерия,
	|	ДоверенностьНомер,
	|	ДоверенностьДата,
	|	Получил,
	|	СуммаДокумента,
	|	ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ КАК ВозвратТоваровПоставщику
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерТЧ,
	|	НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|	Номенклатура.Код     КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	КоличествоМест,
	|	ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|	ЕдиницаИзмеренияМест.Представление КАК ЕдиницаМест,
	|	Цена,
	|	Сумма,
	|	СуммаНДС,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия
	|ИЗ 
	|	(ВЫБРАТЬ
	|		1 КАК НомерТЧ,
	|		МИНИМУМ(НомерСтроки) КАК НомерСтрокиТЧ,
	|		Номенклатура         КАК Номенклатура,
	|		ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		Цена                 КАК Цена,
	|		СтавкаНДС            КАК СтавкаНДС,
	|		СерияНоменклатуры    КАК СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(Количество)    КАК Количество,
	|		СУММА(КоличествоМест)КАК КоличествоМест,
	|		СУММА(Сумма)         КАК Сумма,
	|		СУММА(СуммаНДС)      КАК СуммаНДС
	|	ИЗ
	|		Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ВозвратТоваровПоставщику
	|	ГДЕ
	|		ВозвратТоваровПоставщику.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест,
	|		Цена,
	|		СтавкаНДС,
	|		СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры
	|	) КАК ВложенныйЗапросПоТоварам
	|УПОРЯДОЧИТЬ ПО
	|	НомерТЧ, НомерСтрокиТЧ
	|";
	
	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НомерСтроки						КАК НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000))  КАК Товар,
	|	Номенклатура.Код                КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаЦены,	
	|	Цена,
	|	Сумма
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.ВозвратнаяТара КАК ВозвратТоваровПоставщику
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиТЧ
	|";
	
	ЗапросТара = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВозвратТоваровПоставщикуИзНТТ_Накладная";

	Макет = ПолучитьМакет("Накладная");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Выводим шапку нкладной

	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Возврат поставщику (из НТТ)';uk='Повернення постачальнику (з НТТ)'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ФактическийАдрес,Телефоны,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПокупателя		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим дополнительно информацию о договоре и сделке
	СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";
	Если Шапка.ПечататьСделку = Истина Тогда
		СписокДополнительныхПараметров = СписокДополнительныхПараметров + "Сделка,";
	КонецЕсли;
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;		
	
	Если ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	Если Товары.Итог("КоличествоМест") > 0 Тогда
		ОбластьШапки  = ОбластьШапки  + "Мест";
		ОбластьСтроки = ОбластьСтроки + "Мест";
	Конецесли;
	
	// Вывести табличную часть (товары и услуги)
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = Колонка;
	КонецЕсли;
	
	
	Суффикс = "";
	Если Шапка.УчитыватьНДС Тогда
		Если Шапка.СуммаВключаетНДС Тогда
			Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
		Иначе	
			Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
		КонецЕсли;
		Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
	КонецЕсли;
	ОбластьМакета.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
	ОбластьМакета.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	
	Сумма    = 0;
	СуммаНДС = 0;

	Для каждого ВыборкаСтрокТовары из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);

		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТовары.КодАртикул;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Сумма    = Сумма    + ВыборкаСтрокТовары.Сумма;
		СуммаНДС = СуммаНДС + ВыборкаСтрокТовары.СуммаНДС;
		
	КонецЦикла;

	ОбластьИтого = "Итого";
	
	// Вывести Итого
	ОбластьМакета                 = Макет.ПолучитьОбласть(ОбластьИтого);
	ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);

	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести ИтогоНДС
	Если Шапка.УчитыватьНДС Тогда
		// НДС
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаНДС,,"''");
		ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
		ТабДокумент.Вывести(ОбластьМакета);

		// всего с НДС (если сумма не включает НДС)
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(Сумма + СуммаНДС);
			ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Усього з ПДВ:'",КодЯзыкаПечать);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЕсли;
	
	// Вывести таблицу с возвратной тарой
	ОбластьШапки  = СтрЗаменить(ОбластьШапки,"Мест","") +"Тара";
	ОбластьСтроки = СтрЗаменить(ОбластьСтроки,"Мест","")+"Тара";
	
	Если ЗапросТара.Количество() > 0 Тогда
		
		// сделаем отступ от основной таблицы
		ОбластьПробел = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьПробел);
		
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.Колонка = Колонка;
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		
		СуммаТара    = 0;
		
		Для каждого ВыборкаСтрокТара Из ЗапросТара Цикл 
		
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТара);
			ОбластьМакета.Параметры.НомерСтроки = ЗапросТара.Индекс(ВыборкаСтрокТара) + 1;
			ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТара.Номенклатура);

			Если ВыводитьКоды Тогда
				ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТара.КодАртикул;
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

			СуммаТара = СуммаТара + ВыборкаСтрокТара.Сумма;
		
		КонецЦикла; 
		
		// Вывести Итого
		ОбластьИтого = "ИтогоТара";
		ОбластьМакета                 = Макет.ПолучитьОбласть(ОбластьИтого);
		ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(СуммаТара);
		ТабДокумент.Вывести(ОбластьМакета);		
		
		// сделаем отступ
		ТабДокумент.Вывести(ОбластьПробел);
	КонецЕсли;
	
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ЗапросТовары.Количество() + "," +
											 НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента)
											 + ?(ЗапросТара.Количество() = 0, "",  НСтр("ru='; возвратная тара ';uk='; зворотна тара '",КодЯзыкаПечать) + ЗапросТара.Количество() + НСтр("ru=', на сумму ';uk=', на суму '",КодЯзыкаПечать) + ОбщегоНазначения.ФорматСумм(СуммаТара, Шапка.ВалютаДокумента)) + ".";
											 
	ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
	 										 + ?(НЕ Шапка.УчитыватьНДС, "", Символы.ПС + НСтр("ru='В т.ч. НДС: ';uk='У т.ч. ПДВ: '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаНДС, Шапка.ВалютаДокумента, КодЯзыкаПечать));
	ТабДокумент.Вывести(ОбластьМакета);

	Если ЗначениеЗаполнено(Шапка.МестоСоставленияДокумента) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("МестоСоставления");
		ОбластьМакета.Параметры.МестоСоставления = СокрЛП(Шапка.МестоСоставленияДокумента);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	// Вывести подписи
	ДанныеПредставителя = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация,Шапка.ПредставительПоставщика, Шапка.Дата);
	ДолжностьПредставителя = СокрЛП(ДанныеПредставителя.Должность);
	
	ДолжностьФИОПредставителя = ?(ЗначениеЗаполнено(ДолжностьПредставителя),ДолжностьПредставителя + " ","") + 
								?(ДанныеПредставителя.Фамилия = Неопределено,"",ДанныеПредставителя.Фамилия + " ") + 
								?(ДанныеПредставителя.Имя = Неопределено,"",ДанныеПредставителя.Имя + " ") +
								?(ДанныеПредставителя.Отчество = Неопределено,"",ДанныеПредставителя.Отчество);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.Ответственный = ДолжностьФИОПредставителя;
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьВозвратаПоставщику()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Накладная"  Тогда
		ТабДокумент = ПечатьВозвратаПоставщику();
	ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
		ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ""), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Накладная,СерийныеНомера","Возврат поставщику", "Список серийных номеров");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДокумента)

	Если ЗаполнятьБУ = Истина Тогда

		Если  ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом 
			И ИмяТабЧасти = "Товары" Тогда
			СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаДоп;
		Иначе

			СтрокаТЧ.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		СтрокаТЧ.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();

	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУ()

// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДокумента)

	Если ЗаполнятьНУ  = Истина Тогда
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначение;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 		= СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;				
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначениеДоходовИЗатрат", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;				
	КонецЕсли; // Если ЗаполнятьНУ  = Истина Тогда

КонецПроцедуры // ЗаполнитьСчетаНУ()

// Заполняет счета БУ и НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	СчетаУчета    = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);
	МетаданныеДок = ЭтотОбъект.Метаданные();

	ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьБУ, МетаданныеДок);
	ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, ЗаполнятьНУ, МетаданныеДок);

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части.
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

Процедура РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.СуммаВРознице = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент / СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * СтрокаТабличнойЧасти.ЦенаВРознице;
	
КонецПроцедуры

// Возвращает текстовые участки запроса, выполняемого
// при заполнении на основании ТЧ Товары
Процедура ПолучитьУчасткиЗапросаПоТоварамОрганизацийДляЗаполненияТЧТовары(ПолеОстаткиОрганизации, СоединениеТоваровОрганизаций, ТекстЗапросаСписокНоменклатуры)
	
	ПолеОстаткиОрганизации = "
	|	ОстаткиОрганизации.КоличествоОстаток                 КАК КоличествоОстатокОрганизации,";
	
	СоединениеТоваровОрганизаций = "
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(, Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ") 
	|	                                               И Организация = &Организация) КАК ОстаткиОрганизации
	|ПО
	|	Док.Номенклатура               = ОстаткиОрганизации.Номенклатура
	| "+?(ВестиУчетПоДопРазрезамРегл,"И Док.ХарактеристикаНоменклатуры = ОстаткиОрганизации.ХарактеристикаНоменклатуры","");
	
КонецПроцедуры

Процедура УчестьОстаткиТоваровОрганизацийПриЗаполненииТЧТовары(КоличествоПоДокументу, Выборка)
	
	КоличествоПоДокументу = Мин(Выборка.КоличествоПоДокументу, 
						   ?(Выборка.КоличествоОстатокОрганизации=NULL, 0, Выборка.КоличествоОстатокОрганизации));
						   
					   КонецПроцедуры

// Функция возвращает сделки из табличных частей документа основания.
// Если документ основания содержит в своих табличных частях поле "Заказ поставщику" (сделка)
// тогда, для корректного заполнения документа необходимо выбрать сделку.
//
// Параметры:
// ДокументОснованиеИмя - имя документа из которого необходимо получить сделки
// ТабличныеЧасти       - структура с именами табличных частей, из которых необходимо получать сделки
// ДокументОснование    - документ основание
//
// Возвращаемое значение:
// Структура, Ключ      - ПараметрСделка содержит выбранную сделку
//            Ключ      - СтрокаУсловияСделки содержит строку условия которая ограничивает заказы в табличной части документа из основного запроса.
Функция ПолучитьСделки(ДокументОснованиеИмя, ТабличныеЧасти, ДокументОснование) Экспорт
	Перем ПараметрСделка;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	ТекстЗапроса = "";
	ДобавитьСтрокуПоместить = Истина;
	Для Каждого ИмяТаблицы Из ТабличныеЧасти Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	Номенклатура    КАК Номенклатура,
		|	ЗаказПоставщику КАК ЗаказПоставщику
		|" + ?(ДобавитьСтрокуПоместить, "ПОМЕСТИТЬ ВременнаяТоварыДокумент ", "") + "
		|ИЗ
		|	Документ." + ДокументОснованиеИмя + "." + ИмяТаблицы.Ключ + " КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &ДокументОснование
		|";
		ДобавитьСтрокуПоместить = Ложь;
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ЗаказПоставщику
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказПоставщику
	|ИЗ
	|	ВременнаяТоварыДокумент
	|";
	ТекстЗапроса = Сред(ТекстЗапроса, 12);
	Запрос.Текст = ТекстЗапроса;

	МассивТаблиц = Запрос.ВыполнитьПакет();
	СписокСделок = Новый СписокЗначений();
	ТаблицаСделок = МассивТаблиц[1].Выгрузить();
	Для Каждого СтрокаСделка Из ТаблицаСделок Цикл
		СписокСделок.Добавить(СтрокаСделка.ЗаказПоставщику, ?(ЗначениеЗаполнено(СтрокаСделка.ЗаказПоставщику), СтрокаСделка.ЗаказПоставщику, "Пустой заказ"));
	КонецЦикла;
	Если СписокСделок.Количество() = 0 Тогда
		возврат Новый Структура();
	ИначеЕсли СписокСделок.Количество() = 1 Тогда
		ПараметрСделка = СписокСделок.Получить(0).Значение;
	Иначе
		ФормаВыбораЗаказа = ПолучитьОбщуюФорму("ФормаВыбораЗаказа");
		ФормаВыбораЗаказа.НачальноеЗначениеВыбора = Новый Структура("СписокВыбора, ЗаполнитьСписокВыбора", СписокСделок, Ложь);
		ФормаВыбораЗаказа.ОткрытьМодально();
		Если НЕ ФормаВыбораЗаказа.ВыбраноЗначение Тогда
			возврат Новый Структура();
		КонецЕсли;
		ПараметрСделка = ФормаВыбораЗаказа.ВыбранноеЗначение;
	КонецЕсли;
	возврат Новый Структура("ПараметрСделка", ПараметрСделка);
КонецФункции // ПолучитьСделки(

// Процедура выполняет заполнение табличной части по документу основанию.
// При заполнении копируется состав документа, количество заполняется минимальным из того,
//  что осталось на складе и того, что есть в строке документа-основания.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьТоварыПоОснованиюУпр(ДокументОснование, СтруктураПолученияСделок) Экспорт
	
	Если СтруктураПолученияСделок.Отказ Тогда
		возврат;
	КонецЕсли;
	
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад",              Склад);
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДокументОснование.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ПустойЗаказ",        Неопределено);
	Запрос.УстановитьПараметр("СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);

	ОснованиеПоступление = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
	ОснованиеЗаказ       = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику"));
	ТоварКомитента       = (ДокументОснование.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);

	ВедениеВзаиморасчетовПоСчетам = ДокументОснование.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;

	ДокументОснованиеИмя = ДокументОснование.Метаданные().Имя;

	СтрокаУсловияСделки = "";
	ПараметрСделка = Сделка;
	Если ОснованиеЗаказ ИЛИ ВедениеВзаиморасчетовПоСчетам Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ОснованиеЗаказ Тогда
				ПараметрСделка = ДокументОснование;
			Иначе
				ПараметрСделка = ДокументОснование.Сделка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СтруктураПолученияСделок.ПолучатьСделки Тогда
			СтруктураПараметрСделка = ПолучитьСделки(ДокументОснованиеИмя, СтруктураПолученияСделок.СтруктураТабличныхЧастей, ДокументОснование);
			Если СтруктураПараметрСделка.Количество() = 0 Тогда
				СтруктураПолученияСделок.Отказ = Истина;
				возврат;
			КонецЕсли;
			СтрокаУсловияСделки = " И Док.ЗаказПоставщику = &СделкаДокумент";
			ПараметрСделка = СтруктураПараметрСделка.ПараметрСделка;
		ИначеЕсли ОснованиеПоступление Тогда
			СтрокаУсловияСделки = " И Док.ЗаказПоставщику = &СделкаДокумент";
		КонецЕсли;
		Запрос.УстановитьПараметр("СделкаДокумент", ПараметрСделка);
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументРезерва", ПараметрСделка);

	Если СтруктураПолученияСделок.ИзменитьСделкуВШапке Тогда
		Сделка = ПараметрСделка;
	КонецЕсли;

	// Вложенный запрос, ограничивающий список номенклатуры
	ТекстЗапросаСписокНоменклатуры = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура 
	|ИЗ 
	|	Документ." + ДокументОснованиеИмя + ".Товары 
	|ГДЕ Ссылка = &ДокументОснование";

	// Сформируем участки запроса
	ПоляЗапросаРегл        = "";
	ПоляПоступленияРегл    = ",
	|	Док.СчетУчетаБУ,
	|	Док.НалоговоеНазначение";
	ПолеОстаткиОрганизации = "";
	СоединениеТоваровОрганизаций = "";
	ПолучитьУчасткиЗапросаПоТоварамОрганизацийДляЗаполненияТЧТовары(ПолеОстаткиОрганизации, СоединениеТоваровОрганизаций, ТекстЗапросаСписокНоменклатуры);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Док.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                                КАК КурсДокумента,
	|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Док.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                                КАК КратностьДокумента,
	|	Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов   КАК ВалютаВзаиморасчетов,
	|	Док.Ссылка.КурсВзаиморасчетов                        КАК КурсВзаиморасчетов,
	|	Док.Ссылка.КратностьВзаиморасчетов                   КАК КратностьВзаиморасчетов,
	|	Док.Ссылка.УчитыватьНДС,
	|	Док.Ссылка.СуммаВключаетНДС,
	|	Док.Номенклатура,
	|	Док.ЕдиницаИзмерения,
	|	Док.Коэффициент,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентХраненияОстатков,
	|	Док.СтавкаНДС,
	|	ВЫРАЗИТЬ(Док.Количество * Док.Коэффициент / Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Число(10,3))
	|														КАК КоличествоПоДокументу,"
	+	?(ОснованиеЗаказ, "", ПоляЗапросаРегл) + "
	|	Остатки.КоличествоОстаток                            КАК КоличествоОстаток,"
	+	ПолеОстаткиОрганизации + "
	|	Док.Цена";

	Если ОснованиеПоступление Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	Док.СерияНоменклатуры"
		+	ПоляПоступленияРегл;
	КонецЕсли; 

	Если ТоварКомитента Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ОстаткиПолученных.КоличествоОстаток            КАК КоличествоОстатокПолученных,
		|	ОстаткиПолученных.СуммаВзаиморасчетовОстаток   КАК СуммаПолученныхПолученных";

	КонецЕсли;

	Запрос.Текст = Запрос.Текст + ",
	|	Док.ХарактеристикаНоменклатуры";
	
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Документ." + ДокументОснованиеИмя + ".Товары   КАК Док";

	Если ТоварКомитента Тогда
		Запрос.УстановитьПараметр("СделкаРегистр", ?(ЗначениеЗаполнено(ПараметрСделка), ПараметрСделка, Неопределено));
		Запрос.Текст = Запрос.Текст + "
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыПолученные.Остатки(,
		|	                                             ДоговорКонтрагента = &ДоговорКонтрагента
		|											   И СтатусПолучения    = &СтатусПолучения
		|											   И Сделка             = &СделкаРегистр
		|	                                           ) КАК ОстаткиПолученных
		|ПО
		|	Док.Номенклатура = ОстаткиПолученных.Номенклатура 
		|   И Док.ХарактеристикаНоменклатуры = ОстаткиПолученных.ХарактеристикаНоменклатуры
		|";

	КонецЕсли;

	Запрос.Текст = Запрос.Текст + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВНТТ.Остатки(, Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ") 
	|	                                               И Склад = &Склад) КАК Остатки
	|ПО
	|	Док.Номенклатура               = Остатки.Номенклатура
	| И Док.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|
	|"
	+ СоединениеТоваровОрганизаций + "
	|
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование " + СтрокаУсловияСделки + "
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки
	|";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(Выборка.КоличествоОстаток) Тогда
			Продолжить; // товары, отстутствующие на складе, в документ не добавляем
		КонецЕсли;

		КоличествоПоДокументу = Выборка.КоличествоПоДокументу;
		УчестьОстаткиТоваровОрганизацийПриЗаполненииТЧТовары(КоличествоПоДокументу, Выборка);

		Если ТоварКомитента Тогда
			КоличествоПолученных          = ?(Выборка.КоличествоОстатокПолученных = NULL, 0, Выборка.КоличествоОстатокПолученных);
			СуммаВзаиморасчетовПолученных = ?(Выборка.СуммаПолученныхПолученных   = NULL, 0, Выборка.СуммаПолученныхПолученных);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Выборка.КоличествоОстаток) 
		 ИЛИ (Выборка.КоличествоОстаток ) = 0 Тогда
			Продолжить;
		Иначе
			СписКоличество = Мин(КоличествоПоДокументу, Выборка.КоличествоОстаток);
		КонецЕсли;

		Если ТоварКомитента Тогда
			СписКоличество = Мин(СписКоличество, КоличествоПолученных);
		КонецЕсли;

		Если СписКоличество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти              = Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = Выборка.Номенклатура;

		// Дубли строк (например, совпадающая номенклатура и характиеристика, разные серии) 
		// в документе-основании не отслеживаем, считаем, что при необходимости пользователь 
		// сам должен выбрать нужную строку, а не нужную удалить.
		СтрокаТабличнойЧасти.Количество       = СписКоличество * Выборка.КоэффициентХраненияОстатков / Выборка.Коэффициент;
		КоличествоПоДокументу                 = КоличествоПоДокументу - СписКоличество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС        = Выборка.СтавкаНДС;
				
		Если ТоварКомитента Тогда

			СтрокаТабличнойЧасти.Цена = СуммаВзаиморасчетовПолученных / КоличествоПолученных;

			// Пересчитаем цену в валюту документа (может отличаться от валюты основания).
			Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Цена, Выборка.ВалютаВзаиморасчетов, ВалютаДокумента,
			       Выборка.КурсВзаиморасчетов, КурсДокумента, Выборка.КратностьВзаиморасчетов, КратностьДокумента);

		Иначе

			СтрокаТабличнойЧасти.Цена = Выборка.Цена;

			// Пересчитаем цену в валюту документа (может отличаться от валюты основания).
			Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Цена, Выборка.ВалютаДокумента, ВалютаДокумента,
			       Выборка.КурсДокумента, КурсДокумента, Выборка.КратностьДокумента, КратностьДокумента);

		КонецЕсли;

		СтрокаТабличнойЧасти.Цена         = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
		                                    Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
		                                    Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
		                                    УчитыватьНДС, СуммаВключаетНДС,
		                                    УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

		СтрокаТабличнойЧасти.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, Склад,
		                                    мВалютаРегламентированногоУчета, Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
		                                    мВалютаРегламентированногоУчета, 1, 1);
											
		РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти);
		СтрокаТабличнойЧасти.СтавкаНДСВРознице = СтрокаТабличнойЧасти.СтавкаНДС;
		
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		Если ОснованиеПоступление Тогда
			СтрокаТабличнойЧасти.СерияНоменклатуры = Выборка.СерияНоменклатуры;
		КонецЕсли;

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.ДокументПоступления        = ДокументОснование;

		
		Если ОснованиеПоступление Тогда
				
			СтрокаТабличнойЧасти.СчетУчетаБУ  = Выборка.СчетУчетаБУ;
			
			СтрокаТабличнойЧасти.НалоговоеНазначение 		= Выборка.НалоговоеНазначение;
		Иначе	
			
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);	
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТоварыПоОснованию()

// Процедура выполняет заполнение возвратной тары по документу основанию.
// При заполнении копируется состав документа, количество заполняется минимальным из того,
//  что осталось на складе и того, что есть в строке документа-основания.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьВозвратнуюТаруПоОснованиюУпр(ДокументОснование, СтруктураПолученияСделок) Экспорт

	Если СтруктураПолученияСделок.Отказ Тогда
		возврат;
	КонецЕсли;
	
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	Запрос.УстановитьПараметр("СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара);

	ДокументОснованиеИмя = ДокументОснование.Метаданные().Имя;
	
	ОснованиеПоступление = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
	ОснованиеЗаказ       = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику"));
	СтрокаУсловияСделки = "";

	ВедениеВзаиморасчетовПоСчетам = ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	ПараметрСделка = Сделка;
	Если ОснованиеЗаказ ИЛИ ВедениеВзаиморасчетовПоСчетам Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ОснованиеЗаказ Тогда
				ПараметрСделка = ДокументОснование;
			Иначе
				ПараметрСделка = ДокументОснование.Сделка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СтруктураПолученияСделок.ПолучатьСделки Тогда
			Если ОснованиеПоступление И НЕ ВедениеВзаиморасчетовПоСчетам Тогда
				СтруктураПараметрСделка = ПолучитьСделки(ДокументОснованиеИмя, СтруктураПолученияСделок.СтруктураТабличныхЧастей, ДокументОснование);
				Если СтруктураПараметрСделка.Количество() = 0 Тогда
					СтруктураПолученияСделок.Отказ = Истина;
					возврат;
				КонецЕсли;
				ПараметрСделка = СтруктураПараметрСделка.ПараметрСделка;
			КонецЕсли;
			СтрокаУсловияСделки = " И Док.ЗаказПоставщику = &СделкаДокумент ";
			Запрос.УстановитьПараметр("СделкаДокумент", ПараметрСделка);
		ИначеЕсли ОснованиеПоступление И НЕ ВедениеВзаиморасчетовПоСчетам Тогда
			СтрокаУсловияСделки = " И Док.ЗаказПоставщику = &СделкаДокумент ";
			Запрос.УстановитьПараметр("СделкаДокумент", ПараметрСделка);
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Сделка", ?(ЗначениеЗаполнено(ПараметрСделка), ПараметрСделка, Неопределено));

	Если СтруктураПолученияСделок.ИзменитьСделкуВШапке Тогда
		Сделка = ПараметрСделка;
	КонецЕсли;

	// Вложенный запрос, ограничивающий список номенклатуры
	ТекстЗапросаСписокНоменклатуры = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура 
	|ИЗ 
	|	Документ." + ДокументОснованиеИмя + ".ВозвратнаяТара 
	|ГДЕ Ссылка = &ДокументОснование";
	
	// Сформируем участки запроса
	ПоляЗапросаРегл = "";
    Если ДокументОснованиеИмя = "ПоступлениеТоваровУслугВНТТ" Тогда
		ПоляЗапросаРегл = "
	|	СчетУчетаБУ,
	|	НалоговоеНазначение,
	|";
	КонецЕсли;
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Док.Ссылка.КурсВзаиморасчетов
	|   ИНАЧЕ
	|		1
	|	КОНЕЦ                         КАК КурсДокумента,
	|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Док.Ссылка.КратностьВзаиморасчетов
	|   ИНАЧЕ
	|		1
	|   КОНЕЦ                         КАК КратностьДокумента,
	|	Док.Номенклатура,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент  КАК КоэффициентХраненияОстатков,
	|	Остатки.КоличествоОстаток                             КАК КоличествоОстатокКомпании,
	|	Док.Цена,"
	+ ПоляЗапросаРегл + "
	|	Док.Количество                                        КАК КоличествоПоДокументу
	|ИЗ
	|	Документ." + ДокументОснованиеИмя + ".ВозвратнаяТара КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыПолученные.Остатки(,  Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ") 
	|	                                                         И ДоговорКонтрагента = &ДоговорКонтрагента
	|	                                                         И СтатусПолучения = &СтатусПолучения
	|	                                                         И Сделка = &Сделка
	|	                                            ) КАК Остатки
	|ПО
	|	Док.Номенклатура = Остатки.Номенклатура
	|
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование И
	|	Остатки.КоличествоОстаток > 0 " + СтрокаУсловияСделки + "
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки
	|";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(Выборка.КоличествоОстатокКомпании) Тогда
			Продолжить; // товары, отстутствующие на складе, в документ не добавляем
		КонецЕсли;  

		СтрокаВозвратнойТары = ВозвратнаяТара.Добавить();

		СтрокаВозвратнойТары.Номенклатура = Выборка.Номенклатура;
		СтрокаВозвратнойТары.Количество   = Мин(Выборка.КоличествоПоДокументу, Выборка.КоличествоОстатокКомпании);
		СтрокаВозвратнойТары.Цена         = Выборка.Цена;

		// Пересчитаем цену в валюту взаиморасчетов (в документах договоры могут отличаться).
		СтрокаВозвратнойТары.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаВозвратнойТары.Цена, 
						  Выборка.ВалютаДокумента, ВалютаДокумента, Выборка.КурсДокумента, 
						  КурсДокумента, Выборка.КратностьДокумента, КратностьДокумента);
						  
		СтрокаВозвратнойТары.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаВозвратнойТары.Номенклатура, Неопределено, Склад,
		                                    мВалютаРегламентированногоУчета, Дата, СтрокаВозвратнойТары.Номенклатура.ЕдиницаХраненияОстатков,
		                                    мВалютаРегламентированногоУчета, 1, 1);

		ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		
		Если ДокументОснованиеИмя = "ПоступлениеТоваровУслугВНТТ" Тогда
			СтрокаВозвратнойТары.СчетУчетаБУ  = Выборка.СчетУчетаБУ;
			СтрокаВозвратнойТары.НалоговоеНазначение  		 = Выборка.НалоговоеНазначение;
		Иначе
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаВозвратнойТары, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
		КонецЕсли;
		

	КонецЦикла;

КонецПроцедуры // ЗаполнитьВозвратнуюТаруПоОснованию()

// Добавляет с необходимым пересчетом строки табличной части из выбранного документа Поступления
//
// Параметры: 
//  ДокументПостуление - ссылка на документ типа Поступлуние, из которого надо добавить строки табличной части,
//  ТабличнаяЧасть     - табличная часть, в которую надо добавить строки.
//
Процедура ДобавитьСтрокиТабличнойЧастиИзДокументаПоступления(ДокументПоступления, ТабличнаяЧасть) Экспорт

	// Считываем нужную информацию по документу Поступления
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументПоступления);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура,
	|	Док.Количество,
	|	Док.СчетУчетаБУ,
	|	Док.Цена,";
	Если ТабличнаяЧасть = Товары Тогда
		Запрос.Текст = Запрос.Текст + "
		|	Док.ЕдиницаИзмерения,
		|	Док.ЕдиницаИзмеренияМест,
		|	Док.КоличествоМест,
		|	Док.Коэффициент,
		|	Док.Ссылка.ВалютаДокумента,
		|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
		|		Док.Ссылка.КурсВзаиморасчетов
		|	ИНАЧЕ
		|		1
		|	КОНЕЦ КАК КурсДокумента,
		|	ВЫБОР КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
		|	      Док.Ссылка.КратностьВзаиморасчетов
		|	ИНАЧЕ
		|		1
		|	КОНЕЦ КАК КратностьДокумента,
		|	Док.Ссылка.УчитыватьНДС,
		|	Док.Ссылка.СуммаВключаетНДС,
		|	Док.СтавкаНДС, 
		|	Док.ХарактеристикаНоменклатуры,
		|	Док.СерияНоменклатуры, 
		|	Док.НалоговоеНазначение
		|";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	Док.НалоговоеНазначение,
		|	Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов  КАК ВалютаВзаиморасчетов,
		|	Док.Ссылка.КурсВзаиморасчетов, 
		|	Док.Ссылка.КратностьВзаиморасчетов ";
	КонецЕсли; 

	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ" + ?(ТабличнаяЧасть = Товары,".Товары",".ВозвратнаяТара") + " КАК Док
	|
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки
	|";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	// Обходим строки Поступления
	СтруктураОтбора = Новый Структура();
	Пока Выборка.Следующий() Цикл

		// Ищем текущую позицию основания в табличной части документа возврата.
		//  Если найдем - увеличим количество; не найдем - добавим новую строку.

		Если ТабличнаяЧасть = Товары Тогда
			СтруктураОтбора.Вставить("ЕдиницаИзмерения",           Выборка.ЕдиницаИзмерения);
			СтруктураОтбора.Вставить("ЕдиницаИзмеренияМест",       Выборка.ЕдиницаИзмеренияМест);
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
			СтруктураОтбора.Вставить("СерияНоменклатуры"         , Выборка.СерияНоменклатуры);
			СтруктураОтбора.Вставить("ДокументПоступления"       , ДокументПоступления);
		КонецЕсли;

		СтрокаТабличнойЧасти = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ТабличнаяЧасть, СтруктураОтбора);
		Если СтрокаТабличнойЧасти <> Неопределено Тогда

			// Нашли, увеличиваем количество в первой найденной строке.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + Выборка.Количество;

			Если ТабличнаяЧасть = Товары Тогда

				// Рассчитать реквизиты табличной части.
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				СтрокаТабличнойЧасти.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, Склад,
				                                    мВалютаРегламентированногоУчета, Дата, СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков,
				                                    мВалютаРегламентированногоУчета, 1, 1);
													
				РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти);
				СтрокаТабличнойЧасти.СтавкаНДСВРознице = СтрокаТабличнойЧасти.СтавкаНДС;

			ИначеЕсли ТабличнаяЧасть = ВозвратнаяТара Тогда

				// Рассчитать реквизиты табличной части.
				ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				СтрокаТабличнойЧасти.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура, Неопределено, Склад,
				                                    мВалютаРегламентированногоУчета, Дата, СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков,
				                                    мВалютаРегламентированногоУчета, 1, 1);

			КонецЕсли;
		Иначе

			// Не нашли - добавляем новую строку.
			СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество   = Выборка.Количество;

			Если ТабличнаяЧасть = Товары Тогда

				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = Выборка.ЕдиницаИзмерения.Коэффициент;
				СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест       = Выборка.ЕдиницаИзмеренияМест;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
				СтрокаТабличнойЧасти.ДокументПоступления        = ДокументПоступления;

				// Заполняем реквизиты табличной части.
				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект,"Приобретение");

				// Пересчитаем цену в валюту документа.
				Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена, 
				                  Выборка.ВалютаДокумента,    ВалютаДокумента, 
				                  Выборка.КурсДокумента,      ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				                  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));

				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
				                                                 Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
				                                                 Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
				                                                 УчитыватьНДС,
				                                                 СуммаВключаетНДС,
				                                                 УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

				СтрокаТабличнойЧасти.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, Склад,
				                                    мВалютаРегламентированногоУчета, Дата, СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков,
				                                    мВалютаРегламентированногоУчета, 1, 1);
													
				РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти);
				СтрокаТабличнойЧасти.СтавкаНДСВРознице = СтрокаТабличнойЧасти.СтавкаНДС;
																 
				// Рассчитываем реквизиты табличной части.
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				
				СтрокаТабличнойЧасти.СчетУчетаБУ  = Выборка.СчетУчетаБУ;
				
				СтрокаТабличнойЧасти.НалоговоеНазначение = Выборка.НалоговоеНазначение;
				
			ИначеЕсли ТабличнаяЧасть = ВозвратнаяТара Тогда

				// Пересчитаем цену в валюту взаиморасчетов (в документах договоры могут отличаться).
				СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена, 
				                  Выборка.ВалютаВзаиморасчетов, ДоговорКонтрагента.ВалютаВзаиморасчетов,
				                  Выборка.КурсВзаиморасчетов, КурсВзаиморасчетов,
				                  Выборка.КратностьВзаиморасчетов, КратностьВзаиморасчетов);

				// По флагам налогообложения тару пересчитывать не надо,
				// Считаем, для тары флаги одинакове (с НДС),

				// Рассчитать реквизиты табличной части.
				ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				
				СтрокаТабличнойЧасти.ЦенаВРознице = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура, Неопределено, Склад,
				                                    мВалютаРегламентированногоУчета, Дата, СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков,
				                                    мВалютаРегламентированногоУчета, 1, 1);
				
				СтрокаТабличнойЧасти.СчетУчетаБУ  = Выборка.СчетУчетаБУ;
				СтрокаТабличнойЧасти.НалоговоеНазначение = Выборка.НалоговоеНазначение;

			КонецЕсли;

		КонецЕсли; // СтрокаТабличнойЧасти <> Неопределено

	КонецЦикла;

КонецПроцедуры // ДобавитьСтрокиТабличнойЧастиИзДокументаПоступления()

// Заолняет табличную часть по сериям номенклатуры при оперативном проведении
//
Процедура ЗаполнитьПоСериям() Экспорт

	ТоварыТабличнойЧасти = Товары.Выгрузить();
	ТоварыТабличнойЧасти.Свернуть("Номенклатура"); 
	МассивНоменклатуры = ТоварыТабличнойЧасти.ВыгрузитьКолонку("Номенклатура");
	
	ТаблицаСерий = УправлениеЗапасами.ПолучитьТаблицуОстатковПоСериям(Склад, Организация, МассивНоменклатуры,, Истина);
	ТаблицаСерий.Индексы.Добавить("Номенклатура,ХарактеристикаНоменклатуры");
	ТоварыТабличнойЧасти=Товары.Выгрузить();
	Товары.Очистить();

	КолонкиТабЧасти = ТоварыТабличнойЧасти.Колонки;

	СтруктДанныеСерНомера = УчетСерийныхНомеров.СформироватьИсходнуюТаблицуСерийныйНомеров(ТоварыТабличнойЧасти, СерийныеНомера);
	
	Для Каждого ИсходнаяСтрока ИЗ ТоварыТабличнойЧасти Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               ИсходнаяСтрока.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
		СтруктураПоиска.Вставить("Цена", ИсходнаяСтрока.ЦенаВРознице);
		
		ЗаполненКлючСвязи = Ложь;
		
		НайденныеСтроки = ТаблицаСерий.НайтиСтроки(СтруктураПоиска);
		КоличествоОсталосьПогасить = ИсходнаяСтрока.Количество;
		СтрокаСПустойСерией = Неопределено;

		Для Каждого Строка Из НайденныеСтроки Цикл
			Если КоличествоОсталосьПогасить<=0 Тогда
				Прервать;
			КонецЕсли;
			Если Строка.Остаток <= 0 Тогда
				Продолжить;
			КонецЕсли;

			ОстатокВЕдиницахДокумента = Строка.Остаток * ИсходнаяСтрока.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсходнаяСтрока.ЕдиницаИзмерения.Коэффициент;

			Если ОстатокВЕдиницахДокумента >= КоличествоОсталосьПогасить Тогда
				КоэффСписания = КоличествоОсталосьПогасить/ОстатокВЕдиницахДокумента;
			Иначе
				КоэффСписания = 1
			КонецЕсли;

			СписанноеКоличество = Окр(ОстатокВЕдиницахДокумента * КоэффСписания, 3, РежимОкругления.Окр15как20);

			Если СписанноеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;

			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура               = ИсходнаяСтрока.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения           = ИсходнаяСтрока.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент                = ИсходнаяСтрока.Коэффициент;
			НоваяСтрока.Цена                       = ИсходнаяСтрока.Цена;
			НоваяСтрока.ЦенаВРознице               = ИсходнаяСтрока.ЦенаВРознице;
			НоваяСтрока.ХарактеристикаНоменклатуры = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры          = Строка.СерияНоменклатуры;
			НоваяСтрока.СтавкаНДС                  = ИсходнаяСтрока.СтавкаНДС;
			НоваяСтрока.ДокументПоступления        = ИсходнаяСтрока.ДокументПоступления;
			НоваяСтрока.Количество                 = СписанноеКоличество; 
			
			УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, ИсходнаяСтрока.НомерСтроки - 1, КоличествоОсталосьПогасить - СписанноеКоличество, НоваяСтрока, СписанноеКоличество);
			
			РассчитатьРозничнуюСуммуВСтрокеТабЧасти(НоваяСтрока);
			НоваяСтрока.СтавкаНДСВРознице = ИсходнаяСтрока.СтавкаНДСВРознице;
			
			НоваяСтрока.СчетУчетаБУ                = ИсходнаяСтрока.СчетУчетаБУ;
			НоваяСтрока.НалоговоеНазначение        = ИсходнаяСтрока.НалоговоеНазначение; 
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СерияНоменклатуры) Тогда
				СтрокаСПустойСерией = НоваяСтрока;
			КонецЕсли;
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить-СписанноеКоличество;
			Строка.Остаток = Строка.Остаток - СписанноеКоличество;
		КонецЦикла;
		
		Если КоличествоОсталосьПогасить>0 Тогда
			Если СтрокаСПустойСерией = Неопределено Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура               = ИсходнаяСтрока.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения           = ИсходнаяСтрока.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент                = ИсходнаяСтрока.Коэффициент;
				НоваяСтрока.Цена                       = ИсходнаяСтрока.Цена;
				НоваяСтрока.ЦенаВРознице               = ИсходнаяСтрока.ЦенаВРознице;
				НоваяСтрока.ХарактеристикаНоменклатуры = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.СерияНоменклатуры          = ИсходнаяСтрока.СерияНоменклатуры;
				НоваяСтрока.СтавкаНДС                  = ИсходнаяСтрока.СтавкаНДС;
				НоваяСтрока.ДокументПоступления        = ИсходнаяСтрока.ДокументПоступления;
				НоваяСтрока.Количество                 = КоличествоОсталосьПогасить;
				
				УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, ИсходнаяСтрока.НомерСтроки - 1, 0, НоваяСтрока, КоличествоОсталосьПогасить);
			
				РассчитатьРозничнуюСуммуВСтрокеТабЧасти(НоваяСтрока);
				НоваяСтрока.СтавкаНДСВРознице = ИсходнаяСтрока.СтавкаНДСВРознице;
				
				НоваяСтрока.СчетУчетаБУ                = ИсходнаяСтрока.СчетУчетаБУ;
				НоваяСтрока.НалоговоеНазначение        = ИсходнаяСтрока.НалоговоеНазначение; 
				
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
			Иначе
				СтрокаСПустойСерией.Количество = СтрокаСПустойСерией.Количество+КоличествоОсталосьПогасить;
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаСПустойСерией, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаСПустойСерией, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоСериям()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
// По виду операции определяет статус партии прихода товаров (не возвратная тара!)
//
// Параметры: 
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Значение перечисления "Статусы партии товаров".
//
Функция ОпределитьСтатусПартииПриходаУпр(СтруктураШапкиДокумента) 

	Статус = Перечисления.СтатусыПартийТоваров.ПустаяСсылка();

	Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		Статус = Перечисления.СтатусыПартийТоваров.НаКомиссию;
	Иначе
		Статус = Перечисления.СтатусыПартийТоваров.Купленный; 
	КонецЕсли;
		
	Возврат Статус;

КонецФункции // ОпределитьСтатусПартииПриходаУпр()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)
	
	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаТоваров.ЗаполнитьЗначения(0                            , "НДС");		
	КонецЕсли;
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, Истина);

	ТаблицаТоваров.Колонки.Добавить("ДокументОприходования");
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ИмяТабЧасти");
	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("Склад");
	
	ТаблицаТоваров.Колонки.Добавить("Организация");
	ТаблицаТоваров.Колонки.Добавить("ДоговорКонтрагента");
	
	ТаблицаТоваров.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаТоваров.Колонки.Добавить("КорСубконтоСписанияБУ3");
	
	ТаблицаТоваров.Колонки.Добавить("СписыватьПоУказаннойСтоимости");
	
	ТаблицаТоваров.Колонки.Добавить("ДляХозяйственнойДеятельности");
	ТаблицаТоваров.Колонки.Добавить("Амортизируется", Новый ОписаниеТипов("Булево"));
	
	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,                          "Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад,       "Склад");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	ТаблицаТоваров.ЗаполнитьЗначения("Товары",                            "ИмяТабЧасти");

	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
	
	ТаблицаТоваров.ЗаполнитьЗначения(Ложь, "СписыватьПоУказаннойСтоимости");
			
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом, "КорСчетСписанияБУ");
	Для каждого Субконто из СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.ВидыСубконто Цикл
		Если Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты тогда
			ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		ИначеЕсли Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры тогда
			ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		ИначеЕсли Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами тогда
			ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.СделкаБУ, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из ТаблицаТоваров Цикл
		Если Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			Строка.ДляХозяйственнойДеятельности = Ложь;
		Иначе
			Строка.ДляХозяйственнойДеятельности = Истина;
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)
	
	// При выгрузке таблицы из документа количество имеет неотрицательный тип значения,
	// нам необходимы отрицательные числа
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Стоимость");
	ТаблицаТоваров.Колонки.Добавить("СуммаВзаиморасчетов");
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр",            ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"           	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	// для расчета НДС по бух.(нал.) правилам
	ВидДеятельностиНДСНеоблагаемый 		= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	ВидДеятельностиНДСПропорциональный 	= Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;
	ПогрешностьРасчетаНДС = 0;
	
	// Надо расчитать стоимость без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Если СтрокаТаблицы.КоличествоДок = NULL Тогда
			СтрокаТаблицы.КоличествоДок = 0;
		КонецЕсли;

		СтрокаТаблицы.Количество  = - СтрокаТаблицы.КоличествоДок;
		
		//СтрокаТаблицы.Стоимость = СтрокаТаблицы.Сумма - 
		//						  ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
								  
		СтоимостьСНДС  = СтрокаТаблицы.Сумма + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
								  
		СтрокаТаблицы.СуммаВзаиморасчетов = - МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаВзаиморасчетов, 
		                                 СтруктураШапкиДокумента.КурсДокумента, КурсВзаиморасчетов, 
										 СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
										 
		СтрокаТаблицы.СуммаУпр = - МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
										 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
										 СтруктураШапкиДокумента.КратностьДокумента, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
										 
		// НДС в упр. учете должен совпадать с бухгалтерским, если для отличий нет особых причин										 
		Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			// сумма указанная в чисто упр. документе переносится в соотв. ресурсы регистра
			СуммаНДСВалУпр = СтрокаТаблицы.НДС;
			
		Иначе
			
			Если СтруктураШапкиДокумента.УчитыватьНДС = Ложь Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСНеоблагаемый Тогда
				
				СуммаНДСВалУпр= 0;
				
			ИначеЕсли СтрокаТаблицы.ВидДеятельностиНДС = ВидДеятельностиНДСПропорциональный Тогда
				
				Если СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего = 0 Тогда
					СуммаНДСВалУпр = 0;
				Иначе	
					СуммаНДСВалУпр = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.НДС * (СтруктураШапкиДокумента.СуммаНДСПропорциональноКредит / СтруктураШапкиДокумента.СуммаНДСПропорциональноВсего), 2, ПогрешностьРасчетаНДС);
				КонецЕсли;			
				
			Иначе
				
				СуммаНДСВалУпр = СтрокаТаблицы.НДС;
				
			КонецЕсли;	
			
		КонецЕсли;
										 
		СтрокаТаблицы.НДСУпр = - МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВалУпр, ВалютаДокумента, 
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КурсДокумента, 
										 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
										 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
		
										 
		//// Суммы пересчитаем в валюту упр. учета
		//СтрокаТаблицы.Стоимость = - МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
		//								 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		//								 СтруктураШапкиДокумента.КурсДокумента,
		//								 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		//								 СтруктураШапкиДокумента.КратностьДокумента,
		//								 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета)
	КонецЦикла;

КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();

	// При выгрузке таблицы из документа количество имеет неотрицательный тип значения,
	// нам необходимы отрицательные числа
	ТаблицаТары.Колонки.Добавить("Количество");
	ТаблицаТары.Колонки.Добавить("Стоимость");
    ТаблицаТары.Колонки.Добавить("ЕдиницаИзмерения");

	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		СтрокаТаблицы.Количество       = СтрокаТаблицы.КоличествоДок;
        СтрокаТаблицы.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаХраненияОстатков;

	КонецЦикла;

   	ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);

	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары.Колонки.Добавить("СтавкаНДС");
	ТаблицаТары.Колонки.Добавить("НДС");
	ТаблицаТары.Колонки.Добавить("ДляХозяйственнойДеятельности");
	ТаблицаТары.Колонки.Добавить("Амортизируется");
	
	// тара без НДС, и не амортизируется
	ТаблицаТары.ЗаполнитьЗначения(0								, "НДС");
	ТаблицаТары.ЗаполнитьЗначения(Перечисления.СтавкиНДС.НеНДС, "СтавкаНДС");
	
	Для каждого Строка Из ТаблицаТары Цикл
		Строка.ДляХозяйственнойДеятельности = Истина;
		Строка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая; 
	КонецЦикла; 
	
	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТары, СтруктураШапкиДокумента, ПогрешностиОкругления, Истина);
	
	ТаблицаТары.Колонки.Добавить("ДокументОприходования");
	ТаблицаТары.Колонки.Добавить("ДоговорПоставщика");
	ТаблицаТары.Колонки.Добавить("Регистратор");
	ТаблицаТары.Колонки.Добавить("Склад");
	ТаблицаТары.Колонки.Добавить("Организация");
	ТаблицаТары.Колонки.Добавить("СубконтоБУ");
	ТаблицаТары.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаТары.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаТары.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаТары.Колонки.Добавить("КорСубконтоСписанияБУ3");
	
	ТаблицаТары.Колонки.Добавить("ДоговорКонтрагента");

	ТаблицаТары.ЗаполнитьЗначения(ЭтотОбъект,                          "Регистратор");
	ТаблицаТары.ЗаполнитьЗначения(Склад,	                           "Склад");
	ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
	ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");

	ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре, "КорСчетСписанияБУ");
	Для каждого Субконто из СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре.ВидыСубконто Цикл
		Если Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты тогда
			ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		ИначеЕсли Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры тогда
			ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		ИначеЕсли Субконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами тогда
			ТаблицаТары.ЗаполнитьЗначения(СтруктураШапкиДокумента.СделкаБУ, "КорСубконтоСписанияБУ"+Субконто.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТарыРегл()	

Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)

	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов");
	ТаблицаТары.Колонки.Добавить("СуммаУпр"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ДанныеДоговора = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаВзаиморасчетов, Дата);

	// Надо расчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаВзаиморасчетов, 
		                                 СтруктураШапкиДокумента.КурсДокумента, КурсВзаиморасчетов, 
		                                 СтруктураШапкиДокумента.КратностьДокумента, 
		                                 КратностьВзаиморасчетов);

		// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СтрокаТаблицы.СуммаУпр = СтрокаТаблицы.Стоимость;

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента, Контрагент, ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Склад");

	// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
	 ИЛИ СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		СтруктураОбязательныхПолей.Вставить("Сделка", 
		        "По выбранному договору установлен способ ведения взаиморасчетов ""по заказам""! 
		        |Заполните поле ""Заказ поставщику""!");
	КонецЕсли;
	
	Если  СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
		И СтруктураШапкиДокумента.СуммоваяРозница = Истина Тогда
	
		ОбщегоНазначения.ОшибкаПриПроведении("Прием на комиссию (возврат с комиссии)в НТТ с суммовым учетом не предусмотрен!", Отказ, Заголовок);
	
	КонецЕсли;
	
	Если  СтруктураШапкиДокумента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
		И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете  Тогда

		СтруктураОбязательныхПолей.Вставить("СчетУчетаДоходовБУ");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасходовБУ");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
		
	КонецЕсли;

	Если ВозвратнаяТара.Количество() > 0 И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре");
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		   
		    Если СтруктураШапкиДокумента.ЕстьНДС И СтруктураШапкиДокумента.УчитыватьНДС Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
			КонецЕсли;

			Если (СтруктураШапкиДокумента.СложныйНалоговыйУчет = Ложь
				  ИЛИ  ДоговорКонтрагента.ВидДоговора = перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
				  И СтруктураШапкиДокумента.УчитыватьНДС Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДСПодтвержденный");
			КонецЕсли;
		   
   КонецЕсли;		

	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если  СтруктураШапкиДокумента.ЕстьНДС
		И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		
		Если НЕ СтруктураШапкиДокумента.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомитентом_НК Тогда
			 
			 ОбщегоНазначения.СообщитьОбОшибке("В договоре комиссии указана неправильная схема налогового учета! Используйте схему для периода с 2011 года!",Отказ,Заголовок);
			 
		ИначеЕсли НЕ СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
				  
			 ОбщегоНазначения.СообщитьОбОшибке("По договорам комиссии с 2011 года в конфигурации реализован только ""сложный налоговый учет"". Установите соответствующий флаг в договоре с контрагентом!",Отказ,Заголовок);
			 
		 КонецЕсли;
	
	КонецЕсли;
	
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);

	// Склад должен быть НТТ
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.Склад)
	   И СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.ОшибкаПриПроведении("Документ можно оформить только на склад вида ""Неавтоматизированная торговая точка""!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, 
	                                              Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТовары();

	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если Не мРазрешитьНулевыеЦеныВРознице Тогда
		СтруктураОбязательныхПолей.Вставить("ЦенаВРознице");
	КонецЕсли;

	СНТТ = (СтруктураШапкиДокумента.СуммоваяРозница = Истина);
	
	// Укажем, что надо проверить:
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если СНТТ И НЕ (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)Тогда
			СтруктураОбязательныхПолей = Новый Структура("СуммаВРознице");
			Если мРазделятьПоСтавкамНДС Тогда
				СтруктураОбязательныхПолей.Вставить("СтавкаНДСВРознице");
			КонецЕсли;
		КонецЕсли;	
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");

		Если СтруктураШапкиДокумента.ЕстьНДС
			И НЕ (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");			
		КонецЕсли;
		
   	КонецЕсли;
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	
	Если НЕ СНТТ ИЛИ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		// Здесь услуг быть не должно.
		УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТара();
	
	Если Не мРазрешитьНулевыеЦеныВРознице Тогда
		СтруктураОбязательныхПолей.Вставить("ЦенаВРознице");
	КонецЕсли;

	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");

		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли;
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара",СтруктураОбязательныхПолей, Отказ, Заголовок);
    	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		Для каждого СтрокаТЧ из ТаблицаПоТаре Цикл

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Возвратная тара"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
			
			Если СтрокаТЧ.СчетУчетаБУ.Забалансовый Тогда

				СтрокаСообщения = НСтр("ru='указан забалансовый счет!';uk='вказано забалансовий рахунок!'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
	
			КонецЕсли;			

			Если ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
				Если СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					СтрокаСообщения = " указно налоговое назначение по нехозяйственной деятельности!";
											
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
								
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.СуммоваяРозница Тогда

		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			Движения.ТоварыВНТТ.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
			Движения.ТоварыВНТТ.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
			
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыВНТТ.
		Если НЕ Отказ Тогда
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыВНТТ, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",     Склад);
					
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВНТТ, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТаре);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыВНТТ, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",     Склад);
					
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВНТТ, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	Иначе
		
		ТаблицаНаценок = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаНТТ(Ссылка, Склад, мРазделятьПоСтавкамНДС);		
		Для каждого Строка Из ТаблицаПоТоварам  Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Склад", Склад);
			
			Если мРазделятьПоСтавкамНДС Тогда
				Отбор.Вставить("СтавкиНДС", Строка.СтавкаНДСВРознице);
			КонецЕсли;
			НайденныеСтроки = ТаблицаНаценок.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаТаблицыНаценок = НайденныеСтроки[0];
			Иначе
				СтрокаТаблицыНаценок = Неопределено
			КонецЕсли;
			
			Сумма = Строка.СуммаВРознице;
			
			Если СтрокаТаблицыНаценок = Неопределено Тогда
				ПокупнаяЦена = Сумма;
			ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС + Сумма = 0 Тогда
				СуммаНаценки = СтрокаТаблицыНаценок.ТН * Сумма / (СтрокаТаблицыНаценок.ПС);
				ПокупнаяЦена = Сумма - СуммаНаценки;
			Иначе
				ПокупнаяЦена = 0;
			КонецЕсли;
			
			// Спишем из регистра
			НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();
			
			НовоеДвижение.Период 			= Дата;
			НовоеДвижение.Склад 			= Склад;
			Если мРазделятьПоСтавкамНДС Тогда
				НовоеДвижение.СтавкаНДС 	= Строка.СтавкаНДСВРознице;
			КонецЕсли;
			
			НовоеДвижение.Сумма				= Сумма;
			НовоеДвижение.СуммаНаценки 		= Сумма - ПокупнаяЦена;
			НовоеДвижение.КодОперации		= Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат;
			НовоеДвижение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	// ТОВАРЫ ПО РЕГИСТРУ Закупки.
	КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();

	КопияТаблицыТоваров.Колонки.НДС   .Имя = "_НДС";
	КопияТаблицыТоваров.Колонки.НДСУпр.Имя = "НДС";
		
	СтруктТаблицДокумента = Новый Структура;
	СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", КопияТаблицыТоваров);
			
	ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.Закупки, СтруктТаблицДокумента);
		
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Подразделение",      Подразделение);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",       ОпределитьСтатусПартииПриходаУпр(СтруктураШапкиДокумента));
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
	 ИЛИ (СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
	   И  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом) Тогда
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка);
	КонецЕсли;
				
	ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.Закупки, Неопределено, ТаблицыДанныхДокумента, Дата);
	
КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартий()

// По результатам запросов формирует движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, 
							  ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
							  Отказ, Заголовок);

	ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
	
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, Отказ, Заголовок);
	
	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам,
	                      Отказ, Заголовок, СтруктураШапкиДокумента);	
	
	ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
	
	ТаблицаПоВторомуСобытиюНал = ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ);
							  
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВторомуСобытиюНал, Отказ, Заголовок);
	
	ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;

	// Зарегистрируем в последовательности УУ
	Если ОтражатьВУправленческомУчете Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
		ЗаписьРегистрации.Период      = Дата;
	КонецЕсли;

	
	Если ПроводитьПоПартиям Тогда

		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
		
	Иначе

		// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВторомуСобытиюНал, Отказ, Заголовок)
    	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;

	ПроводкиБУ = Движения.Хозрасчетный;
				
	ЕстьНалоговыйУчетПартий = (СтруктураШапкиДокумента.ЕстьНДС ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль);
	
	Комиссия = (ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);

	СНТТ = СтруктураШапкиДокумента.СуммоваяРозница;
	
	// вернем в таблицы количество со знаком "+"
	ТаблицаПоТоварам.Колонки.Удалить("Количество");
	ТаблицаПоТоварам.Колонки.КоличествоДок.Имя = "Количество";
	
	ТаблицаПоТаре.Колонки.Удалить("Количество");
	ТаблицаПоТаре.Колонки.КоличествоДок.Имя = "Количество";
	
	// Проводки по взаиморасчетам - авансы
	
   	ТаблицыДокумента = Новый Структура();
    ТаблицыДокумента.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);

	//Возможны корректировки сумм при расчетах в валюте
	Если  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда  
		
	   ВсегоКЗачету = СуммаДокумента;
		
	   ТаблицаСделок = ДокументыРасчетовСКонтрагентом.Выгрузить(,"ДокументРасчетовСКонтрагентом,Сумма,ДатаОплаты,ВозвратнаяТара");
	   ТаблицаСделок.Свернуть("ДокументРасчетовСКонтрагентом,ДатаОплаты,ВозвратнаяТара", "Сумма");
	   ТаблицаСделок.Сортировать("ДатаОплаты");
	   
	   Для каждого СтрокаПредоплаты Из ТаблицаСделок Цикл
			
			Если СтрокаПредоплаты.ВозвратнаяТара Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаПредоплаты   = СтрокаПредоплаты.Сумма;
			РасчетныйДокумент = СтрокаПредоплаты.ДокументРасчетовСКонтрагентом;
			
			//Если СуммаПредоплаты > ВсегоКЗачету Тогда
			//
			//	Сообщить(Локализация.СтрШаблон1("Сумма предоплаты по документу ¤1¤, указанная на закладке ""Предоплата"" (¤2¤),
			//								   |    превышает возможную сумму предоплаты на ¤3¤ (¤4¤) (с учетом предыдущих документов предоплаты)",
			//								   СтрокаПредоплаты.ДокументРасчетовСКонтрагентом,
			//								   СуммаПредоплаты,
			//								   Мин(СуммаПредоплаты,СуммаПредоплаты - ВсегоКЗачету),
			//								   ВалютаДокумента));
			//
			//КонецЕсли;
			
			Если ВсегоКЗачету > 0 Тогда
			
				// зачтем аванс в размере указанной суммы на закладке предоплата
				ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ"
																	   ,,, ,, РасчетныйДокумент, Мин(ВсегоКЗачету,СуммаПредоплаты));	
			
			КонецЕсли;
																   
			ВсегоКЗачету = ВсегоКЗачету - ТаблицаАвансов.Итог("СуммаВал");
			
		КонецЦикла;
		
		
	Иначе
		// обычный зачет аванса и корректировка сумм при расчетах в валюте
		ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ");
		
	КонецЕсли;
		
	// Проводки по взаиморасчетам за тару - авансы
    ТаблицыДокумента = Новый Структура();
    ТаблицыДокумента.Вставить("ТаблицаПоТаре",ТаблицаПоТаре);

	//Возможны корректировки сумм при расчетах в валюте
	Если  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда  
		
	   ВсегоКЗачету = ВозвратнаяТара.Итог("Сумма");
		
	   ТаблицаСделок = ДокументыРасчетовСКонтрагентом.Выгрузить(,"ДокументРасчетовСКонтрагентом,Сумма,ДатаОплаты,ВозвратнаяТара");
	   ТаблицаСделок.Свернуть("ДокументРасчетовСКонтрагентом,ДатаОплаты,ВозвратнаяТара", "Сумма");
	   ТаблицаСделок.Сортировать("ДатаОплаты");
	   
	   Для каждого СтрокаПредоплаты Из ТаблицаСделок Цикл
			
			Если НЕ СтрокаПредоплаты.ВозвратнаяТара Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаПредоплаты   = СтрокаПредоплаты.Сумма;
			РасчетныйДокумент = СтрокаПредоплаты.ДокументРасчетовСКонтрагентом;
			
			//Если СуммаПредоплаты > ВсегоКЗачету Тогда
			//
			//	Сообщить(Локализация.СтрШаблон1("Сумма предоплаты по документу ¤1¤, указанная на закладке ""Предоплата"" (¤2¤),
			//								   |    превышает возможную сумму предоплаты на ¤3¤ (¤4¤) (с учетом предыдущих документов предоплаты)",
			//								   СтрокаПредоплаты.ДокументРасчетовСКонтрагентом,
			//								   СуммаПредоплаты,
			//								   Мин(СуммаПредоплаты,СуммаПредоплаты - ВсегоКЗачету),
			//								   ВалютаДокумента));
			//
			//КонецЕсли;
			
			Если ВсегоКЗачету > 0 Тогда
			
				// зачтем аванс в размере указанной суммы на закладке предоплата
				ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, "АВ"
																	   ,,, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТареПоАвансам
																	   , РасчетныйДокумент, Мин(ВсегоКЗачету,СуммаПредоплаты));	
			
			КонецЕсли;
																   
			ВсегоКЗачету = ВсегоКЗачету - ТаблицаАвансов.Итог("СуммаВал");
			
		КонецЦикла;
		
		
	Иначе
		//Возможны корректировки сумм при расчетах в валюте
		ТаблицаАвансовПоТаре = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок,"АВ",,,СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре, СтруктураШапкиДокумента.СчетУчетаРасчетовПоТареПоАвансам);
		
	КонецЕсли;	
	
	МассивРасчетныхДокументов = Неопределено;
	Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		МассивРасчетныхДокументов = ДокументыРасчетовСКонтрагентом.ВыгрузитьКолонку("ДокументРасчетовСКонтрагентом");
		УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивРасчетныхДокументов);
	КонецЕсли;
	
	Если СНТТ Тогда
		
		ТаблицаНаценок 	  = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаНТТБух(Ссылка, Склад, ТаблицаПоТоварам.ВыгрузитьКолонку("НалоговоеНазначение"), мРазделятьПоСтавкамНДС);
		СчетНаценки 	  = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
				
		Если ТаблицаПоТоварам.Колонки.Найти("СписанныеПартииБУ") = Неопределено Тогда
			ТаблицаПоТоварам.Колонки.Добавить("СписанныеПартииБУ");
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаПоТоварам Цикл
			
			ПолучательСчетНаценки = Строка.КорСчетСписанияБУ;
			
			СтруктураПоиска = Новый Структура("Склад", Склад);
			СтруктураПоиска.Вставить("НалоговоеНазначение", Строка.НалоговоеНазначение);
			Если мРазделятьПоСтавкамНДС Тогда
				СтруктураПоиска.Вставить("СтавкиНДС", Строка.СтавкаНДСВРознице);
			КонецЕсли;	
			СтрокаТаблицыНаценок = ТаблицаНаценок.НайтиСтроки(СтруктураПоиска);
			СтрокаТаблицыНаценок = ?(СтрокаТаблицыНаценок.Количество() > 0, СтрокаТаблицыНаценок[0], Неопределено);
			
			Сумма = Строка.СуммаВРознице;
			СуммаНУ = Строка.СуммаВРознице;
			
			Если СтрокаТаблицыНаценок = Неопределено Тогда
				ПокупнаяЦена = Сумма;
			ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС + Сумма = 0 Тогда
				СуммаНаценки = СтрокаТаблицыНаценок.ТН * Сумма / (СтрокаТаблицыНаценок.ПС);
				ПокупнаяЦена = Сумма - СуммаНаценки;
			Иначе
				ПокупнаяЦена = 0;
			КонецЕсли;
			
			Если СтрокаТаблицыНаценок = Неопределено Тогда
				ПокупнаяЦенаНУ = СуммаНУ;
			ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС_НУ = 0 Тогда
				СуммаНаценкиНУ = СтрокаТаблицыНаценок.ТН_НУ * СуммаНУ / (СтрокаТаблицыНаценок.ПС_НУ);
				ПокупнаяЦенаНУ = СуммаНУ - СуммаНаценкиНУ;
			Иначе
				ПокупнаяЦенаНУ = 0;
			КонецЕсли;
			
			//Спишем товар из розницы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Возврат товара из розницы";
			
			Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
			Проводка.СчетКт      = Строка.СчетУчетаБУ;
			
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.КорСубконтоСписанияБУ1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.КорСубконтоСписанияБУ2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.КорСубконтоСписанияБУ3);
					
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			
			Если мРазделятьПоСтавкамНДС Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
			КонецЕсли;
			
			Проводка.Сумма         = ПокупнаяЦена;
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаДт = ?(Строка.СуммаБезНДСВал = 0, Проводка.Сумма, Проводка.Сумма * Строка.СуммаБезНДСВал / Строка.СуммаБезНДСРегл);
			КонецЕсли;
			
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
				 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
				Проводка.СуммаНУКт       = ПокупнаяЦенаНУ;
			КонецЕсли;
			
			//Спишем торговую наценку
			Если 	 Сумма - ПокупнаяЦена <> 0
				ИЛИ (СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И (СуммаНУ - ПокупнаяЦенаНУ <> 0)) Тогда
				
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = "Торговая наценка";
				
				Проводка.СчетДт      = СчетНаценки;
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  Склад);
				Если мРазделятьПоСтавкамНДС Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				КонецЕсли;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				Если мРазделятьПоСтавкамНДС Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				КонецЕсли;
				Проводка.Сумма                     = Сумма - ПокупнаяЦена;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;				
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
					 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					Проводка.СуммаНУДт       = СуммаНУ - ПокупнаяЦенаНУ;					
					Проводка.СуммаНУКт       = СуммаНУ - ПокупнаяЦенаНУ;
				КонецЕсли;
				
			КонецЕсли;
			
			ТаблицаПартий = Новый ТаблицаЗначений;
			ТаблицаПартий.Колонки.Добавить("СуммаСписания");
			ТаблицаПартий.Колонки.Добавить("СуммаСписанияНУ");
			
			СтрокаСтоимости = ТаблицаПартий.Добавить();
			СтрокаСтоимости.СуммаСписания = ПокупнаяЦена;
			СтрокаСтоимости.СуммаСписанияНУ = ПокупнаяЦенаНУ;
			
			Строка.СписанныеПартииБУ = ТаблицаПартий;
						
		КонецЦикла;
		
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТаре,    ,Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , ,Отказ, , "Возврат тары");
		
	Иначе
		
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, ,Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , ,Отказ, , "Возврат ТМЦ");
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТаре,    ,Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , ,Отказ, , "Возврат тары");
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДатаДок    = Дата;
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Если (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
		  ИЛИ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный)
		и ТаблицаПоТоварам.Количество()>0 тогда
				
		// Проводки по НДС
		ТаблицаДляПроводокПоНДС = ТаблицаПоТоварам.Скопировать();                                                                                              
		ТаблицаДляПроводокПоНДС.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","ПроводкиСуммаНДСРегл, ПроводкиСуммаНДСВал");
								
		Для каждого СтрокаТаблицы Из ТаблицаДляПроводокПоНДС Цикл
			Если СтруктураШапкиДокумента.УчитыватьНДС И СтрокаТаблицы.ПроводкиСуммаНДСРегл > 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = Дата;

			
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "НДС (товары) (сторно)";

				Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаНДС;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаНУ);

				Проводка.СчетКт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаБУ);

				Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.Валютный Тогда
					Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
					Проводка.ВалютнаяСуммаКт = - СтрокаТаблицы.ПроводкиСуммаНДСВал;
				КонецЕсли;


				
				Проводка.Сумма       = - СтрокаТаблицы.ПроводкиСуммаНДСРегл;
					
				НалоговыйУчет.РазбитьПроводкуПоНДСНаПервоеВтороеСобытие(ТаблицаПоВторомуСобытиюНал, ПроводкиБУ, Проводка, 
														   "Дт", СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный, 
														  СтруктураШапкиДокумента.ДоговорКонтрагента, 
														  СтруктураШапкиДокумента.СделкаНУ, МассивРасчетныхДокументов,
														  Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат,
														  СтрокаТаблицы.СтавкаНДС, СтрокаТаблицы.ДляХозяйственнойДеятельности, СтрокаТаблицы.ВидДеятельностиНДС, СтрокаТаблицы.Амортизируется,
													      СтрокаТаблицы.ПроводкиСуммаНДСВал);
			КонецЕсли;											  
		КонецЦикла;
		
		// посчитаем на какую сумму были сформированы проводки по себестоимости
		СуммаПоПартиямВсего = 0;
		СуммаПоПартиямВсегоВал = 0;
		Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
			СуммаПоПартиямВсего = СуммаПоПартиямВсего + СтрокаТаблицы.СписанныеПартииБУ.Итог("СуммаСписания");
			Для каждого СтрокаПартии Из СтрокаТаблицы.СписанныеПартииБУ Цикл
				СуммаПоПартиямВсегоВал = СуммаПоПартиямВсегоВал + Окр(?(СтрокаТаблицы.ПроводкиСуммаСНДСРегл = 0, СтрокаПартии.СуммаСписания, СтрокаПартии.СуммаСписания * СтрокаТаблицы.ПроводкиСуммаСНДСВал / СтрокаТаблицы.ПроводкиСуммаСНДСРегл),2);
			КонецЦикла; 
		КонецЦикла;
		//Сколько всего должно пройти по взаиморасчетам
		СуммаСНДСВзаиморасчетыРегл = ТаблицаПоТоварам.Итог("ПроводкиСуммаСНДСРегл");
		СуммаНДСВзаиморасчетыРегл = ТаблицаПоТоварам.Итог("ПроводкиСуммаНДСРегл");
		СуммаСНДСВзаиморасчетыВал = ТаблицаПоТоварам.Итог("ПроводкиСуммаСНДСВал");
		СуммаНДСВзаиморасчетыВал = ТаблицаПоТоварам.Итог("ПроводкиСуммаНДСВал");
		
		Разница = СуммаСНДСВзаиморасчетыРегл - (СуммаПоПартиямВсего + СуммаНДСВзаиморасчетыРегл);
		РазницаВал = СуммаСНДСВзаиморасчетыВал - (СуммаПоПартиямВсегоВал + СуммаНДСВзаиморасчетыВал);
		
		Разница 	= Окр(Разница, 2);
		РазницаВал 	= Окр(РазницаВал, 2);
		
		Если Разница > 0 Тогда
			
			// доходы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;

			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = "Сумма дохода от возврата (товар)";

			Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаБУ);

			Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаДт = РазницаВал;
			КонецЕсли;

			Проводка.СчетКт      = СтруктураШапкиДокумента.СчетУчетаДоходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоДоходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоДоходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоДоходов3);

			// разницу по НУ не показываем
			Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
			
			Проводка.Сумма       = Разница;
			
		ИначеЕсли Разница < 0 Тогда
			// расходы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;

			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = "Сумма затрат от возврат (товар)";

			Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоРасходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоРасходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоРасходов3);

			Проводка.СчетКт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаБУ);

			Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаКт = - РазницаВал;
			КонецЕсли;

			Проводка.Сумма       = - Разница;
			
			// разницу по НУ не показываем
			Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
			
		КонецЕсли;
		
		СуммаПоПартиямВсего = 0;
		СуммаПоПартиямВсегоВал = 0;
		Для каждого СтрокаТаблицы Из ТаблицаПоТаре Цикл
			СуммаПоПартиямВсего = СуммаПоПартиямВсего + СтрокаТаблицы.СписанныеПартииБУ.Итог("СуммаСписания");
			Для каждого СтрокаПартии Из СтрокаТаблицы.СписанныеПартииБУ Цикл
				СуммаПоПартиямВсегоВал = СуммаПоПартиямВсегоВал + Окр(?(СтрокаТаблицы.ПроводкиСуммаСНДСРегл = 0, СтрокаПартии.СуммаСписания, СтрокаПартии.СуммаСписания * СтрокаТаблицы.ПроводкиСуммаСНДСВал / СтрокаТаблицы.ПроводкиСуммаСНДСРегл),2);
			КонецЦикла; 
		КонецЦикла;
		
		//Сколько всего должно пройти по взаиморасчетам
		СуммаСНДСВзаиморасчетыРегл 	= ТаблицаПоТаре.Итог("ПроводкиСуммаСНДСРегл");
		СуммаСНДСВзаиморасчетыВал 	= ТаблицаПоТаре.Итог("ПроводкиСуммаСНДСВал");
		
		Разница = СуммаСНДСВзаиморасчетыРегл - СуммаПоПартиямВсего;
		РазницаВал = СуммаСНДСВзаиморасчетыВал - СуммаПоПартиямВсегоВал;
		
		Разница 	= Окр(Разница, 2);
		РазницаВал 	= Окр(РазницаВал, 2);

		Если Разница > 0 Тогда
			
			// доходы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;

			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = "Сумма дохода от возврата (тара)";

			Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаБУ);

			Если СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаДт = РазницаВал;
			КонецЕсли;

			Проводка.СчетКт      = СтруктураШапкиДокумента.СчетУчетаДоходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоДоходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоДоходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоДоходов3);

			Проводка.Сумма       = Разница;
			
		ИначеЕсли Разница < 0 Тогда
			// расходы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;

			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = "Сумма затрат от возврат (тара)";

			Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоРасходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоРасходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоРасходов3);

			Проводка.СчетКт      = СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        СтруктураШапкиДокумента.Контрагент, Истина);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", СтруктураШапкиДокумента.СделкаБУ);

			Если СтруктураШапкиДокумента.СчетУчетаРасчетовПоТаре.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаВзаиморасчетов;
				Проводка.ВалютнаяСуммаКт = - РазницаВал;
			КонецЕсли;

			Проводка.Сумма       = - Разница;
		
		КонецЕсли;
		
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц
	 
КонецПроцедуры 
                                                                             	
Функция ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ)
	
	ТаблицаПоВторомуСобытиюНал = НалоговыйУчет.СоздатьСтруктуруТаблицыНалоговыхСумм();
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		// Если не нужно отражать в бухгалтерском учете, тогда не отражаем и в подсистеме учета НДС
		Возврат ТаблицаПоВторомуСобытиюНал;
	КонецЕсли;
	
	Если Не СтруктураШапкиДокумента.ЕстьНДС Тогда
		Возврат ТаблицаПоВторомуСобытиюНал;
	КонецЕсли;
		
	//Отразим Продажи в регистре ПродажиНалоговыйУчет
	НаборДвижений = Движения.ПриобретенияНалоговыйУчет;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	ТаблицаДвиженийТара = ТаблицаДвижений.Скопировать();
	
	// ТОВАРЫ
	Если  СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		// в налоговом учете не учитываются
	Иначе
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
		ТаблицаКопия.Свернуть("СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС, Амортизируется","СуммаСНДСВал, СуммаНДСВал, СуммаНДСВалИсходный");
		
		ТаблицаКопия.Колонки.Добавить("СуммаНДСПропорционально");
		Для каждого СтрокаКопии Из ТаблицаКопия Цикл
			Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
				СтрокаКопии.СуммаНДСВал = СтрокаКопии.СуммаНДСВалИсходный;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаКопия.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
		ТаблицаКопия.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	КонецЕсли;		
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СделкаНУ,"Сделка");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику, "Событие");
		
	Если СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// очистим налоговые реквизиты
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), 			"СтавкаНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Ложь, 										   	"ДляХозяйственнойДеятельности");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПустаяСсылка(), 	"ВидДеятельностиНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Ложь, 										   	"Амортизируется");
		ТаблицаДвижений.ЗаполнитьЗначения(0, 												"СуммаНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(0, 												"СуммаНДСПропорционально");
		
	Иначе		
				
		Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// взаиморасчеты по договору по расчетным документам - необходимо заполнить в регистре реквизит РасчетныйДокумент
			НалоговыйУчет.ЗаполнитьДокументыРасчета(ТаблицаДвижений, ДокументыРасчетовСКонтрагентом.Выгрузить());
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный, "СчетУчетаНДСПодтвержденный");
		КонецЕсли;			
		
	КонецЕсли;		
	
	//ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС, ДляХозяйственнойДеятельности,ВидДеятельностиНДС","СуммаСНДСВал, СуммаНДСВал");
	ТаблицаКопия.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(СтруктураШапкиДокумента.СделкаНУ,"Сделка");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику, "Событие");
    ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина, "ВозвратнаяТара");
	
	Если СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// очистим налоговые реквизиты
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), 			"СтавкаНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Ложь, 										   	"ДляХозяйственнойДеятельности");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПустаяСсылка(), 	"ВидДеятельностиНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(0, 												"СуммаНДС");
		
	Иначе		
				
		Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// взаиморасчеты по договору по расчетным документам - необходимо заполнить в регистре реквизит РасчетныйДокумент
			НалоговыйУчет.ЗаполнитьДокументыРасчета(ТаблицаДвиженийТара, ДокументыРасчетовСКонтрагентом.Выгрузить());
		КонецЕсли;			
		
	КонецЕсли;		
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;
	
	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
			
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;
	
	
	
	Если НЕ СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		// Движения формируются по данным рассчета "первого события" 
	   НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаУпрощенныйНалоговыйУчет(ЭтотОбъект, ТаблицаПоВторомуСобытиюНал);
	
	ИначеЕсли  НЕ СтруктураШапкиДокумента.Внешнеэкономический Тогда
	      // движения формируются по методу "по отгрузке"

		НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
				
		// ТОВАРЫ
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
		ТаблицаКопия.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,Амортизируется","СуммаБезНДСВал,СуммаНДСВал, СуммаНДСВалИсходный");
		ТаблицаПриобретений = ТаблицаКопия.Скопировать();
		
		ТаблицаПриобретений.Колонки.Добавить("СуммаНДСПропорционально");
		Для каждого СтрокаКопии Из ТаблицаПриобретений Цикл
			Если СтрокаКопии.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				СуммаСНДСВал = СтрокаКопии.СуммаБезНДСВал  + СтрокаКопии.СуммаНДСВал;
				СтрокаКопии.СуммаНДСПропорционально = СтрокаКопии.СуммаНДСВал;
				СтрокаКопии.СуммаНДСВал 			= СтрокаКопии.СуммаНДСВалИсходный;
				СтрокаКопии.СуммаБезНДСВал 			= СуммаСНДСВал - СтрокаКопии.СуммаНДСВал;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПриобретений.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
		ТаблицаПриобретений.Колонки.СуммаНДСВал   .Имя = "СуммаНДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПриобретений, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СделкаНУ, "Сделка");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ОжидаемыйНДС , "КодОперации");
							
		Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьПриход();
			Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
			
		КонецЕсли;
	
	КонецЕсли;

	Возврат ТаблицаПоВторомуСобытиюНал;
	
КонецФункции

// Формирует движения по регистрам для целей упр. учета.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоТоварамОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок)
    	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	// В СНТТ в регистре ТоварыОрганизаций товары не учитываются
	Если СтруктураШапкиДокумента.СуммоваяРозница Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	ТаблицаДвиженийТара = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация,                "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,               "Комиссионер");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;

	// ТАРА ПО РЕГИСТРУ ТоварыОрганизаций.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвиженийТара);
	
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация,                "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Неопределено,               "Комиссионер");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвиженийТара, ТаблицаДвижений);	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьДвижения();
	КонецЕсли;
	
КонецПроцедуры

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	УправлениеВзаиморасчетами.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
						мСтруктураПараметровВзаиморасчетов, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
						ВидДвиженияНакопления.Расход, Отказ, Заголовок);

	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.Сделка) 
	   И ТипЗНЧ(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	   
		// Движения по заказам покупателей.
		//Товары
		НаборДвижений = Движения.ЗаказыПоставщикам;
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику",    СтруктураШапкиДокумента.Сделка);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",Перечисления.СтатусыПартийТоваров.Купленный, "ТаблицаПоТоварам");

		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;	
	

	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	ТоварыИТараПоРегистрамОстатковУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
			
	Если НЕ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда 
		
		// ТАРА ПО РЕГИСТРУ ТоварыПолученные.
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТаре);
				
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыПолученные, СтруктТаблицДокумента);
			
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Сделка",             УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента));
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара);
					
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыПолученные, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		
	ИначеЕсли СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			Движения.ТоварыПолученные.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию,     Отказ, Заголовок);
			Движения.ТоварыПолученные.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара, Отказ, Заголовок);
		КонецЕсли;
		
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыПолученные.
		Если НЕ Отказ Тогда
		
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыПолученные, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);

			Если ЗначениеЗаполнено(СтруктураШапкиДокумента.Сделка) Тогда
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Сделка",         СтруктураШапкиДокумента.Сделка);
			КонецЕсли;

			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);

			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыПолученные, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);

			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТаре);
			
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыПолученные, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Сделка",             УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,,, Истина));
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара);
			
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыПолученные, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по регистру "Взаиморасчеты с контрагентами по документам расчетов",
// если по договору ведется учет в разрезе документов
//
Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		Возврат;
	КонецЕсли;

	ВидДвижения = ВидДвиженияНакопления.Расход;
	ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;

	УправлениеВзаиморасчетами.ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаПоВзаиморасчетам, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры
Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам)

	Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.НаКомиссию,"ДопустимыйСтатус1");
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус1");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	
КонецПроцедуры

Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТареУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТаре)
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	
КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок)
    	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.СуммоваяРозница Тогда
		// партии в суммовой рознице не учитываются
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.

	// Количество из колонки КоличествоДок
	ТаблицаПоТоварамКопия = ТаблицаПоТоварам.Скопировать();
	
	ТаблицаПоТоварамКопия.Колонки.Удалить("Количество");
	ТаблицаПоТоварамКопия.Колонки.КоличествоДок.Имя = "Количество";

	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамКопия, ТаблицаДвижений);
	
	ЗаполнитьДокументПартии = НЕ РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ПрименятьСтратегиюСписанияПартийДляВозвратовПоставщикам;

	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		
		СтрокаТЧ = ТаблицаПоТоварам[ТаблицаДвижений.Индекс(Строка)];
			
		Если ЗаполнитьДокументПартии Тогда
			Строка.ДокументПартии = СтрокаТЧ.ДокументЗакупки;
		КонецЕсли;

		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Товары;

	КонецЦикла;

	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Склад,"Склад");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ВозвратПоставщику,  "КодОперацииПартииТоваров");
	
	ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварамКопия);

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;

	// ТАРА ПО РЕГИСТРУ СписанныеТовары.

	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Ресурс в регистре называется ЗаказПартии
	ТаблицаПоТареКопия = ТаблицаПоТаре.Скопировать();
	
	ТаблицаПоТареКопия.Колонки.Удалить("Количество");
	ТаблицаПоТареКопия.Колонки.КоличествоДок.Имя = "Количество";

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТареКопия, ТаблицаДвижений);

	// Недостающие поля.
	Для каждого Строка Из ТаблицаДвижений Цикл

		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Тара;

	КонецЦикла;

	// Если ПУ по складам
	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Склад,"Склад");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ВозвратПоставщику,"КодОперацииПартииТоваров");
	
	ЗаполнитьКолонкиРегистраСписанныеТоварыПоТареУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТареКопия);

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
	    Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования <> Тип("ДокументСсылка.ЗаказПоставщику")
		И ТипОснования <> Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		И ТипОснования <> Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ") Тогда
		возврат;
	КонецЕсли;

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ") Тогда
		Если Основание.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслугВНТТ.ВнутреннееПеремещение Тогда
			Возврат;
		КонецЕсли;

		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		Склад = Основание.Склад;

		Сделка = Основание.Сделка; // заполняем сделку заказом поставщику

		Если Основание.Проведен Тогда
			
			Если НЕ Основание.Склад.СуммовойУчет Тогда
			
				// Заполним табличные части по поступлению Товаров.
			СтруктураПолученияСделок = Новый Структура();
			СтруктураПолученияСделок.Вставить("ПолучатьСделки"          , Истина);
			СтруктураПолученияСделок.Вставить("ИзменитьСделкуВШапке"    , Истина);
			СтруктураПолученияСделок.Вставить("Отказ"                   , Ложь);
			СтруктураПолученияСделок.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, ВозвратнаяТара"));
			ЗаполнитьТоварыПоОснованиюУпр(Основание, СтруктураПолученияСделок);
			СтруктураПолученияСделок.Вставить("ПолучатьСделки", Ложь);
			СтруктураПолученияСделок.Вставить("ИзменитьСделкуВШапке", Ложь);
			СтруктураПолученияСделок.Вставить("СтруктураТабличныхЧастей", Новый Структура());
			ЗаполнитьВозвратнуюТаруПоОснованиюУпр(Основание, СтруктураПолученияСделок);
			
			Иначе
				
				// скопируем из документа
				ДобавитьСтрокиТабличнойЧастиИзДокументаПоступления(Основание, Товары);
			
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		// Заполнение шапки
		ОтражатьВУправленческомУчете = Истина;
		ВалютаДокумента              = Основание.ВалютаДокумента;
		ДоговорКонтрагента           = Основание.ДоговорКонтрагента;
		Комментарий                  = Основание.Комментарий;
		Контрагент                   = Основание.Контрагент;
		КратностьВзаиморасчетов      = Основание.КратностьВзаиморасчетов;
		КурсВзаиморасчетов           = Основание.КурсВзаиморасчетов;
		Организация                  = Основание.Организация;
		Ответственный                = Основание.Ответственный;
		Подразделение                = Основание.Подразделение;
		Склад                        = Основание.Склад;
		СуммаВключаетНДС             = Основание.СуммаВключаетНДС;
		СуммаДокумента               = Основание.СуммаДокумента;
		ТипЦен                       = Основание.ТипЦен;
		УчитыватьНДС                 = Основание.УчитыватьНДС;
		
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			Сделка = Основание;
		Иначе
			Сделка = Неопределено;
		КонецЕсли;

		Для Каждого ТекСтрокаВозвратнаяТара Из Основание.ВозвратнаяТара Цикл
			НоваяСтрока = ВозвратнаяТара.Добавить();
			НоваяСтрока.Количество   = ТекСтрокаВозвратнаяТара.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаВозвратнаяТара.Номенклатура;
			НоваяСтрока.Сумма        = ТекСтрокаВозвратнаяТара.Сумма;
			НоваяСтрока.Цена         = ТекСтрокаВозвратнаяТара.Цена;
		КонецЦикла;

		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения           = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмеренияМест       = ТекСтрокаТовары.ЕдиницаИзмеренияМест;
			НоваяСтрока.Количество                 = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоМест             = ТекСтрокаТовары.КоличествоМест;
			НоваяСтрока.Коэффициент                = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура               = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СтавкаНДС                  = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.Сумма                      = ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДС                   = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.Цена                       = ТекСтрокаТовары.Цена;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		Сделка = Основание; // заполняем сделку заказом поставщику

		Если Сделка.Проведен Тогда
			// Заполним табличные части по заказу поставщику.
			СтруктураПолученияСделок = Новый Структура();
			СтруктураПолученияСделок.Вставить("ПолучатьСделки"          , Ложь);
			СтруктураПолученияСделок.Вставить("ИзменитьСделкуВШапке"    , Истина);
			СтруктураПолученияСделок.Вставить("Отказ"                   , Ложь);
			СтруктураПолученияСделок.Вставить("СтруктураТабличныхЧастей", Новый Структура());
			ЗаполнитьТоварыПоОснованиюУпр(Сделка, СтруктураПолученияСделок);
			СтруктураПолученияСделок.Вставить("ИзменитьСделкуВШапке"    , Ложь);
			ЗаполнитьВозвратнуюТаруПоОснованиюУпр(Сделка, СтруктураПолученияСделок);
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
		мСтруктураПараметровВзаиморасчетов.Дата = ТекущаяДата();
		УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммоваяРозница = Склад.СуммовойУчет;
	
	Если ВозвратнаяТара.Количество() > 0
	   И (ДоговорКонтрагента.Внешнеэкономический ИЛИ СуммоваяРозница)Тогда

		ВозвратнаяТара.Очистить();

	КонецЕсли;
	
	Если СуммоваяРозница Тогда
		Для Каждого Строка Из Товары Цикл
			Строка.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
		КонецЦикла;
	КонецЕсли;

	Если НЕ мУчетнаяПолитикаНУ.ЕстьНДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Товары Цикл
			СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
		
		Для каждого СтрокаТЧ  Из ВозвратнаяТара Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла;
			
	КонецЕсли; 	
	
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Товары);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Товары");
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Товары");
	
	// Удаление неиспользуемых строк табличной части "Серийные номера".
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");

КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Перем ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам;
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента   = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"        , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                 , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                 , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"       , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Внешнеэкономический"		  , "Внешнеэкономический");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"					   , "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"              , "ВидОперации"                 , "СделкаВидОперации");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВестиПартионныйУчетПоСкладам", "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"               , "ВидСклада"                   , "ВидСклада");
 	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"               , "СуммовойУчет"                , "СуммоваяРозница");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "ВалютаУправленческогоУчета"    , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"         , "ВедениеВзаиморасчетов");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам",                     "ВедениеУчетаПоПроектам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентом"    , "ВестиПоДокументамРасчетовСКонтрагентом");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентомРегл"    , "ВестиПоДокументамРасчетовСКонтрагентомРегл");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СхемаНалоговогоУчета"                      , "СхемаНалоговогоУчета");
	
	// Для контроля остатков по взаиморасчетам
	УправлениеВзаиморасчетами.ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке, РежимПроведения);

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	СтруктураШапкиДокумента.Вставить("СделкаБУ", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка, Сделка));
	СтруктураШапкиДокумента.Вставить("СделкаНУ", НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка));
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	ОбновитьПараметрыУчетнойПолитики(Дата,Организация);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Удалить ("Количество");
	СтруктураПолей.Вставить("КоличествоДок"      , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент"); // Количество нужно выгружать с другим псевдонимом, иначе нельзя будет использовать отрицательные значения
	СтруктураПолей.Вставить("Услуга"             , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"              , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"           , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ЦенаВРознице"       , "ЦенаВРознице");
	СтруктураПолей.Вставить("ДокументЗакупки"    , "ДокументПоступления");
	СтруктураПолей.Вставить("Цена"               , "Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"   , "ЕдиницаИзмерения");
	
	СтруктураПолей.Вставить("БланкСтрогогоУчета" , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("СчетУчетаБУ"        , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СуммаВРознице"      , "СуммаВРознице");
	СтруктураПолей.Вставить("СтавкаНДСВРознице"  , "СтавкаНДСВРознице");
	
	СтруктураПолей.Вставить("НалоговоеНазначение"     	, "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     	, "НалоговоеНазначение.ВидДеятельностиНДС");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;

	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	// Получим необходимые данные для проведения и проверки заполенения данных 
	// по табличной части "Возвратная тара".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТара();
	СтруктураПолей.Удалить ("Количество");
	СтруктураПолей.Вставить("КоличествоДок"      , "Количество"); // Количество нужно выгружать с другим псевдонимом, иначе нельзя будет использовать отрицательные значения
	СтруктураПолей.Вставить("ЦенаВРознице"       , "ЦенаВРознице");
	
	СтруктураПолей.Вставить("БланкСтрогогоУчета" , "Номенклатура.БланкСтрогогоУчета");
	
	СтруктураПолей.Вставить("СчетУчетаБУ" , "СчетУчетаБУ");
		
	СтруктураПолей.Вставить("НалоговоеНазначение"     	, "НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС"     	, "НалоговоеНазначение.ВидДеятельностиНДС");

	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);

	ПогрешностиОкругления		= Новый Соответствие;
	ПогрешностиОкругленияТара   = Новый Соответствие;
	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ТаблицаПоТаре    = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругленияТара);

	// Проверить заполнение ТЧ "Товары" и "Возвратная тара".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);

	
	ПроводитьПоВзаиморасчетам = НЕ (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	мСтруктураПараметровВзаиморасчетов.Вставить("ПроводитьПоВзаиморасчетам", ПроводитьПоВзаиморасчетам);
	
	СтруктураПодготовленныхТаблиц = Новый Структура("Товары", ТаблицаПоТоварам);
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблиц);
	УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                ЭтотОбъект, мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента, 
	                                                Отказ, Заголовок);
	
	//Проверим на возможность проведения в БУ и НУ.
	Если ОтражатьВБухгалтерскомУчете Тогда
		УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,
		                                     ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
		                                     Ложь, Отказ, Заголовок, "", СтруктураШапкиДокумента.ВалютаВзаиморасчетов);
	КонецЕсли;

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", Неопределено);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

Процедура ОбновитьСтруктуруПараметровДляПолученияДоговора() Экспорт
	
	СписокДопустимыхВидовДоговоров = Новый СписокЗначений;
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Если Не Склад.СуммовойУчет Тогда
	
		СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);	
	
	КонецЕсли;
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);

	мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части ВозвратнаяТара по выбранному заказу поставщику.
//
Процедура ЗаполнитьВозвратнуюТаруПоЗаказуПоставщику() Экспорт
	
	ЗаполнитьТабличнуюЧастьПоЗаказуПоставщику(ВозвратнаяТара);
	
КонецПроцедуры

// Заполняет поля всех позиций табличной части ВозвратнаяТара по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ЗаполнитьПозицииТЧВозвратнаяТара() Экспорт
	
	Для НомерПозиции = 0 По ВозвратнаяТара.Количество() - 1 Цикл	
		ЗаполнитьПозициюВозвратнойТарыПоНоменклатуре(НомерПозиции);			
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПозицииТЧВозвратнаяТара()
 
// Заполняет поля всех позиций табличной части Товары по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ЗаполнитьПозицииТЧТовары() Экспорт
	
	Для НомерПозиции = 0 По Товары.Количество() - 1 Цикл	
		ЗаполнитьПозициюТоварыПоНоменклатуре(НомерПозиции);			
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПозицииТЧТовары()

// Заполняет поля позиции табличной части ВозвратнаяТара по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
// Параметры
//  НомерПозиции  – номер позиции табличной части
//
Процедура ЗаполнитьПозициюВозвратнойТарыПоНоменклатуре(НомерПозиции) Экспорт

	ПриИзмененииНоменклатурыВозвратнаяТара(ВозвратнаяТара.Получить(НомерПозиции));

КонецПроцедуры // ЗаполнитьПозициюВозвратнойТарыПоНоменклатуре()   

// Заполняет поля позиции табличной части Товары по выбранной номенклатуре.
// Вызывается из веб-приложения "Удаленный склад"
//
// Параметры
//  НомерПозиции  – номер позиции табличной части
//
Процедура ЗаполнитьПозициюТоварыПоНоменклатуре(НомерПозиции) Экспорт

	ПриИзмененииНоменклатурыТовары(Товары.Получить(НомерПозиции));

КонецПроцедуры // ЗаполнитьПозициюТоварыПоНоменклатуре()

// Процедура выполняет заполнение табличной части по выбранному заказу поставщику.
//
// Параметры:
//  ТабличнаяЧасть - табличная часть, которую необходимо заполнить.
//
Процедура ЗаполнитьТабличнуюЧастьПоЗаказуПоставщику(ТабличнаяЧасть) Экспорт

	ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам;
	ПредставлениеЗаказПоставщику = Метаданные.Документы.ЗаказПоставщику.Представление();

	ЗаполнятьТабличнуюЧасть = Ложь;
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстПредупреждения = "Не выбран договор. Заполнение невозможно.";

	ИначеЕсли НЕ ЗначениеЗаполнено(Сделка)
		  или Не ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ТекстПредупреждения = "Не выбран "+ПредставлениеЗаказПоставщику+".
		                      |Заполнение невозможно.";

	ИначеЕсли Не Сделка.Проведен Тогда
		ТекстПредупреждения = ПредставлениеЗаказПоставщику + " не проведен.
		                      |Заполнение невозможно.";
	Иначе
		ЗаполнятьТабличнуюЧасть = Истина;
	КонецЕсли;

	Если Не ЗаполнятьТабличнуюЧасть Тогда
		
		#Если Клиент Тогда		
			Предупреждение(ТекстПредупреждения, , Метаданные().Представление());
			Возврат;		
		#Иначе
			ВызватьИсключение ТекстПредупреждения;
		#КонецЕсли
	КонецЕсли;

	Если ТабличнаяЧасть.Количество() > 0 Тогда
		
		#Если Клиент Тогда
		
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Представление());
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		
		#КонецЕсли

		ТабличнаяЧасть.Очистить();
	КонецЕсли;

	СтруктураПолученияСделок = Новый Структура();
	СтруктураПолученияСделок.Вставить("ПолучатьСделки"          , Ложь);
	СтруктураПолученияСделок.Вставить("ИзменитьСделкуВШапке"    , Ложь);
	СтруктураПолученияСделок.Вставить("Отказ"                   , Ложь);
	СтруктураПолученияСделок.Вставить("СтруктураТабличныхЧастей", Новый Структура());

	Если ТабличнаяЧасть = Товары Тогда
		ЗаполнитьТоварыПоОснованиюУпр(Сделка, СтруктураПолученияСделок);
	ИначеЕсли ТабличнаяЧасть = ВозвратнаяТара Тогда
		ЗаполнитьВозвратнуюТаруПоОснованиюУпр(Сделка, СтруктураПолученияСделок);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьТабличнуюЧастьПоЗаказуПоставщику()

// Процедура выполняет заполнение табличной части Товары по выбранному заказу поставщику.
//
Процедура ЗаполнитьТоварыПоЗаказуПоставщику() Экспорт
	
	ЗаполнитьТабличнуюЧастьПоЗаказуПоставщику(Товары);
	
КонецПроцедуры

// Инициализирует документ
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	Если ЭтоНовый() Тогда
		
		#Если Клиент Или ВнешнееСоединение Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Покупка", ПараметрОбъектКопирования, ПараметрОснование);	
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		#КонецЕсли	
		
		// Склад должен быть НТТ, значение по умолчанию неправильного вида очищаем
		Если ЗначениеЗаполнено(Склад) И Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента)
			И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			
			Если Склад.СуммовойУчет Тогда
				
			Иначе
				ДоговорКонтрагента = Неопределено;
			КонецЕсли;
		КонецЕсли;

				
		Если НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
			
			СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, ДоговорКонтрагента);

			СчетУчетаРасчетовСКонтрагентом 	= СчетаУчета.СчетРасчетов;
			Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПриБартере;
			КонецЕсли;
			
			СчетУчетаРасчетовПоАвансам		= СчетУчетаРасчетовСКонтрагентом;
			
			СчетУчетаРасчетовПоТаре        	= СчетаУчета.СчетУчетаТары;
			СчетУчетаРасчетовПоТареПоАвансам= СчетаУчета.СчетУчетаТары;
            						
			СчетУчетаНДС 				= СчетаУчета.СчетУчетаНДСПриобретений;
			СчетУчетаНДСПодтвержденный  = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;

			СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДоходовВозвратПоставщику);
			СчетУчетаДоходовБУ 	= СчетУчета.СчетУчетаБУ;
			СубконтоДоходов1 	= СчетУчета.Субконто1;
			СубконтоДоходов2 	= СчетУчета.Субконто2;
			СубконтоДоходов3 	= СчетУчета.Субконто3;
		
			СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратВозвратПоставщику);
			СчетУчетаРасходовБУ 	= СчетУчета.СчетУчетаБУ;
			СубконтоРасходов1 	= СчетУчета.Субконто1;
			СубконтоРасходов2 	= СчетУчета.Субконто2;
			СубконтоРасходов3 	= СчетУчета.Субконто3;
			
		КонецЕсли;
		
	КонецЕсли;
	
	мТекущийДоговорКонтрагента = ДоговорКонтрагента;
	мТекущаяВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	ОбновитьПараметрыУчетнойПолитики(Дата,Организация);

КонецПроцедуры // ИнициализироватьДокумент()

// Пересчитывает суммы в табличных частях. Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьВебДокумент() Экспорт

	ПересчитатьТабличнуюЧастьТовары();	
	ПересчитатьТабличнуюЧастьВозвратнаяТара();

КонецПроцедуры // ПересчитатьВебДокумент()

// Пересчитывает суммы в позициях табличной части ВозвратнаяТара.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьТабличнуюЧастьВозвратнаяТара() Экспорт

	Для Каждого СтрокаТабЧасти Из ВозвратнаяТара Цикл

		ПриИзмененииКоличестваВозвратнаяТара(СтрокаТабЧасти);

	КонецЦикла; 	

КонецПроцедуры // ПересчитатьТабличнуюЧастьВозвратнаяТара()

// Пересчитывает суммы в позициях табличной части Товары.
// Вызывается из веб-приложения "Удаленный склад"
//
Процедура ПересчитатьТабличнуюЧастьТовары() Экспорт

	Для Каждого СтрокаТабЧасти Из Товары Цикл
		
		ПриИзмененииКоличестваТовары(СтрокаТабЧасти);

	КонецЦикла; 	

КонецПроцедуры // ПересчитатьТабличнуюЧастьТовары()


// Выполняет необходимые действия при изменении реквизита ДоговорКонтрагента
//
Процедура ПриИзмененииДоговора() Экспорт
	
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
	
	// Зададим, какие реквизиты надо редактировать.
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ЭтотОбъект);
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ЭтотОбъект, мТекущаяВалютаВзаиморасчетов, мВалютаРегламентированногоУчета, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", мТекущийДоговорКонтрагента);
	
	мТекущийДоговорКонтрагента = ДоговорКонтрагента;
	мТекущаяВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	ЗаполнениеДокументов.УстановитьТипСделки(ЭтотОбъект, Ложь);
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента.ОсновнойПроект) Тогда
		Проект = ДоговорКонтрагента.ОсновнойПроект;
	КонецЕсли;
	
КонецПроцедуры //ПриИзмененииДоговора()

// Выполняет необходимые действия при изменении реквизита Количество в таб.части Товары
//	
Процедура ПриИзмененииКоличестваВозвратнаяТара(СтрокаТабличнойЧасти) Экспорт 
	
	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
КонецПроцедуры //ПриИзмененииКоличестваВозвратнаяТара()

// Выполняет необходимые действия при изменении реквизита Количество в таб.части Товары
//	
Процедура ПриИзмененииКоличестваТовары(СтрокаТабличнойЧасти) Экспорт 
	
	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры //ПриИзмененииКоличестваТовары() 

// Выполняет необходимые действия при изменении реквизита ДоговорКонтрагента
//
Процедура ПриИзмененииКонтрагента() Экспорт
	
	ОбновитьСтруктуруПараметровДляПолученияДоговора();
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
	ПриИзмененииДоговора();
	
КонецПроцедуры // ПриИзмененииКонтрагента()

// Выполняет необходимые действия при изменении поля Номенклатура в таб.части ВозвратнаяТара
//	
Процедура ПриИзмененииНоменклатурыВозвратнаяТара(СтрокаТабличнойЧасти) Экспорт 
	
	// Выполнить общие действия для всех документов при изменении возвратной тары.
	ОбработкаТабличныхЧастей.ПриИзмененииВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

	// Заполнить реквизиты табличной части.
	ОбработкаТабличныхЧастей.ЗаполнитьЦенуВозвратнойТарыТабЧастиПоступление(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета);

	// Рассчитать реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
	
КонецПроцедуры //ПриИзмененииНоменклатурыВозвратнаяТара() 

// Выполняет необходимые действия при изменении поля Номенклатура в таб.части Товары
//	
Процедура ПриИзмененииНоменклатурыТовары(СтрокаТабличнойЧасти) Экспорт 

	// Выполнить общие действия для всех документов при изменении номенклатуры.
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

	// Заполняем реквизиты табличной части.
	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, "Приобретение"); 
	СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
	                                         Контрагент, ТипЦен, ДоговорКонтрагента, Дата,ВалютаДокумента, УчитыватьНДС,СуммаВключаетНДС);

	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета); 

	// Рассчитываем реквизиты табличной части.
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, ЭтотОбъект);
	
	РассчитатьРозничнуюСуммуВСтрокеТабЧасти(СтрокаТабличнойЧасти);
	
	ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);

	Если Склад.СуммовойУчет Тогда
		Если (мРазделятьПоСтавкамНДС) Тогда
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
				СтрокаТабличнойЧасти.СтавкаНДСВРознице = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры // ПриИзмененииНоменклатурыТовары()
	
// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
	ОбновитьСтруктуруПараметровДляПолученияДоговора();
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
	
	ОбновитьПараметрыУчетнойПолитики(Дата,Организация);
	
	Сделка = Неопределено;
	
КонецПроцедуры // ПриИзмененииОрганизации()

// Выполняет необходимые действия при изменении реквизита Склад
//
Процедура ПриИзмененииСклада() Экспорт
	
	// возможно нужно изменить договор
	ПриИзмененииКонтрагента();
	
КонецПроцедуры //ПриИзмененииСклада()

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата,Ссылка.Организация, Ложь);

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);

мСтруктураПараметровДляПолученияДоговора = Новый Структура();
ОбновитьСтруктуруПараметровДляПолученияДоговора();

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары", Ложь));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Ложь);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях");
мСтруктураПараметровВзаиморасчетов.Вставить("ЭтоВозврат", Истина);

УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");

мУказаниеСкладовВТЧ    = (УказаниеСкладов     = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации)
                         Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации);

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();
