////Перем СписокВыбораТипаНовогоДокумента;
////Перем СписокТиповДокументов;
//Перем БылаПроверка;
//Перем бОтладка;
//Перем тзНеоплЗаказы;

//Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
//	ИмяОбработки = ЭтотОбъект.Метаданные().Имя;
//	Организация = ВосстановитьЗначение(ИмяОбработки + "Организация");
//	Карта       = ВосстановитьЗначение(ИмяОбработки + "Карта"); 
//	//	НачПериода  = ВосстановитьЗначение(ИмяОбработки + "НачПериода");
//	//	КонПериода  = ВосстановитьЗначение(ИмяОбработки + "КонПериода");
//	
//	НачПериода  = Дата(1,1,1);
//	КонПериода  = КонецДня(ТекущаяДата());
//	
//	ТочностьСуммы  =ВосстановитьЗначение(ИмяОбработки + "ТочностьСуммы");
//	ТочностьПроцент=ВосстановитьЗначение(ИмяОбработки + "ТочностьПроцент");
//КонецПроцедуры

//Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
//	ИмяОбработки = ЭтотОбъект.Метаданные().Имя;
//	СохранитьЗначение(ИмяОбработки + "Организация", Организация);
//	СохранитьЗначение(ИмяОбработки + "Карта", Карта);
//	СохранитьЗначение(ИмяОбработки + "НачПериода", НачПериода);
//	СохранитьЗначение(ИмяОбработки + "КонПериода", КонПериода);
//	СохранитьЗначение(ИмяОбработки + "ТочностьСуммы", ТочностьСуммы);
//	СохранитьЗначение(ИмяОбработки + "ТочностьПроцент", ТочностьПроцент);
//КонецПроцедуры

//Процедура ПриОткрытии()
//	ОчиститьСообщения();
//	Если НЕ ЗначениеЗаполнено(Организация) Тогда
//		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");		
//	Иначе
//		Запрос = новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	Организации.Наименование
//		|ИЗ
//		|	Справочник.Организации КАК Организации
//		|ГДЕ
//		|	Организации.Ссылка = &СсылкаНаОрганизацию";
//		
//		Запрос.УстановитьПараметр("СсылкаНаОрганизацию",Организация);
//		Выборка = Запрос.Выполнить().Выгрузить();
//		
//		Если Выборка.Количество() = 0 Тогда
//			Карта = Справочники.КарточныеСчета.ПустаяСсылка();
//			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если НЕ бОтладка Тогда 
//		ЭлементыФормы.КоманднаяПанель.Кнопки.ПолучитьНалКурсВалПриват.Доступность = Ложь;
//		
//		//ЭлементыФормы.КоманднаяПанель.Кнопки.ТестОтвета.Доступность = Ложь;
//	КонецЕсли;	
//	
//	// выбрать все неопл заказы: дата начала по первому неопл заказу
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	//		|	ЗаказПокупателя.Ссылка,
//	|	ЗаказПокупателя.Дата КАК Дата,
//	|	ЗаказПокупателя.СтатусЗаказа
//	|ИЗ
//	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
//	|ГДЕ
//	|	ЗаказПокупателя.СтатусЗаказа = &СтатусЗаказаОжидаетОплаты
//	|АВТОУПОРЯДОЧИВАНИЕ
//	|";
//	
//	Запрос.УстановитьПараметр("СтатусЗаказаОжидаетОплаты", Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты"));			
//	РезультатЗапроса = Запрос.Выполнить();
//	тз = РезультатЗапроса.Выгрузить();
//	КвоДок = РезультатЗапроса.Выбрать().Количество();
//	//////	сТекст1 = "Найдено"; //Есть подходящие заказы:";
//	//////	сТекст2 = " " + СокрЛП(Формат(КвоДок,"ЧЦ=10; ЧДЦ=; ЧН=0"))+" док.";
//	////////	ОформлениеСтроки.Ячейки.СуммаОт.УстановитьТекст(сТекст);
//	////////	ЭлементыФормы.ДокументСписок.Колонки.СуммаДокумента.ТекстПодвала = сТекст;	
//	////////	ЭлементыФормы.ДокументСписок.Колонки.Дата.ТекстПодвала = сТекст;	
//	//////	ЭлементыФормы.ДокументСписок.Колонки.СуммаОт.ТекстПодвала = сТекст1;	
//	//////	ЭлементыФормы.ДокументСписок.Колонки.СуммаДо.ТекстПодвала = сТекст2;	
//	Если КвоДок > 0 Тогда 
//		НачПериода = тз[0].Дата;
//	КонецЕсли;	
//	
//	Если бОтладка Тогда 
//		ИмяФайлаОтвета = "";		
//		ОбработкаОтветаТест(ИмяФайлаОтвета);		
//	Иначе 
//		ЗагрузитьДанныеСсайта();	
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ОбновлениеОтображения()
//	Если Не БылаПроверка Тогда
//		БылаПроверка = истина;
//		//БанковскийСчетПриИзменении(Неопределено);
//	КонецЕсли;
//КонецПроцедуры

//Процедура ОрганизацияПриИзменении(Элемент)
//	
//	Если Не ЗначениеЗаполнено(Организация) Тогда
//		//ВыборкаОрганизаций = ПолучитьВыборкуОрганизаций();
//		//Если ВыборкаОрганизаций.Следующий() Тогда
//		//	Организация = ВыборкаОрганизаций.Организация;
//		//КонецЕсли;
//	КонецЕсли;
//	
//	// АА+
//	Если ЗначениеЗаполнено(Организация) Тогда
//		Запрос = Новый Запрос; 
//		Запрос.Текст = "ВЫБРАТЬ 
//		|	КарточныеСчета.Ссылка 
//		|ИЗ 
//		|	Справочник.КарточныеСчета КАК КарточныеСчета
//		|ГДЕ 
//		|	КарточныеСчета.Владелец = &Владелец"; 
//		
//		Запрос.УстановитьПараметр("Владелец", Организация); 
//		тз = Запрос.Выполнить().Выгрузить(); 
//		Если тз.Количество() = 1 Тогда
//			Карта = тз[0].Ссылка;
//		Иначе	
//			Карта = Справочники.КарточныеСчета.ПустаяСсылка();
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

//// АА+ МОЁ НАЧАЛО **************************************************************************************************
//Процедура ЗагрузитьДанныеСсайта();
//	ОчиститьСообщения();
//	ДокументыКИмпорту.Очистить();		
//	сДата1 = Формат(НачПериода,"ДФ=dd.MM.yyyy");
//	сДата2 = Формат(КонПериода,"ДФ=dd.MM.yyyy");  // 11.08.2013
//	ВыбКарты = Справочники.КарточныеСчета.Выбрать(,Организация);
//	Пока ВыбКарты.Следующий() = 1 Цикл
//		//Если ВыбКарты.БанковскийСчетКарточный.Владелец <> Организация Тогда  	
//		//	Продолжить;
//		//КонецЕсли;	
//		Карта = ВыбКарты.Ссылка;
//		//сАдресСайта   = СокрЛП(Карта.АдресСайта);
//		//сАдресРесурса = СокрЛП(Карта.УРЛ);
//		сАйДи = Карта.АйДи;
//		//сДата1 = Формат(НачПериода,"ДФ=dd.MM.yyyy");
//		//сДата2 = Формат(КонПериода,"ДФ=dd.MM.yyyy");  // 11.08.2013
//		сНомерКарты = Карта.НомерКарты;
//		сСигнатура  = Карта.Сигнатура;
//		//	сОпер = "cmt";
//		//	сВэйт = "0";
//		//	сТест = "0";
//		//	сАйДиОплаты = "";
//		//******	
//		сТекстТэгаДата2="<oper>cmt</oper><wait>0</wait><test>0</test><payment id=""""><prop name=""sd"" value="""+сДата1+"""/><prop name=""ed"" value="""+сДата2+"""/><prop name=""card"" value="""+сНомерКарты+"""/></payment>";
//		стрШифр1 = сТекстТэгаДата2+сСигнатура; 
//		сСигнатура2 = Хеширование1(стрШифр1);
//		сТекстЗапроса1="<?xml version=""1.0"" encoding=""UTF-8""?><request version=""1.0""><merchant><id>"+сАйДи+"</id><signature>"+сСигнатура2+"</signature></merchant><data>";
//		сТекстЗапроса3="</data></request>";
//		сТекстЗапроса = ""+сТекстЗапроса1 + сТекстТэгаДата2 + сТекстЗапроса3;
//		// отл
//		Сообщить1(""+ТекущаяДата()+"строка текста запроса сТекстЗапроса= *****************");
//		Сообщить1(""+сТекстЗапроса);
//		УстановитьТекстВБуферОбмена(сТекстЗапроса);	
//		//
//		Текст=Новый ТекстовыйДокумент;
//		Текст.УстановитьТипФайла(КодировкаТекста.UTF8);
//		Текст.ДобавитьСтроку(сТекстЗапроса);
//		
//		ВремФайлУТФ = ПолучитьИмяВременногоФайла("utf");
//		
//		Текст.Записать(ВремФайлУТФ);
//		Текст=Неопределено;
//		Данные=Новый ДвоичныеДанные(ВремФайлУТФ);
//		Строка64=Base64Строка(Данные);
//		Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
//		ДанныеНаЗапись=Base64Значение(Строка64);
//		
//		ВремФайлОтправкиХМЛ = ПолучитьИмяВременногоФайла("xml");
//		ДанныеНаЗапись.Записать(ВремФайлОтправкиХМЛ);	
//		
//		HTTPЗапрос = Новый HTTPЗапрос("/p24api/rest_fiz");
//		HTTPЗапрос.УстановитьИмяФайлаТела(ВремФайлОтправкиХМЛ);
//		
//		ssl = Новый ЗащищенноеСоединениеOpenSSL();
//		HTTPСоединение = Новый HTTPСоединение("api.privatbank.ua",,,,,,ssl);
//		//Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);		
//		
//		//	УдалитьФайлы(ВремФайлОтправкиХМЛ);
//		ВремФайлОтвета = ПолучитьИмяВременногоФайла("xml");	
//		//	ВремФайлОтвета = "z:\fromSerCard.xml";
//		HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос,ВремФайлОтвета);		
//		
//		Соединение = Неопределено;	
//		HTTPЗапрос = Неопределено;	
//		УдалитьФайлы(ВремФайлУТФ);
//		УдалитьФайлы(ВремФайлОтправкиХМЛ);
//		//*************************************
//		ОбработкаОтвета1(ВремФайлОтвета);    //*
//		//*************************************
//		УдалитьФайлы(ВремФайлОтвета);
//	КонецЦикла; // по пл картам
//	//
//	ПоискЗаказовДляОплат(); // включает ОбработкаОтвета2
//	//
//КонецПроцедуры

//Процедура ПоискЗаказовДляОплат()
//	Отказ = Ложь;
//	ОтменитьПроведение(Отказ);
//	Если Отказ Тогда 
//		Возврат
//	КонецЕсли;	
//	
//	// подготовка к расшифровке ответов 2 - поиск заказов для оплат
//	//неопл заказы
//	Запрос = Новый Запрос; 
//	Запрос.Текст = " 
//	|ВЫБРАТЬ 
//	|	ЗаказПокупателя.Ссылка,
//	|	ЗаказПокупателя.Номер,
//	|	ЗаказПокупателя.НомерЗаказа2ССайта      КАК Номер2,
//	|	ЗаказПокупателя.Контрагент.Наименование КАК ФИО,
//	|	ЗаказПокупателя.Контрагент.Наименование КАК ФИ,	
//	|	ЗаказПокупателя.Контрагент.Наименование КАК ФИОКратко,		
//	|	ЗаказПокупателя.СтатусЗаказа,	
//	|	ЗаказПокупателя.СуммаДокумента,	
//	//  НомерЗаказа - число
//	|	12345678901 КАК НомерЗаказа
//	|ИЗ 
//	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя 
//	|ГДЕ 
//	|	ЗаказПокупателя.Проведен 
//	|	И 
//	|	ЗаказПокупателя.СтатусЗаказа = &СтатусЗаказаОжидаетОплаты
//	|	И 
//	|	ЗаказПокупателя.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
//	|"; 
//	
//	СтатусЗаказаСсылкаОжидаетОплаты = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты");
//	Запрос.УстановитьПараметр("СтатусЗаказаОжидаетОплаты",СтатусЗаказаСсылкаОжидаетОплаты);
//	тзНеоплЗаказы = Запрос.Выполнить().Выгрузить(); 
//	Для Каждого тс Из тзНеоплЗаказы Цикл 
//		// 1)
//		тс.НомерЗаказа = 0;
//		сНомерЗаказа1 = СокрЛП(тс.Номер);
//		тс.Номер = сНомерЗаказа1;
//		ДлинаСтрокиНомера = СтрДлина(сНомерЗаказа1);
//		Для у = 1 По ДлинаСтрокиНомера Цикл
//			сНомерЗаказа2 = Сред(сНомерЗаказа1, у);
//			чНомерЗаказа2 = ПроверкаНаЧисло(сНомерЗаказа2);			
//			Если чНомерЗаказа2 <> 0 Тогда 
//				тс.НомерЗаказа = Число(сНомерЗаказа2);
//				Прервать;
//			КонецЕсли; 
//		КонецЦикла; 
//		// 2) Фамилия Имя
//		сФИ = тс.ФИ;
//		аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сФИ, " ");
//		тс.ФИ = "";
//		Если аСтрок.Количество() >= 2 Тогда
//			тс.ФИ = аСтрок[0] + " " + аСтрок[1];
//		КонецЕсли;
//		// 3) ФИОКратко
//		сФИ = тс.ФИОКратко;
//		аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сФИ, " ");
//		тс.ФИОКратко = "";
//		Если аСтрок.Количество() >= 2 Тогда
//			тс.ФИОКратко = СокрЛП(аСтрок[0])+" "+Лев(аСтрок[1],1)+".";
//		КонецЕсли;
//		Если аСтрок.Количество() >= 3 Тогда
//			//	тс.ФИОКратко = СокрЛП(аСтрок[0])+" "+Лев(аСтрок[1],1)+"."+" "+Лев(аСтрок[2],1)+".";
//			тс.ФИОКратко = СокрЛП(аСтрок[0])+" "+Лев(аСтрок[1],1)+"."+"" +Лев(аСтрок[2],1)+".";
//		КонецЕсли;
//		
//		тсВСтроку = "!"		
//		+тс.Номер+"!"
//		+тс.Номер2+"!"
//		+тс.ФИО+"!"
//		+тс.ФИ+"!"	
//		+тс.ФИОКратко+"!"		
//		+тс.СтатусЗаказа+"!"	
//		+тс.СуммаДокумента+"!"	
//		+тс.НомерЗаказа+"!";
//		ВОтладку("*тзНеоплЗаказы="+тсВСтроку);
//		
//	КонецЦикла; 
//	//
//	// поиск и заполнене в тз заказов
//	//ДокументыКИмпорту.Очистить();	// выше в начале
//	ОбработкаОтвета2();
//	//
//	// загрузка с 1с готовых найденных оплат напрямую ППВх - сразу после обработки
//	Загрузить(ДокументыКИмпорту,Истина); // загр только отмеченные - сразу отмеченные	
//	//
//КонецПроцедуры // Процедура ПоискЗаказовДляОплат()

//Процедура ОбработкаОтветаТест(ИмяФайлаОтвета)
//	Режим = РежимДиалогаВыбораФайла.Открытие; 
//	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
//	ДиалогОткрытияФайла.ПолноеИмяФайла = "fromSerCardTest.xml"; 
//	Фильтр = "XML(*,xml)|*.xml"; 
//	ДиалогОткрытияФайла.Фильтр = Фильтр; 
//	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
//	ДиалогОткрытияФайла.Заголовок = "Выберите файл ответа:"; 
//	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда 
//		Возврат;
//	КонецЕсли;		
//	//	НачПериода = Дата(2013,10,27);
//	//	КонПериода = Дата(2013,10,27);
//	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла; 
//	ОбработкаОтвета1(ПутьКФайлу);
//	ПоискЗаказовДляОплат();
//КонецПроцедуры // Процедура ОбработкаОтветаТест(ИмяФайлаОтвета)

//Процедура ОтменитьПроведение(Отказ);
//	Отказ = Ложь;
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Дата,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВидОперации,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Оплачено,
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ДатаОплаты
//	|ИЗ
//	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
//	|ГДЕ
//	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
//	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации
//	//		|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Оплачено = &Оплачено
//	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Оплачено 
//	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ДатаОплаты МЕЖДУ &Дата1 И &Дата2
//	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = &СтатьяДвиженияДенежныхСредств
//	|";
//	
//	ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
//	//Дата1 = Дата(2013,10,27);
//	//Дата2 = Дата(2013,10,27);
//	//ДатаОплаты = Дата(2013,10,27);
//	//Оплачено = Истина;
//	СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателяПриват24;
//	
//	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
//	Запрос.УстановитьПараметр("Дата1", НачПериода);
//	Запрос.УстановитьПараметр("Дата2", КонПериода);
//	//	Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплаты);
//	//	Запрос.УстановитьПараметр("Оплачено", Оплачено);
//	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	тз = РезультатЗапроса.Выгрузить();
//	Выборка = РезультатЗапроса.Выбрать();
//	//
//	чКвоДокПП = Выборка.Количество();
//	сКвоДокПП = СокрЛП(""+Выборка.Количество());
//	Если чКвоДокПП = 0 Тогда 
//		Возврат
//	КонецЕсли;	
//	Ответ = Вопрос("За " + ПредставлениеПериода(НачалоДня(НачПериода), КонецДня(КонПериода), "ФП = Истина")
//	+" есть " + сКвоДокПП + " док. оплаты - будут помечены на удаление или обновлены. Продолжить ?",
//	РежимДиалогаВопрос.ДаНет);
//	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда 
//		Отказ = Истина;			  
//		Возврат
//	КонецЕсли;	
//	//
//	Пока Выборка.Следующий() Цикл
//		ДокПП = Выборка.Ссылка.ПолучитьОбъект();
//		Если НЕ ДокПП.ПометкаУдаления Тогда 
//			ДокПП.УстановитьПометкуУдаления(Истина);
//		КонецЕсли;	
//		ДокПП.Оплачено   = Ложь;
//		ДокПП.ДатаОплаты = Дата(1,1,1);
//		ДокПП.Записать(РежимЗаписиДокумента.Запись);
//		//ДокЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(НомерДок, Дата(2005, 1, 1)); 
//		//Если НЕ ИскомыйДокумент.Пустая() Тогда 
//		//	// Выполнить действия в случае обнаружения такого документа. … 
//		//КонецЕсли; 
//		ДокЗаказ = ДокПП.РасшифровкаПлатежа[0].Сделка;
//		Если ТипЗнч(ДокЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
//			Если НЕ(ДокЗаказ=Документы.ЗаказПокупателя.ПустаяСсылка()) Тогда 
//				ДокЗ = ДокЗаказ.ПолучитьОбъект();			
//				ДокЗ.ДатаОплаты = Дата(1,1,1);
//				ДокЗ.СтатусЗаказа = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты");
//				ДокЗ.Записать(РежимЗаписиДокумента.Проведение);   
//			КонецЕсли;	   
//		КонецЕсли;	   		   
//	КонецЦикла;
//	
//КонецПроцедуры //ОтменитьПроведение(Отказ);

//Процедура ОбработкаОтвета1(ИмяФайлаОтвета) // обработка файла ответа от п24
//	// поиск заказа по 
//	// 1,2) ФИО (ФИ) и сумма+/- только после слова "Отправитель:" 
//	// в комментариях (поля Терминал + Содержание (terminal + description ))
//	// 3,4) по точной строке № заказа или числу номера заказа и сумма+/-, 
//	// после слов "Комментарий к платежу:" или по всей строке комментариев
//	
//	////неопл заказы
//	//Запрос = Новый Запрос; 
//	//Запрос.Текст = " 
//	//|ВЫБРАТЬ 
//	//|	ЗаказПокупателя.Ссылка,
//	//|	ЗаказПокупателя.Номер,
//	//|	ЗаказПокупателя.Контрагент.Наименование КАК ФИО,
//	//|	ЗаказПокупателя.Контрагент.Наименование КАК ФИ,	
//	//|	ЗаказПокупателя.Контрагент.Наименование КАК ФИОКратко,		
//	//|	ЗаказПокупателя.СтатусЗаказа,	
//	//|	ЗаказПокупателя.СуммаДокумента,	
//	//|	12345678901 КАК НомерЗаказа
//	//|ИЗ 
//	//|	Документ.ЗаказПокупателя КАК ЗаказПокупателя 
//	//|ГДЕ 
//	//|	ЗаказПокупателя.Проведен 
//	//|	И 
//	//|	ЗаказПокупателя.СтатусЗаказа = &СтатусЗаказаОжидаетОплаты
//	//|	И 
//	//|	ЗаказПокупателя.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
//	//|"; 
//	//
//	//СтатусЗаказаСсылкаОжидаетОплаты = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает оплаты");
//	//Запрос.УстановитьПараметр("СтатусЗаказаОжидаетОплаты",СтатусЗаказаСсылкаОжидаетОплаты);
//	//тзНеоплЗаказы = Запрос.Выполнить().Выгрузить(); 
//	//Для Каждого тс Из тзНеоплЗаказы Цикл 
//	//	// 1)
//	//	тс.НомерЗаказа = 0;
//	//	сНомерЗаказа1 = СокрЛП(тс.Номер);
//	//	тс.Номер = сНомерЗаказа1;
//	//	ДлинаСтрокиНомера = СтрДлина(сНомерЗаказа1);
//	//	Для у = 1 По ДлинаСтрокиНомера Цикл
//	//		сНомерЗаказа2 = Сред(сНомерЗаказа1, у);
//	//		чНомерЗаказа2 = ПроверкаНаЧисло(сНомерЗаказа2);			
//	//		Если чНомерЗаказа2 <> 0 Тогда 
//	//			тс.НомерЗаказа = Число(сНомерЗаказа2);
//	//			Прервать;
//	//		КонецЕсли; 
//	//	КонецЦикла; 
//	//	// 2)
//	//	сФИ = тс.ФИ;
//	//	аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сФИ, " ");
//	//	тс.ФИ = "";
//	//	Если аСтрок.Количество() >= 2 Тогда
//	//		тс.ФИ = аСтрок[0] + " " + аСтрок[1];
//	//	КонецЕсли;
//	//	// 3) ФИОКратко
//	//	сФИ = тс.ФИОКратко;
//	//	аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сФИ, " ");
//	//	тс.ФИОКратко = "";
//	//	Если аСтрок.Количество() >= 2 Тогда
//	//		тс.ФИОКратко = СокрЛП(аСтрок[0])+" "+Лев(аСтрок[1],1)+".";
//	//	КонецЕсли;
//	//	Если аСтрок.Количество() >= 3 Тогда
//	//		тс.ФИОКратко = СокрЛП(аСтрок[0])+" "+Лев(аСтрок[1],1)+"."+" "+Лев(аСтрок[2],1)+".";
//	//	КонецЕсли;
//	//КонецЦикла; 
//	//
//	//ДокументыКИмпорту.Очистить();	
//	
//	ЧтениеXML = Новый ЧтениеXML; 
//	ЧтениеXML.ОткрытьФайл(ИмяФайлаОтвета);
//	Пока ЧтениеXML.Прочитать() Цикл
//		Если НЕ(ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда 
//			Продолжить;
//		КонецЕсли;					
//		ИмяУзла = ЧтениеXML.Имя; Сообщить1("--Начало ИмяУзла:" + ИмяУзла); 
//		Если НЕ (ИмяУзла = "statement") Тогда
//			//Сообщить("ИмяУзла = data");
//			Продолжить;
//		КонецЕсли;
//		Код1 = ""; Дата1 = ""; Время1 = ""; Сумма1 = 0; Валюта1 = ""; Остаток1 = 0;
//		Терминал1 = ""; Содержание1 = "";
//		Пока ЧтениеXML.ПрочитатьАтрибут() Цикл 
//			// Прочитать данные узла атрибута.  
//			ТипУзла = ЧтениеXML.ТипУзла; 
//			Имя = ЧтениеXML.Имя; 
//			Значение = ЧтениеXML.Значение; 
//			// Обработать полученные значения. 
//			Сообщить1("Имя Значение:"+Имя+" "+Значение);
//			
//			Если Имя = "appcode" Тогда
//				Код1 = Значение;
//			ИначеЕсли Имя = "trandate" Тогда
//				Дата1 = Значение;
//			ИначеЕсли Имя = "trantime" Тогда
//				Время1 = Значение;
//			ИначеЕсли Имя = "cardamount" Тогда
//				Сумма1  = Число(Лев(Значение, СтрДлина(Значение)-3));
//				Валюта1 = Прав(Значение,3);
//			ИначеЕсли Имя = "rest" Тогда
//				Остаток1 = Лев(Значение, СтрДлина(Значение)-3);
//			ИначеЕсли Имя = "terminal" Тогда
//				Терминал1 = Значение;
//			ИначеЕсли Имя = "description" Тогда
//				Содержание1 = Значение;
//			КонецЕсли;
//			
//		КонецЦикла;	
//		Если НЕ ЗначениеЗаполнено(Код1) Тогда
//			Продолжить;
//		КонецЕсли;
//		//// откл для отладки
//		Если Сумма1 <= 0 Тогда
//			Продолжить;
//		КонецЕсли;
//		//******************************************* новая оплата **********************************
//		нс = ДокументыКИмпорту.Добавить();
//		нс.ПлатежнаяКарта = Карта;
//		нс.НомерДок   = Код1;
//		нс.ДатаПроведения = Дата(Число(Сред(Дата1,1,4)),Число(Сред(Дата1,6,2)),Число(Сред(Дата1,9,2)),
//		Число(Сред(Время1,1,2)),Число(Сред(Время1,4,2)),Число(Сред(Время1,7,2)));
//		
//		нс.СуммаДокумента = Сумма1;
//		нс.Валюта         = Справочники.Валюты.НайтиПоНаименованию(Валюта1);
//		нс.СуммаПоступило = ?(Сумма1>0, Сумма1,0);
//		нс.СуммаСписано   = ?(Сумма1<0,-Сумма1,0);
//		нс.Остаток    = Остаток1;
//		Терминал1     = СокрЛП(Терминал1);
//		Содержание1   = СокрЛП(Содержание1);
//		нс.Терминал   = Терминал1;
//		нс.Содержание = Содержание1;
//		ДокументОплаты(нс);
//	КонецЦикла; // Пока ЧтениеXML.Прочитать() Цикл
//КонецПроцедуры // ОбработкаОтвета1(ИмяФайлаОтвета)		

//Процедура ОбработкаОтвета2() // поиск заказа в тз оплат		
//	//ПоискЗаказаВСтроке(); // из тз ДокументыКИмпорту  =========================================
//	
//	//заказ2
//	//заказ1
//	//ФИО полностью
//	//Фамилия Имя
//	//Фамилия И.О.
//	//Фамилия И.
//	//и со всеми сумма
//	
//	Для Каждого тс Из ДокументыКИмпорту Цикл 		
//		//// "наоборот"	
//		//нс.НомерДок   = Код1;
//		//нс.ДатаПроведения = Дата(Число(Сред(Дата1,1,4)),Число(Сред(Дата1,6,2)),Число(Сред(Дата1,9,2)),
//		//Число(Сред(Время1,1,2)),Число(Сред(Время1,4,2)),Число(Сред(Время1,7,2)));
//		//
//		Сумма1 = тс.СуммаДокумента;
//		//нс.Валюта         = Справочники.Валюты.НайтиПоНаименованию(Валюта1);
//		//нс.СуммаПоступило = ?(Сумма1>0, Сумма1,0);
//		//нс.СуммаСписано   = ?(Сумма1<0,-Сумма1,0);
//		//нс.Остаток    = Остаток1;
//		Терминал1     = СокрЛП(тс.Терминал);
//		Содержание1   = СокрЛП(тс.Содержание);
//		//
//		бЗаказНайден = Ложь; 
//		//фНомерЗаказаНайден = 0; 
//		//фФИОЗаказаНайдены = 0; 
//		//бСуммаЗаказаНайдена = Ложь;
//		
//		ВОтладку("(*1 начало поиска номер строки=)"+тс.номерстроки); 
//		ВОтладку("сумма="+Сумма1+"!"+Терминал1+"!"+Содержание1); 
//		
//		// 1) поиск по ФИО Иванов Иван Иванович
//		//Для у = 1 По 2 Цикл
//		сПоиска = ""+Терминал1+" "+Содержание1;
//		//Если у=1 Тогда
//		//	сПоиска = Терминал1;
//		//ИначеЕсли у=1 Тогда
//		//    сПоиска = Содержание1;
//		//КонецЕсли;	
//		//	чПоз = СтрНайти(сПоиска,"Отправитель:");
//		чПоз = Найти(сПоиска,"Отправитель:");
//		Если чПоз > 0 Тогда 
//			сПоиска = Сред(сПоиска,чПоз+12);
//			аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сПоиска, " ");
//			сФИО="";сФИ="";сФИОКратко="";
//			Если НЕ бЗаказНайден Тогда
//				Если аСтрок.Количество() >= 3 Тогда 
//					сФИО = СокрЛП(""+аСтрок[0]+" "+аСтрок[1]+" "+аСтрок[2]);
//					СпрКонтрагенты = Справочники.Контрагенты;
//					Контрагент1 = СпрКонтрагенты.НайтиПоНаименованию(сФИО, Истина);
//					Если Контрагент1 <> СпрКонтрагенты.ПустаяСсылка() Тогда
//						фФИОЗаказаНайдены = 3;	
//						тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(сФИО,"ФИО");
//						Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//							СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//							//	Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 											
//							Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)
//								бЗаказНайден = Истина;	
//								тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоФИОиСумме; // нс
//								ВОтладку("(*2)"+тс.ИдентификацияЗаказа); 
//								//Прервать;
//							КонецЕсли		
//						КонецЕсли	
//					КонецЕсли
//				КонецЕсли;	
//			КонецЕсли;	
//			// 2) поиск по ФИ Иванов Иван			
//			Если НЕ бЗаказНайден Тогда
//				Если аСтрок.Количество() >= 2 Тогда 
//					сФИ = СокрЛП(""+аСтрок[0]+" "+аСтрок[1]);
//					СпрКонтрагенты = Справочники.Контрагенты;
//					Контрагент1 = СпрКонтрагенты.НайтиПоНаименованию(сФИ, Истина);
//					Если Контрагент1 <> СпрКонтрагенты.ПустаяСсылка() Тогда
//						фФИОЗаказаНайдены = 2;	
//						тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(сФИ,"ФИ");
//						Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//							СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//							//Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 											
//							Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)
//								бЗаказНайден = Истина;	
//								тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоФИиСумме; // нс
//								ВОтладку("(*3)"+тс.ИдентификацияЗаказа); 
//								//Прервать;
//							КонецЕсли		
//						КонецЕсли	
//					КонецЕсли
//				КонецЕсли;	
//			КонецЕсли;
//			// 3) поиск по ФИОКратко = Иванов И.И.		
//			Если НЕ бЗаказНайден Тогда
//				Если аСтрок.Количество() >= 2 Тогда 
//					// ***
//					сИнициалы = СокрЛП(аСтрок[1]);
//					Если ((Сред(сИнициалы,2,1)=".")И(Прав(сИнициалы,1)=".")) Тогда 
//						сФИОКраткоОплаты = СокрЛП(""+аСтрок[0]+" "+аСтрок[1]);
//						сФамилияОплаты   = СокрЛП(""+аСтрок[0]);
//						СпрКонтрагенты = Справочники.Контрагенты;
//						Контрагент1 = СпрКонтрагенты.НайтиПоНаименованию(сФамилияОплаты, Ложь);
//						аФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Контрагент1.Наименование, " ");
//						сФИОКраткоКА = "";
//						Если аФИО.Количество() >= 1 Тогда 
//							сФИОКраткоКА = СокрЛП(аФИО[0])
//						КонецЕсли;	
//						Если аФИО.Количество() >= 2 Тогда 
//							сФИОКраткоКА = СокрЛП(аФИО[0])+" "+Лев(аФИО[1],1)+".";
//						КонецЕсли;	
//						Если аФИО.Количество() >= 3 Тогда 
//							сФИОКраткоКА = СокрЛП(аФИО[0])+" "+Лев(аФИО[1],1)+"."+Лев(аФИО[2],1)+".";
//						КонецЕсли;	
//						Если сФИОКраткоКА = сФИОКраткоОплаты Тогда 	
//							фФИОЗаказаНайдены = 3;	
//							тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(сФИОКраткоКА,"ФИОКратко");
//							Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//								СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//								//Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 											
//								Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)
//									бЗаказНайден = Истина;	
//									тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоФИОКраткоИСумме; // нс
//									ВОтладку("(*4)"+тс.ИдентификацияЗаказа); 
//									//Прервать;
//								КонецЕсли		
//							КонецЕсли	
//						КонецЕсли
//					КонецЕсли;	
//				КонецЕсли;
//			КонецЕсли;			
//			
//			//КонецЦикла; // Терминал1 Содержание1 
//			Если бЗаказНайден Тогда 
//				тс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
//				тс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;
//				тс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
//				тс.Загружать = Истина;
//				ОплаченоПозаказу(тс);
//			КонецЕсли;				
//		КонецЕсли;
//		// конец поиска по ФИ(О) ФИОКратко и сумме				
//		//
//		// 3) поиск по номеру заказа
//		Если НЕ бЗаказНайден Тогда 
//			// 3) поиск по полному номеру заказа
//			сПоиска = ""+Терминал1+" "+Содержание1;
//			//чПоз = СтрНайти(сПоиска,"Комментарий к платежу:");
//			чПоз = Найти(сПоиска,"Комментарий к платежу:");
//			Если чПоз > 0 Тогда 
//				сПоиска = Сред(сПоиска,чПоз+22);
//			КонецЕсли;	
//			аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(сПоиска, " ");
//			Для Каждого ЭлементМассива Из аСтрок Цикл 
//				// 31) точное соотв нру заказа
//				ЭлементМассива = СокрЛП(ЭлементМассива); 
//				тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(ЭлементМассива,"Номер");
//				Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//					СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//					//	Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 						
//					Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)									
//						бЗаказНайден = Истина;	
//						тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоПолномуНомеруЗаказаИСумме; // нс
//						ВОтладку("(*5)"+тс.ИдентификацияЗаказа); 
//						Прервать;
//					КонецЕсли; 		
//				КонецЕсли;	
//				// 4) соотв числу нра заказа
//				чЭлементМассива = ПроверкаНаЧисло(ЭлементМассива);
//				Если чЭлементМассива <> 0 Тогда 		
//					чВозможныйЗаказ = Число(ЭлементМассива); 
//					тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(чВозможныйЗаказ,"НомерЗаказа");
//					Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//						СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//						//	Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 	
//						Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)				
//							бЗаказНайден = Истина;	
//							тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоНомеруЗаказаИСумме; // нс
//							ВОтладку("(*6)"+тс.ИдентификацияЗаказа); 
//							Прервать;
//						КонецЕсли		
//					КонецЕсли	
//				КонецЕсли; 
//				// 32) точное соотв номеру2 заказа
//				ЭлементМассива = СокрЛП(ЭлементМассива); 
//				тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(ЭлементМассива,"Номер2");
//				Если тсНайденныйВозможныйЗаказ <> Неопределено Тогда					
//					СумД = тсНайденныйВозможныйЗаказ.СуммаДокумента;
//					Если ОплатаВДиапазонеЗаказа(Сумма1,СумД) Тогда ; // СуммаОплаты, СуммаЗаказа)
//						//Если (Сумма1>=(СумД-ТочностьСуммы))И(Сумма1<=(СумД+ТочностьСуммы)) Тогда 											
//						бЗаказНайден = Истина;	
//						тс.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.ПоПолномуНомеруЗаказаИСумме; // нс
//						ВОтладку("(*7)"+тс.ИдентификацияЗаказа); 
//						Прервать;
//					КонецЕсли; 		
//				КонецЕсли;	
//			КонецЦикла;; 	// аСтрок 
//			Если бЗаказНайден Тогда 
//				тс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
//				тс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;
//				тс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
//				тс.Загружать = Истина;
//				ОплаченоПозаказу(тс);
//				//Прервать;
//			КонецЕсли;				
//		КонецЕсли; // 3) поиск по номеру заказа
//		ВОтладку("(*8 бЗаказНайден=)"+бЗаказНайден);
//		ВОтладку("(*9 конец цикла поиска, следующая запись)"); 
//	КонецЦикла;	// Для Каждого тс Из ДокументыКИмпорту Цикл 		
//	// // НЕ ЗДЕСЬ !!! а выше по структуре прг
//	//// загрузка с 1с напрямую - сразу после обработки
//	//Загрузить(ДокументыКИмпорту,Истина); // загр только отмеченные - сразу отмеченные	
//	//
//КонецПроцедуры // Процедура ОбработкаОтвета2()		

//Функция ОплатаВДиапазонеЗаказа(СуммаОплаты, СуммаЗаказа)
//	чСуммаОт = СуммаЗаказа;
//	чСуммаДо = СуммаЗаказа;
//	Если ТочностьСуммы <> 0 Тогда 
//		чСуммаОт = СуммаЗаказа - ТочностьСуммы;
//		чСуммаОт = ?(чСуммаОт<0,0, чСуммаОт);		
//		чСуммаДо = СуммаЗаказа + ТочностьСуммы;
//	КонецЕсли;
//	Если ТочностьПроцент <> 0 Тогда 
//		чСуммаОт = СуммаЗаказа * (1-ТочностьПроцент/100);
//		чСуммаОт = ?(чСуммаОт<0,0, чСуммаОт);
//		чСуммаДо = СуммаЗаказа * (1+ТочностьПроцент/100);
//	КонецЕсли;
//	Если ((СуммаОплаты>=чСуммаОт)И(СуммаОплаты<=чСуммаДо)) Тогда 
//		бВозврат = Истина;
//	Иначе	
//		бВозврат = Ложь;
//	КонецЕсли;
//	Возврат бВозврат;
//КонецФункции

////Процедура ПоискЗаказаВСтроке(бЗаказНайден, СтрокаПоискаЗаказа,)
////КонецПроцедуры 
//Функция ПроверкаНаЧисло(а) 
//	Попытка	
//		а = Число(а);
//		//Сообщить("а - число");
//		Возврат а
//	Исключение
//		//Сообщить("а - строка");
//		Возврат 0
//	КонецПопытки;
//КонецФункции

//Процедура ОплаченоПоЗаказу(нс)
//	
//	Отбор = Новый Структура();
//	Отбор.Вставить("Сделка", нс.Заказ);
//	тз = РегистрыНакопления.РасчетыСКонтрагентами.Обороты(,,Отбор, "Сделка", "СуммаВзаиморасчетов");
//	чСуммаОплаты = тз.Итог("СуммаВзаиморасчетовРасход");
//	нс.СуммаОплаченоПоЗаказу = чСуммаОплаты;
//	//сЗаголовок = "";
//	//Если чСуммаОплаты > 0 Тогда 
//	//	сЗаголовок = "Сумма оплаты: "+ СокрЛП(Формат(чСуммаОплаты,"ЧЦ=10; ЧДЦ=2; ЧН=0")+" грн");
//	//Иначе
//	//	сЗаголовок = " нет оплаты";
//	//КонецЕсли;	
//	//ЭлементыФормы.НадписьСуммаОплаты.Заголовок = сЗаголовок;
//	
//	ДокументОплаты(нс);
//	
//КонецПроцедуры	

//Процедура ДокументОплаты(нс);
//	
//	// документ оплаты, если был
//	СтрокаПоискаВхПП = Формат(нс.ДатаПроведения, "ДФ=yyyy.MM.dd") + " "	+ СокрЛП(нс.НомерДок);
//	СсылкаПП = Документы.ПлатежноеПоручениеВходящее.НайтиПоРеквизиту("НомерВходящегоДокумента",СтрокаПоискаВхПП);
//	//Если НЕ СсылкаПП=Документы.ПлатежноеПоручениеВходящее.ПустаяСсылка() Тогда
//	//	// В ИБ найден документ ПП
//	//	нс.ПлатежноеПоручениеВходящее = СсылкаПП;
//	//	Если нс.ПлатежноеПоручениеВходящее.ПометкаУдаления Тогда 
//	//		нс.УДЛ = "Х";
//	//	ИначеЕсли 	нс.ПлатежноеПоручениеВходящее.Проведен Тогда
//	//		нс.УДЛ = "√";
//	//	Иначе	
//	//		нс.УДЛ = " ";
//	//	КонецЕсли;	
//	//КонецЕсли;
//	//
//КонецПроцедуры

//Процедура РазобратьХМЛФайл(имяФайла)
//	
//	ЧтениеXML = Новый ЧтениеXML; 
//	ЧтениеXML.ОткрытьФайл(имяФайла);
//	Пока ЧтениеXML.Прочитать() Цикл
//		// чтение ответа в виде XML файла
//		// Прочитать "структурные части" элементов.  
//		// Проверить, какая часть элемента - текущая.  
//		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
//			ИмяУзла = ЧтениеXML.Имя; Сообщить1("--Начало ИмяУзла:" + ИмяУзла); 
//			////
//			//Если ИмяУзла = "data" Тогда
//			//	Сообщить("ИмяУзла = data");
//			//КонецЕсли;	
//			
//			// Атрибуты элементов можно читать только если текущая часть - начало элемента  
//			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл 
//				// Прочитать данные узла атрибута.  
//				ТипУзла = ЧтениеXML.ТипУзла; 
//				Имя = ЧтениеXML.Имя; 
//				Значение = ЧтениеXML.Значение; 
//				// Обработать полученные значения. 
//				Сообщить1("Имя Значение:"+Имя+" "+Значение);
//			КонецЦикла;
//			
//		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
//			// В примере просто выводим текст в окно сообщений.  
//			Сообщить1("Тип узла Текст:" + ЧтениеXML.Значение); 
//			
//		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
//			// В примере просто выводим признак конца элемента  
//			Сообщить1("--Конец:" + ЧтениеXML.Имя);  
//		КонецЕсли;				
//		
//	КонецЦикла;	
//КонецПроцедуры // Процедура РазобратьХМЛФайл(имяФайла)

//&НаКлиенте
//Функция Хеширование1(стрШифр1_) // 632
//	стрШифр2_ = MD5ХешСтрока(стрШифр1_);
//	стрШифр3_ = СтрЗаменить(стрШифр2_," ","");
//	стрШифр4_ = НРег(стрШифр3_);
//	стрШифр5_ = SHA1ХешСтрока(стрШифр4_);
//	стрШифр6_ = СтрЗаменить(стрШифр5_," ","");
//	стрШифр7_ = НРег(стрШифр6_);
//	Сообщить1(стрШифр7_);
//	Возврат стрШифр7_
//КонецФункции

//&НаСервере
//Функция MD5ХешСтрока(тСтрока)
//	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
//	Хеш.Добавить(тСтрока);
//	Возврат Хеш.ХешСумма; 
//КонецФункции

//Функция SHA1ХешСтрока(тСтрока)
//	Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
//	Хеш.Добавить(тСтрока);
//	Возврат Хеш.ХешСумма; 
//КонецФункции

//Процедура КнопкаЗагрузить1Нажатие(Элемент)
//	ЗагрузитьДанныеСсайта();
//КонецПроцедуры

//Процедура КартаПриИзменении(Элемент)
//	Если Не ЗначениеЗаполнено(Организация) Тогда
//		Возврат;
//	КонецЕсли;
//	ДокументыКИмпорту.Очистить();
//КонецПроцедуры

//Процедура КоманднаяПанельПолучитьНалКурсВалПриват(Кнопка)
//	//	АдресСайта = "https://api.privatbank.ua";
//	АдресСайта = "api.privatbank.ua";
//	стрУРЛ = "/p24api/pubinfo?exchange&coursid=5";
//	//имяВыходногоФайла = ПолучитьимяВременногоФайла("xml");
//	имяВыходногоФайла = "z:\fromServerVal2.xml"; 
//	
//	// якобй правильный запрос 2 да правильный
//	Попытка
//		Соединение = Новый HTTPСоединение(АдресСайта, , , , , Истина);
//		// Новый HTTPСоединение(<Сервер>, <Порт>, <ИмяПользователя>, <Пароль>, <Прокси>, <ЗащищенноеСоединение>)   
//	Исключение
//		Сообщить(""+ТекущаяДата()+" (904)Не удалось установить соединение с сервером:"+ИнформацияОбОшибке().Описание);
//		Возврат //Неопределено;
//	КонецПопытки;
//	
//	Попытка	
//		HTTPОтвет = Соединение.Получить(стрУРЛ, имяВыходногоФайла);
//		КодСостояния = HTTPОтвет.КодСостояния;
//		сТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
//		сообщить1(КодСостояния);
//		сообщить1(сТекстОтвета);
//		Соединение = Неопределено;
//		// хмл
//		Текст = Новый ТекстовыйДокумент; 
//		Текст.Прочитать(имяВыходногоФайла); 
//		Сообщить1(""+ТекущаяДата()+"=="+Текст.ПолучитьТекст()); 
//		Текст = Неопределено;
//		
//	Исключение
//		Сообщить(""+ТекущаяДата()+" (905)Не удалось установить гет соединение с сервером (курс валют привата):"+ИнформацияОбОшибке().Описание);	
//	КонецПопытки;
//	
//КонецПроцедуры // КоманднаяПанельПолучитьНалКурсВалПриват(Кнопка)

//Процедура КоманднаяПанельПолучитьВыписку(Кнопка)
//	
//КонецПроцедуры // Процедура КоманднаяПанельПолучитьВыписку(Кнопка)

//Функция УстановитьТекстВБуферОбмена(Текст) Экспорт
//	#Если Клиент Тогда 
//		Объект = Новый COMОбъект("htmlfile");
//		Объект.ParentWindow.ClipboardData.Setdata("Text", Текст);
//		Возврат Текст;
//	#КонецЕсли 
//КонецФункции   

//Процедура КоманднаяПанельИзФайла(Кнопка)
//	HTTPЗапрос = Новый HTTPЗапрос("/p24api/rest_fiz");
//	HTTPЗапрос.УстановитьИмяФайлаТела("z:\aaa999.xml");
//	
//	//	HTTPСоединение = Новый HTTPСоединение("api.privatbank.ua",,,,,Истина);
//	ssl = Новый ЗащищенноеСоединениеOpenSSL();
//	HTTPСоединение = Новый HTTPСоединение("api.privatbank.ua",,,,,,ssl);
//	
//	//    ФайлОтвета = ПолучитьИмяВременногоФайла();
//	
//	//	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
//	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);		
//	
//	а = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
//	Сообщить1(""+ТекущаяДата()+"HTTPЗапрос.ПолучитьТелоКакСтроку() а="+а+"КОНЕЦ_ОТВЕТА");
//	Соединение = Неопределено;
//	
//КонецПроцедуры

//Процедура КоманднаяПанельЗагрузитьВ1с(Кнопка)
//	КоличествоКВыгрузке = 0;
//	Для Каждого тс Из ДокументыКИмпорту Цикл 
//		Если  тс.Загружать Тогда
//			КоличествоКВыгрузке = КоличествоКВыгрузке + 1;
//		КонецЕсли; 
//	КонецЦикла;	
//	//Если КоличествоКВыгрузке > 0 Тогда
//	Если ДокументыКИмпорту.Количество() > 0 Тогда 
//		//	ОтветПользователя = Вопрос("Можно загрузить " + КоличествоКВыгрузке + " док. Продолжить ?",
//		ОтветПользователя = Вопрос(
//		"Можно провести " + КоличествоКВыгрузке + " док. и записать остальные "
//		+ Строка(Число(ДокументыКИмпорту.Количество()-КоличествоКВыгрузке))
//		+" док. Продолжить ?",
//		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.НЕТ, "Загрузка платежей Приват24");							
//		Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
//			Возврат;
//		КонецЕсли;
//		Загрузить(ДокументыКИмпорту);
//		//Иначе
//		//	Предупреждение(НСтр("ru='Список документов для загрузки пуст.';uk='Список документів для завантаження порожній.'"));
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура Загрузить(ДокументыКИмпорту,ЗагрузитьТолькоОтмеченные=Ложь) 
//	ЗаписаноДокПП =0; ПроведеноДокПП =0;
//	// загружаем отмеченные секции документов
//	Для каждого тс из ДокументыКИмпорту Цикл
//		//
//		Если ЗагрузитьТолькоОтмеченные Тогда 
//			Если НЕ тс.Загружать Тогда
//				Продолжить;
//			КонецЕсли;	
//		КонецЕсли;	
//		//
//		СтрокаПоискаВхПП = Формат(тс.ДатаПроведения, "ДФ=yyyy.MM.dd") + " "
//		+ СокрЛП(тс.НомерДок);
//		СсылкаПП = Документы.ПлатежноеПоручениеВходящее.НайтиПоРеквизиту("НомерВходящегоДокумента",СтрокаПоискаВхПП);
//		Если СсылкаПП=Документы.ПлатежноеПоручениеВходящее.ПустаяСсылка() Тогда
//			// В ИБ не найден документ, необходимо создать новый
//			Док = Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
//		Иначе
//			// В ИБ найден документ, необходимо получить его объект
//			Док = СсылкаПП.ПолучитьОбъект();
//			Если Док.ПометкаУдаления Тогда 
//				Док.УстановитьПометкуУдаления(Ложь);
//			КонецЕсли;	
//		КонецЕсли;
//		Док.ДокументОснование       = тс.Заказ;
//		Док.ДатаВходящегоДокумента  = тс.ДатаПроведения;
//		Док.НомерВходящегоДокумента = СтрокаПоискаВхПП;
//		//	Док.Организация             = тс.Заказ.Организация;
//		Док.Организация             = Организация;
//		Док.СчетОрганизации         = тс.ПлатежнаяКарта.БанковскийСчетКарточный; //Карта.БанковскийСчетКарточный;
//		Док.Контрагент              = тс.Заказ.Контрагент;
//		//Док.СчетКонтрагента
//		Док.ДоговорКонтрагента = тс.Заказ.ДоговорКонтрагента;
//		Док.СуммаДокумента     = тс.СуммаПоступило;
//		Док.ВалютаДокумента   = Справочники.Валюты.НайтиПоКоду(980);
//		//	Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам;
//		Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
//		Док.ОтраженоВОперУчете = Истина;
//		Док.Оплачено  = Истина;
//		Док.ДатаОплаты = тс.ДатаПроведения;
//		//Док.  ЧастичнаяОплата
//		//Док.Комментарий = СокрЛП(тс.Терминал) +";"+СокрЛП(тс.Содержание);
//		Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
//		Док.ОтражатьВБухгалтерскомУчете = Истина;
//		//Док.СтатьяДвиженияДенежныхСредств  
//		Док.ОтражатьВНалоговомУчете = Истина;
//		Док. Подразделение = тс.Заказ.Подразделение; 
//		Док.НазначениеПлатежа = СокрЛП(тс.Терминал) +" ; "+СокрЛП(тс.Содержание);
//		//Док.СтатьяЗатрат
//		//Док. НоменклатурнаяГруппа 
//		//Док.   ПодразделениеЗатраты
//		//Док.  СуммаУслуг
//		Док.РасшифровкаПлатежа.Очистить();
//		СтрТЧ = Док.РасшифровкаПлатежа.Добавить();
//		СтрТЧ.ДоговорКонтрагента = тс.Заказ.ДоговорКонтрагента;
//		СтрТЧ.Сделка             = тс.Заказ;
//		Если ЗначениеЗаполнено(тс.Заказ.ДоговорКонтрагента) Тогда		
//			//СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(Док.ВалютаДокумента, ТекущаяДата());
//			//СтрТЧ.КурсДокумента     = СтруктураКурсаДокумента.Курс;
//			СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(тс.Заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов, ТекущаяДата());
//			СтрТЧ.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
//			СтрТЧ.СуммаПлатежа       = тс.СуммаПоступило;
//			СтрТЧ.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
//			СтрТЧ.СуммаВзаиморасчетов = тс.СуммаПоступило/СтрТЧ.КурсВзаиморасчетов*СтрТЧ. КратностьВзаиморасчетов;
//		Иначе 
//			//СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(Док.ВалютаДокумента, ТекущаяДата());
//			//СтрТЧ.КурсДокумента     = СтруктураКурсаДокумента.Курс;
//			//СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(тс.Заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов, ТекущаяДата());
//			СтрТЧ.КурсВзаиморасчетов      = 1;
//			СтрТЧ.КратностьВзаиморасчетов = 1;
//			//СтрТЧ.СуммаВзаиморасчетов = тс.СуммаПоступило/СтрТЧ.КурсВзаиморасчетов*СтрТЧ. КратностьВзаиморасчетов;
//			СтрТЧ.СуммаВзаиморасчетов = тс.СуммаПоступило;
//		КонецЕсли;
//		СтрТЧ.СуммаПлатежа = тс.СуммаПоступило;		
//		
//		//СтрТЧ. СтавкаНДС 
//		//СтрТЧ.  СуммаНДС
//		СтрТЧ. СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателяПриват24;
//		//СтрТЧ. ДокументПланированияПлатежа
//		//СтрТЧ.  Проект
//		//СтрТЧ. КурсВзаиморасчетовПлан
//		//СтрТЧ.СуммаПлатежаПлан
//		//СтрТЧ.СтатьяДекларацииПоЕдиномуНалогу
//		//СтрТЧ.ЗаТару
//		//СтрТЧ.ДокументРасчетовСКонтрагентом
//		
//		Док.Дата = тс.ДатаПроведения;
//		тс.ПлатежноеПоручениеВходящее = Док.Ссылка;
//		
//		////ДокументОплаты(тс);
//		//Если тс.ПлатежноеПоручениеВходящее.ПометкаУдаления Тогда 
//		//	тс.УДЛ = "Х";
//		//ИначеЕсли 	тс.ПлатежноеПоручениеВходящее.Проведен Тогда
//		//	тс.УДЛ = "√";
//		//Иначе	
//		//	тс.УДЛ = " ";
//		//КонецЕсли;	
//		
//		Если НЕ тс.Загружать Тогда
//			//Попытка
//			Док.Записать(РежимЗаписиДокумента.Запись);  
//			//Док.Записать(РежимЗаписиДокумента.Проведение);  
//			ЗаписаноДокПП = ЗаписаноДокПП + 1;
//			//Исключение КонецПопытки;
//			Продолжить;
//		КонецЕсли;		
//		Если тс.Загружать Тогда
//			Док.Записать(РежимЗаписиДокумента.Запись);  
//			Док.Записать(РежимЗаписиДокумента.Проведение);  
//			ПроведеноДокПП = ПроведеноДокПП + 1;
//		КонецЕсли;	
//		// конец ППВх
//		//================================================
//		// начало заказа в ОЖИДАЕТ ОТПРАВКИ
//		ДокЗаказ = тс.Заказ.ПолучитьОбъект();			
//		ДокЗаказ.ИдентификацияЗаказа = тс.ИдентификацияЗаказа;
//		ДокЗаказ.СтатусЗаказа = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидает отправки");
//		// заказ полностью ли оплачен ?  // пока откл
//		Если тс.Заказ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
//		Иначе // Взаиморасчеты ведутся по сделкам
//			СсылкаДокумент = Неопределено;
//			СуммаДолга = УправлениеВзаиморасчетами.ТекущийДолг(тс.Заказ.ДоговорКонтрагента, тс.Заказ, СсылкаДокумент);
//			Если Абс(СуммаДолга) <= ТочностьСуммы Тогда 
//				ДокЗаказ.ДатаОплаты = тс.ДатаПроведения;
//			КонецЕсли;
//		КонецЕсли;	
//		ДокЗаказ.Записать(РежимЗаписиДокумента.Проведение);  
//	КонецЦикла;
//	
//	//удалить загруженные
//	Если ЗагрузитьТолькоОтмеченные Тогда 
//		КвоСтрок = ДокументыКИмпорту.Количество();
//		Для Индекс = 1 По КвоСтрок Цикл
//			тс = ДокументыКИмпорту[КвоСтрок - Индекс];
//			Если тс.Загружать Тогда
//				ДокументыКИмпорту.Удалить(тс);
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//	//Если (ЗаписаноДокПП++ПроведеноДокПП)>0 Тогда  	
//	//	сИнфо = "Загружено "+ЗаписаноДокПП+" и проведено "+ПроведеноДокПП+" платежных док.";
//	//	//Предупреждение("Загружено "+ЗаписаноДокПП+" и проведено "+ПроведеноДокПП+" платежных док.");
//	//Иначе
//	//	сИнфо = "";
//	//КонецЕсли;		
//	
//	//сИнфо = "";
//	//Если (ПроведеноДокПП)>0 Тогда  	
//	//	сИнфо = "Загружено и проведено "+ПроведеноДокПП;
//	//	//Предупреждение("Загружено "+ЗаписаноДокПП+" и проведено "+ПроведеноДокПП+" платежных док.");
//	//КонецЕсли;		
//	//Если (ЗаписаноДокПП)>0 Тогда  	
//	//	сИнфо = сИнфо + ", записано "+ЗаписаноДокПП;
//	//	//Предупреждение("Загружено "+ЗаписаноДокПП+" и проведено "+ПроведеноДокПП+" платежных док.");
//	//КонецЕсли;		
//	//Если (ЗаписаноДокПП+ПроведеноДокПП)>0 Тогда  	
//	//	сИнфо = сИнфо + " платежных документов.";
//	//КонецЕсли;		
//	
//	сИнфо = "";
//	Если (ЗаписаноДокПП++ПроведеноДокПП)>0 Тогда  	
//		сИнфо = "Загружено и проведено "+ПроведеноДокПП + ", записано "+ЗаписаноДокПП+" платежных документов";
//	КонецЕсли;		
//	ЭлементыФормы.НадписьИнфо.Заголовок = сИнфо;
//	
//КонецПроцедуры // Загрузить(ДокументыКИмпорту) 

//Процедура ДокументыКИмпортуПриИзмененииФлажка(Элемент, Колонка)
//	Сообщить1(""+Элемент+" "+Колонка);
//	Если НЕ ЗначениеЗаполнено(Элемент.ТекущаяСтрока.Заказ) Тогда
//		Элемент.ТекущиеДанные.Загружать = Ложь;	
//		Предупреждение("Не заполнен заказ");
//	КонецЕсли;	
//КонецПроцедуры

//Функция Абс(Знач ВхЧисло)
//	Возврат ?(ВхЧисло <0, -ВхЧисло, ВхЧисло);
//КонецФункции 	

//Процедура КоманднаяПанельЖурналПП(Кнопка)
//	ОткрытьФорму("Документ.ПлатежноеПоручениеВходящее.ФормаСписка");
//КонецПроцедуры

//Процедура КоманднаяПанельЗаказы(Кнопка)
//	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаСписка");
//КонецПроцедуры

//Процедура Сообщить1(сТекст)
//	Если бОтладка Тогда 
//		Сообщить(сТекст);
//	КонецЕсли;	
//КонецПроцедуры

//////Процедура ДокументыКИмпортуЗаказНачалоВыбораОлд1(Элемент, СтандартнаяОбработка)
//////	СтандартнаяОбработка = Ложь; 
//////	//	ФормаВыбора = Документы.ЗаказПокупателя.ПолучитьФормуВыбора("ФормаВыбораП24", Элемент);
//////	//	ФормаВыбора = Документы.ЗаказПокупателя.ПолучитьФормуВыбора("ФормаВыбораП24тз", Элемент);
//////	
//////	//ФормаВыбора = Документы.ЗаказПокупателя.ПолучитьФормуВыбора("ФормаВыбораУправляемая", Элемент);
//////	
//////	//////	Если ЗначениеЗаполнено(Элемент.Значение.Контрагент) Тогда
//////	////Если ЗначениеЗаполнено(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент) Тогда	
//////	////	ЭлементОтбораКонтрагент = ФормаВыбора.Отбор.Контрагент;
//////	////	Если ЭлементОтбораКонтрагент <> Неопределено Тогда
//////	////		ЭлементОтбораКонтрагент.ВидСравнения  = ВидСравнения.Равно;
//////	////		//	ЭлементОтбораКонтрагент.Значение      = Элемент.Значение.Контрагент;
//////	////		ЭлементОтбораКонтрагент.Значение      = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент;
//////	////		ЭлементОтбораКонтрагент.Использование = Истина;
//////	////	КонецЕсли;
//////	////	//ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидПрочихДоходовИРасходов.Доступность = Ложь;
//////	////КонецЕсли;
//////	
//////	//Параметры = Новый Структура("МойПараметр", ЗначениеМоегоПараметра);	
//////	
//////	//Форма = Обработки.Сканирование.ПолучитьФорму("Форма");
//////	//ФормаВыбора.Параметр = "йцу";
//////	
//////	//// надо
//////	//ФормаВыбора.ТочностьСуммы          = ТочностьСуммы;
//////	//ФормаВыбора.ТочностьПроцент        = ТочностьПроцент;
//////	//ФормаВыбора.СуммаПоступилоПоЗаказу = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.СуммаПоступило;
//////	//ФормаВыбора.КонтрагентЗаказа       = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент;
//////	
//////	//&НаКлиенте
//////	//Процедура СоставСменыЗамещающийСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//////	
//////	ПараметрыФормы = Новый Структура;
//////	ПараметрыФормы.Вставить("ТочностьСуммы",   ТочностьСуммы);
//////	ПараметрыФормы.Вставить("ТочностьПроцент", ТочностьПроцент);
//////	ПараметрыФормы.Вставить("СуммаПоступилоПоЗаказу",ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.СуммаПоступило);
//////	Если ЗначениеЗаполнено(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент) Тогда
//////		КонтрагентЗаказа = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент;
//////	Иначе 	
//////		КонтрагентЗаказа = Справочники.Контрагенты.ПустаяСсылка();
//////	КонецЕсли;	
//////	ПараметрыФормы.Вставить("КонтрагентЗаказа", КонтрагентЗаказа);
//////	
//////	// ФормаВыбора.Открыть();
//////	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
//////	//	ФормаВыбора.Открыть(); // УФ НЕ=== ПараметрыФормы); //, Элемент);
//////	
//////КонецПроцедуры // Процедура ДокументыКИмпортуЗаказНачалоВыбора Олд1(Элемент, СтандартнаяОбработка)

//Процедура ДокументыКИмпортуЗаказНачалоВыбора(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь; 
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ТочностьСуммы",   ТочностьСуммы);
//	ПараметрыФормы.Вставить("ТочностьПроцент", ТочностьПроцент);
//	ПараметрыФормы.Вставить("СуммаПоступилоПоЗаказу",ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.СуммаПоступило);
//	Если ЗначениеЗаполнено(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент) Тогда
//		КонтрагентЗаказа = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент;
//	Иначе 	
//		КонтрагентЗаказа = Справочники.Контрагенты.ПустаяСсылка();
//	КонецЕсли;	
//	ПараметрыФормы.Вставить("КонтрагентЗаказа", КонтрагентЗаказа);
//	
//	ФормаВыбора = ПолучитьФорму("Документ.ЗаказПокупателя.Форма.ФормаВыбораУправляемая",ПараметрыФормы);
//	// так не работает
//	//СтруктураВозвращаемыхЗначений = ФормаВыбора.ОткрытьМодально();
//	//Элемент.Значение = СтруктураВозвращаемыхЗначений.Заказ;
//	//ТочностьСуммы    = СтруктураВозвращаемыхЗначений.ТочностьСуммы;
//	//ТочностьПроцент  = СтруктураВозвращаемыхЗначений.ТочностьПроцент;
//	//Элемент.Значение = ФормаВыбора.ОткрытьМодально();
//	ВозвращаемоеЗначение = ФормаВыбора.ОткрытьМодально();
//	Если ВозвращаемоеЗначение <> Неопределено Тогда 
//		Элемент.Значение = ВозвращаемоеЗначение;
//		ДокументыКИмпортуЗаказПриИзменении(Элемент);
//		тс = ТекущийЭлемент.ТекущаяСтрока;
//		ОплаченоПоЗаказу(тс);
//	КонецЕсли;	
//	
//КонецПроцедуры	// Процедура ДокументыКИмпортуЗаказНачалоВыбора(Элемент, СтандартнаяОбработка)

//Процедура ДокументыКИмпортуЗаказПриИзменении(Элемент)
//	ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.СуммаЗаказа = Элемент.Значение.СуммаДокумента;
//	ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Контрагент  = Элемент.Значение.Контрагент;
//	ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Загружать   = Истина;	
//	ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.ИдентификацияЗаказа = Перечисления.ИдентификацияЗаказа.Исполнитель;	
//	
//	//Элемент.Значение = 
//	
//КонецПроцедуры

//Процедура ТочностьСуммыПриИзменении(Элемент)
//	Если Элемент.Значение <> 0 Тогда 
//		ТочностьПроцент = 0;
//	КонецЕсли;	
//КонецПроцедуры

//Процедура ТочностьПроцентПриИзменении(Элемент)
//	Если Элемент.Значение <> 0 Тогда 
//		ТочностьСуммы = 0;
//	КонецЕсли;	
//КонецПроцедуры

//Процедура ДокументыКИмпортуПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
//	//Если ДанныеСтроки.ПлатежноеПоручениеВходящее.Проведен Тогда
//	//	Картинка1 = БиблиотекаКартинок.ДокументПроведенКоннекторЛево;
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.ОтображатьКартинку = Истина;
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.Картинка = Картинка1
//	//ИначеЕсли ДанныеСтроки.ПлатежноеПоручениеВходящее.ПометкаУдаления Тогда 
//	//	Картинка1 = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторЛево;
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.ОтображатьКартинку = Истина;
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.Картинка = Картинка1
//	//Иначе
//	//	Картинка1 = БиблиотекаКартинок.ДокументЗаписанКоннекторЛево;
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.ОтображатьКартинку = Истина; //Ложь;	
//	//	ОформлениеСтроки.Ячейки.КартинкаПП.Картинка = Картинка1
//	//КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ПлатежноеПоручениеВходящее) Тогда
//		ОформлениеСтроки.Ячейки.КартинкаПП.ОтображатьКартинку = Ложь;	
//		Возврат;
//	КонецЕсли;	
//	
//	Если ДанныеСтроки.ПлатежноеПоручениеВходящее.Проведен Тогда
//		Картинка1 = БиблиотекаКартинок.ДокументПроведенКоннекторЛево;
//	ИначеЕсли ДанныеСтроки.ПлатежноеПоручениеВходящее.ПометкаУдаления Тогда 
//		Картинка1 = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторЛево;
//	Иначе
//		Картинка1 = БиблиотекаКартинок.ДокументЗаписанКоннекторЛево;
//	КонецЕсли;
//	
//	ОформлениеСтроки.Ячейки.КартинкаПП.ОтображатьКартинку = Истина; //Ложь;	
//	ОформлениеСтроки.Ячейки.КартинкаПП.Картинка = Картинка1
//	
//КонецПроцедуры

//Процедура ДокументыКИмпортуЗаказОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//Процедура ВОтладку(стр);
//	Если бОтладка Тогда
//		ОтладочныйТекст.ЗаписатьСтроку(стр); 
//	КонецЕсли;
//КонецПроцедуры

////бОтладка = Ложь; //Истина; //Ложь; //
//БылаПроверка = Ложь;
//бОтладка = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "Отладка");

//// нал курс привата GET XML: https://api.privatbank.ua/p24api/pubinfo?exchange&coursid=5
//// безнал курс      GET XML: https://api.privatbank.ua/p24api/pubinfo?exchange&coursid=11
////надо Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");  


////////Если (НЕ бЗаказНайден) И (ЗначениеЗаполнено(Содержание1)) Тогда 
////////	аСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Содержание1, " ");
////////	Для Каждого ЭлементМассива Из аСтрок Цикл 
////////		Если бЗаказНайден Тогда 
////////			Прервать;
////////		КонецЕсли; 
////////		// 1) точное соотв нру заказа
////////		ЭлементМассива = СокрЛП(ЭлементМассива); 
////////		тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(ЭлементМассива,"Номер");
////////		Если НЕ(тсНайденныйВозможныйЗаказ = Неопределено) Тогда 
////////			нс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
////////			нс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;
////////			нс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
////////			бЗаказНайден = Истина;
////////			тзНеоплЗаказы.Удалить(тсНайденныйВозможныйЗаказ); 
////////			нс.ТипПоиска = "(3) по полному номеру заказа содерж";
////////			Прервать;
////////		КонецЕсли;
////////		// 2) соотв числу нра заказа
////////		//Если (НЕ бЗаказНайден) Тогда 
////////		чЭлементМассива = ПроверкаНаЧисло(ЭлементМассива);
////////		Если чЭлементМассива <> 0 Тогда 		
////////			чВозможныйЗаказ = Число(ЭлементМассива); 
////////			тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(чВозможныйЗаказ,"НомерЗаказа");
////////			Если НЕ(тсНайденныйВозможныйЗаказ = Неопределено) Тогда 
////////				нс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
////////				нс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;			
////////				нс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
////////				бЗаказНайден = Истина;
////////				тзНеоплЗаказы.Удалить(тсНайденныйВозможныйЗаказ); 
////////				нс.ТипПоиска = "(4) по номеру заказа число содерж";
////////				Прервать;
////////			КонецЕсли;
////////		КонецЕсли; 
////////		//КонецЕсли; 			
////////	КонецЦикла; // аСтрок Содержание1
////////КонецЕсли;  // Если (НЕ бЗаказНайден) И (ЗначениеЗаполнено(Содержание1)) Тогда 			

////////	
////////		Если фНомерЗаказаНайден=0 Тогда 
////////		// 3) точное соотв ФИО
////////			ЭлементМассива = СокрЛП(ЭлементМассива); 
////////			тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(ЭлементМассива,"Номер");
////////			Если НЕ(тсНайденныйВозможныйЗаказ = Неопределено) Тогда 
////////				нс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
////////				нс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;
////////				нс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
////////				бЗаказНайден = Истина;
////////				тзНеоплЗаказы.Удалить(тсНайденныйВозможныйЗаказ); 
////////				нс.ТипПоиска = "(3) по полному номеру заказа содерж";
////////				Прервать;
////////			КонецЕсли;
////////			// 2) соотв числу нра заказа
////////			//Если (НЕ бЗаказНайден) Тогда 
////////			чЭлементМассива = ПроверкаНаЧисло(ЭлементМассива);
////////			Если чЭлементМассива <> 0 Тогда 		
////////				чВозможныйЗаказ = Число(ЭлементМассива); 
////////				тсНайденныйВозможныйЗаказ = тзНеоплЗаказы.Найти(чВозможныйЗаказ,"НомерЗаказа");
////////				Если НЕ(тсНайденныйВозможныйЗаказ = Неопределено) Тогда 
////////					нс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
////////					нс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;			
////////					нс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
////////					бЗаказНайден = Истина;
////////					тзНеоплЗаказы.Удалить(тсНайденныйВозможныйЗаказ); 
////////					нс.ТипПоиска = "(4) по номеру заказа число содерж";
////////					Прервать;
////////				КонецЕсли;
////////			КонецЕсли; 
////////			//КонецЕсли; 			
////////		КонецЦикла; // аСтрок Содержание1
////////	КонецЕсли;  // Если (НЕ бЗаказНайден) И (ЗначениеЗаполнено(Содержание1)) Тогда 			
////////	
////////	
////////	// поиск по сумме
////////	Для Каждого тс Из тзНеоплЗаказы Цикл 
////////		Если ((тс.СуммаДокумента>=Сумма1-ТочностьСуммы)И(тс.СуммаДокумента<=Сумма1+ТочностьСуммы)) Тогда
////////			тсНайденныйВозможныйЗаказ = тс;
////////			нс.Заказ = тсНайденныйВозможныйЗаказ.Ссылка;
////////			нс.СуммаЗаказа = тсНайденныйВозможныйЗаказ.Ссылка.СуммаДокумента;
////////			нс.Контрагент = тсНайденныйВозможныйЗаказ.Ссылка.Контрагент;
////////			бЗаказНайден = Истина;
////////			тзНеоплЗаказы.Удалить(тсНайденныйВозможныйЗаказ); 
////////			нс.ТипПоиска = "(5) по сумме";				
////////			Прервать;
////////		КонецЕсли; 
////////	КонецЦикла; 
////////

////*****************************************************************************************************

////&НаКлиенте
////Процедура ВыбратьВоВнешнейФорме(Команда)
////    ПараметрыФормы = Новый Структура;
////    ПараметрыФормы.Вставить("АдресХранилища",АдресХранилища);
////        
////    Результат = ОткрытьФормуМодально(Объект.ПутьКФормам+".ФормаВыбора",ПараметрыФормы,ЭтаФорма);
////    Если Результат<>Неопределено Тогда
////        ОбработатьНаСервере();
////    КонецЕсли;
////КонецПроцедуры

////&НаСервере
////Процедура ОбработатьНаСервере()

////    СтруктураЗначений = ПолучитьИзВременногоХранилища(АдресХранилища);
////    //Проверки на корректность формата переданных параметров
////    Если ТипЗнч(СтруктураЗначений)<>Тип("Структура") Тогда
////        Отказ = Истина;
////        Сообщение = Новый СообщениеПользователю;
////        Сообщение.Текст = ЭтаФорма.ИмяФормы+"[ЗагрузитьЗначенияЗамены] ожидается структура значений";
////        Сообщение.Сообщить();
////        Возврат;
////    КонецЕсли;
////    Значение = Неопределено;
////    Если Не СтруктураЗначений.Свойство("ЗначенияВыбора",Значение) Тогда
////        Сообщение = Новый СообщениеПользователю;
////        Сообщение.Текст = ЭтаФорма.ИмяФормы+"[ЗагрузитьОбработатьНаСервере] в структуре значений ожидается значение с ключем ""ЗначенияВыбора""";
////        Сообщение.Сообщить();
////        Иначе
////                //Обработка полученного значения
////    КонецЕсли;
////КонецПроцедуры // ОбработатьНаСервере()

//////*********************************************************************************************
////&НаКлиенте
////Процедура ПеренестиРезультат(Команда)
////        ТекущиеДанные = ЭлементыФормы.СписокВыбора.ТекущиеДанные;
////        
////        // возможно передать произвольные серриализуемые данные, но обернуть в вызов НаСервере
////    СтруктураЗначений = Новый Структура;
////    СтруктураЗначений.Вставить("ЗначенияВыбора",ТекущиеДанные.Ссылка);        
////        ПоместитьВоВременноеХранилище(СтруктураЗначений,Параметры.АдресХранилища);
////        
////        Закрыть("ОК"); //в простейшем случае можно передать значение здесь
////КонецПроцедуры
