
Функция _AttachProtectComponent(prefix_id, product_id) Экспорт
	
	Перем МестоположениеКомпонента;
	Перем ЛицензионныйКлюч;
	
	МИКО_ЛицензированиеПереопределяемый.ПриИнициализацииЗакрытогоМодуля(prefix_id, МестоположениеКомпонента);
	МИКО_ЛицензированиеПереопределяемый.ПриЧтенииЛицензионногоКлюча(product_id, ЛицензионныйКлюч);
	
	Если ПодключитьВнешнююКомпоненту(МестоположениеКомпонента, "Protection", ТипВнешнейКомпоненты.Native) Тогда
		
		ProtectComp = Новый ("AddIn.Protection.MIKO_Protection1C");
		ProtectComp.MikoLicense = ЛицензионныйКлюч;
		УстановитьПредставлениеПользователя(ProtectComp);
		
	Иначе
		
		СообщитьОбОшибке();
		
	КонецЕсли;
	
	Возврат ProtectComp;
	
КонецФункции

Процедура _OnError(xml_info) Экспорт
	
	Сообщение = "Неизвестная ошибка";
	Код = "0";
	
	Если Не ПустаяСтрока(xml_info) Тогда
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(xml_info);
			Если ЧтениеXML.Прочитать() Тогда
				Сообщение = ЧтениеXML.ЗначениеАтрибута("status");
				Код       = ЧтениеXML.ЗначениеАтрибута("code");
			КонецЕсли;
		Исключение
			Сообщение = "Ошибка разбора XML: "+xml_info;
		КонецПопытки; 
	КонецЕсли;
	
	Если Код = "0" Тогда
		Возврат; // TODO: Надо разобраться почему возникает эта ошибка.
	КонецЕсли;
	
	ИнформацияОбОшибке = Новый Структура("Сообщение,Код", Сообщение, Число(Код));
	СтандартнаяОбработка = Истина;
		
	МИКО_ЛицензированиеПереопределяемый.ПриВозникновенииОшибки(ИнформацияОбОшибке, СтандартнаяОбработка);		
	Если СтандартнаяОбработка Тогда
		ВызватьИсключение "[" + Код + "] " + Сообщение;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПредставлениеПользователя(ProtectComp)
	
	ИнформацияОПользователе = Новый Структура;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Лев(СистемнаяИнформация.ВерсияПриложения, 5) >= "8.3.8" Тогда
		Попытка
		ТекущийСеансИнформационнойБазы = Вычислить("ПолучитьТекущийСеансИнформационнойБазы()");
		ИнформацияОПользователе.Вставить("user", ТекущийСеансИнформационнойБазы.Пользователь.Имя);
		ИнформацияОПользователе.Вставить("host", ТекущийСеансИнформационнойБазы.ИмяКомпьютера);
		ИнформацияОПользователе.Вставить("proc", ТекущийСеансИнформационнойБазы.НомерСеанса);
		Исключение
		КонецПопытки; 
	КонецЕсли;
	
	Если ИнформацияОПользователе.Количество()=0 Тогда
		ИнформацияОПользователе.Вставить("user", ИмяПользователя());
		ИнформацияОПользователе.Вставить("host", ИмяКомпьютера());
		ИнформацияОПользователе.Вставить("proc", НомерСеансаИнформационнойБазы());
	КонецЕсли; 
	
	Попытка
	ProtectComp.Present(ИнформацияОПользователе.user, ИнформацияОПользователе.host, ИнформацияОПользователе.proc);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

Процедура СообщитьОбОшибке()
	
	СистИнформация  = Новый СистемнаяИнформация;
	врСообщеине 	= "Ошибка инициализации компонента. Системная информация:
					  | ОС "					+СистИнформация.ВерсияОС+" 
					  | ВерсияПриложения "		+СистИнформация.ВерсияПриложения+" 
					  | ИдентификаторКлиента "	+СистИнформация.ИдентификаторКлиента+" 
					  | ОперативнаяПамять "		+СистИнформация.ОперативнаяПамять+" 
					  | Процессор "				+СистИнформация.Процессор+" 
					  | Платформа "				+СистИнформация.ТипПлатформы;
					  
	ЗаписьЖурналаРегистрации("МИКО.СистемаЗащиты", УровеньЖурналаРегистрации.Ошибка, , , врСообщеине);
		
КонецПроцедуры

Функция ПодключитьКомпонент(ПрефиксКлюч, ИдентификаторКонфигурации) Экспорт
	
	Перем МестоположениеКомпонента;
	Перем ЛицензионныйКлюч;
	
	МИКО_ЛицензированиеПереопределяемый.ПриИнициализацииФормыРегистрации(ПрефиксКлюч, МестоположениеКомпонента);
	МИКО_ЛицензированиеПереопределяемый.ПриЧтенииЛицензионногоКлюча(ИдентификаторКонфигурации, ЛицензионныйКлюч);
	
	Если ПодключитьВнешнююКомпоненту(МестоположениеКомпонента, "Registration", ТипВнешнейКомпоненты.Native) Тогда
		
		ProtectComp = Новый ("AddIn.Registration.MIKO_Registration1C");
		
	Иначе
		
		СообщитьОбОшибке();
		
	КонецЕсли;
	
	Возврат ProtectComp;
	
КонецФункции

Функция ПолучитьСведенияОПродукте(НаименованиеПродукта) Экспорт
	
	Продукты = Новый Массив;
	МИКО_ЛицензированиеПереопределяемый.ЛицензируемыеПродукты(Продукты);
	
	Для Каждого СтруктураПродукт Из Продукты Цикл
		Если СтруктураПродукт.Наименование = НаименованиеПродукта Тогда
			Возврат СтруктураПродукт;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура НачатьРаботу(НаименованиеПродукта) Экспорт
	
	СведенияОПродукте = ПолучитьСведенияОПродукте(НаименованиеПродукта);
	
	ProtectComp = _AttachProtectComponent(СведенияОПродукте.ПрефиксКлюч, СведенияОПродукте.ИдентификаторКонфигурации);
	Успех = ProtectComp.Login(СведенияОПродукте.ИдентификаторФичи);
	
	Если Не Успех Тогда
		_OnError(ProtectComp.LastError());
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьРаботу(НаименованиеПродукта) Экспорт
	
	СведенияОПродукте = ПолучитьСведенияОПродукте(НаименованиеПродукта);
	
	ProtectComp = _AttachProtectComponent(СведенияОПродукте.ПрефиксКлюч, СведенияОПродукте.ИдентификаторКонфигурации);
	ProtectComp.Shutdown(СведенияОПродукте.ИдентификаторФичи);
	
КонецПроцедуры
