
#Если Клиент Тогда

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ВидыРасчетаПоИЛ = Новый Массив;
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.АлиментыПроцентом);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.АлиментыПроцентомДоПредела);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммой);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммойДоПредела);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.ИЛПроцентом);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.ИЛПроцентомДоПредела);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.ИЛФиксированнойСуммой);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.ИЛФиксированнойСуммойДоПредела);
	ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.Удержания.ПочтовыйСбор);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ВидыРасчетаПоИЛ", ВидыРасчетаПоИЛ);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПочтовыйСборПоИЛ", ПланыВидовРасчета.Удержания.ПочтовыйСбор);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ФактическийАдрес", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = Метаданные().Синоним;
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Удержания.Результат КАК Результат,
	|	Удержания.ПочтовыйСбор КАК ПочтовыйСбор,
	|	Удержания.Сотрудник КАК Сотрудник,
	|	Удержания.Сотрудник.ФизЛицо КАК ФизЛицо
	|{ВЫБРАТЬ
	|	ФактическийАдрес.Представление КАК ФактическийАдрес,
	|	Удержания.Показатель1,
	|	Удержания.ДокументОснование,
	|	Удержания.ПорядокРасчета,
	|	Удержания.ДокументОснование.Получатель.* КАК Получатель,
	|	Удержания.ДокументОснование.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокумента
	|	}
	|ИЗ
	|	(ВЫБРАТЬ
	|		УдержанияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|		СУММА(ВЫБОР
	|				КОГДА УдержанияРаботниковОрганизаций.ВидРасчета = &ПочтовыйСборПоИЛ
	|					ТОГДА 0
	|				ИНАЧЕ УдержанияРаботниковОрганизаций.Результат
	|			КОНЕЦ) КАК Результат,
	|		СУММА(ВЫБОР
	|				КОГДА УдержанияРаботниковОрганизаций.ВидРасчета = &ПочтовыйСборПоИЛ
	|					ТОГДА УдержанияРаботниковОрганизаций.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПочтовыйСбор,
	|		УдержанияРаботниковОрганизаций.Показатель1 КАК Показатель1,
	|		УдержанияРаботниковОрганизаций.ДокументОснование КАК ДокументОснование,
	|		ВЫБОР
	|			КОГДА УдержанияРаботниковОрганизаций.ВидРасчета = &ПочтовыйСборПоИЛ
	|				ТОГДА ""% от удержанных сумм""
	|			КОГДА УдержанияРаботниковОрганизаций.ДокументОснование.СпособРасчетаИЛ = 1
	|				ТОГДА ""% заработка""
	|			ИНАЧЕ ""фиксированная сумма""
	|		КОНЕЦ КАК ПорядокРасчета,
	|		УдержанияРаботниковОрганизаций.Организация КАК Организация,
	|		УдержанияРаботниковОрганизаций.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизаций
	|	ГДЕ
	|		УдержанияРаботниковОрганизаций.ВидРасчета В(&ВидыРасчетаПоИЛ)
	|		И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
	|	{ГДЕ
	|		УдержанияРаботниковОрганизаций.Организация,
	|		УдержанияРаботниковОрганизаций.Сотрудник,
	|		УдержанияРаботниковОрганизаций.ДокументОснование}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УдержанияРаботниковОрганизаций.Сотрудник,
	|		УдержанияРаботниковОрганизаций.Сотрудник.ФизЛицо,
	|		УдержанияРаботниковОрганизаций.Показатель1,
	|		УдержанияРаботниковОрганизаций.ДокументОснование,
	|		УдержанияРаботниковОрганизаций.Организация,
	|		УдержанияРаботниковОрганизаций.ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА УдержанияРаботниковОрганизаций.ВидРасчета = &ПочтовыйСборПоИЛ
	|				ТОГДА ""% от удержанных сумм""
	|			КОГДА УдержанияРаботниковОрганизаций.ДокументОснование.СпособРасчетаИЛ = 1
	|				ТОГДА ""% заработка""
	|			ИНАЧЕ ""фиксированная сумма""
	|		КОНЕЦ) КАК Удержания
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическийАдрес
	|		ПО (ФактическийАдрес.Тип = &Адрес)
	|			И (ФактическийАдрес.Вид = &ФактическийАдрес)
	|			И Удержания.ДокументОснование.Получатель = ФактическийАдрес.Объект}
	|{УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ФизЛицо,
	|	Удержания.ДокументОснование,
	|	Удержания.ДокументОснование.Получатель КАК Получатель,
	|	Удержания.Показатель1}
	|ИТОГИ
	|	СУММА(Результат),
	|	СУММА(ПочтовыйСбор)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Удержания.Организация,
	|	Удержания.ПериодРегистрации,
	|	Удержания.Сотрудник,
	|	Удержания.Сотрудник.ФизЛицо,
	|	Удержания.ДокументОснование}";	
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
							  
	//представление полей запроса
	СтруктураПредставлениеПолей.Вставить("ВидИсполнительногоДокумента",	"Вид исполнительного документа");
	СтруктураПредставлениеПолей.Вставить("ДокументОснование",		"Исполнительный документ");
	СтруктураПредставлениеПолей.Вставить("Показатель1",					"Размер удержания");
	СтруктураПредставлениеПолей.Вставить("ПорядокРасчета",			"Порядок расчета удержания");
	СтруктураПредставлениеПолей.Вставить("Сотрудник",					"Работник");
	СтруктураПредставлениеПолей.Вставить("ФактическийАдрес",		"Адрес получателя");
	СтруктураПредставлениеПолей.Вставить("ФизЛицоПредставление",	"Работник");
	СтруктураПредставлениеПолей.Вставить("ПериодРегистрации",		"Месяц начисления");
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели("Результат", "Удержано по исполнительным листам", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("ПочтовыйСбор", "Почтовый сбор", Истина, "ЧЦ=15; ЧДЦ=2");
	
	// формат полей
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("ПериодРегистрации", "ДФ='ММММ гггг ""г.""'");
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ПериодРегистрации");
	
	// Упорядочение
	ПостроительОтчета.Порядок.Добавить("Сотрудник");
	
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("Сотрудник");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// поля по умолчанию
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	
	// настройки отчета
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Ложь;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мРежимВводаПериода = 0; // произвольный период
	ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок) Экспорт

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок);
	
КонецПроцедуры

#КонецЕсли

