Функция ПолучитьМассивСкладов(ГруппаСкладов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка В ИЕРАРХИИ(&ГруппаСкладов)
		|	И НЕ Склады.ПометкаУдаления
		|	И НЕ Склады.ЭтоГруппа";
	
	
	Запрос.УстановитьПараметр("ГруппаСкладов", ГруппаСкладов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции


функция ПолучитьСтатус(этоОпт, Ссылка, Предзаказ) Экспорт 	
	
	НетСклада = (ссылка = Справочники.Склады.ПустаяСсылка() ИЛИ Ссылка = Неопределено);
	
	Если ссылка = НетСклада И Не Предзаказ Тогда
		Возврат "0";
	ИначеЕсли НетСклада И Предзаказ Тогда 
		Возврат "3";
	ИначеЕсли НетСклада Тогда 
		Возврат "0";
	КонецЕсли;
			
	Если Ссылка.Качество = Справочники.Качество.НайтиПокоду("000000001") Тогда
		Возврат "1";
	ИначеЕсли Ссылка.Качество = Справочники.Качество.НайтиПокоду("000000002") Тогда
		Возврат "2";
	ИначеЕсли Предзаказ Тогда
		Возврат "3";
	Иначе
		Возврат "0";
	КонецЕсли;
					
	//Не в наявності 0
	//в    наявності 1
	//На виробництві 2	
	//Предзамовлення 3
КонецФункции

Функция ПолучитьСкладыОпт() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Склады.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Склады КАК Склады
        |ГДЕ
        |	Склады.Активный
        |	И НЕ Склады.Розница";
    
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции
 
Функция ПолучитьСкладыРозн() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Склады.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Склады КАК Склады
        |ГДЕ
        |	Склады.Активный";  
 
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ПолучитьСкладыМаркетПлейс() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Склады.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Склады КАК Склады
        |ГДЕ
        |	Склады.Активный
        |	И Склады.Качество.Код = ""000000001""";  
 
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции