Перем НеОбновлятьВИССлужбыДоставки Экспорт;

Процедура ОбновитьАдресВИССлужбыДоставки() Экспорт
	Если НеОбновлятьВИССлужбыДоставки = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Сообщить("Не указан контрагент");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Владелец.ГУИД) тогда
		Сообщить("В указанном контрагенте не заполнен идентификатор");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Улица) Тогда
		Сообщить("Не указана улица");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Улица.ГУИД) тогда
		Сообщить("В указанной улице не заполнен идентификатор");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Дом)) тогда
		Сообщить("Не указан номер дома");
		Отказ = Истина;
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
		
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "Address");
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураЗапроса.Вставить("calledMethod", "update");
	Иначе	
		СтруктураЗапроса.Вставить("calledMethod", "save");
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CounterpartyRef", Владелец.ГУИД);
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураПараметров.Вставить("Ref", ГУИД);
	КонецЕсли;
	СтруктураПараметров.Вставить("StreetRef", Улица.ГУИД);
	
	СтруктураПараметров.Вставить("BuildingNumber", СокрЛП(Дом));
	Если ЗначениеЗаполнено(Квартира) тогда
		СтруктураПараметров.Вставить("Flat", ФОрмат(Квартира,"ЧГ="));
	КонецЕсли;
	Если ЗначениеЗаполнено(Комментарий) Тогда 
		СтруктураПараметров.Вставить("Note", СокрЛП(Комментарий));
	КонецЕсли;
	
	СтруктураЗапроса.Вставить("methodProperties", СтруктураПараметров);
	Если Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Получить() = Перечисления.ЛМ_ЯзыкиИнтерфейсаОбмена.Украинский Тогда
		СтруктураЗапроса.Вставить("language", "ua");
	Иначе
		СтруктураЗапроса.Вставить("language", "ru");
	КонецЕсли;
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтруктураОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ПолучитьСтруктуруОтвета(ДеревоОтвета);
	
	Если СтруктураОтвета.Свойство("Ref") И СтруктураОтвета.Ref <> ГУИД Тогда
		ГУИД = СтруктураОтвета.Ref;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Наименование) И СтруктураОтвета.Свойство("Description") тогда
		Наименование = СтруктураОтвета.Description;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ)
	ОбновитьАдресВИССлужбыДоставки();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГУИД = "";
КонецПроцедуры
