// #Область СлужебныеПроцедурыИФункции

// Только для 8.3
// 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = ""+Данные.Направление+" звонок "+Данные.Дата+", с "+Данные.Src+" на "+Данные.Dst+"";
	СтандартнаяОбработка = Ложь;                    
КонецПроцедуры

// Только для 8.3
// 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Направление");
	Поля.Добавить("Дата");
	Поля.Добавить("Src");
	Поля.Добавить("Dst");
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	врМассив = Новый Массив;
	ОбработкаПолученияПолейПредставления(врМассив, Истина);
	ОбработкаПолученияПредставления(Новый Структура("Направление,Дата,Src,Dst"),"",Истина);	
	
КонецПроцедуры

// #КонецОбласти