
Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 
	
	ТипЦены                   = Константы.ТипЦенПром                          .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс                    .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиПром                 .Получить();
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	

	ИсключитьГруппыНоменклатр = Новый Массив;	
	//ИсключитьГруппыНоменклатр = Справочники.Номенклатура.ПолучитьГруппыСкладов("000000047");	
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,,ИсключитьГруппыНоменклатр);
	Остатки = ОстаткиКВыгрузке.Остатки;
	Комплектующие = ОстаткиКВыгрузке.Комплектующие;	
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");
	Если СтрДлина(Врем)= 7 Тогда
		Врем  = Лев(Врем,4);
	Иначе
		Врем  = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 
	|<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+"""> 
	|<shop>
	|<name>Cvetkov</name>
	|<url>https://www.cvetkovtm.com/</url>
	|<currencies>
	|<currency id=""UAH"" rate=""1""/>
	|</currencies>");
	
	ТД.ЗаписатьСтроку("<offers>");
	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияРозетка", ПроверятьРазбитиеРостовок, ВариантВыгрузки,);	
	
	МассивКатегорий = Новый Массив;
	
	Для Каждого Стр из ТаблицаХарактеристик Цикл 	
		Если ЗначениеЗаполнено(Стр.Номенклатура.КатегорияАлло) Тогда			
			 ЗаписатьНоменклатуру(Стр, ТД);
			 
			 Если МассивКатегорий.Найти(Стр.Номенклатура.КатегорияАлло) = Неопределено Тогда
          		  МассивКатегорий.Добавить(Стр.Номенклатура.КатегорияАлло);
       		 КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>");
	
	//ВыборкаКатегорий = Справочники.КатегорияАлло.Выбрать();
	ВыборкаКатегорий = МассивКатегорий;
	// Категории
	ТД.ЗаписатьСтроку("<categories>");
	Для Каждого Категория из ВыборкаКатегорий Цикл 	

		Если Категория.ПометкаУдаления ИЛИ Категория.Наименование = "нет" Тогда Продолжить; КонецЕсли;
	    	Код = ОбщегоНазначения.УбратьНоликиСлева(Категория.Код);
			ТД.ЗаписатьСтроку("<category id="""+Код+""">"+Категория.Наименование+"</category>");
		
	КонецЦикла;
	ТД.ЗаписатьСтроку("</categories>");

	ТД.ЗаписатьСтроку("
	|</shop>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, ТД)
	
	// Из Строки 
	Цена                 = Стр.Цена;	
	СпрГруппыЦветов	     = Стр.ГруппаЦвета;
	Номенклатура         = Стр.Номенклатура;	
	Характеристика       = Стр.Характеристика;
	Ид                   = Стр.ИД;
	ИдГуппы              = Стр.ИдГуппы;
	Доступна             = Стр.Доступна;
	ШтрихКод             = Стр.ШтрихКод;
	Скидка               = Стр.Скидка;
	Ростовка             = Стр.Ростовка;		
	ОстатокРозница       = Стр.Остаток;	
	Предзаказ            = Стр.Предзаказ;
	Наценка = Стр.Наценка;		
	ПерваяЦена           = стр.ПерваяЦена;
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Стр.Характеристика,Истина);	

	
	Если НЕ ЗначениеЗаполнено(ОписаниеМодели) Тогда
		Сообщить("Не заполнено описание модели" + Номенклатура.Наименование);
		Возврат
	КонецЕсли;
	
	// Доп информация
	ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
	НоменклатураОбъект   = Номенклатура.ПолучитьОбъект();	
	
	РусскийЯзык = Истина; Переводить = Ложь;

	
	//ОстатокОпт      = ХарактеристикаОбъект.СвободныйОстаток(МассивСкладаОпт);
	СкладРозы       = Справочники.Склады.НайтиПоКоду("");
	Доступна        = (Доступна Или Предзаказ); 
	available       = ?(Доступна,"true","false");	

	
	РознНаличие 	= ?(Доступна,?(ХарактеристикаОбъект.Остаток(СкладРозы)>0,"true","false"),"false");
	//ОптНаличие      = ?(Доступна,?(ХарактеристикаОбъект.СвободныйОстаток(СкладРозы)>0,"true","false"),"");
	
	ЦветРус         = ХарактеристикаОбъект.ЦветХарактеристики(РусскийЯзык, Переводить);
	ЦветУкр         = ХарактеристикаОбъект.ЦветХарактеристики(НЕ РусскийЯзык, Переводить); 
	Категория       = Номенклатура.КатегорияАлло;
	
	
	Название        = НоменклатураОбъект.Наименование(Истина);
	ЦенаСтрока      = формат(Цена,"ЧГ=");
	
	ТипИзделия = НоменклатураОбъект.ПолучитьТипИзделия(Истина);	
	
	////////////////////////////////////////////////////////////////////////////////
	ТД.ЗаписатьСтроку("<offer id="""+Ид+""" available="""+available+""" in_stock="""+РознНаличие+""" type=""vendor.model"" selling_type=""r"" group_id= """+ИдГуппы+""">");	

		
	ТД.ЗаписатьСтроку("<typePrefix>"+ ТипИзделия +"</typePrefix>");
	//ТД.ЗаписатьСтроку("<categoryId>null</categoryId>");
	//ТД.ЗаписатьСтроку("<portal_category_url>"+ Категория.Код +"</portal_category_url>");
		
	ТД.ЗаписатьСтроку("<categoryId>"+ ОбщегоНазначения.УбратьНоликиСлева(Категория.Код) +"</categoryId>");
	ТД.ЗаписатьСтроку("<portal_category_id>"+ Категория.Код +"</portal_category_id>");
	ТД.ЗаписатьСтроку("<select_2840_global>Повседневный (casual)</select_2840_global>");

	
	
	// Скидка и цена
	Если Скидка>0 Или Наценка < 70 Тогда
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price>");
		ТД.ЗаписатьСтроку("<sale_price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</sale_price>");
	Иначе
		ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");
	КонецЕсли;
	//ТД.ЗаписатьСтроку("<discount>"+ + "</discount>");
	
	ТД.ЗаписатьСтроку("<quantity>" + ОстатокРозница + "</quantity>");
	ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
	
	//фото
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов, Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			Если Фот.НеВыгружать ИЛИ Фот.НеВыгружатьРозница Тогда 
				Продолжить;
			КонецЕсли;

			
			ИмяФото = Фот.Наименование;
			
			ТД.ЗаписатьСтроку("<picture_urls>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture_urls>");
			
		КонецЦикла;
		
	КонецЕсли;

	ТД.ЗаписатьСтроку("<vendor>Cvetkov</vendor>");
	 
	НаименованиеУкр = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Ложь, Ложь);
	ТД.ЗаписатьСтроку("<name_ua>"+НаименованиеУкр+"</name_ua>");

	НаименованиеРус = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Истина, Истина);
	ТД.ЗаписатьСтроку("<name_ru>"+НаименованиеРус+"</name_ru>");
	
	/// Рус Описание

	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description_ru>"+Описание+"</description_ru>");
		
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Стр.Характеристика,Ложь);
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description_ua>"+Описание+"</description_ua>");

	
	ТД.ЗаписатьСтроку("<param name=""barcode"">" + ШтрихКод + "</param>");
	ТД.ЗаписатьСтроку("<param name=""strana_proizvoditel"">Украина</param>");
	ТД.ЗаписатьСтроку("<param name=""strana_proishozhdeniya_brenda"">Украина</param>");	 
	ТД.ЗаписатьСтроку("<param name=""color"">" + ЦветРус +"</param>");	 
	ТД.ЗаписатьСтроку("<param name=""Гарантийный срок"">14 дней</param>");	 

	           

	
	//Параметры
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Алло");
	Категория = Номенклатура.КатегорияАлло;
	ИсключениеСвойств = Неопределено;
	Свойство = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Категория, Характеристика,"name","","",ИсключениеСвойств);
    Тд.ЗаписатьСтроку(Свойство);
	
		
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры

