Перем мУдалятьДвижения;

// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;

Перем ТаблицаПлатежейУпр;

Перем мТекущаяСхемаНалогообложения;

//Определение периода движений документа
Перем ДатаДвижений;

Перем РасчетыВозврат;

Перем мСтруктураПараметровДенежныхСредств;

Перем СтарыйРасчетныйДокумент;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Заполнение табличной части перечисления ЗП данными клиент-банка
//
// Параметры
//  ТаблицаПлатежей  – ТаблицаЗначений – Таблица перечислений денежных средств физлицам
//  Основание  – Документ основание
//
Процедура ЗаполнитьПеречислениеЗППоОбменуСБанком(ТаблицаПлатежей, Основание) Экспорт

	ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП;
	
	ДокументОснование = Основание;
	СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате;
	
	ВыплатаЗаработнойПлаты.Загрузить(ТаблицаПлатежей);
	
	СуммаДокумента = ВыплатаЗаработнойПлаты.Итог("СуммаПлатежа");

КонецПроцедуры // ЗаполнитьПеречислениеЗППоОбменуСБанком()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина) Экспорт

	Если НЕ (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда

		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, СтрокаПлатеж.ДоговорКонтрагента);

		Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю тогда

			Если ЗаполнятьСчетаВзаиморасчетов Тогда
			
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
			
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами тогда
			
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
						
		Иначе

			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
				
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется                 = СчетаУчета.Амортизируется;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж)

	КурсДокумента=?(КурсДокумента=0,1, КурсДокумента);
	КратностьДокумента=?(КратностьДокумента=0,1, КратностьДокумента);
	СтрокаПлатеж.КурсВзаиморасчетов=?(СтрокаПлатеж.КурсВзаиморасчетов=0,1,СтрокаПлатеж.КурсВзаиморасчетов);
	СтрокаПлатеж.КратностьВзаиморасчетов=?(СтрокаПлатеж.КратностьВзаиморасчетов=0,1,СтрокаПлатеж.КратностьВзаиморасчетов);

КонецПроцедуры // ПроверкаКурсовВалют()

// Формирует движения по регистрам
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//  Режим 					  - режим проведения документа
//
Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)

	ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента);

	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента);
	КонецЕсли;
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, РежимПроведения, Отказ, Заголовок);
	
КонецПроцедуры	

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ (Оплачено И ОтражатьВУправленческомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Приход;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю Тогда
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику Тогда
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	Иначе
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, "РасшифровкаПлатежа", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, РежимПроведения, Отказ, Заголовок)

	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// Бухгалтерские проводки документа
	ПроводкиБУ = Движения.Хозрасчетный;

	РасчетыВВалюте = Ложь;
	Если СчетОрганизации.ВалютаДенежныхСредств <> мВалютаРегламентированногоУчета Тогда
		КассаВВалюте = Истина;
	КонецЕсли;

	ВидСчетаОрг = СчетОрганизации.ВидСчета;
	ВалютаСчета = СчетОрганизации.ВалютаДенежныхСредств;

	СчетКт      = СтруктураШапкиДокумента.СчетБанк;
	
	РасчетыВВалюте = Ложь;
	МоментДокумента = Новый МоментВремени(ДатаДвижений, Ссылка);
	Если СчетБанк.Валютный Тогда
		РасчетыВВалюте = Истина;
		УправлениеДенежнымиСредствами.ПроверитьОстатокДенежныхСредств(СтруктураШапкиДокумента.СуммаДокумента, СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ВалютаДокумента, МоментДокумента, СтруктураШапкиДокумента.СчетБанк,СтруктураШапкиДокумента.СчетОрганизации, Заголовок);
	Иначе
		УправлениеДенежнымиСредствами.ПроверитьОстатокДенежныхСредств(СтруктураШапкиДокумента.СуммаДокумента, СтруктураШапкиДокумента.Организация, , МоментДокумента, СтруктураШапкиДокумента.СчетБанк,СтруктураШапкиДокумента.СчетОрганизации, Заголовок);
	КонецЕсли;


	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда

		//Дополнение структуры шапки документа (для использования глобальных процедур)
		СтруктураШапкиДокумента.Вставить("КоррСчет"			,СчетКт);
		
		//Вызов универсальной процедуры подготовки реестра платежей по данным документа. 		
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
		СодержаниеПроводки = "";
		
		Если ЕстьРасчетыСКонтрагентами Тогда
			Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
				СодержаниеПроводки = "Расчеты с контрагентом";
				РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
			КонецЕсли; 
			БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей); 	  
		Иначе //расчеты по кредитам
			СодержаниеПроводки = "Расчеты по кредитам и займам";
			БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Ложь,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей);
		КонецЕсли; 

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = ДатаДвижений;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
			Проводка.Содержание  = "Перечисление налога";
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			Проводка.Содержание  = "Прочее списание денежных средств";
		ИначеЕсли Проводка.СчетДт.Валютный Тогда
			Проводка.Содержание = "Продажа валюты";
		Иначе
			Проводка.Содержание = "Покупка валюты";
		КонецЕсли;		

		Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.Контрагент);
		Иначе	
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоДт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоДт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоДт3);
		КонецЕсли;	

		Проводка.СчетКт      = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);

		Если РасчетыВВалюте Тогда

			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			ДанныеОВалюте   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ДатаДвижений);

			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
														 СтруктураШапкиДокумента.КурсДокумента,      ДанныеОВалюте.Курс, 
														 СтруктураШапкиДокумента.КратностьДокумента, ДанныеОВалюте.Кратность);
		Иначе
			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетУчетаРасчетовСКонтрагентом) = "Затраты" Тогда
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.НалоговоеНазначениеДт = НалоговоеНазначениеПриПрочемСписании;
				Если НЕ НалоговоеНазначениеПриПрочемСписании = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
			
			
			Для каждого ТекущаяСтрока Из ПеречислениеНалогов Цикл
				
				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период      = ДатаДвижений;
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "Перечисление налогов";
				
				Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ТекущаяСтрока.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ТекущаяСтрока.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ТекущаяСтрока.СубконтоДт3);
				
				Проводка.СчетКт      = СчетКт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
				
				Проводка.Сумма = ТекущаяСтрока.Сумма;
				
				// только для расчета ЗП
				Если Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ Тогда
					
					ДвиженияПоВзаиморасчетыПоНДФЛ();
					
				ИначеЕсли Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению 
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюНаСлучайБезработицы
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев
					Тогда
					
                        мСтатьяНалоговойДекларации = "";
						Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
							мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт1; 
						ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
							мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт2; 
						ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
							мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт3; 
						КонецЕсли;
                        мНалог = "";
						Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="Налоги" Тогда
							мНалог = ТекущаяСтрока.СубконтоДт1; 
						ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="Налоги" Тогда
							мНалог = ТекущаяСтрока.СубконтоДт2; 
						ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="Налоги" Тогда
							мНалог = ТекущаяСтрока.СубконтоДт3; 
						КонецЕсли;
						ДвиженияПоВзаиморасчетыПоВзносамВФонды(ТекущаяСтрока.Ведомость, мСтатьяНалоговойДекларации, мНалог)

					
				КонецЕсли; 	
				
			КонецЦикла; 
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет Тогда

			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = "Перевод средств на другой счет организации";
			
			Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СчетКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);

			Проводка.СчетКт      = СчетКт;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);

			Если РасчетыВВалюте Тогда

				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
					Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
				КонецЕсли;

				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
					Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
				КонецЕсли;

				ДанныеОВалюте   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ДатаДвижений);

				Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
															 СтруктураШапкиДокумента.КурсДокумента,      ДанныеОВалюте.Курс, 
															 СтруктураШапкиДокумента.КратностьДокумента, ДанныеОВалюте.Кратность);
			Иначе
				Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП Тогда
			
		
		СпособОплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
		ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.Выплачено;
		ПроведениеРасчетов.ВыполнитьДвиженияПоЗарплате( Ссылка, Движения, ПроводкиБУ, СчетБанк, СпособОплаты, ВыплаченностьЗарплаты, СчетОрганизации,,Контрагент );
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
		
		СтруктураШапкиДокумента.Вставить("КоррСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период      = ДатаДвижений;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание = "Выдача средств подотчетнику";
		
		Если РасчетыВВалюте Тогда
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте;
		Иначе                          
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;
		КонецЕсли;
		Проводка.СубконтоДт.РаботникиОрганизаций = СтруктураШапкиДокумента.ФизЛицо;
		
		Проводка.СчетКт      = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
		
		Если РасчетыВВалюте Тогда
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			ДанныеОВалюте   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ДатаДвижений);
			
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
			СтруктураШапкиДокумента.КурсДокумента,      ДанныеОВалюте.Курс, 
			СтруктураШапкиДокумента.КратностьДокумента, ДанныеОВалюте.Кратность);
		Иначе
			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
		КонецЕсли;

	КонецЕсли;
	
	Если   ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда

		Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			
			Если НЕ СтрокаРасшифровки.ВозвратАвансаДо01042011НУ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПриобретение = (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ВХОДЯЩ") > 0) ИЛИ (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ПРИХОД") > 0);			
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			СуммаСторноДоходовЗатрат = - СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011;
				
			Если ЭтоПриобретение Тогда
				Проводка.СчетДт    = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
				Проводка.СчетКт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно расходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно витрат при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
					
			Иначе	
				Проводка.СчетКт    = ПланыСчетов.Хозрасчетный.ДругиеДоходыОтОбычнойДеятельности;
				Проводка.СчетДт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно доходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно доходів при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;

	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц
	
	Если СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
		Если    ЕстьРасчетыСКонтрагентами 
			или ЕстьРасчетыПоКредитам 
			или ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
			
			РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
			
			ТаблицаПеречислениеНалогов = ПеречислениеНалогов.Выгрузить();
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуТаблица(ЭтотОбъект,СтруктураШапкиДокумента,ТаблицаПеречислениеНалогов,Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП 
			или ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуПрочее(ЭтотОбъект,СтруктураШапкиДокумента,Отказ);	
			
		КонецЕсли;
	КонецЕсли;
    		
	Если (ЕстьРасчетыСКонтрагентами  и не ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами) 
	   И СтруктураШапкиДокумента.ЕстьНДС Тогда
		РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
		НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
	КонецЕсли; 
			
КонецПроцедуры

Процедура ДвиженияПоВзаиморасчетыПоВзносамВФонды(Ведомость, СтатьяНалоговойДекларации, Налог)
	
	// все проверки уже сделаны, осталось только провести
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("СтатьяНалоговойДекларации", СтатьяНалоговойДекларации);
	Запрос.УстановитьПараметр("Налог", Налог);
	
	Запрос.Текст =
	"ВЫБРАТЬ                                          
	|	Основной.ПериодВзаиморасчетов   КАК ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало	КАК ПериодДействия,
	|	СУММА(Основной.База)			КАК База,
	|	СУММА(Основной.БазаВзноса)		КАК БазаВзноса,
	|	СУММА(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Основной
	|ГДЕ	Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0 ИЛИ	Основной.БазаВзноса <> 0 ИЛИ	Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ                                          
	|	Основной.ПериодВзаиморасчетов	КАК ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало	КАК ПериодДействия,
	|	Сумма(Основной.База)			КАК База,
	|	Сумма(Основной.БазаВзноса)		КАК БазаВзноса,
	|	Сумма(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Основной   
	|ГДЕ	Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0 ИЛИ	Основной.БазаВзноса <> 0 ИЛИ	Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВзаиморасчетыПоВзносамВФонды.Добавить();
		
		Движение.Период      			= ДатаДвижений;
		Движение.ВидДвижения 			= ВидДвиженияНакопления.Расход;
		
		Движение.Организация 				= Организация;
		Движение.СтатьяНалоговойДекларации	= СтатьяНалоговойДекларации;
		Движение.Налог						= Налог;
		Движение.ПериодВзаиморасчетов       = Выборка.ПериодВзаиморасчетов;
	
		
		Движение.База 			= Выборка.База;
		Движение.БазаВзноса 	= Выборка.БазаВзноса;	
		Движение.Результат 		= Выборка.Результат;	
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоЗарплатеРегл()

Процедура ДвиженияПоВзаиморасчетыПоНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	НаименованиеДокумента = Ссылка.Метаданные().Имя;
	
	Запрос.Текст = "
	|ВЫБРАТЬ                                          
	|	Основной.Сотрудник				КАК Сотрудник,
	|	Основной.ДоходНДФЛ				КАК ДоходНДФЛ,
	|	Основной.ВидСтавки				КАК ВидСтавки,
	|	Основной.НалоговыйПериод		КАК НалоговыйПериод,
	|	Основной.Льгота					КАК Льгота,
	|	Основной.КоличествоЛьгот		КАК КоличествоЛьгот,
	|	Основной.Налог		КАК Налог,
	|	Основной.Доход		КАК Доход
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + НаименованиеДокумента + ".ПеречислениеНалогов  КАК НалогиПлатежки
	|ПО НалогиПлатежки.Ссылка = &Ссылка
	|	И НалогиПлатежки.Ведомость = Основной.Ссылка
	|
	|ГДЕ	Основной.Налог <> 0
	|	ИЛИ	Основной.Доход <> 0
	|";
	
	КодОперацииВыплата = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
		
		Движение.Период      	= ДатаДвижений;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;;
		
		Движение.Организация 		= Организация;
		Движение.Сотрудник 			= Выборка.Сотрудник;
		Движение.ВидСтавки			= Выборка.ВидСтавки;
		Движение.ДоходНДФЛ 			= Выборка.ДоходНДФЛ;
		Движение.НалоговыйПериод 	= Выборка.НалоговыйПериод;
		Движение.Льгота 			= Выборка.Льгота;
		
		Движение.Налог 			= Выборка.Налог;	
		Движение.Доход 			= Выборка.Доход;	
		
		Движение.КоличествоЛьгот	= Выборка.КоличествоЛьгот;		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоЗарплатеРегл()

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Режим, Заголовок)
	
	// Проверка шапки 
	
	// Сформируем структуру обязательных полей
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	
	// Общие обязательные поля
	СтруктураОбязательныхПолей.Вставить("СчетОрганизации","Не указан банковский счет организации!");
	СтруктураОбязательныхПолей.Вставить("СуммаДокумента");
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолей.Вставить("Контрагент");
	КонецЕсли;		
	
	// Регл. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетБанк",       "Не указан счет учета денежных средств");
        
		Если СчетБанк.Валютный Тогда
			СтруктураОбязательныхПолей.Вставить("ВалютаДокумента","Не указана валюта документа.");
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет Тогда
			
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
			
		КонецЕсли;
		
		Если ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет Тогда
			СтруктураОбязательныхПолей.Вставить("СчетКонтрагента","Не указан банковский счет, на который производится перевод!");
		КонецЕсли;
		
		Если (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств)
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда		
				
			Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетУчетаРасчетовСКонтрагентом) = "Затраты" Тогда
				СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПриПрочемСписании","Не указано налоговое назначение!");
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли; 
	
	// Упр. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("Ответственный");
	КонецЕсли; 
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверка ТЧ
	СтруктураОбязательныхПолейТЧ = Новый Структура();
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолейТЧ.Вставить("СуммаВзаиморасчетов");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорКонтрагента");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕСли;
	КонецЕСли;
	
	УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "РасшифровкаПлатежа", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента 
		И НЕ (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты) Тогда
		Сообщить(Заголовок+" 
		|не совпадают сумма документа и ее расшифровка.");
		
		Отказ=Истина;
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			//Проверим на возможность проведения в БУ и НУ
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(Платеж.ДоговорКонтрагента, ВалютаДокумента,
												 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
												 Ложь, Отказ, Заголовок, "", Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		КонецЦикла;
	КонецЕСли;	
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок);
	КонецЕСли;	
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕСли;	
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок)

	Если (ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам)
		И НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		Сообщить(Заголовок+" 
		|не совпадают сумма документа и ее расшифровка.");

		Отказ = Истина;

	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете И Режим = РежимПроведенияДокумента.Оперативный И (ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам) Тогда
					
		УправлениеДенежнымиСредствами.КонтрольОстатковПоТЧ(Дата, РасшифровкаПлатежа, Отказ, Заголовок, Истина);			
		
	КонецЕсли;

	Если ОтражатьВУправленческомУчете Тогда
		
		ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолейРасчетыУпр(), Отказ, Заголовок);
		
		Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
			
			ПроверитьЗаполнениеТЧ(Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, Платеж.ДоговорКонтрагента, 
			Платеж.ДоговорКонтрагента.Организация, Отказ, Заголовок);
			
		КонецЦикла;
		
	КонецЕсли;
    
	Если  ЕстьРасчетыСКонтрагентами 
		И НЕ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами		
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС (неподтвержденный)!");
						
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС н/к (н/о)!");
						
					КонецЕсли;
				КонецЕсли;

                Если Платеж.НалоговоеНазначение.Пустая() Тогда
						
                    Отказ = истина;
						
                    Если Отказ Тогда
						
                        Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указано Налоговое назначение!");
							
                    КонецЕсли;
                КонецЕсли;
					
				
			КонецЕсли;
			
		КонецЦикла; 	
		
	КонецЕсли; 
	
    
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП Тогда
		
			Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Выплачено",Перечисления.ВыплаченностьЗарплаты.Выплачено);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("парамВыплатаЧерезБанк", Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
		Запрос.УстановитьПараметр("парамБанк", Контрагент);
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
 	    |	Работники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ
		|	ВТРаботникиОрганизации
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК Работники
		|ГДЕ
		|	Работники.ВыплаченностьЗарплаты = &Выплачено
		|	И Работники.СпособВыплаты = &парамВыплатаЧерезБанк
		|	И Работники.Банк = &парамБанк
		|	И Работники.Ссылка В (ВЫБРАТЬ Выпл.Ведомость ИЗ Документ.ПлатежныйОрдерСписаниеДенежныхСредств.ВыплатаЗаработнойПлаты КАК ВЫПЛ ГДЕ Выпл.Ссылка = &Ссылка)
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник ";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПЕРВЫЕ 1 Работники.Сотрудник ИЗ
		|ВТРаботникиОрганизации КАК Работники";
		
		НаименованиеКонтрагента = ?(ЗначениеЗаполнено(Контрагент),"""" +  Контрагент.ПолноеНаименование() + """", "...");
		Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В перечисленных ведомостях на выплату отсутствуют суммы к выплате через банк ';uk='В перерахованих відомостях відсутні суми до виплати через банк '" )+НаименованиеКонтрагента,Отказ,Заголовок);	
			Возврат;
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СУММА(ЗарплатаКВыплате.Сумма) КАК СуммаВыплачено
		|ИЗ
		|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств.ВыплатаЗаработнойПлаты КАК ПлатежноеПоручениеВыплатаЗаработнойПлаты
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты КАК ЗарплатаКВыплате
		|		ПО ПлатежноеПоручениеВыплатаЗаработнойПлаты.Ведомость = ЗарплатаКВыплате.Ссылка
		|		И ПлатежноеПоручениеВыплатаЗаработнойПлаты.СчетУчета = ЗарплатаКВыплате.СчетУчета
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК РанееВыплаченныеСуммы
		|		ПО ПлатежноеПоручениеВыплатаЗаработнойПлаты.Ведомость = РанееВыплаченныеСуммы.Ведомость
		|			И ЗарплатаКВыплате.Сотрудник = РанееВыплаченныеСуммы.Сотрудник
		|			И ЗарплатаКВыплате.СчетУчета = РанееВыплаченныеСуммы.СчетУчета
		|			И РанееВыплаченныеСуммы.Регистратор <> &Ссылка
		|ГДЕ
		|	ПлатежноеПоручениеВыплатаЗаработнойПлаты.Ссылка = &Ссылка
		|	И ЗарплатаКВыплате.Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТРаботникиОрганизации)   
		|	И РанееВыплаченныеСуммы.Сотрудник ЕСТЬ NULL
		|";
		
		Запрос.УстановитьПараметр("Выплачено",Перечисления.ВыплаченностьЗарплаты.Выплачено);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если НЕ (Результат.Следующий() И Результат.СуммаВыплачено=СуммаДокумента) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не совпадает сумма документа и суммы по ведомостям на выплату заработной платы.';uk='Не збігається сума документа й сума по відомостях на виплату заробітної плати.'"),Отказ,Заголовок);
		КонецЕсли;

	КонецЕсли;
	
	Если  ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю
		И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если   Платеж.ВозвратАвансаДо01042011НУ И НЕ ЗначениеЗаполнено(Платеж.СтатьяПоВозвратуАвансаДо2011НУ) Тогда
				
				СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для договора ""¤1¤"" не указана статья по возврату аванса до 01.04.2011!'; uk = 'Для договору ""¤1¤"" не зазначена стаття по поверненню аванса до 01.04.2011!'"), Строка(Платеж.ДоговорКонтрагента));
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;				
	
КонецПроцедуры //ПроверитьЗаполнениеДокументаРегл()

Процедура ЗаполнитьРасшифровкуПлатежа()
	
	ТаблицаКопия = ПеречислениеНалогов.Выгрузить(,"Сумма,СтатьяДвиженияДенежныхСредств, Проект, ДокументПланированияПлатежа, СтатьяДекларацииПоЕдиномуНалогу");
	ТаблицаКопия.Свернуть("СтатьяДвиженияДенежныхСредств, Проект, ДокументПланированияПлатежа, СтатьяДекларацииПоЕдиномуНалогу","Сумма");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("Сумма"),"СуммаПлатежа");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("СтатьяДвиженияДенежныхСредств"),"СтатьяДвиженияДенежныхСредств");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("Проект"),"Проект");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("ДокументПланированияПлатежа"),"ДокументПланированияПлатежа");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("СтатьяДекларацииПоЕдиномуНалогу"),"СтатьяДекларацииПоЕдиномуНалогу");
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	Если ЕстьРасчетыСКонтрагентами Тогда
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	КонецЕсли; 
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	ДокументОснование = Основание;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
		
		ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику;
		ФизЛицо                       = Основание.ФизЛицо;
		РасчетныйДокументРаботника    = Основание;
		ВалютаВзаиморасчетовРаботника = Основание.ВалютаДокумента;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовРаботника, ТекущаяДата());
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		ПроверкаКурсовВалют(СтрокаПлатеж);
		ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж);
		
	ИначеЕсли Основание.Метаданные().Реквизиты.Найти("Оплачено") <> Неопределено Тогда
	
		Если Основание.Оплачено Тогда
			Сообщить("Платежный ордер не вводится на основании документов, уже исполненных банком.");
			Возврат;
		КонецЕсли;
		
		РасчетныйДокумент = Основание.Ссылка;
		ЗаполнитьПоРасчетномуДокументу();
		
	Иначе
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		УправлениеДенежнымиСредствами.ЗаполнитьРасходПоОснованию(ЭтотОбъект, Основание, УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный"));
		
	КонецЕсли;
	
	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	ДокументОснование  = Основание;
		
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                         , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                          , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       			, "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                       			, "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                     , "ВедениеУчетаПоПроектам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
		
		КурсДокумента      = РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		КратностьДокумента = РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

	Иначе	
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("КурсДокумента"		, КурсДокумента);
	СтруктураШапкиДокумента.Вставить("КратностьДокумента"	, КратностьДокумента);

	ДатаДвижений=УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Дата,ДатаОплаты);
	СтруктураШапкиДокумента.Вставить("ДатаДвижений",ДатаДвижений);
	СтруктураШапкиДокумента.Вставить("ОтраженоВОперУчете",ОтражатьВУправленческомУчете);
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	РасчетыВозврат = УправлениеДенежнымиСредствами.НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(ВидОперации);
	
	мТекущаяСхемаНалогообложения = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация);
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	// Документ должен принадлежать хотя бы к одному виду учета  (бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);

	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Режим, Заголовок);
	
	ТаблицаПлатежейУпр = УправлениеДенежнымиСредствами.ПолучитьТаблицуПлатежейУпр(ДатаДвижений,ВалютаДокумента,Ссылка, "ПлатежныйОрдерСписаниеДенежныхСредств");
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);
	КонецЕсли;
	
	Если НЕ Отказ 
		И ЗначениеЗаполнено(РасчетныйДокумент) 
		И НЕ РасчетныйДокумент.ЧастичнаяОплата 
		Тогда
		
		ИзменяемыйДокумент=РасчетныйДокумент.ПолучитьОбъект();
		Попытка
			ИзменяемыйДокумент.Заблокировать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось заблокировать документ " + ИзменяемыйДокумент, Отказ);
			Возврат;
		КонецПопытки;
		ИзменяемыйДокумент.Разблокировать();


		ИзменяемыйДокумент.ЧастичнаяОплата = Истина;
		Попытка
			ИзменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать документ " + ИзменяемыйДокумент +":" + Символы.ПС
				+ ИнформацияОбОшибке(), Отказ);
			Возврат;
		КонецПопытки;
													
	КонецЕсли;

	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
		ЗаполнитьРасшифровкуПлатежа();
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	СтруктураДействий = Новый Структура("УстановитьДоговор");
	УправлениеДенежнымиСредствами.ВыполнитьДействияПередЗаписьюПлатежногоДокумента(ЭтотОбъект, СтруктураДействий, Отказ, РежимЗаписи, РежимПроведения);
	
	Оплачено   = Истина;
	ДатаОплаты = Дата;
	
	Если НЕ Отказ
		И НЕ ЭтоНовый() 
		Тогда
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.РасчетныйДокумент
		|ИЗ
		|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		СтарыйРасчетныйДокумент = Выборка.РасчетныйДокумент;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	// Проверим необходимость снятия флага частичной оплаты у старого расчетного документа
	
	Если НЕ Отказ 
		И ЗначениеЗаполнено(СтарыйРасчетныйДокумент)
		И СтарыйРасчетныйДокумент <> РасчетныйДокумент 
		Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств КАК ПлатежныйОрдерСписаниеДенежныхСредств
		|
		|ГДЕ
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Ссылка <> &Ссылка И
		|  ПлатежныйОрдерСписаниеДенежныхСредств.РасчетныйДокумент=&РасчетныйДокумент И
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("РасчетныйДокумент", СтарыйРасчетныйДокумент);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			ИзменяемыйДокумент = СтарыйРасчетныйДокумент.ПолучитьОбъект();
			Попытка
				ИзменяемыйДокумент.Заблокировать();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось заблокировать документ " + ИзменяемыйДокумент, Отказ);
				Возврат;
			КонецПопытки;
			ИзменяемыйДокумент.Разблокировать();

			ИзменяемыйДокумент.ЧастичнаяОплата = Ложь;
			Попытка
				ИзменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать документ " + ИзменяемыйДокумент +":" + Символы.ПС
					+ ИнформацияОбОшибке(), Отказ);
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

//Заполняет сумму документа и расшифровку платежа по расчетному документу
 //
Процедура ЗаполнитьПоРасчетномуДокументу() Экспорт
	
	Организация=РасчетныйДокумент.Организация;
	СчетОрганизации=РасчетныйДокумент.СчетОрганизации;
	
	Контрагент=РасчетныйДокумент.Контрагент;
	СчетКонтрагента=РасчетныйДокумент.СчетКонтрагента;
	
	ВалютаДокумента=РасчетныйДокумент.ВалютаДокумента;
	СтруктураКурсаДокумента   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	КурсДокумента      = СтруктураКурсаДокумента.Курс;
	КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	
	ВидОперацииДокумент=РасчетныйДокумент.ВидОперации;
	
	Если ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет;
	ИначеЕсли ВидОперацииДокумент = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику;
	Иначе
		ВидОперации=ВидОперацииДокумент;
	КонецЕсли;
		
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	ОтражатьВУправленческомУчете= РасчетныйДокумент.ОтражатьВУправленческомУчете;
	ОтражатьВБухгалтерскомУчете = РасчетныйДокумент.ОтражатьВБухгалтерскомУчете;
	
	СубконтоДт1 = РасчетныйДокумент.СубконтоДт1; 
	СубконтоДт2 = РасчетныйДокумент.СубконтоДт2;
	СубконтоДт3 = РасчетныйДокумент.СубконтоДт3;
	СчетУчетаРасчетовСКонтрагентом = РасчетныйДокумент.СчетУчетаРасчетовСКонтрагентом;
	СчетБанк = РасчетныйДокумент.СчетБанк;
	СтатьяДекларацииПоЕдиномуНалогу = РасчетныйДокумент.СтатьяДекларацииПоЕдиномуНалогу;
	НалоговоеНазначениеПриПрочемСписании = РасчетныйДокумент.НалоговоеНазначениеПриПрочемСписании;
	
	СтатьяДвиженияДенежныхСредств = РасчетныйДокумент.СтатьяДвиженияДенежныхСредств;
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		
		ТекстЗапроса="ВЫБРАТЬ
		|	ДенежныеСредстваКСписаниюОстатки.ДокументСписания,
		|	ДенежныеСредстваКСписаниюОстатки.СуммаОстаток,
		|	ДенежныеСредстваКСписаниюОстатки.СтатьяДвиженияДенежныхСредств,
		|	РасчетныйДокумент.ДоговорКонтрагента,
		|	РасчетныйДокумент.Сделка,
		|	РасчетныйДокумент.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	РасчетныйДокумент.СуммаПлатежа,
		|	РасчетныйДокумент.КурсВзаиморасчетов,
		|	РасчетныйДокумент.КратностьВзаиморасчетов,
		|	РасчетныйДокумент.СуммаВзаиморасчетов,
		|	РасчетныйДокумент.СтавкаНДС,
		|	РасчетныйДокумент.СуммаНДС,
		|	РасчетныйДокумент.СтатьяДекларацииПоЕдиномуНалогу,
		|	РасчетныйДокумент.СчетУчетаРасчетовСКонтрагентом,
		|	РасчетныйДокумент.СчетУчетаРасчетовПоАвансам,
		|	РасчетныйДокумент.ДокументПланированияПлатежа,
		|	РасчетныйДокумент.Проект 				 
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКСписанию.Остатки(, ДокументСписания=&РасчетныйДокумент) КАК ДенежныеСредстваКСписаниюОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ."+РасчетныйДокумент.Метаданные().Имя+".РасшифровкаПлатежа КАК РасчетныйДокумент
		|		ПО ДенежныеСредстваКСписаниюОстатки.ДокументСписания = РасчетныйДокумент.Ссылка
		|      И  ДенежныеСредстваКСписаниюОстатки.СтатьяДвиженияДенежныхСредств = РасчетныйДокумент.СтатьяДвиженияДенежныхСредств";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТекстЗапроса;
		Запрос.УстановитьПараметр("РасчетныйДокумент",РасчетныйДокумент);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.ДоговорКонтрагента=Результат.ДоговорКонтрагента;
			СтрокаПлатеж.Сделка=Результат.Сделка;
			СтрокаПлатеж.КурсВзаиморасчетов=Результат.КурсВзаиморасчетов;
			СтрокаПлатеж.КратностьВзаиморасчетов=Результат.КратностьВзаиморасчетов;
			СтрокаПлатеж.СтавкаНДС=Результат.СтавкаНДС;
			СтрокаПлатеж.СтатьяДекларацииПоЕдиномуНалогу = Результат.СтатьяДекларацииПоЕдиномуНалогу;
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = Результат.СчетУчетаРасчетовСКонтрагентом;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам = Результат.СчетУчетаРасчетовПоАвансам;
			СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=Результат.СтатьяДвиженияДенежныхСредств;
			СтрокаПлатеж.ДокументПланированияПлатежа=Результат.ДокументПланированияПлатежа;
			СтрокаПлатеж.Проект=Результат.Проект;
			
			КоэффициентПересчета=?(Результат.СуммаДокумента=0,0,Результат.СуммаОстаток/Результат.СуммаДокумента);
			
			СтрокаПлатеж.СуммаПлатежа=Результат.СуммаПлатежа*КоэффициентПересчета;
			СтрокаПлатеж.СуммаВзаиморасчетов=Результат.СуммаВзаиморасчетов*КоэффициентПересчета;
			СтрокаПлатеж.СуммаНДС=Результат.СуммаНДС*КоэффициентПересчета;
			
		КонецЦикла;
	
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	Иначе		
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДенежныеСредстваКСписаниюОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКСписанию.Остатки(, ДокументСписания=&РасчетныйДокумент) КАК ДенежныеСредстваКСписаниюОстатки";
					 
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		СуммаДокумента = Выборка.СуммаОстаток;
		
		СтрокаПлатеж   = РасшифровкаПлатежа.Добавить();
		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		СтрокаПлатеж.СуммаВзаиморасчетов = СуммаДокумента;
		
		СтатьяДвиженияДенежныхСредств = РасчетныйДокумент.СтатьяДвиженияДенежныхСредств;
		
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
		
			ФизЛицо                       = РасчетныйДокумент.ФизЛицо;
			ВалютаВзаиморасчетовРаботника = РасчетныйДокумент.ВалютаВзаиморасчетовРаботника;
			РасчетныйДокументРаботника    = РасчетныйДокумент.РасчетныйДокументРаботника;
			ДатаПогашенияАванса           = РасчетныйДокумент.ДатаПогашенияАванса;
			
			СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовРаботника, Дата);
			СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
			СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
			СтрокаПлатеж.СуммаВзаиморасчетов     = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, 
				ВалютаДокумента, ВалютаВзаиморасчетовРаботника,
				КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
				КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
			
		КонецЕсли;		
		
	КонецЕсли;		
			
	// Заполним ТЧ ПеречислениеНалогов
	Если ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
		ПеречислениеНалогов.Загрузить(РасчетныйДокумент.ПеречислениеНалогов.Выгрузить());
		СуммаДокумента = РасчетныйДокумент.СуммаДокумента;
	КонецЕсли;
	
	// Заполним ТЧ ПеречислениеЗаработнойПлаты
	Если ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП Тогда
		ВыплатаЗаработнойПлаты.Загрузить(РасчетныйДокумент.ВыплатаЗаработнойПлаты.Выгрузить());
		СуммаДокумента = РасчетныйДокумент.СуммаДокумента;
	КонецЕсли; 
		
КонецПроцедуры // ЗаполнитьПоРасчетномуДокументу()

// Процедура выполняет заполнение суммы документа и суммы взаиморасчетов по регистру расчетов с подотчетными лицами
//
Процедура ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",          Организация);
	Запрос.УстановитьПараметр("ФизЛицо",              ФизЛицо);
	Запрос.УстановитьПараметр("РасчетныйДокумент",    РасчетныйДокументРаботника);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетовРаботника);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаДолга
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
	|			,
	|			Организация = &Организация
	|				И ФизЛицо = &ФизЛицо
	|				И РасчетныйДокумент = &РасчетныйДокумент
	|				И Валюта = &ВалютаВзаиморасчетов) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток < 0";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтрокаПлатеж.СуммаВзаиморасчетов = - Выборка.СуммаДолга;
		
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			СтрокаПлатеж.СуммаВзаиморасчетов, 
		    ВалютаВзаиморасчетовРаботника, ВалютаДокумента,
		    СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		    СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;							
									
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр()

// Формирует структуру полей, обязательных для заполнения при отражении операции во 
// взаиморасчетах
// Возвращаемое значение:
//   СтруктурахПолей   – структура для проверки
//
Функция СтруктураОбязательныхПолейРасчетыУпр()

	СтруктураПолей = Новый Структура("Организация, СуммаДокумента");
	Если   Не (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств) 
		 И Не (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет) 
		 И Не (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеЗП)
		 И НЕ (ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику) 	Тогда
		СтруктураПолей.Вставить("Контрагент");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
		СтруктураПолей.Вставить("ФизЛицо","Не указано подотчетное лицо");
		СтруктураПолей.Вставить("ВалютаВзаиморасчетовРаботника","Не указана валюта взаиморасчетов с подотчетным лицом");
	КонецЕсли;
	СтруктураПолей.Вставить("СчетОрганизации","Не указан банковский счет организации!");

	Возврат СтруктураПолей;

КонецФункции // 

// Проверяет значение, необходимое при проведении
Процедура ПроверитьЗначение(Значение, Отказ, Заголовок, ИмяРеквизита)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда 

		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита """+ИмяРеквизита+"""",Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПроверитьЗначение()

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧ(Отказ, Заголовок)

	Для Каждого Платеж Из РасшифровкаПлатежа Цикл

		ПроверитьЗначение(Платеж.ДоговорКонтрагента,Отказ, Заголовок,"Договор");
		ПроверитьЗначение(Платеж.СуммаВзаиморасчетов,Отказ, Заголовок,"Сумма взаиморасчетов");

		Если Не Отказ Тогда

			// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
			Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Заказ покупателя","Заказ поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);
				
				Если Отказ Тогда
				
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по заказам""! 
					|Заполните поле """+ТекстСделка+"""!");
					
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Счет покупателя","Счет поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);


				Если Отказ Тогда
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по счетам""! 
					|Заполните поле """+ТекстСделка+"""!");
				КонецЕсли;
						
			КонецЕсли;

			Если ЗначениеЗаполнено(Организация) 
				И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТЧ
	
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента)

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	мСтруктураПараметровДенежныхСредств.Вставить("РасчетыВозврат",            РасчетыВозврат);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыПоКредитам",     ЕстьРасчетыПоКредитам);
	мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКасса",       СчетОрганизации);
	мСтруктураПараметровДенежныхСредств.Вставить("ДатаДвижений",              ДатаДвижений);
	мСтруктураПараметровДенежныхСредств.Вставить("ПоРасчетномуДокументу",     ЗначениеЗаполнено(РасчетныйДокумент));

	Если ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет Тогда
		мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКассаПолучатель", СчетКонтрагента);
		мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредствПолучатель",  Перечисления.ВидыДенежныхСредств.Безналичные);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
		мСтруктураПараметровДенежныхСредств.Вставить("ФизЛицо",                    ФизЛицо);
		мСтруктураПараметровДенежныхСредств.Вставить("РасчетныйДокументРаботника", РасчетныйДокументРаботника);
	КонецЕсли;	
		
	УправлениеДенежнымиСредствами.ПровестиСписаниеДенежныхСредствУпр(
		СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Проверим необходимость снятия флага частичной оплаты у расчетного документа
	
	Если ЗначениеЗаполнено(РасчетныйДокумент) Тогда	
	
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств КАК ПлатежныйОрдерСписаниеДенежныхСредств
		|
		|ГДЕ
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Ссылка <> &Ссылка И
		|  ПлатежныйОрдерСписаниеДенежныхСредств.РасчетныйДокумент=&РасчетныйДокумент И
		|	ПлатежныйОрдерСписаниеДенежныхСредств.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("РасчетныйДокумент",РасчетныйДокумент);
		
		Результат=Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			ИзменяемыйДокумент=РасчетныйДокумент.ПолучитьОбъект();
			Попытка
				ИзменяемыйДокумент.Заблокировать();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось заблокировать документ " + ИзменяемыйДокумент, Отказ);
				Возврат;
			КонецПопытки;
			ИзменяемыйДокумент.Разблокировать();
			
			ИзменяемыйДокумент.ЧастичнаяОплата=Ложь;
			Попытка
				ИзменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать документ " + ИзменяемыйДокумент +":" + Символы.ПС
					+ ИнформацияОбОшибке(), Отказ);
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
				
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мСтруктураПараметровДенежныхСредств = Новый Структура;
мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Безналичные);