
////////////////////////////////////////////////////////////////////////////////
// Обработчики действий формы.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("СведенияОПродукте", 	СведенияОПродукте);	
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат;	
	КонецПопытки; 
			
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.НадписьПодробности.Видимость = Ложь;
		Элементы.ГруппаДействия.Видимость = Ложь;
	КонецЕсли; 
	
	Если НЕ ТипЗнч(СведенияОПродукте) = Тип("Структура")
		 ИЛИ НЕ СведенияОПродукте.Свойство("Наименование") 
		 ИЛИ НЕ ЗначениеЗаполнено(СведенияОПродукте.Наименование) Тогда
		Сообщить("Не заполнен параметр: НаименованиеПродукта");
		Отказ = Истина;
		Возврат;                                                                         
	КонецЕсли;
	Заголовок = м_СтрШаблон("Регистрация продукта ""%1""", СведенияОПродукте.Наименование);
		
	ОбновитьСведенияОЛицензии();
	
	ЮрЛицо = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Служебные функции.

// Проеряет заполнение полей ввода.
//
&НаКлиенте
Процедура ПроверитьЗаполнениеПолей(ПоляКПроверке, Отказ)
	
	ТекстСообщения = "";

	Для Каждого Поле Из ПоляКПроверке Цикл
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[Поле.Ключ]) Тогда
			
			ТекстСообщения = Поле.Значение;
			
		ИначеЕсли Поле.Ключ = "ЭлектронныйАдрес" Тогда 
			
			Значение = ЭтаФорма[Поле.Ключ];
			ВерныйФормат = Найти(Значение, "@")>1; 
			ВерныйФормат = МИН(ВерныйФормат, Найти(Значение, ".")>1);
			Если НЕ ВерныйФормат Тогда
		  		ТекстСообщения = "Неверный формат электронной почты";
			КонецЕсли;
			
		ИначеЕсли Поле.Ключ = "НомерТелефона" Тогда 
			
			Телефон = ЭтаФорма[Поле.Ключ];
			Если СтрДлина(Телефон) < 5 Тогда
		  		ТекстСообщения = "Неверный формат номера телефона";
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
		    Сообщение.Поле = Поле.Ключ;
		    Сообщение.УстановитьДанные(ЭтаФорма[Поле.Ключ]);
		    Сообщение.Сообщить();
			
			Отказ = Истина;			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ЗначениеАтрибутаDOM(врАтрибуты, врИмяАтрибута)
	
	врЗначение = врАтрибуты.ПолучитьИменованныйЭлемент(врИмяАтрибута).Значение;
	врЗначение = ОтменитьЭкранированиеСпецСимволовXML(врЗначение);
	
	Возврат врЗначение;
	
КонецФункции // ПолучитьЗначениеАтрибутаDOM()

&НаКлиентеНаСервереБезКонтекста 
Функция ОтменитьЭкранированиеСпецСимволовXML(Знач ИсхСтрока)
	Результат = ИсхСтрока;
	Результат = СтрЗаменить(Результат,"&quot;", """");	
	Результат = СтрЗаменить(Результат,"&apos;", "'");	
	Результат = СтрЗаменить(Результат,"&lt;", "<");	
	Результат = СтрЗаменить(Результат,"&gt;", ">");	
	Результат = СтрЗаменить(Результат,"&amp;", "&");	
	
	Возврат Результат;
КонецФункции // ОтменитьЭкранированиеСпецСимволовXML()

// Производится попытка преобразовать строку в дату
// 
&НаКлиентеНаСервереБезКонтекста
Функция ПреобразоватьВДату(Знач парамДата)
	Если ТипЗнч(парамДата) = Тип("Дата") Тогда
		Возврат парамДата;
	КонецЕсли; 
	НачалоВремен 	= Дата("19700101");
	ПустаяДата 		= Дата("00010101");
	
	Если НЕ ЗначениеЗаполнено(парамДата) Тогда
		Возврат ПустаяДата;
	КонецЕсли; 
	
	Если Найти(""+парамДата, ".")>0 Тогда
		// Формат даты UNIX
		Если ТипЗнч(парамДата) = Тип("Строка") Тогда
			Попытка
			  	парамДата = Число(парамДата);
			Исключение
				Возврат ПустаяДата;
			КонецПопытки; 
		ИначеЕсли ТипЗнч(парамДата) = Тип("Число") Тогда
			// тут все ок	
		Иначе
			Возврат ПустаяДата;
		КонецЕсли; 
		Если (ПустаяДата + парамДата) < НачалоВремен Тогда
			парамДата = НачалоВремен + парамДата;	
		КонецЕсли;
	Иначе	
		Попытка
			парамДата = Дата(парамДата);
		Исключение
			Возврат ПустаяДата;
		КонецПопытки; 	
	КонецЕсли; 
	
	Возврат парамДата;
КонецФункции // ПреобразоватьВДату()

Процедура СообщениеОбОшибкеСистемыЛицензирования(Компонент)
	
	ЧтениXML = Новый ЧтениеXML;
	ЧтениXML.УстановитьСтроку(Компонент.LastError());
	Если ЧтениXML.Прочитать() Тогда
		ТекстСообщения = ЧтениXML.ПолучитьАтрибут("status");
		КодСообщения   = ЧтениXML.ПолучитьАтрибут("code");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = м_СтрШаблон("[%1] %2", КодСообщения, ТекстСообщения);
    	Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция м_СтрШаблон(Текст, п1="", п2="", п3="", п4="", п5="", п6="")

	Для К = 1 По 6 Цикл
		Параметр = Вычислить("п" + К);
		Если Не ПустаяСтрока(Параметр) Тогда
			Текст = СтрЗаменить(Текст, "%" + К, Параметр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Текст;	

КонецФункции // СтрШаблон()

////////////////////////////////////////////////////////////////////////////////
// Сбор информации о лицензии.

&НаКлиенте
Процедура ОбновитьСведенияЛицензирования(Команда)
	ОбновитьСведенияОЛицензии();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОЛицензии()
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
		мМИКО_ЛицензированиеПереопределяемый = Вычислить("МИКО_ЛицензированиеПереопределяемый");	
	Исключение
		Возврат;	
	КонецПопытки; 
	ЛицензионныйКлюч = мМИКО_ЛицензированиеПереопределяемый.КлючЗащитыМодульСтатистики(,Ложь);	
	ИнформациюОЛицензии = "";
	Если ЗначениеЗаполнено(ЛицензионныйКлюч) Тогда
		LastError = "";
		Компонент = мМИКО_Лицензирование.ПодключитьКомпонент(СведенияОПродукте.ПрефиксКлюч, СведенияОПродукте.ИдентификаторКонфигурации);
		Компонент.MikoLicense = ЛицензионныйКлюч;
		Если НЕ Компонент.GetLicenseInfo(ИнформациюОЛицензии) Тогда
		    LastError = Компонент.LastError();
		КонецЕсли;
		ПроверитьНаличиеОшибок();
	КонецЕсли; 
	ТекущийСтатус = ОбработатьИнформациюОЛицензии(ИнформациюОЛицензии, ""+LastError);
	
КонецПроцедуры

// Обработка ответа сервера лицензирования.
// 
&НаСервере
Функция ОбработатьИнформациюОЛицензии(ИнформациюОЛицензии, ИнформацияОбОшибке="")
	
	ИнформациюОЛицензииСтруктура = ИнформациюОЛицензииВСтруктуру(ИнформациюОЛицензии);
	ОстатокДнейЛицензии = 0;
	БессрочнаяЛицензия  = Ложь;
	Элементы.ДобавитьПробнуюВерсиюПродукта.Видимость = Ложь;
	// Отобразим информацию по остатку дней лицензии.
	Если НЕ ЗначениеЗаполнено(ЛицензионныйКлюч) Тогда
		СтатусЛицензии = "Не указан регистрационный номер";
	ИначеЕсли ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		СтатусЛицензии = "Нет информации о лицензии";
	ИначеЕсли ЗначениеЗаполнено(ИнформациюОЛицензииСтруктура.РегистрационныйНомер) Тогда
		ФичаНайдена = Ложь;
		Продукты = ИнформациюОЛицензииСтруктура.ДополнительнаяИнформация.Продукты;
		Для Каждого Продукт Из Продукты Цикл
			
			ПродуктОстатокДнейЛицензии = Окр((Продукт.expired - ТекущаяДата()) / 86400 + 0.5);
			ПродуктБессрочнаяЛицензия  = (Продукт.trial = "0");
			
			Для Каждого Фича Из Продукт.Фичи Цикл
				Если Фича.id = СведенияОПродукте.ИдентификаторФичи Тогда
					
					Если ПродуктБессрочнаяЛицензия Тогда
						БессрочнаяЛицензия = Истина;
					Иначе
						ОстатокДнейЛицензии = Макс(ОстатокДнейЛицензии, ПродуктОстатокДнейЛицензии);
					КонецЕсли;
					ФичаНайдена = Истина;
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
		КонецЦикла;
		Элементы.НадписьПодробности.Видимость = Истина;
		Если БессрочнаяЛицензия Тогда
			СтатусЛицензии = "Зарегистрировано на " + ИнформациюОЛицензииСтруктура.ДополнительнаяИнформация.companyname;
		ИначеЕсли ФичаНайдена = Истина И ОстатокДнейЛицензии <= 0 Тогда
			СтатусЛицензии = "Срок действия лицензии истек";
		ИначеЕсли ФичаНайдена = Ложь И ОстатокДнейЛицензии <= 0 Тогда
			СтатусЛицензии = "Продукт не активирован";
			Элементы.ДобавитьПробнуюВерсиюПродукта.Видимость = Истина;
			Элементы.НадписьПодробности.Видимость = Ложь;
		Иначе
			СтатусЛицензии = "Срок действия лицензии " + Формат(ОстатокДнейЛицензии, "ЧДЦ=") + " дней";
		КонецЕсли;
		
	Иначе
		СтатусЛицензии = "Лицензия не обнаружена";
	КонецЕсли;
	
	КлючДействует = БессрочнаяЛицензия Или (ОстатокДнейЛицензии > 0);
	
	Элементы.НадписьЗаголовок.Заголовок = СтатусЛицензии;
	Элементы.НадписьРегистрацияКлиента.Видимость  = Не КлючДействует;
	Элементы.ПерейтиКРегистрацииКлиента.Видимость = Не КлючДействует;
	Элементы.НадписьАктивацияПродукта.Видимость   = Не БессрочнаяЛицензия;
	Элементы.НадписьАктивацияДополнений.Видимость = БессрочнаяЛицензия;
	
	ИнформациюОЛицензииСтруктура.Вставить("нТекстЛицензии", 	СтатусЛицензии);
	ИнформациюОЛицензииСтруктура.Вставить("ИнформацияОбОшибке", ИнформацияОбОшибке);
	
	Возврат СформироватьСводкуСистемыЛицензирования(ИнформациюОЛицензииСтруктура);
					
КонецФункции
 
// Обновляем информацию по ключу защиты.
// 
&НаСервере
Функция СформироватьСводкуСистемыЛицензирования(ИнформациюОЛицензииСтруктура)
	
	ДополнительнаяИнформация = ИнформациюОЛицензииСтруктура.ДополнительнаяИнформация;
	
	Результат = "";
	Если ЗначениеЗаполнено(ИнформациюОЛицензииСтруктура.ИнформацияОбОшибке) Тогда
		Результат = ""+ИнформациюОЛицензииСтруктура.ИнформацияОбОшибке;
	ИначеЕсли ЗначениеЗаполнено(ИнформациюОЛицензииСтруктура.РегистрационныйНомер) Тогда
	
		ТекстВладелец = "";
		ТекстПродукты = "Продукты:" + Символы.ПС;
		ПС = Символы.ПС;
		
		ТекстВладелец = м_СтрШаблон(
			"Организация: %1
			|ФИО контактного лица: %2
			|E-mail: %3
			|Телефон: %4",
			ДополнительнаяИнформация.companyname,
			ДополнительнаяИнформация.contact,
			ДополнительнаяИнформация.email,
			ДополнительнаяИнформация.tel);
		
		Продукты = ДополнительнаяИнформация.Продукты;
		Для Каждого Продукт Из Продукты Цикл
			
			ОстатокДнейЛицензии = Макс(0, Окр((Продукт.expired - ТекущаяДата()) / 86400 + 0.5));
			БессрочнаяЛицензия  = (Продукт.trial = "0");
			
			ТекстФичи = "";
			Для Каждого Фича Из Продукт.Фичи Цикл
				ТекстФичи = ТекстФичи + м_СтрШаблон(
					" - %1. Используется: %2/%3",
					Фича.name,
					Фича.captured,
					Фича.count) + ПС;
			КонецЦикла;
			
			ТекстПродукты = ТекстПродукты + м_СтрШаблон(
				"[ %1. %2 ]",
				Продукт.name,
				?(БессрочнаяЛицензия,
					"Действует",
					"Осталось " + Формат(ОстатокДнейЛицензии, "ЧДЦ=") + " дней")) +
				ПС + ТекстФичи + ПС + ПС;
			
			КонецЦикла;
			
		Результат = ТекстВладелец + ПС + ПС + ТекстПродукты;
		
	Иначе
		Результат = "Нет информации о ключе.";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция парсит ответ сервера
// возвращет результат сбора информации в виде структуры.
//
&НаСервереБезКонтекста   
Функция ИнформациюОЛицензииВСтруктуру(ИнформациюОЛицензии)
	
	// 1. Производим парсинг - перечень страниц
    ЧтениеHTML 	 	= Новый ЧтениеHTML;	
    ПостроительDOM 	= Новый ПостроительDOM; 
    Попытка
        ЧтениеHTML.УстановитьСтроку(ИнформациюОЛицензии);
        ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);
    Исключение
    КонецПопытки;
	
	ОтветСервера = Новый Структура;
	ОтветСервера.Вставить("ОстатокДнейЛицензии",          -1);
	ОтветСервера.Вставить("ТипЛицензии",                  "");
	ОтветСервера.Вставить("РегистрационныйНомер",         "");
	ОтветСервера.Вставить("ДополнительнаяИнформация",     Новый Структура);
	ОтветСервера.Вставить("HASP_ОстатокДнейЛицензии",     -1);
	ОтветСервера.Вставить("HASP_ТипЛицензии",             "");
	ОтветСервера.Вставить("HASP_РегистрационныйНомер",    "");
	ОтветСервера.Вставить("HASP_ДополнительнаяИнформация",Новый Структура);
	
	// ПОДГОТОВКА ОТВЕТА
	ОтветСервераМИКО = ПолучитьСведенияПоКлючамЗащитыМИКО(ДокументDOM);
	ЗаполнитьЗначенияСвойств(ОтветСервера, ОтветСервераМИКО);
	// ЗаполнитьЗначенияСвойств(ОтветСервера, ОтветСервераHASP);
		
	Возврат ОтветСервера;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСведенияПоКлючамЗащитыМИКО(ДокументDOM)
	
	ОтветСервера = Новый Структура;
	ОтветСервера.Вставить("ОстатокДнейЛицензии",          -1);
	ОтветСервера.Вставить("ТипЛицензии",                  "");
	ОтветСервера.Вставить("РегистрационныйНомер",         "");
	ОтветСервера.Вставить("ДополнительнаяИнформация",     Новый Структура);
	
	ОстатокДнейЛицензии = 0;
	// Пример ответа от сервера лицензирования МИКО                                        
    ЭлементыUl = ДокументDOM.ПолучитьЭлементыПоИмени("saaslicenseinfo");
	Если ЭлементыUl.Количество()=0 Тогда
	 	Возврат ОтветСервера;
	КонецЕсли;
	ТекЭлемент_hasp = ЭлементыUl[0];
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("key", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "key") );
	ДополнительнаяИнформация.Вставить("companyname",ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "companyname") );
	ДополнительнаяИнформация.Вставить("contact", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "contact") );
	ДополнительнаяИнформация.Вставить("email", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "email") );
	ДополнительнаяИнформация.Вставить("tel", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "tel") );
	ДополнительнаяИнформация.Вставить("activated", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "activated") = "1");
	version = ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "version");
	
	Продукты = Новый Массив;
	products = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("product");
	Для каждого product Из products Цикл
		врПродукт = Новый Структура("name,id,trial,expired,feature");
		name         = ЗначениеАтрибутаDOM(product.Атрибуты, "name");
		ID           = ЗначениеАтрибутаDOM(product.Атрибуты, "id");
		trial        = ЗначениеАтрибутаDOM(product.Атрибуты, "trial");
		expired  	 = ЗначениеАтрибутаDOM(product.Атрибуты, "expired");
		
		дата_expired = ПреобразоватьВДату(СтрЗаменить(СтрЗаменить(СтрЗаменить(expired,"-","")," ",""),":",""));
		
		врПродукт.Вставить("name",    name);
		врПродукт.Вставить("id",      ID);
		врПродукт.Вставить("trial",	  trial);
		врПродукт.Вставить("expired", дата_expired);
		
		features = Новый Массив;
		элfeature = product.ПолучитьЭлементыПоИмени("feature");  	
		Для каждого тек_feature Из элfeature Цикл
			id   	 = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "id");
			name   	 = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "name");
			count 	 = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "count");
			captured = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "captured");
			counteach= ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "counteach");
			
			врfeature = Новый Структура("id,name,count,captured,counteach", id,name,count,captured,counteach);
			features.Добавить(врfeature);
		КонецЦикла; 
		врПродукт.Вставить("Фичи",	features);
		
		Продукты.Добавить(врПродукт);
	КонецЦикла; 
		
	ДополнительнаяИнформация.Вставить("Продукты",		Продукты);
	ОтветСервера.Вставить("ОстатокДнейЛицензии", 		ОстатокДнейЛицензии);
	ОтветСервера.Вставить("ДополнительнаяИнформация", 	ДополнительнаяИнформация);
	ОтветСервера.Вставить("РегистрационныйНомер", 		ДополнительнаяИнформация.key);
	ОтветСервера.Вставить("ТипЛицензии", 				"MIKO SaaS");
	ОтветСервера.Вставить("version", 					version);
	
	Возврат ОтветСервера;
	
КонецФункции // ПолучитьСведенияПоКлючамЗащитыМИКО()


////////////////////////////////////////////////////////////////////////////////
// Обработчики действий элементов формы.

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НадписьПодробностиНажатие(Элемент)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСтатус;
	
	Элементы.ИзменитьКлюч.Видимость = Истина;
	Элементы.СохранитьКлюч.Видимость = Ложь;
	
	Элементы.ЛицензионныйКлюч.ТолькоПросмотр = Истина;
	
	ЛицензионныйКлючВременный = ЛицензионныйКлюч;
	
КонецПроцедуры

// Обновим отображение элементов на форме.
// 
&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	
	Элементы.ГруппаДанныеЮрЛица.Видимость = ЮрЛицо;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы.

&НаКлиенте
Процедура ПерейтиКРегистрацииКлиента(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРегистрация;
	Элементы.Зарегистрировать.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКАктивацииПродукта(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАктивация;
	Элементы.АктивироватьКупон.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКМеню(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМеню;
	Элементы.КнопкаПродолжить.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	ЗавершитьРаботуСистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКлюч(Команда)
	
	Элементы.ЛицензионныйКлюч.ТолькоПросмотр = Ложь;

	Элементы.ИзменитьКлюч.Видимость = Ложь;
	Элементы.СохранитьКлюч.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКлюч(Команда)
	
	ТекущийСтатус = "Получение информации по лицензированию...";
	
	СохранитьКлючНаСервере();
	
	Элементы.ЛицензионныйКлюч.ТолькоПросмотр = Истина;
	
	Элементы.ИзменитьКлюч.Видимость = Истина;
	Элементы.СохранитьКлюч.Видимость = Ложь;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ПоляКПроверке = Новый Соответствие;
	Если ЮрЛицо = Истина Тогда
		ПоляКПроверке.Вставить("НаименованиеОрганизации", 	"Введите наименование ораганизации.");
		ПоляКПроверке.Вставить("ИННОрганизации", 		 	"Введите ИНН юридического лица.");
	КонецЕсли;
	ПоляКПроверке.Вставить("ФИОКонтактногоЛица", 			"Введите ФИО контактного лица.");
	ПоляКПроверке.Вставить("НомерТелефона", 				"Укажите контактный номер телефона.");
	ПоляКПроверке.Вставить("ЭлектронныйАдрес", 				"Укажите адрес электронной почты.");
	
	Отказ = Ложь;
	ПроверитьЗаполнениеПолей(ПоляКПроверке, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарегистрироватьНаСервере() Тогда
		ПерейтиКМеню(0);
	КонецЕсли;
	
	ПроверитьНаличиеОшибок();
КонецПроцедуры
&НаКлиенте
Процедура АктивироватьКупон(Команда)
	
	ПоляКПроверке = Новый Соответствие;
	ПоляКПроверке.Вставить("КлючКупон", "Укажите номер купона.");
	
	Отказ = Ложь;
	ПроверитьЗаполнениеПолей(ПоляКПроверке, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если АктивироватьКупонНаСервере() Тогда
		ПерейтиКМеню(0);
	КонецЕсли;
	
	ПроверитьНаличиеОшибок();
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьПробнуюВерсиюПродукта(Команда)
	ДобавитьПробнуюВерсиюПродуктаНаСервере();
КонецПроцедуры
&НаСервере
Функция ПроверитьНаличиеОшибок()
	Данные = LastError; врСообщение = "";
	
	Если Найти(Данные, "1003")>0 Тогда
		врСообщение = врСообщение + "[1003] Для активации купона """+КлючКупон+""" необходимо ввести данные о компании и получить регистрационный номер по ссылке ""Регистрация в сервисе MIKO SaaS""." + Символы.ПС;	
	ИначеЕсли Найти(Данные,"1058")>0  Тогда 	
		// ERR Данный e-mail адрес уже зарегистрирован в системе [1058]	
		врСообщение = врСообщение + "[1058] E-mail """+ЭлектронныйАдрес+""" или ПК уже зарегистрирован в системе." + Символы.ПС;		
	ИначеЕсли Найти(Данные,"1053")>0  Тогда 	
		врСообщение = врСообщение + "[1053] Введен не корректный регистрационный номер """+ЛицензионныйКлюч+"""." + Символы.ПС;
	ИначеЕсли Найти(Данные,"1081")>0  Тогда 	
		врСообщение = врСообщение + "[1081] Введен не корректный код купона """+КлючКупон+"""." + Символы.ПС;
		КлючКупон = "";		
	ИначеЕсли Найти(Данные, "1082")>0 Тогда 	
		врСообщение = врСообщение + "[1082] Купон """+КлючКупон+""" уже был активирован ранее." + Символы.ПС;  
		КлючКупон = "";	
	ИначеЕсли Найти(Данные, "1012")>0 Тогда
		// ERR Сервер лицензирования не вернул ответ [1011]
		врСообщение = врСообщение + "[1012] Сервер лицензирования отклонил запрос." + Символы.ПС;	
	ИначеЕсли Найти(Данные, "1011")>0 Тогда
		// ERR Сервер лицензирования не вернул ответ [1011]
		врСообщение = врСообщение + "[1011] Сервер лицензирования не вернул ответ." + Символы.ПС;
		врСообщение = врСообщение + "Проверьте наличие доступа в интернет." + Символы.ПС;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(врСообщение) Тогда
		LastError = врСообщение;	
	КонецЕсли; 
	
	Возврат LastError;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд на стороне сервера.

&НаСервере
Процедура СохранитьКлючНаСервере()
	
	ЛицензионныйКлюч = СокрЛП(ЛицензионныйКлючВременный);
	МИКО_ЛицензированиеПереопределяемый.ПриЗаписиЛицензионногоКлюча(СведенияОПродукте.ИдентификаторКонфигурации, ЛицензионныйКлюч);
	
	ОбновитьСведенияОЛицензии();
	
КонецПроцедуры

// Регистрация клиента в системе.
// 
&НаСервере
Функция ЗарегистрироватьНаСервере()
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат Ложь;	
	КонецПопытки; 
	Компонент = мМИКО_Лицензирование.ПодключитьКомпонент(СведенияОПродукте.ПрефиксКлюч, СведенияОПродукте.ИдентификаторКонфигурации);
	// Пример:
	//<reginfo>
	//	<param name = "Companyname" value = "МИКО ООО" />
	//	<param name = "Contact" value = "Лев Мышкин" />
	//	<param name = "Email" value = "l.mouse@miko.ru" />
	//	<param name = "Telefone" value = "+791278945623" />
	//	<param name = "INN" value = "7735518433" />
	//	<param name = "TypeOPF" value = "org" />
	//	<param name = "Description" value = "Активация из 1С" />
	//</reginfo>
	//.	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Companyname", ?(ЗначениеЗаполнено(НаименованиеОрганизации),НаименованиеОрганизации,ФИОКонтактногоЛица));
	СтруктураПараметров.Вставить("INN", 		ИННОрганизации);  		
	СтруктураПараметров.Вставить("Contact", 	ФИОКонтактногоЛица);
	СтруктураПараметров.Вставить("Email", 		ЭлектронныйАдрес);
	СтруктураПараметров.Вставить("Telefone", 	НомерТелефона);
	СтруктураПараметров.Вставить("Description", "");
	СтруктураПараметров.Вставить("TypeOPF", 	?(ЮрЛицо, "org", "ind"));
	Данные = "<reginfo>";
	Для Каждого ТекПараметр Из СтруктураПараметров Цикл
		Если ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
			ДанныеКлюча = "";
			Компонент.UrlEncode(""+ТекПараметр.Значение, ДанныеКлюча);	
			Данные = Данные + Символы.ПС + м_СтрШаблон("<param name=""%1"" value=""%2""/>", ТекПараметр.Ключ, ДанныеКлюча);
		КонецЕсли; 
	КонецЦикла; 
	Данные = Данные + Символы.ПС + "</reginfo>";
														
	ИдентификаторПродукта = ""+СведенияОПродукте.ИдентификаторТриальногоПродукта;	
	Результат = ""; ТекущийСтатус="";
	Если Компонент.GetTrialLicense(ИдентификаторПродукта, Данные, Результат) Тогда
		
		Если ЗначениеЗаполнено(Результат) Тогда
			МИКО_ЛицензированиеПереопределяемый.ПриЗаписиЛицензионногоКлюча(
				СведенияОПродукте.ИдентификаторКонфигурации,
				Результат);
				
			ЛицензионныйКлюч = Результат;
				
			// Активируем купон.
			АктивироватьКупонНаСервере();
			
			ОбновитьСведенияОЛицензии();
				
			Возврат Истина;
		КонецЕсли; 
		
	КонецЕсли;
	LastError = Компонент.LastError();
 	Элементы.РезультатLastError1.Видимость = ЗначениеЗаполнено(LastError);
	
	Возврат Ложь;
КонецФункции

// Активация купона.
//
&НаСервере
Функция АктивироватьКупонНаСервере()
	ТекущийСтатус = "";
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат Ложь;	
	КонецПопытки; 
	Если ПустаяСтрока(КлючКупон) Тогда
	  	Возврат Истина;
	КонецЕсли; 
	
	Компонент = мМИКО_Лицензирование.ПодключитьКомпонент(СведенияОПродукте.ПрефиксКлюч,
	                                                    СведенияОПродукте.ИдентификаторКонфигурации);
	Компонент.MikoLicense = ЛицензионныйКлюч;
	Результат = Компонент.ActivateCoupone(КлючКупон, "");
	Если Результат Тогда
		ОбновитьСведенияОЛицензии();
	КонецЕсли;
	LastError = Компонент.LastError();
	Элементы.РезультатLastError.Видимость = ЗначениеЗаполнено(LastError);
	
	Возврат Результат;
КонецФункции

// Активация купона.
//
&НаСервере
Функция ДобавитьПробнуюВерсиюПродуктаНаСервере()
	ТекущийСтатус = "";
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат Ложь;	
	КонецПопытки; 
	
	Компонент = мМИКО_Лицензирование.ПодключитьКомпонент(СведенияОПродукте.ПрефиксКлюч, СведенияОПродукте.ИдентификаторКонфигурации);
	Компонент.MikoLicense = ЛицензионныйКлюч;
	Если ПустаяСтрока(ЛицензионныйКлюч) Тогда
	  	Возврат Ложь;
	КонецЕсли; 
	
	Результат = Компонент.AddTrialProduct(""+СведенияОПродукте.ИдентификаторТриальногоПродукта);
	Если Результат = Истина Тогда
		ОбновитьСведенияОЛицензии();
	Иначе
		СообщениеОбОшибкеСистемыЛицензирования(Компонент);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПолучитьПомощьВЛицензированииНажатие(Элемент)
	ЗапуститьПриложение("https://miko24.ru/online/telefon1csupport")
КонецПроцедуры

&НаКлиенте
Процедура СогласенНаОбработкуПерсональныхДанныхПриИзменении(Элемент)
	Элементы.Зарегистрировать.Доступность = СогласенНаОбработкуПерсональныхДанных;
КонецПроцедуры

// #КонецОбласти 