

Функция СформироватьФайлXML(ПутьКФайлу = Неопределено, Номенклатура = Неопределено) Экспорт


	Если ПутьКФайлу = Неопределено Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли; 
	
	ТипЦены                   = Константы.ТипЦенКаста                         .Получить();
	ПроверятьРазбитиеРостовок = Константы.ПроверятьРазбитиеРостовокМаркетПлэйс.Получить();
	//ГруппаСклада              = Константы.СкладМаркетПлэйс                    .Получить();
	ВариантВыгрузки           = Константы.ВариантВыгрузкиКаста                .Получить();

	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	
		
	ОстаткиКВыгрузке = ОбщегоНазначения.ПолучитьОстаткиКВыгрузке(Номенклатура,);
	Остатки = ОстаткиКВыгрузке.Остатки;
	Комплектующие = ОстаткиКВыгрузке.Комплектующие;	
	
	Врем = Формат(ТекущаяДата(),"ДЛФ=T");
	Если СтрДлина(Врем)= 7 Тогда
		Врем  = Лев(Врем,4);
	Иначе
		Врем  = Лев(Врем,5);
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?> 
	|<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
	|<yml_catalog date="""+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Врем+"""> 
	|<shop>
	|<name>Cvetkov</name>
	|<company>Cvetkov TM</company>
	|<url>https://www.cvetkovtm.com/</url>
	|<currencies>
	|<currency id=""UAH"" rate=""1""/>
	|</currencies>");
	
	ВыборкаКатегорий = Справочники.КатегорииРозетка.Выбрать();
	
	// Категории
	ТД.ЗаписатьСтроку("<categories>");
	Пока ВыборкаКатегорий.Следующий() Цикл
		Если ВыборкаКатегорий.ПометкаУдаления ИЛИ ВыборкаКатегорий.Наименование = "нет" Тогда Продолжить; КонецЕсли;
    	Код = ОбщегоНазначения.УбратьНоликиСлева(ВыборкаКатегорий.Код);
		ТД.ЗаписатьСтроку("<category id="""+Код+""">"+ВыборкаКатегорий.Наименование+"</category>");
	КонецЦикла;	
	ТД.ЗаписатьСтроку("<category id=""0000001"">Куртки для девочек Зима</category>");
	ТД.ЗаписатьСтроку("<category id=""0000002"">Куртки для девочек Демисезон</category>");
	ТД.ЗаписатьСтроку("<category id=""0000003"">Куртки для малышей Зима</category>");
	ТД.ЗаписатьСтроку("<category id=""0000004"">Куртки для малышей Деми</category>");
	ТД.ЗаписатьСтроку("<category id=""0000005"">Куртки для мальчиков Зима</category>");
	ТД.ЗаписатьСтроку("<category id=""0000006"">Куртки для мальчиков Демисезон</category>");
	ТД.ЗаписатьСтроку("</categories>");

	ТД.ЗаписатьСтроку("<offers>");	

	Контрагент =  Справочники.Контрагенты.НайтиПоКоду("000004317");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000003189");	
	ТаблицаХарактеристик = ОбщегоНазначения.ПолучитьТаблицуХарактеристикДляВыгрузки(Остатки, ТипЦены, "КатегорияРозетка", ПроверятьРазбитиеРостовок, ВариантВыгрузки,,,200,,Контрагент,Договор);	
	
	Для Каждого Стр из ТаблицаХарактеристик Цикл 		
		ЗаписатьНоменклатуру(Стр, ТД);
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>
	|</shop>
	|</yml_catalog>");
	
	ТД.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьНоменклатуру(Стр, ТД)

	Цена = Стр.Цена;	
	СпрГруппыЦветов	= Стр.ГруппаЦвета;
	Номенклатура = Стр.Номенклатура;
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	Характеристика = Стр.Характеристика;
	ХарактеристикаОбъект = Стр.Характеристика.ПолучитьОбъект();
	Ид = Стр.ИД;	
	ПерваяЦена           = стр.ПерваяЦена;

	Доступна = Стр.Доступна;
	ШтрихКод = Стр.ШтрихКод;
	Скидка = Стр.Скидка;
	Остаток = Стр.Остаток;
	ИдГуппы = Стр.ИдГуппы;
	Наценка = Стр.Наценка;		
	available = ?(Доступна,"true","false");	
	ТД.ЗаписатьСтроку("<offer id="""+Ид+""" available="""+available+""">");	
	
	ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
	
	// наименование
	НеДобавлятьТкань = Ложь;
	НеДобавлятьРазмер = Ложь;
	НеДобавлятьШтрихКод = Ложь;
	НаименованиеУкр = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Ложь, НеДобавлятьТкань, НеДобавлятьРазмер, НеДобавлятьШтрихКод);
	НаименованиеРус = ОбщегоНазначения.НаименованиеДляВыгрузки(Характеристика, Истина, НеДобавлятьТкань, НеДобавлятьРазмер, НеДобавлятьШтрихКод);
	ТД.ЗаписатьСтроку("<name>"+НаименованиеРус+"</name>");	
	ТД.ЗаписатьСтроку("<name_ua>"+НаименованиеУкр+"</name_ua>");		
	
	Цвет = ХарактеристикаОбъект.ПолучитьЗначениеЦвета();
	СуществуетАтрибутАкция = Цвет.Метаданные().Реквизиты.Найти("Цвет") <> Неопределено;
	Акция = ?(СуществуетАтрибутАкция,Цвет.ВАкции,Истина);
	
	Если Ложь Тогда 
		//Если Скидка > 0 Или Наценка < 70 Тогда
			ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price_old>");
			ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price>");						
			ТД.ЗаписатьСтроку("<promo_new_price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цел(Цена*(1-Скидка/100)-1),"ЧДЦ=")) +"</promo_new_price>");
		//Иначе
		//	ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price_old>");
		//	ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");			
		//	ТД.ЗаписатьСтроку("<promo_new_price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</promo_new_price>");		
		//КонецЕсли;	
	Иначе 
		//Если Скидка > 0 Или Наценка < 70 Тогда
			ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price_old>");
			ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цел(Цена*(1-Скидка/100)),"ЧДЦ="))+"</price>");		
			ТД.ЗаписатьСтроку("<promo_new_price>" +ОбщегоНазначения.НормальноеЧисло(Формат(Цел(Цена*(1-Скидка/100)),"ЧДЦ="))+"</promo_new_price>");
		//Иначе
		//	ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price_old>");
		//	ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");							
		//КонецЕсли;	
	КонецЕсли;
	
	//Если Скидка>0 Или Наценка < 70 Тогда
	//	ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</price>");
	//	ТД.ЗаписатьСтроку("<promo_new_price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена*(1-Скидка/100),"ЧДЦ="))+"</promo_new_price>");
	//	ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(ПерваяЦена,"ЧДЦ="))+"</price_old>");
	//Иначе
	//	ТД.ЗаписатьСтроку("<price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price>");
	//	ТД.ЗаписатьСтроку("<promo_new_price>"    +ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</promo_new_price>");		
	//	ТД.ЗаписатьСтроку("<price_old>"+ОбщегоНазначения.НормальноеЧисло(Формат(Цена,"ЧДЦ="))+"</price_old>");
	//КонецЕсли;
		
	ЗаписатьКатегориюДляХарактеристики(ТД,Стр.Характеристика);
	
	/// Рус Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Стр.Характеристика,Истина);	
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description>"+Описание+"</description>");
	
	/// УКР Описание
	ОписаниеМодели = ОбщегоНазначения.ОписаниеДляХарактеристики(Стр.Характеристика,Ложь);
	Описание =  ?(ОписаниеМодели <> "","<![CDATA["+ОписаниеМодели+"]]>"," ");
	ТД.ЗаписатьСтроку("<description_ua>"+Описание+"</description_ua>");

	Название = НоменклатураОбъект.Наименование(Истина);
	ТД.ЗаписатьСтроку("<model>"+Название+"</model>");

	
	Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
		
		ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов,Истина);
		
		Для Каждого Фот Из ТабФото Цикл
			
			 //Или Фот.НеВыгружатьРозница 
			Если Фот.НеВыгружать ИЛИ Фот.НеВыгружатьРозница Тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяФото = Фот.Наименование;
			
			ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Параметры
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("Каста");
	Категория = Номенклатура.КатегорияРозетка;
	ИсключениеСвойств = Неопределено;	
	Свойства = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Категория, Характеристика,"name","paramid","valueid",ИсключениеСвойств);
    ТД.ЗаписатьСтроку(Свойства);
 
	

	ТД.ЗаписатьСтроку("<param name=""Країна виробництва"">Україна</param>");
	ТД.ЗаписатьСтроку("<vendor>Cvetkov</vendor>");	
	ТД.ЗаписатьСтроку("<stock_quantity>"+Остаток+"</stock_quantity>");	
	ТД.ЗаписатьСтроку("<article>" + ИдГуппы + "</article>");
	ТД.ЗаписатьСтроку("<param name=""Штрих-код"">"+ШтрихКод+"</param>");
	//ТД.ЗаписатьСтроку("<param name=""Стиль"">Повседневный (casual)</param>");

	
	
	//ТД.ЗаписатьСтроку("<param name=""Рік колекції"">"+Прав(Номенклатура.Родитель.Наименование,4)+"</param>");	
	
	ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры

Процедура ЗаписатьКатегориюДляХарактеристики(Тд, Характеристика)
	
	Номенклатура = Характеристика.Владелец;
	КатегорияРозетка = Номенклатура.КатегорияРозетка;
	РозеткаСезонСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000056"); 
	РозеткаСезонЗначение = ОбщегоНазначения.СвойстваОбъекта(Номенклатура,"000000056");
		
	Если КатегорияРозетка.Наименование = "Куртки для девочек" Тогда 
		
		Если РозеткаСезонЗначение.Наименование = "Зимний" Тогда
			ТД.ЗаписатьСтроку("<categoryId>0000001</categoryId>");	
		ИначеЕсли РозеткаСезонЗначение.Наименование = "Осенне-Весенний" Или РозеткаСезонЗначение.Наименование = "Всесезонная модель" Тогда
			ТД.ЗаписатьСтроку("<categoryId>0000002</categoryId>");
		КонецЕсли;

	ИначеЕсли КатегорияРозетка.Наименование = "Куртки для малышей" Тогда
		
		Если РозеткаСезонЗначение.Наименование = "Зимний" Тогда
			 ТД.ЗаписатьСтроку("<categoryId>0000003</categoryId>");
		ИначеЕсли РозеткаСезонЗначение.Наименование = "Осенне-Весенний"  Или РозеткаСезонЗначение.Наименование = "Всесезонная модель" Тогда
			 ТД.ЗаписатьСтроку("<categoryId>0000004</categoryId>");
		КонецЕсли;
		
	ИначеЕсли КатегорияРозетка.Наименование = "Куртки для мальчиков" Тогда
		
		Если РозеткаСезонЗначение.Наименование = "Зимний" Тогда
			ТД.ЗаписатьСтроку("<categoryId>0000005</categoryId>");
		ИначеЕсли РозеткаСезонЗначение.Наименование = "Осенне-Весенний" Или РозеткаСезонЗначение.Наименование = "Всесезонная модель" Тогда
			ТД.ЗаписатьСтроку("<categoryId>0000006</categoryId>");
		КонецЕсли;
	
	Иначе
		ТД.ЗаписатьСтроку("<categoryId>"+ОбщегоНазначения.УбратьНоликиСлева(КатегорияРозетка.Код)+"</categoryId>");
	КонецЕсли;
		
КонецПроцедуры
