 
			///////////////////////////////////////////////////////////////////
			//			ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ НА СЕРВРЕ //
			/////////////////////////////////////////////////////////////////

Процедура ЗарегистрироватьИзменения(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	МассивУзлов = Б_СерверПовтИсп.ПолучитьМассивУзлов();
	Попытка
	
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	Исключение
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);   
	
КонецПроцедуры

Процедура ЗарегистрироватьЭлементПользовательскогоСправочника(Объект) Экспорт
	ТипОбъекта = ТипЗнч(Объект);
	Попытка
		Выборка = планыОбмена.Б_ОбменССайтом.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОбменПользовательскимиСправочниками Тогда
				
				СохраненныеНастройки = Выборка.СохраненныеНастройки.Получить();
				
				ВремТзн = СохраненныеНастройки.ПользовательскиеСправочники.ВыгружаемыеПоляСправочников.Скопировать();
				ВремТзн.Свернуть("Справочник");
				
				Для Каждого ТекСправочник из ВремТзн Цикл
					
					Если ТипОбъекта = Тип("СправочникОбъект." + ТекСправочник.Справочник) тогда
						
						ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Объект.Ссылка);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось зарегистрировать изменение для элемента " + Строка(Объект.Ссылка) + ". Элемент не будет отправлен на сайт Битрикс в режиме изенений.");
		Сообщить(ОписаниеОшибки()); 
	КонецПопытки;
	
	
КонецПроцедуры


Процедура ФормированиеФайловXMLОбменаДанных(ПараметрыОбмена, Операция, ЭтоДозагрузка = Ложь) Экспорт
	
	Если Операция = "ОбщаяИнформация" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов общей информации в в XML.", ПараметрыОбмена);
		
		СтрокаКаталога = 0;
		
		Для Каждого СтрокаТаблицыКаталогов Из ПараметрыОбмена.ТаблицаКаталогов Цикл
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета общей информации каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, СтрокаТаблицыКаталогов.ИдКаталога); 
			ВыгрузитьОбщуюИнформацию(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, СтрокаКаталога);
			СтрокаКаталога = СтрокаКаталога + 1;	
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета общей информации каталога: " + СтрокаТаблицыКаталогов.Каталог + " завершена.", ПараметрыОбмена, Истина);
			
		КонецЦикла;	
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов общей информации в XML завершена.", ПараметрыОбмена);
		
	ИначеЕсли Операция = "Свойства" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов свойств в XML.", ПараметрыОбмена);
		
		СтрокаКаталога = 0;
		
		Для Каждого СтрокаТаблицыКаталогов Из ПараметрыОбмена.ТаблицаКаталогов Цикл
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета свойства каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, СтрокаТаблицыКаталогов.ИдКаталога); 
			ВыгрузитьИнформациюОСвойствах(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, СтрокаКаталога);
			СтрокаКаталога = СтрокаКаталога + 1;	
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета свойства каталога: " + СтрокаТаблицыКаталогов.Каталог + " завершена.", ПараметрыОбмена, Истина);
			
		КонецЦикла;	
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов свойств в XML завершена.", ПараметрыОбмена);
		
	ИначеЕсли Операция = "Товары" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов товаров в в XML.", ПараметрыОбмена);
		
		СтрокаКаталога = 0;
		
		Для Каждого СтрокаТаблицыКаталогов Из ПараметрыОбмена.ТаблицаКаталогов Цикл
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, СтрокаТаблицыКаталогов.ИдКаталога); 
			ВыгрузитьИнформациюОТоварах(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, СтрокаКаталога);
			СтрокаКаталога = СтрокаКаталога + 1;	
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов каталога: " + СтрокаТаблицыКаталогов.Каталог + " завершена.", ПараметрыОбмена, Истина);
			
		КонецЦикла;	
		
		Если НЕ ЭтоДозагрузка И НЕ ПараметрыОбмена.ВыгружатьТолькоИзменения И ПараметрыОбмена.ВыгружатьНаСайт И ПараметрыОбмена.ДеактивироватьТоварыЕслиПолнаяВыгрузка И (ПараметрыОбмена.ВыгружатьТовары ИЛИ ПараметрыОбмена.ВыгружатьПредложения) тогда
			
			Если ПараметрыОбмена.ДатаДеактивацииПриПакетнойВыгрузке = Неопределено тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отправка запроса на деактивацию невозможна. ", ПараметрыОбмена, Истина);   
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Б_ПакетныйОбмен.Объект,
			|	Б_ПакетныйОбмен.Каталог,
			|	Б_ПакетныйОбмен.Пакет
			|ИЗ
			|	РегистрСведений.Б_ПакетныйОбмен КАК Б_ПакетныйОбмен
			|ГДЕ
			|	Б_ПакетныйОбмен.НастройкаОбмена = &ПараметрыОбмена
			|	И Б_ПакетныйОбмен.Каталог В(&МассивКаталогов)";
			Запрос.УстановитьПараметр("ПараметрыОбмена",ПараметрыОбмена.Ссылка);
			Запрос.УстановитьПараметр("МассивКаталогов",ПараметрыОбмена.ТаблицаКаталогов.ВыгрузитьКолонку("ИдКаталога"));
			
			ТзнВрем = запрос.Выполнить().Выгрузить();
			
			Если ТзнВрем.Количество() = 0 тогда
				
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Деактивация элементов, не попавшие в полную пакетную выгрузку.", ПараметрыОбмена, Истина);   
				
				ПараметрыЗапроса = ПараметрыОбмена.НастройкиПодключения.ПараметрЗапросаHTTP_ДеактивацияДанныхПоДате + ПараметрыОбмена.ДатаДеактивацииПриПакетнойВыгрузке;
				
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ВыгрузитьДанныеНаСайтУпрощенно(ПараметрыОбмена, "catalog", ПараметрыЗапроса);
				
			КонецЕсли;
			
       	КонецЕсли;
		
		Если НЕ ЭтоДозагрузка И ПараметрыОбмена.ВыгружатьНаСайт тогда
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Отправка запроса об окончании выгрузки информации о товарах.", ПараметрыОбмена, Истина); 
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ВыгрузитьДанныеНаСайтУпрощенно(ПараметрыОбмена, "catalog", ПараметрыОбмена.НастройкиПодключения.ПараметрЗапросаHTTP_ОкончаниеВыгрузкиТоваров);
			
       	КонецЕсли;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов товаров в XML завершена.", ПараметрыОбмена);
		
	ИначеЕсли Операция = "Скидки" тогда
		
		Если ПараметрыОбмена.ВыгрузкаСкидок ИЛИ ПараметрыОбмена.ВыгрузкаВидовКартЛояльности тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов скидок в XML.", ПараметрыОбмена);
			МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, "Скидки");
			ВыгрузитьИнформациюОСкидках(ПараметрыОбмена,МассивДанных, Операция);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов пользовательских справочников в XML завершена.", ПараметрыОбмена);
		КонецЕсли;
		
	ИначеЕсли Операция = "КартыЛояльности" тогда
		
		Если ПараметрыОбмена.ВыгрузкаКартЛояльности тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов карт лояльности в XML.", ПараметрыОбмена);
			МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, "КартыЛояльности");
			ВыгрузитьИнформациюОКартахЛояльности(ПараметрыОбмена,МассивДанных, Операция);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов карт лояльности в XML завершена.", ПараметрыОбмена);
		КонецЕсли;
		
	ИначеЕсли Операция = "ПользовательскиеСправочники" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов пользовательских справочников в XML.", ПараметрыОбмена);
		МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, "ПользовательскиеСправочники");
		ВыгрузитьПользовательскиеСправочникиXDTO(ПараметрыОбмена,МассивДанных, Операция);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов пользовательских справочников в XML завершена.", ПараметрыОбмена);
		
	ИначеЕсли Операция = "Контрагенты" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов контрагентов в XML.", ПараметрыОбмена);
		
		МассивДанных = ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, "Контрагенты");
		
		ВыгрузитьКонтрагентов(ПараметрыОбмена,МассивДанных, Операция);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов контрагентов в XML завершена.", ПараметрыОбмена);
		
		
	ИначеЕсли Операция = "Документы" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов документов в XML.", ПараметрыОбмена);

		ТаблицаДокументов 	= ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, "Документы", ЭтоДозагрузка);
		ВыгрузитьДокументы(ПараметрыОбмена, ТаблицаДокументов);

		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов документов в XML завершена.", ПараметрыОбмена);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеИзРегистраПакетовИУдалениеРегистрации(ПараметрыОбмена, Каталог, ЭтоДозагрузка = Ложь)
	
	Запрос = Новый Запрос;    	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б_ПакетныйОбмен.Объект,
	|	Б_ПакетныйОбмен.Пакет КАК Пакет,
	|	Б_ПакетныйОбмен.ТипОбъекта,
	|	Б_ПакетныйОбмен.ПользовательскийСправочник,
	|	Б_ПакетныйОбмен.Статус
	|ИЗ
	|	РегистрСведений.Б_ПакетныйОбмен КАК Б_ПакетныйОбмен
	|ГДЕ
	|	Б_ПакетныйОбмен.НастройкаОбмена = &Обмен
	|	И Б_ПакетныйОбмен.Каталог = &Каталог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пакет";
	Запрос.УстановитьПараметр("Обмен", ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("Каталог", Каталог);
	тзнДанных = Запрос.Выполнить().Выгрузить();
	
	Если Каталог = "Документы" И ПараметрыОбмена.ВыгружатьНаСайт И НЕ ЭтоДозагрузка тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.ЗаказПокупателя);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.РеализацияТоваровУслуг);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.ПриходныйКассовыйОрдер);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.ПлатежныйОрдерПоступлениеДенежныхСредств);
		ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Метаданные.Документы.ПлатежноеПоручениеВходящее);
	Иначе
				
		Если ПараметрыОбмена.ВыгружатьНаСайт тогда
			Для Каждого Данные Из тзнДанных Цикл    			
				Если Данные.ТипОбъекта <> "ТоварДляГруппы" тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Данные.Объект);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат тзнДанных; 	
	
КонецФункции

Функция РазборМассиваДанныхПоТипамОбъектов(МассивДанных)
	
	Результат 		= Новый Структура;
	
	СпкНоменклатура = Новый СписокЗначений;
	СпкСклады 		= Новый СписокЗначений;
	СпкТипыЦен 		= Новый СписокЗначений;
	СпкСвойства 	= Новый СписокЗначений;
	СпкСвойства 	= Новый СписокЗначений;
	СпкЕдиницы 		= Новый СписокЗначений;
	СпкСкидки 			= Новый СписокЗначений;
	СпкВидыДК 			= Новый СписокЗначений;
	СпкКартыЛояльности	= Новый СписокЗначений;
	
	Для каждого ТекСтр Из МассивДанных Цикл
		Если ТекСтр.ТипОбъекта = "Номенклатура" тогда
			СпкНоменклатура.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "Склад" тогда
			СпкСклады.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "ТипЦены" тогда
			СпкТипыЦен.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "Свойство" тогда
			СпкСвойства.Добавить(ТекСтр.Объект);
		ИначеЕсли ТекСтр.ТипОбъекта = "ЕдиницаИзмерения" тогда
			СпкЕдиницы.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "ВидДисконтнойКарты" тогда
			СпкВидыДК.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "Скидка" тогда
			СпкСкидки.Добавить(ТекСтр.Объект);	
		ИначеЕсли ТекСтр.ТипОбъекта = "ДисконтнаяКарта" тогда
			СпкКартыЛояльности.Добавить(ТекСтр.Объект);	
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("Номенклатура", СпкНоменклатура);
	Результат.Вставить("Склады"		, СпкСклады);
	Результат.Вставить("ТипыЦен"	, СпкТипыЦен);
	Результат.Вставить("Свойства"	, СпкСвойства);
	Результат.Вставить("Единицы"	, СпкЕдиницы);
	Результат.Вставить("Скидки"			, СпкСкидки);
	Результат.Вставить("ВидыДК"			, СпкВидыДК);
	Результат.Вставить("КартыЛояльности", СпкКартыЛояльности);
	
	Возврат Результат;
КонецФункции


// Процедура - Удаляет регистрацию измений данных, если они успешно выгружены на сайт
//
// Параметры:
//  Успешно					 - 	 Признак успешности выгрузки данных на сайт 
//  ПараметрыОбмена			 - 	 Настройки узла обмена 
//  Пакет					 - 	 Номер пакета данных 
//  ИдентификаторКаталога	 - 	 Идентификатор каталога(инфоблока), куда были выгружены данные 
//  МассивСтрок				 - 	 Массив данных, для которых нужно удалить регистрацию изменений, если обмен успешен  
//  МассивКартинок			 - 	 Массив картинок, для которых нужно удалить регистрацию изменений, если обмен успешен 
//  МассивФайлов			 - 	 Массив файлов, для которых нужно удалить регистрацию изменений, если обмен успешен 
Процедура УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(Успешно, ПараметрыОбмена, Операция, Пакет, ИдентификаторКаталога, МассивСтрок, МассивКартинок = Неопределено, МассивФайлов = Неопределено)
	
	ПараметрыОбмена.ОбменВыполненБезОшибок = ?(НЕ Успешно, Успешно, ПараметрыОбмена.ОбменВыполненБезОшибок);
	
	Если Успешно ИЛИ НЕ ПараметрыОбмена.ВыгружатьНаСайт тогда
		НаборЗаписей = РегистрыСведений.Б_ПакетныйОбмен.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пакет.Установить(Пакет);
		НаборЗаписей.Отбор.НастройкаОбмена.Установить(ПараметрыОбмена.Ссылка);
		НаборЗаписей.Отбор.Каталог.Установить(ИдентификаторКаталога);
		НаборЗаписей.Отбор.Операция.Установить(Операция);
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	//Если НЕ Успешно  тогда
	//	
	//	Для Каждого Данные Из МассивСтрок Цикл
	//		
	//		ПланыОбмена.ЗарегистрироватьИзменения(ПараметрыОбмена.Ссылка, Данные.Объект);
	//	
	//	КонецЦикла; 
	//	
	//КонецЕсли;
	
	Если Успешно  тогда
		
		Если МассивКартинок <> неопределено тогда
			Для Каждого Данные Из МассивКартинок Цикл
				ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Данные);
			КонецЦикла;
		КонецЕсли;                    		
		МассивКартинок = Неопределено;
		
		Если МассивФайлов <> неопределено тогда
			Для Каждого Данные Из МассивФайлов Цикл
				ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Данные);
			КонецЦикла;
		КонецЕсли;
		МассивФайлов = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Процедура - Удаляет регистрацию измений данных общей информации, если она успешно выгружены на сайт
//
// Параметры:
//  Успешно					 - 	 Признак успешности выгрузки данных на сайт 
//  ПараметрыОбмена			 - 	 Настройки узла обмена 
//  Пакет					 - 	 Номер пакета данных 
//  ИдентификаторКаталога	 - 	 Идентификатор каталога(инфоблока), куда были выгружены данные 
//  МассивСтрок				 - 	 Массив данных, для которых нужно удалить регистрацию изменений, если обмен успешен  
Процедура УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайтОбщейИнформации(Успешно, ПараметрыОбмена, Операция, Пакет, ИдентификаторКаталога, МассивСтрок)
	
	Если Успешно ИЛИ НЕ ПараметрыОбмена.ВыгружатьНаСайт тогда
		НаборЗаписей = РегистрыСведений.Б_ПакетныйОбмен.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пакет.Установить(Пакет);
		НаборЗаписей.Отбор.НастройкаОбмена.Установить(ПараметрыОбмена.Ссылка);
		НаборЗаписей.Отбор.Каталог.Установить(ИдентификаторКаталога);
		НаборЗаписей.Отбор.Операция.Установить(Операция);
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	Если Успешно  тогда
		
		Для Каждого Данные Из МассивСтрок Цикл
			
			Если Данные.ТипОбъекта <> "ТоварДляГруппы" тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыОбмена.Ссылка, Данные.Объект);
			КонецЕсли;
		
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовкаДанныхДереваГруппРекурсивно(ТаблицаТоваровДереваГрупп, ДеревоГрупп, ТаблицаГруппНоменклатурыДереваГрупп)
	 
	 Для Каждого СтрокаДерева Из ДеревоГрупп Цикл
		
		Для Каждого НоменклатураЭлемент Из СтрокаДерева.Номенклатура Цикл
			
			НоменклатураСсылка = НоменклатураЭлемент.Значение;
			
			Если НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если НоменклатураСсылка.ЭтоГруппа Тогда
				
				НовСтрока = ТаблицаГруппНоменклатурыДереваГрупп.Добавить();
				НовСтрока.ИдГруппы 		= СтрокаДерева.ИдГруппы;
				НовСтрока.Номенклатура 	= НоменклатураСсылка;
				
			КонецЕсли;
			
			НовСтрока = ТаблицаТоваровДереваГрупп.Добавить();
			НовСтрока.ИдГруппы 		= СтрокаДерева.ИдГруппы;
			НовСтрока.Номенклатура 	= НоменклатураСсылка;
	
		КонецЦикла;
		
		ПодготовкаДанныхДереваГруппРекурсивно(ТаблицаТоваровДереваГрупп, СтрокаДерева.Строки, ТаблицаГруппНоменклатурыДереваГрупп);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, ИмяФайла, ПараметрHTTP, Пакет)
	
	ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ИмяКаталога); 	
	Успешно = Ложь;
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СуществуетФайл(ИмяКаталога) тогда
		СоздатьКаталог(ИмяКаталога);	
	КонецЕсли;
	
	ПолноеИмяФайла = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows,ИмяКаталога +  "\" + ИмяФайла + "___" + Строка(Новый УникальныйИдентификатор) +  ".xml"); 
	
	МойXML = Новый ЗаписьXML;
	МойXML.ОткрытьФайл(ПолноеИмяФайла, "UTF-8");
	МойXML.ЗаписатьОбъявлениеXML();
	
	
	//XDTOКоммерческаяИнформация.Проверить();
	
	ПараметрыОбмена.МояФабрикаXDTO.ЗаписатьXML(МойXML, XDTOКоммерческаяИнформация, "КоммерческаяИнформация"); 
	МойXML.Закрыть();
	
	Если ПараметрыОбмена.ХранитьФайлыОбменаНаСайте И ПараметрыОбмена.ВыгружатьНаСайт И ПараметрыОбмена.ВыгружатьЛогНаСайт Тогда
		
		КаталогХранения 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогЛога + "\reports\" + СокрЛП(ПараметрыОбмена.Ссылка.Код) + "\" + ?(Пакет = 0, "", Строка(Пакет)));
		ПолноеИмяФайлаХранения 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, КаталогХранения +  "\" + ИмяФайла +  ".xml"); 
		
		Если НЕ Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СуществуетФайл(КаталогХранения) тогда
			СоздатьКаталог(КаталогХранения);	
		КонецЕсли;

		КопироватьФайл(ПолноеИмяФайла, ПолноеИмяФайлаХранения);
		
	КонецЕсли;	
	
	лПродолжатьПопытки 	= Истина;
	лЧислоПопыток		= 0;
	
	МассивПодкаталогов = Новый Массив;

	лВыгружатьКартинкиИФайлы = ?(ИмяФайла = "offers" , ПараметрыОбмена.ВыгружатьКартинкиИФайлыПредложений, ПараметрыОбмена.ВыгружатьКартинкиИФайлы);
		
	Если лВыгружатьКартинкиИФайлы Тогда
		
		МассивПодкаталогов.Добавить(ПараметрыОбмена.ПодкаталогФайлов);
		
	КонецЕсли;
	
	Если ПараметрыОбмена.ВыгружатьНаСайт тогда
		
		//Отправляем на сервер	
		
		Если ПараметрHTTP = "catalog" тогда

			МассивПодкаталогов = Новый Массив;
			
			Если ПараметрыОбмена.ВыгружатьКартинкиИФайлы Тогда


				МассивПодкаталогов.Добавить(ПараметрыОбмена.ПодкаталогФайлов);
				
			КонецЕсли;
		КонецЕсли;
		
		Пока лПродолжатьПопытки цикл
			
			Если лЧислоПопыток > 0 И ПараметрыОбмена.ТаймаутМеждуПовторамиНеудачноОтправленныхПакетах тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.Таймаут(ПараметрыОбмена.ТаймаутМеждуПовторамиНеудачноОтправленныхПакетах);
			КонецЕсли;
			
			Успешно = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ВыгрузитьДанныеНаСайт(ПараметрыОбмена, ИмяКаталога, ПолноеИмяФайла, МассивПодкаталогов, Истина, ПараметрHTTP);

			Если Успешно ИЛИ лЧислоПопыток = ПараметрыОбмена.ЧислоПовторовПриНеудачноОтправленныхПакетах тогда
				лПродолжатьПопытки = Ложь;
			КонецЕсли;

			лЧислоПопыток = лЧислоПопыток + 1;

		КонецЦикла;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.КаталогОчищен(ИмяКаталога, ПараметрыОбмена);	

	КонецЕсли;	
		
	Возврат Успешно;
	
КонецФункции


			///////////////////////////////////////////////////////////////////
			//			ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЙ ПАКЕТОВ            //
			/////////////////////////////////////////////////////////////////

			
// Процедура формирует пакеты данных, указанного типа
//
// Параметры:
//  ПараметрыОбмена	 - 	 Настройки узла обмена 
//  Операция		 - 	 Тип операции
Процедура ФормированиеПакетовДанных(ПараметрыОбмена, Операция) Экспорт
				
	//Группы товаров, склады, типы цен, ед. изм.	
	Если Операция = "ОбщаяИнформация" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакета для общих данных для товаров.", ПараметрыОбмена);	
		
		мТаблицаКаталогов 		 = ПараметрыОбмена.ТаблицаКаталогов;
		мТаблицаОтборовКаталогов = ПараметрыОбмена.ТаблицаОтборовКаталогов;
		//перебираем каталоги обмена	
		Для Каждого СтрокаТаблицыКаталогов Из мТаблицаКаталогов Цикл
			
			ПостроительЗапроса = Новый ПостроительОтчета;
			НайденнаяСтрокаСОтбором = мТаблицаОтборовКаталогов.Найти(СтрокаТаблицыКаталогов.ИдКаталога);
			
			ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОбщейИнформации(ПостроительЗапроса, ПараметрыОбмена);
			ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОбщейИнформации(ПостроительЗапроса, ПараметрыОбмена);

			Если НайденнаяСтрокаСОтбором <> Неопределено тогда  
				Если НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета <> Неопределено Тогда 
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета, Операция);
				КонецЕсли;
			КонецЕсли;	

			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			ДобавлениеТоваровВРегистрПакетов(ПостроительЗапроса, ПараметрыОбмена, СтрокаТаблицыКаталогов, Операция, 10000);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог + " Завершено", ПараметрыОбмена, Истина);
			
		КонецЦикла;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакета для для общих данных  для товаров завершено.", ПараметрыОбмена);	
		
	//Свойства	
	ИначеЕсли Операция = "Свойства" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для свойств.", ПараметрыОбмена);	
		
		мТаблицаКаталогов 		 = ПараметрыОбмена.ТаблицаКаталогов;
		мТаблицаОтборовКаталогов = ПараметрыОбмена.ТаблицаОтборовКаталогов;
		//перебираем каталоги обмена	
		Для Каждого СтрокаТаблицыКаталогов Из мТаблицаКаталогов Цикл
			
			ПостроительЗапроса = Новый ПостроительОтчета;
			НайденнаяСтрокаСОтбором = мТаблицаОтборовКаталогов.Найти(СтрокаТаблицыКаталогов.ИдКаталога);
						
			ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительСвойств(ПостроительЗапроса, ПараметрыОбмена);
			ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяСвойств(ПостроительЗапроса, ПараметрыОбмена);

			Если НайденнаяСтрокаСОтбором <> Неопределено тогда  
				
				Если НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета <> Неопределено Тогда 
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета, Операция);
				КонецЕсли;
				
			КонецЕсли;	

			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			ДобавлениеТоваровВРегистрПакетов(ПостроительЗапроса, ПараметрыОбмена, СтрокаТаблицыКаталогов, Операция, ПараметрыОбмена.КоличествоСвойствВПакете);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог + " Завершено", ПараметрыОбмена, Истина);
			
		КонецЦикла;

		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для свойств завершено.", ПараметрыОбмена);	
		
	//Товары	
	ИначеЕсли Операция = "Товары" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для товаров.", ПараметрыОбмена);	
		
		мТаблицаКаталогов 		 = ПараметрыОбмена.ТаблицаКаталогов;
		мТаблицаОтборовКаталогов = ПараметрыОбмена.ТаблицаОтборовКаталогов;
		
		//перебираем каталоги обмена	
		Для Каждого СтрокаТаблицыКаталогов Из мТаблицаКаталогов Цикл
			
			ПостроительЗапроса = Новый ПостроительОтчета;
			НайденнаяСтрокаСОтбором = мТаблицаОтборовКаталогов.Найти(СтрокаТаблицыКаталогов.ИдКаталога);
			
			ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительТоваров(ПостроительЗапроса, ПараметрыОбмена);
			ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяТоваров(ПостроительЗапроса, ПараметрыОбмена);

			Если НайденнаяСтрокаСОтбором <> Неопределено тогда  
				
				Если НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета <> Неопределено Тогда 
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета, Операция);
				КонецЕсли;
				
			КонецЕсли;	

			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
			ДобавлениеТоваровВРегистрПакетов(ПостроительЗапроса, ПараметрыОбмена, СтрокаТаблицыКаталогов, Операция, ПараметрыОбмена.КоличествоТоваровВПакете);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для каталога: " + СтрокаТаблицыКаталогов.Каталог + " Завершено", ПараметрыОбмена, Истина);
			
		КонецЦикла;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для товаров завершено.", ПараметрыОбмена);	
		
	//Скидки
	ИначеЕсли Операция = "Скидки" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для скидок.", ПараметрыОбмена);	
		
		ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "Скидки");
		
		ТаблицаОбъектовОбменаВыгрузки = ЗапросПостроителя.Выполнить().Выгрузить(); 
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, "Скидки", ПараметрыОбмена.КоличествоСкидокВПакете, Операция);
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для скидок завершено.", ПараметрыОбмена);	
		
	ИначеЕсли Операция = "КартыЛояльности" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование карт лояльности для скидок.", ПараметрыОбмена);	
		
		ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "КартыЛояльности");
		ТаблицаОбъектовОбменаВыгрузки = ЗапросПостроителя.Выполнить().Выгрузить(); 
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, "КартыЛояльности", ПараметрыОбмена.КоличествоКартЛояльностиВПакете, Операция);
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для карт лояльности завершено.", ПараметрыОбмена);	
		
	//Пользовательские Справочники
	ИначеЕсли Операция = "ПользовательскиеСправочники" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для пользовательских справочников.", ПараметрыОбмена, Истина);
		тзнСправочников = ПолучитьПользовательскиеСправочникиОбменаДляФормированияПакетов(ПараметрыОбмена);
		ЗагрузкаТаблицыДанныхВРегистрПакетов(тзнСправочников, ПараметрыОбмена, "ПользовательскиеСправочники", ПараметрыОбмена.КоличествоЭлементовСправочникаВПакете, Операция);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для пользовательских справочников завершено.", ПараметрыОбмена, Истина);
		
		//Контрагенты 
	ИначеЕсли Операция = "Контрагенты" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для контрагентов.", ПараметрыОбмена);	
		
		ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "Контрагенты");
		ТаблицаОбъектовОбменаВыгрузки = ЗапросПостроителя.Выполнить().Выгрузить(); 
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, "Контрагенты", ПараметрыОбмена.КоличествоКонтрагентовВПакете, Операция);
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для контрагентов завершено.", ПараметрыОбмена);	
		
	//Документы 
		
	ИначеЕсли Операция = "Документы" тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для документов", ПараметрыОбмена);	
		
		ТаблицаОбъектовОбменаВыгрузки = ПолучитьТаблицуДанныхДляПакетовКонтейнеровДокументов(ПараметрыОбмена, Операция);
		ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, Операция, ПараметрыОбмена.КоличествоДокументовВПакете, Операция);
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формирование пакетов для документов завершено", ПараметрыОбмена);	
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, ИдентификаторКаталога, КоличествоДанныхВПакете, Операция)
	
	ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Пакет");
	ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Каталог");
	ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("НастройкаОбмена");
	ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Операция");
	
	ТаблицаОбъектовОбменаВыгрузки.Сортировать("ТипОбъекта");
	
	РазбивкаТаблицыДанныхНаПакеты(ТаблицаОбъектовОбменаВыгрузки, КоличествоДанныхВПакете, Операция, ПараметрыОбмена, ИдентификаторКаталога);
	
	НаборЗаписей = РегистрыСведений.Б_ПакетныйОбмен.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Каталог.установить(ИдентификаторКаталога);
	НаборЗаписей.Отбор.НастройкаОбмена.установить(ПараметрыОбмена.Ссылка);
	НаборЗаписей.Отбор.Операция.установить(Операция);
	НаборЗаписей.Загрузить(ТаблицаОбъектовОбменаВыгрузки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура РазбивкаТаблицыДанныхНаПакеты(Таблица, КоличествоВПакете, Операция, Узел, Каталог)
	
	мОбъектыПакетов = Новый Массив;
	мОбъектыПакетов.Добавить("Номенклатура");
	мОбъектыПакетов.Добавить("Свойство");
	мОбъектыПакетов.Добавить("Скидка");
	мОбъектыПакетов.Добавить("ДисконтнаяКарта");
	мОбъектыПакетов.Добавить("ПользовательскийСправочник");
	мОбъектыПакетов.Добавить("Контрагент");
	мОбъектыПакетов.Добавить("Заказ");
	мОбъектыПакетов.Добавить("Отгрузка");
	мОбъектыПакетов.Добавить("Оплата");
	
	Итератор 	= 0;
	Пакет 		= 1;
	
	Для каждого ТекСтр из Таблица Цикл
		
		Если  мОбъектыПакетов.Найти(ТекСтр.ТипОбъекта) = Неопределено тогда
			ТекСтр.Пакет 			= 0;
			ТекСтр.Каталог  		= Каталог;
			ТекСтр.НастройкаОбмена 	= Узел.Ссылка;
			ТекСтр.Операция 		= Операция;
			
		Иначе
					
			Итератор = Итератор + 1;

			Если Итератор > КоличествоВПакете тогда
				Пакет = Пакет + 1;
				Итератор = 1;
			КонецЕсли;
			
			ТекСтр.НастройкаОбмена 	= Узел.Ссылка;
			ТекСтр.Каталог 			= Каталог;
			ТекСтр.Пакет 			= Пакет;
			ТекСтр.Операция 		= Операция;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПользовательскиеСправочникиОбменаДляФормированияПакетов(ПараметрыОбмена)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Объект");
	Результат.Колонки.Добавить("ТипОбъекта");
	Результат.Колонки.Добавить("ПользовательскийСправочник");
	
	тзнСправочников = ПараметрыОбмена.ВыгружаемыеПоляСправочников.Скопировать();
	тзнСправочников.Свернуть("Справочник");
	
	Для каждого ТекСпр из тзнСправочников Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользовательскийСправочник.Ссылка КАК Объект
		|ИЗ
		|	Справочник." +  ТекСпр.Справочник + " КАК ПользовательскийСправочник
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПользовательскийСправочник.Ссылка В
		|					(ВЫБРАТЬ
		|						ПользовательскийСправочникИзменений.Ссылка
		|					ИЗ
		|						Справочник." +  ТекСпр.Справочник + ".Изменения КАК ПользовательскийСправочникИзменений
		|					ГДЕ
		|						ПользовательскийСправочникИзменений.Узел = &Узел)
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Узел",ПараметрыОбмена.Ссылка);
		Запрос.УстановитьПараметр("ПолнаяВыгрузка",(НЕ ПараметрыОбмена.ВыгружатьТолькоИзменения ИЛИ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно));
		
		ВыборкаЗначений = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗначений.Следующий() Цикл
			
			НовСтр = результат.Добавить();
			НовСтр.Объект 		= ВыборкаЗначений.Объект;
			НовСтр.ТипОбъекта	= "ПользовательскийСправочник";
			
			НовСтр.ПользовательскийСправочник = ТекСпр.Справочник;
			
		КонецЦикла;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавлениеТоваровВРегистрПакетов(ПостроительЗапроса, ПараметрыОбмена, СтрокаТаблицыКаталогов, Операция, КоличествоПакетов)
	
	Если  Операция <> "Свойства" тогда
		
		ИмяОтбораПоДеревуГрупп 	= "ОтборПоДеревуГрупп";
		ОтборПоКаталогу 		= "ОтборПоКаталогу";
		
		Пока Истина Цикл
			ЭлементОтбора = ПостроительЗапроса.Отбор.Найти(ИмяОтбораПоДеревуГрупп);
			Если ЭлементОтбора = НеОпределено Тогда
				Прервать;
			Иначе
				ПостроительЗапроса.Отбор.Удалить(ПостроительЗапроса.Отбор.Индекс(ЭлементОтбора));
			КонецЕсли;
		КонецЦикла;
		
		Пока Истина Цикл
			ЭлементОтбора = ПостроительЗапроса.Отбор.Найти(ОтборПоКаталогу);
			Если ЭлементОтбора = НеОпределено Тогда
				Прервать;
			Иначе
				ПостроительЗапроса.Отбор.Удалить(ПостроительЗапроса.Отбор.Индекс(ЭлементОтбора));
			КонецЕсли;
		КонецЦикла;
		
		мДеревоГрупп = СтрокаТаблицыКаталогов.ДеревоГрупп;
		мСписокГруппКаталога = СтрокаТаблицыКаталогов.Группы;
		
		Если ЗначениеЗаполнено(мДеревоГрупп) Тогда
			
		
			СписокНоменклатурыДереваГрупп  = Новый СписокЗначений;
			
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Б_ПользовательскиеГруппыТоваровТовары.Номенклатура
			|ИЗ
			|	Справочник.Б_ПользовательскиеГруппыТоваров.Товары КАК Б_ПользовательскиеГруппыТоваровТовары
			|ГДЕ
			|	Б_ПользовательскиеГруппыТоваровТовары.Ссылка В ИЕРАРХИИ (&ДеревоГрупп)";
			
			Запрос.УстановитьПараметр("ДеревоГрупп", мДеревоГрупп);
			тзнТоваров = Запрос.Выполнить().Выгрузить();
			СписокНоменклатурыДереваГрупп.ЗагрузитьЗначения(тзнТоваров.ВыгрузитьКолонку("Номенклатура"));
			
			Если СписокНоменклатурыДереваГрупп.Количество() > 0 Тогда
				
				НайденныйОтбор = ПостроительЗапроса.Отбор.Найти("Номенклатура");
				
				Если НайденныйОтбор <> Неопределено тогда   			
					НовыйОтбор = ПостроительЗапроса.Отбор.Добавить("Номенклатура", ИмяОтбораПоДеревуГрупп);
					НовыйОтбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
					НовыйОтбор.Значение = СписокНоменклатурыДереваГрупп;
					НовыйОтбор.Использование = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ТипЗнч(мСписокГруппКаталога) = Тип("СписокЗначений") Тогда
				Если мСписокГруппКаталога.Количество() > 0 Тогда
					Если ПараметрыОбмена.КлассифицироватьПоЦеновымГруппам Тогда
						Отбор = ПостроительЗапроса.Отбор.Добавить("Номенклатура.ЦеноваяГруппа", ОтборПоКаталогу);
					Иначе
						Отбор = ПостроительЗапроса.Отбор.Добавить("Номенклатура", ОтборПоКаталогу);
					КонецЕсли;
					Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
					Отбор.Значение = мСписокГруппКаталога;
					Отбор.Использование = Истина;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//разбиваем на пакеты
	     
	ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
	ТаблицаОбъектовОбменаВыгрузки = ЗапросПостроителя.Выполнить().Выгрузить(); 
	
	ЗагрузкаТаблицыДанныхВРегистрПакетов(ТаблицаОбъектовОбменаВыгрузки, ПараметрыОбмена, СтрокаТаблицыКаталогов.ИдКаталога, КоличествоПакетов, Операция);	
	
КонецПроцедуры


Функция ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, ТипДанных) Экспорт
	
	Если ТипДанных = "Скидки" тогда
		
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительСкидок(ПостроительЗапроса, ПараметрыОбмена.Ссылка);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяСкидок(ПостроительЗапроса, ПараметрыОбмена.Ссылка);
		
		Если ПараметрыОбмена.ПостроительОтчетаСкидок <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаСкидок, Операция);
		КонецЕсли;
		
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	ИначеЕсли ТипДанных = "КартыЛояльности" тогда
		
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительКартЛояльности(ПостроительЗапроса, ПараметрыОбмена.Ссылка);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяКартЛояльности(ПостроительЗапроса, ПараметрыОбмена.Ссылка);
		
		Если ПараметрыОбмена.ПостроительОтчетаКартЛояльности <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаКартЛояльности, Операция);
		КонецЕсли;
		
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	ИначеЕсли ТипДанных = "Контрагенты" тогда
		
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительКонтрагентов(ПостроительЗапроса		, ПараметрыОбмена);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяКонтрагентов(ПостроительЗапроса	, ПараметрыОбмена);
		
		Если ПараметрыОбмена.ПостроительОтчетаКонтрагентов <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаКонтрагентов, Операция);
		КонецЕсли;
		
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	ИначеЕсли ТипДанных = "Заказы" тогда
	
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительЗаказов(ПостроительЗапроса, ПараметрыОбмена);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяЗаказов(ПостроительЗапроса, ПараметрыОбмена);
		
		Если ПараметрыОбмена.ПостроительОтчетаЗаказов <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаЗаказов, Операция);
		КонецЕсли;
		
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	ИначеЕсли ТипДанных = "Оплаты" тогда
		
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОплат(ПостроительЗапроса, ПараметрыОбмена);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОплат(ПостроительЗапроса, ПараметрыОбмена);
			
		Если ПараметрыОбмена.ПостроительОтчетаОплат <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаОплат, Операция);
		КонецЕсли;
			
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	ИначеЕсли ТипДанных = "Отгрузки" тогда
		
		ПостроительЗапроса = Новый ПостроительОтчета;
		ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительОтгрузок(ПостроительЗапроса, ПараметрыОбмена);
		ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяОтгрузок(ПостроительЗапроса, ПараметрыОбмена);
			
		Если ПараметрыОбмена.ПостроительОтчетаОтгрузок <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, ПараметрыОбмена.ПостроительОтчетаОтгрузок, Операция);
		КонецЕсли;
			
		ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
		
	КонецЕсли;
	
	Возврат ЗапросПостроителя; 
	
КонецФункции






 
			///////////////////////////////////////////////////////////////////
			//			    ВЫГРУЗКА ИНФОРМАЦИИ О ТОВАРАХ                   //
			/////////////////////////////////////////////////////////////////

			
// Процедура - выгружает общую информацию в XDTO
//
// Параметры:
//  ПараметрыОбмена			 - 	 Настройки узла обмена 
//  МассивДанных			 - 	 Массив выгружаеммых данных 
//  СтрокаТаблицыКаталогов	 - 	 Информация о каталоге(инфоблоке), куда выгружается информация 
//  НомерСтроки				 - 	 Номер каталога 
Процедура ВыгрузитьОбщуюИнформацию(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, НомерСтроки)
	
	СписокТоваров 		= Новый СписокЗначений;
	СписокСкладов 		= Новый СписокЗначений;
	СписокСоглашений	= Новый СписокЗначений;
	
	Успешно = Ложь;
	
	ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
	
	XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");
	XDTOКаталогТип 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Каталог");
	XDTOКлассификаторТип 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Классификатор");
	XDTOПакетПредложенийТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПакетПредложений");
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
	
	МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", 0));	
	
	Если МассивСтрок.Количество() > 0 тогда
		
		РазбитаяСтруктураДанных = РазборМассиваДанныхПоТипамОбъектов(МассивСтрок);
		
		НовСтрокаКэша = ПараметрыОбмена.КэшДанных.Добавить();
		НовСтрокаКэша.ИдКаталога 					= СтрокаТаблицыКаталогов.ИдКаталога;
		НовСтрокаКэша.ОбщийСписокСкладов 			= РазбитаяСтруктураДанных.Склады;
		НовСтрокаКэша.ОбщийСписокТиповЦен 			= РазбитаяСтруктураДанных.ТипыЦен;
		НовСтрокаКэша.ОбщийСписокЕдиницИзмерений 	= РазбитаяСтруктураДанных.Единицы;
		
	
		лМенеджерВременныхТаблиц 	= СформироватьВременныеТаблицыПоОбщейИнформации(ПараметрыОбмена, РазбитаяСтруктураДанных.Склады, РазбитаяСтруктураДанных.ТипыЦен, РазбитаяСтруктураДанных.Единицы);
		
		XDTOКаталог 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКаталогТип); 
		XDTOКаталог.Ид				= СтрокаТаблицыКаталогов.ИдКаталога;
		XDTOКаталог.ИдКлассификатора= СтрокаТаблицыКаталогов.ИдКаталога;
		XDTOКаталог.Наименование	= СтрокаТаблицыКаталогов.Каталог;
		XDTOКаталог.Описание 		= СтрокаТаблицыКаталогов.Каталог;
		XDTOКаталог.СодержитТолькоИзменения = XMLСтрока(Истина);
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка справочных данных.", ПараметрыОбмена);
		
		ИмяКаталога = ПараметрыОбмена.КаталогНаДиске; 
		
		
		//выгрузка классификатора
		XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
		
		XDTOКлассификатор 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКлассификаторТип); 
		XDTOКлассификатор.Ид            = СтрокаТаблицыКаталогов.ИдКаталога;
		XDTOКлассификатор.Наименование  = СтрокаТаблицыКаталогов.Каталог;
		XDTOКлассификатор.СодержитТолькоИзменения 	= XMLСтрока(Истина);
		
		ВыгрузитьГруппы(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, СтрокаТаблицыКаталогов);   
		
		ВыгрузитьЕдиницыИзмеренияXDTO(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, лМенеджерВременныхТаблиц);
		
		Если ПараметрыОбмена.ВыгружатьОстаткиПоСкладам тогда
			ВыгрузитьСкладыXDTO(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, лМенеджерВременныхТаблиц);
		КонецЕсли;
		Если ПараметрыОбмена.ВыгружатьЦены тогда
			ВыгрузитьТипыЦенXDTO(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, лМенеджерВременныхТаблиц);
		КонецЕсли;
		
		XDTOКоммерческаяИнформация.Классификатор 	= XDTOКлассификатор;
		XDTOКоммерческаяИнформация.Каталог 			= XDTOКаталог;
		
		Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "import" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", 0);		
		
		УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайтОбщейИнформации(Успешно, ПараметрыОбмена, Операция, 0, СтрокаТаблицыКаталогов.ИдКаталога, МассивСтрок);
		
		лМенеджерВременныхТаблиц.Закрыть();
		
		
	КонецЕсли;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Завершение выгрузки пакета с общей информацией каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
	
КонецПроцедуры

// Функция - формирует временные таблицы с информацией о общей информации
//
// Параметры:
//  ПараметрыОбмена	 - 	 Настройки узла обмена 
//  СписокСкладов	 - 	 Список выгружаемых складов 
//  СписокСоглашений - 	 Список выгружаемых соглашений 
//  СписокЕдиниц	 - 	 Список выгружаемых единиц измерений 
// Возвращаемое значение:
//   Менеджер временных таблиц, хранящий информацию о общей информации 
Функция СформироватьВременныеТаблицыПоОбщейИнформации(ПараметрыОбмена, СписокСкладов, СписокТиповЦен, СписокЕдиниц)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Узел"	, ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("ТекДата"	, ТекущаяДата());
	
	Запрос.УстановитьПараметр("СписокСкладов"	, СписокСкладов);
	Запрос.УстановитьПараметр("СписокТиповЦен"	, СписокТиповЦен);
	Запрос.УстановитьПараметр("СписокЕдиниц" 	, СписокЕдиниц);
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦены,
	|	ТипыЦенНоменклатуры.ВерсияДанных,
	|	ТипыЦенНоменклатуры.ПометкаУдаления,
	|	ТипыЦенНоменклатуры.Наименование,
	|	ТипыЦенНоменклатуры.Рассчитывается,
	|	ТипыЦенНоменклатуры.ПроцентСкидкиНаценки,
	|	ТипыЦенНоменклатуры.ЦенаВключаетНДС,
	|	ТипыЦенНоменклатуры.СпособРасчетаЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены.Наименование КАК ВалютаЦеныКод,
	|	ТипыЦенНоменклатуры.БазовыйТипЦен,
	|	ВЫБОР
	|		КОГДА ТипыЦенНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ТипыЦенНоменклатуры.Ссылка
	|		ИНАЧЕ ТипыЦенНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор
	|ПОМЕСТИТЬ ВремТипыЦен
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|ГДЕ
	|	ТипыЦенНоменклатуры.Ссылка В(&СписокТиповЦен)
	|{ГДЕ
	|	ТипыЦенНоменклатуры.Ссылка.* КАК ТипЦен}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Склад,
	|	ВЫБОР
	|		КОГДА Склады.Б_Идентификатор = """"
	|			ТОГДА Склады.Ссылка
	|		ИНАЧЕ Склады.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	Склады.ВерсияДанных КАК ВерсияДанных,
	|	Склады.Наименование,
	|	Склады.ПометкаУдаления,
	|	Склады.Код,
	|	Склады.ВидСклада,
	|	Склады.Комментарий
	|ПОМЕСТИТЬ ВремСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|	И Склады.Ссылка В(&СписокСкладов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА КлассификаторЕдиницИзмерения.Б_Идентификатор = """"
	|			ТОГДА КлассификаторЕдиницИзмерения.Код
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	КлассификаторЕдиницИзмерения.ВерсияДанных,
	|	КлассификаторЕдиницИзмерения.ПометкаУдаления,
	|	КлассификаторЕдиницИзмерения.Наименование,
	|	КлассификаторЕдиницИзмерения.НаименованиеПолное,
	|	КлассификаторЕдиницИзмерения.МеждународноеСокращение,
	|	КлассификаторЕдиницИзмерения.Код
	|ПОМЕСТИТЬ ВремЕдиницыИзмерения
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Ссылка В(&СписокЕдиниц)";
	
	
	лМенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= лМенеджерВременныхТаблиц; 
	Запрос.Текст = ТекстЗапроса;
	запрос.Выполнить();	
	
	Возврат лМенеджерВременныхТаблиц;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ВыгрузитьСкладыXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка складов в XML.", ПараметрыОбмена);
	Итератор = 0;

	XDTOСкладыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склады", Истина, ВладелецТип);	
	XDTOСклады 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладыТип); 
	
	XDTOСкладТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склад");	
	
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремСклады КАК ВремСклады";
	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСкладов.Следующий() Цикл
		
		XDTOСклад 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладТип); 
		
		XDTOСклад.Ид				= XMLСтрока(ВыборкаСкладов.Идентификатор);
		XDTOСклад.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаСкладов.ВерсияДанных, "Складов");
		XDTOСклад.ПометкаУдаления	= XMLСтрока(ВыборкаСкладов.ПометкаУдаления);
		XDTOСклад.Наименование		= ВыборкаСкладов.Наименование;
		XDTOСклад.Комментарий		= ВыборкаСкладов.Комментарий;
		
		XDTOСклады.Склад.Добавить(XDTOСклад);
		
		Итератор = Итератор + 1;
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка складов в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВремСклады");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

	Если XDTOСклады.Склад.Количество() > 0 тогда
		Владелец.Склады = XDTOСклады;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьЕдиницыИзмеренияXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка единиц измерения в XML.", ПараметрыОбмена);
	Итератор = 0;
	
	XDTOЕдиницыИзмеренияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЕдиницыИзмерения", Истина, ВладелецТип);	
	XDTOЕдиницыИзмерения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЕдиницыИзмеренияТип); 
	
	XDTOЕдиницаИзмеренияТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЕдиницаИзмерения");	
	
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремЕдиницыИзмерения КАК ВремЕдиницыИзмерения";
	ВыборкаЕдиниц = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЕдиниц.Следующий() Цикл
		
		XDTOЕдиницаИзмерения		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЕдиницаИзмеренияТип); 
		
		XDTOЕдиницаИзмерения.Ид					= XMLСтрока(ВыборкаЕдиниц.Идентификатор);
		XDTOЕдиницаИзмерения.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаЕдиниц.ВерсияДанных, "Единиц измерений");
		XDTOЕдиницаИзмерения.НаименованиеКраткое= Лев(ВыборкаЕдиниц.Наименование,3);
		XDTOЕдиницаИзмерения.ПометкаУдаления	= XMLСтрока(ВыборкаЕдиниц.ПометкаУдаления);
		XDTOЕдиницаИзмерения.Код				= Лев(ВыборкаЕдиниц.Код,4);
		XDTOЕдиницаИзмерения.НаименованиеПолное = ВыборкаЕдиниц.НаименованиеПолное;
		XDTOЕдиницаИзмерения.МеждународноеСокращение = Лев(ВыборкаЕдиниц.МеждународноеСокращение,3);

		
		XDTOЕдиницыИзмерения.ЕдиницаИзмерения.Добавить(XDTOЕдиницаИзмерения);
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка единиц измерения в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВремЕдиницыИзмерения");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Владелец.ЕдиницыИзмерения = XDTOЕдиницыИзмерения;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьТипыЦенXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка типов цен в XML.", ПараметрыОбмена);
	Итератор = 0;
	
	XDTOТипыЦенТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ТипыЦен", Истина, ВладелецТип);	
	XDTOТипыЦен 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТипыЦенТип); 
	
	XDTOТипЦеныТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ТипЦены");	
	
	XDTOНалогТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налог", Истина, XDTOТипЦеныТип);	
	
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТипыЦен КАК ВремТипыЦен";
	ВыборкаТиповЦен = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТиповЦен.Следующий() Цикл
		
		XDTOТипЦены 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТипЦеныТип); 
		
		XDTOТипЦены.Ид				= XMLСтрока(ВыборкаТиповЦен.Идентификатор);
		XDTOТипЦены.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаТиповЦен.ВерсияДанных, "Типов цен");
		XDTOТипЦены.Наименование	= ВыборкаТиповЦен.Наименование;
		XDTOТипЦены.ПометкаУдаления	= XMLСтрока(ВыборкаТиповЦен.ПометкаУдаления);
		XDTOТипЦены.Валюта			= Лев(ВыборкаТиповЦен.ВалютаЦеныКод, 3 );
		
		XDTOНалог				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
		XDTOНалог.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
		XDTOНалог.УчтеноВСумме 	= ВыборкаТиповЦен.ЦенаВключаетНДС;
		
		XDTOТипЦены.Налог.Добавить(XDTOНалог);
		
		XDTOТипыЦен.ТипЦены.Добавить(XDTOТипЦены);
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка типов цен в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВремТипыЦен");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Владелец.ТипыЦен = XDTOТипыЦен;
	
КонецПроцедуры



			///////////////////////////////////////////////////////////////////
			//				ВЫГРУЗКА ГРУПП ТОВАРОВ                          //
			/////////////////////////////////////////////////////////////////

Процедура ВыгрузитьГруппы(ПараметрыОбмена, Владелец, ВладелецТип, СтрокаТаблицыКаталогов)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка групп в XML.", ПараметрыОбмена);
	
	XDTOГруппыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группы", Истина, ВладелецТип);
	XDTOГруппы 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип); 

	Итератор = 0;
	ДеревоГрупп = СтрокаТаблицыКаталогов.ДеревоГрупп;                                        
	
	Если ЗначениеЗаполнено(ДеревоГрупп) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДеревоГрупп", ДеревоГрупп);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Б_ПользовательскиеГруппыТоваров.Ссылка КАК Группа,
		|	Б_ПользовательскиеГруппыТоваров.ИдентификаторРаздела,
		|	Б_ПользовательскиеГруппыТоваров.Инфоблок,
		|	Б_ПользовательскиеГруппыТоваров.Наименование,
		|	Б_ПользовательскиеГруппыТоваров.ПометкаУдаления,
		|	Б_ПользовательскиеГруппыТоваров.ВерсияДанных
		|ИЗ
		|	Справочник.Б_ПользовательскиеГруппыТоваров КАК Б_ПользовательскиеГруппыТоваров
		|ГДЕ
		|	Б_ПользовательскиеГруппыТоваров.Ссылка В ИЕРАРХИИ(&ДеревоГрупп)
		|ИТОГИ ПО
		|	Группа ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ДеревоГрупп = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ВыгрузитьГруппыРекурсивноПоДеревуГруппXDTO(ПараметрыОбмена, XDTOГруппы, ДеревоГрупп.Строки, Итератор);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Узел",ПараметрыОбмена.Ссылка);
		Запрос.УстановитьПараметр("Каталог",СтрокаТаблицыКаталогов.ИдКаталога);
		Запрос.УстановитьПараметр("ТипОбъекта","ТоварДляГруппы");
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Б_ПакетныйОбмен.Объект,
		|	ВЫРАЗИТЬ(Б_ПакетныйОбмен.Объект КАК Справочник.Номенклатура).ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВЫРАЗИТЬ(Б_ПакетныйОбмен.Объект КАК Справочник.Номенклатура).Наименование КАК Наименование
		|ПОМЕСТИТЬ ВремНоменклатура
		|ИЗ
		|	РегистрСведений.Б_ПакетныйОбмен КАК Б_ПакетныйОбмен
		|ГДЕ
		|	Б_ПакетныйОбмен.НастройкаОбмена = &Узел
		|	И Б_ПакетныйОбмен.Каталог = &Каталог
		|	И Б_ПакетныйОбмен.ТипОбъекта = &ТипОбъекта ;";
		
		ТекстЗапросаГруппыНоменклатуры =
		"ВЫБРАТЬ
		|	ВремНоменклатура.Объект КАК Объект,
		|	ВремНоменклатура.Наименование КАК Наименование,
		|	ВремНоменклатура.Объект.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	ВремНоменклатура КАК ВремНоменклатура
		|ИТОГИ ПО
		|	Объект ТОЛЬКО ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ТекстЗапросаЦеновыеГруппы =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВремНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
		|ИЗ
		|	ВремНоменклатура КАК ВремНоменклатура
		|ИТОГИ ПО
		|	ЦеноваяГруппа ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Если ПараметрыОбмена.КлассифицироватьПоЦеновымГруппам тогда
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаЦеновыеГруппы;	
		Иначе
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаГруппыНоменклатуры;	
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		ДеревоГрупп = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если ПараметрыОбмена.КлассифицироватьПоЦеновымГруппам Тогда
			
			ВыгрузитьГруппыРекурсивноПоЦеновымГруппамXDTO(ПараметрыОбмена, XDTOГруппы, ДеревоГрупп.Строки, СтрокаТаблицыКаталогов.Группы, Итератор);
			
		Иначе
			
			ВыгрузитьГруппыРекурсивноXDTO(ПараметрыОбмена, XDTOГруппы, ДеревоГрупп.Строки, СтрокаТаблицыКаталогов.Группы, Итератор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка групп в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Если XDTOГруппы.Группа.количество() > 0 тогда
		Владелец.Группы = XDTOГруппы;
	КонецЕсли;
	
КонецПроцедуры

Функция НужноВыгружатьГруппу(СписокГрупп, Элемент)
	
	Если ТипЗнч(СписокГрупп) = Тип("СписокЗначений") Тогда
		Для Каждого Группа Из СписокГрупп Цикл
			Если Элемент.ПринадлежитЭлементу(Группа.Значение) ИЛИ Элемент = Группа.Значение Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыгрузитьГруппыРекурсивноПоДеревуГруппXDTO(ПараметрыОбмена, Владелец, ДеревоГрупп, Итератор, ТекущийРодитель = НеОпределено);
	
	XDTOГруппаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Группа");
	XDTOГруппыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Группы", Истина, XDTOГруппаТип);

	Для Каждого СтрокаДерева Из ДеревоГрупп Цикл
		
		Если СтрокаДерева.Группа = ТекущийРодитель Тогда
			Продолжить;
		КонецЕсли;
				
		Если СтрокаДерева.Инфоблок тогда
			ВыгрузитьГруппыРекурсивноПоДеревуГруппXDTO(ПараметрыОбмена, Владелец, СтрокаДерева.Строки, Итератор, СтрокаДерева.Группа);
		Иначе
			
			XDTOГруппа 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаТип); 
	        XDTOГруппа.Ид 				= XMLСтрока(СтрокаДерева.ИдентификаторРаздела);
			XDTOГруппа.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаДерева.ВерсияДанных, "Групп");
			XDTOГруппа.ПометкаУдаления 	= XMLСтрока(СтрокаДерева.ПометкаУдаления);
	        XDTOГруппа.Наименование 	= Лев(СтрокаДерева.Наименование, 250);
			
			XDTOГруппы 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип); 

			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				
				ВыгрузитьГруппыРекурсивноПоДеревуГруппXDTO(ПараметрыОбмена, XDTOГруппы, СтрокаДерева.Строки, Итератор, СтрокаДерева.Группа);
				Если XDTOГруппы.Группа.количество() > 0 тогда
					XDTOГруппа.Группы = XDTOГруппы;
				КонецЕсли;
			КонецЕсли;

			Итератор = Итератор + 1;
			Владелец.Группа.Добавить(XDTOГруппа);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ВыгрузитьГруппыРекурсивноXDTO(ПараметрыОбмена, Владелец, ДеревоГрупп, СписокГрупп, Итератор, СоздаватьНовыйУровеньГрупп = Истина, ТекущийРодитель = НеОпределено);
	
	XDTOГруппаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группа");
	XDTOГруппыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группы", Истина, XDTOГруппаТип);
	
	Для Каждого СтрокаДерева Из ДеревоГрупп Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДерева.Объект) Тогда 
            Продолжить;    
		КонецЕсли;  
		
		Если НЕ СтрокаДерева.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Объект = ТекущийРодитель Тогда
			Продолжить;
		КонецЕсли;
				
		XDTOГруппы 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип); 
		Если ЭтоГруппаВерхнегоУровня(СтрокаДерева.Объект, СписокГрупп) Тогда
			
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				
				Если НужноВыгружатьГруппу(СписокГрупп, СтрокаДерева.Объект) тогда
					ВыгрузитьГруппыРекурсивноXDTO(ПараметрыОбмена, XDTOГруппы, СтрокаДерева.Строки, СписокГрупп, Итератор, Ложь);
					
					XDTOГруппа 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаТип); 
					XDTOГруппа.Ид 				= XMLСтрока(?(СтрокаДерева.Объект.Б_Идентификатор = "", СтрокаДерева.Объект, ПолучитьИдентификаторГруппы(XMLСтрока(СтрокаДерева.Объект.Б_Идентификатор))));
					XDTOГруппа.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаДерева.Объект.ВерсияДанных, "Групп");
					XDTOГруппа.ПометкаУдаления 	= XMLСтрока(СтрокаДерева.Объект.ПометкаУдаления);
					XDTOГруппа.Наименование 	= Лев(СтрокаДерева.Объект.Наименование, 250);
					
					XDTOГруппа.Группы 			= XDTOГруппы;
					
					Итератор = Итератор + 1;
					Владелец.Группа.Добавить(XDTOГруппа);
					
				Иначе
					ВыгрузитьГруппыРекурсивноXDTO(ПараметрыОбмена, Владелец, СтрокаДерева.Строки, СписокГрупп, Итератор, Ложь);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			XDTOГруппа 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаТип); 
			XDTOГруппа.Ид 				= XMLСтрока(?(СтрокаДерева.Объект.Б_Идентификатор = "", СтрокаДерева.Объект, ПолучитьИдентификаторГруппы(СтрокаДерева.Объект.Б_Идентификатор)));
			XDTOГруппа.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаДерева.Объект.ВерсияДанных, "Групп");
			XDTOГруппа.ПометкаУдаления 	= XMLСтрока(СтрокаДерева.Объект.ПометкаУдаления);
			XDTOГруппа.Наименование 	= Лев(СтрокаДерева.Объект.Наименование, 250);
			
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				ВыгрузитьГруппыРекурсивноXDTO(ПараметрыОбмена, XDTOГруппы, СтрокаДерева.Строки, СписокГрупп, Итератор,, СтрокаДерева.Объект);
				Если XDTOГруппы.Группа.количество() > 0 тогда
					XDTOГруппа.Группы = XDTOГруппы;
				КонецЕсли;
			КонецЕсли;
			
			Итератор = Итератор + 1;
			Владелец.Группа.Добавить(XDTOГруппа);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьГруппыРекурсивноПоЦеновымГруппамXDTO(ПараметрыОбмена, Владелец, ДеревоГрупп, СписокГрупп, Итератор, СоздаватьНовыйУровеньГрупп = Истина, ТекущийРодитель = НеОпределено);
	
	XDTOГруппаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группа");
	XDTOГруппыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группы", Истина, XDTOГруппаТип);
	
	Для Каждого СтрокаДерева Из ДеревоГрупп Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДерева.ЦеноваяГруппа) Тогда 
            Продолжить;    
		КонецЕсли;  
		
		Если СтрокаДерева.ЦеноваяГруппа = ТекущийРодитель Тогда
			Продолжить;
		КонецЕсли;
				
		XDTOГруппы 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип); 
		Если ЭтоГруппаВерхнегоУровня(СтрокаДерева.ЦеноваяГруппа, СписокГрупп) Тогда
			
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				
				Если НужноВыгружатьГруппу(СписокГрупп, СтрокаДерева.ЦеноваяГруппа) тогда
					ВыгрузитьГруппыРекурсивноПоЦеновымГруппамXDTO(ПараметрыОбмена, XDTOГруппы, СтрокаДерева.Строки, СписокГрупп, Итератор, Ложь);
					
					XDTOГруппа 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаТип); 
					XDTOГруппа.Ид 				= XMLСтрока(СтрокаДерева.ЦеноваяГруппа);
					XDTOГруппа.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаДерева.ЦеноваяГруппа.ВерсияДанных, "Групп");
					XDTOГруппа.ПометкаУдаления 	= XMLСтрока(СтрокаДерева.ЦеноваяГруппа.ПометкаУдаления);
					XDTOГруппа.Наименование 	= Лев(СтрокаДерева.ЦеноваяГруппа.Наименование, 250);
					
					XDTOГруппа.Группы 			= XDTOГруппы;
					
					Итератор = Итератор + 1;
					Владелец.Группа.Добавить(XDTOГруппа);
					
				Иначе
					ВыгрузитьГруппыРекурсивноПоЦеновымГруппамXDTO(ПараметрыОбмена, Владелец, СтрокаДерева.Строки, СписокГрупп, Итератор, Ложь);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			XDTOГруппа 					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаТип); 
			XDTOГруппа.Ид 				= XMLСтрока(СтрокаДерева.ЦеноваяГруппа);
			XDTOГруппа.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаДерева.ЦеноваяГруппа.ВерсияДанных, "Групп");
			XDTOГруппа.ПометкаУдаления 	= XMLСтрока(СтрокаДерева.ЦеноваяГруппа.ПометкаУдаления);
			XDTOГруппа.Наименование 	= Лев(СтрокаДерева.ЦеноваяГруппа.Наименование, 250);
			
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				ВыгрузитьГруппыРекурсивноПоЦеновымГруппамXDTO(ПараметрыОбмена, XDTOГруппы, СтрокаДерева.Строки, СписокГрупп, Итератор,, СтрокаДерева.ЦеноваяГруппа);
				Если XDTOГруппы.Группа.количество() > 0 тогда
					XDTOГруппа.Группы = XDTOГруппы;
				КонецЕсли;
			КонецЕсли;
			
			Итератор = Итератор + 1;
			Владелец.Группа.Добавить(XDTOГруппа);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ЭтоГруппаВерхнегоУровня(Элемент, СписокГрупп)
	Если ТипЗнч(СписокГрупп) = Тип("СписокЗначений") Тогда
		Для Каждого Группа Из СписокГрупп Цикл
			Если Группа.Значение.ПринадлежитЭлементу(Элемент) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


// Процедура - выгружает информацию о свойствах в XDTO
//
// Параметры:
//  ПараметрыОбмена			 - 	 Настройки узла обмена 
//  МассивДанных			 - 	 Массив выгружаеммых данных 
//  СтрокаТаблицыКаталогов	 - 	 Информация о каталоге(инфоблоке), куда выгружается информация 
//  НомерСтроки				 - 	 Номер каталога 
Процедура ВыгрузитьИнформациюОСвойствах(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, НомерСтроки)
	
	Успешно = Ложь;
	
	ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
	
	XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");
	XDTOКаталогТип 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Каталог");
	XDTOКлассификаторТип 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Классификатор");
	XDTOПакетПредложенийТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПакетПредложений");
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, -1); 
	
	Для Пакет = 1 по КоличествоПакетов Цикл
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет) + " каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена);
		
		МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", Пакет));	
		
		Если МассивСтрок.Количество() > 0 тогда
							
			ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\properties\" + Строка(Пакет)); 
			
			РазбитаяСтруктураДанных = РазборМассиваДанныхПоТипамОбъектов(МассивСтрок);
			
			СписокСвойств 			= РазбитаяСтруктураДанных.Свойства;
			
			лМенеджерВременныхТаблиц = СформироватьВременныеТаблицыПоСвойствамПакета(ПараметрыОбмена, СписокСвойств);
			
			//Выгружаем свойства товаров 
			ЗапросСвойств = Новый Запрос;
			ЗапросСвойств.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
			
			ЗапросСвойств.Текст = "ВЫБРАТЬ *
			|ИЗ
			|	ВремСвойства КАК ВремСвойства
			| ГДЕ
			| ВремСвойства.ДляТоваров = ИСТИНА";
			тзнСвойств = ЗапросСвойств.Выполнить().Выгрузить();
				
			Если тзнСвойств.Количество() > 0 тогда	
				XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);

				XDTOКаталог 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКаталогТип); 
				XDTOКаталог.Ид				= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOКаталог.ИдКлассификатора= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOКаталог.Наименование	= СтрокаТаблицыКаталогов.Каталог;
				XDTOКаталог.Описание 		= СтрокаТаблицыКаталогов.Каталог;
				XDTOКаталог.СодержитТолькоИзменения = XMLСтрока(Истина);

				
				XDTOКлассификатор 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКлассификаторТип); 
				XDTOКлассификатор.Ид            = СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOКлассификатор.Наименование  = СтрокаТаблицыКаталогов.Каталог;
				XDTOКлассификатор.СодержитТолькоИзменения 	= XMLСтрока(Истина);
				
				ВыгрузитьСвойстваXDTO(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, лМенеджерВременныхТаблиц, Пакет, тзнСвойств, "Товар");
				
				XDTOКоммерческаяИнформация.Классификатор 	= XDTOКлассификатор;
				XDTOКоммерческаяИнформация.Каталог 			= XDTOКаталог;
				
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "import" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				
			КонецЕсли;	
			
			//Выгружаем свойства предложений 
			ЗапросСвойств = Новый Запрос;
			ЗапросСвойств.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
			
			ЗапросСвойств.Текст = "ВЫБРАТЬ *
			|ИЗ
			|	ВремСвойства КАК ВремСвойства
			|ГДЕ
			| ВремСвойства.ДляТоваров = ЛОЖЬ";	
			тзнСвойств = ЗапросСвойств.Выполнить().Выгрузить();
				
			Если тзнСвойств.Количество() > 0 тогда	
				
				XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);

				XDTOПакетПредложений						= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПакетПредложенийТип);  
				XDTOПакетПредложений.Ид						= СтрокаТаблицыКаталогов.ИдКаталога + "#";
				XDTOПакетПредложений.Наименование			= "Пакет предложений (" + СтрокаТаблицыКаталогов.Каталог + ")";
				XDTOПакетПредложений.ИдКаталога				= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.ИдКлассификатора		= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.СодержитТолькоИзменения= XMLСтрока(Истина);
					
				XDTOКоммерческаяИнформация.ПакетПредложений = XDTOПакетПредложений;
				
				XDTOКлассификатор 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКлассификаторТип); 
				XDTOКлассификатор.Ид            = СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOКлассификатор.Наименование  = СтрокаТаблицыКаталогов.Каталог;
				XDTOКлассификатор.СодержитТолькоИзменения 	= XMLСтрока(Истина);
				
				ВыгрузитьСвойстваXDTO(ПараметрыОбмена, XDTOКлассификатор, XDTOКлассификаторТип, лМенеджерВременныхТаблиц, Пакет, тзнСвойств, "Предложения");
				
				XDTOКоммерческаяИнформация.Классификатор 	= XDTOКлассификатор;
				
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "offers" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				
			КонецЕсли;	
			
			УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(Успешно, ПараметрыОбмена, Операция, Пакет, СтрокаТаблицыКаталогов.ИдКаталога, МассивСтрок);
				
			лМенеджерВременныхТаблиц.Закрыть();
			
		КонецЕсли;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Завершение выгрузки пакета " + Строка(Пакет) + " каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - формирует временные таблицы с информацией о свойствах пакета
//
// Параметры:
//  ПараметрыОбмена	 - 	 Настройки узла обмена 
//  СписокСвойств	 - 	 Список свойств пакета 
// Возвращаемое значение:
//   Менеджер временных таблиц, хранящий информацию о товарах 
Функция СформироватьВременныеТаблицыПоСвойствамПакета(ПараметрыОбмена, СписокСвойств)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Узел"	, ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("ТекДата"	, ТекущаяДата());
	
	Запрос.УстановитьПараметр("СписокСвойств"	, СписокСвойств);
	Запрос.УстановитьПараметр("НастройкиСвойств", ПараметрыОбмена.НастройкаСвойствТоваровИХарактеристик);
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	НастройкиСвойств.Свойство,
	|	НастройкиСвойств.ВлияетНаЦену,
	|	НастройкиСвойств.ВыгружатьВХИ
	|ПОМЕСТИТЬ НастройкиСвойств
	|ИЗ
	|	&НастройкиСвойств КАК НастройкиСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвойстваОбъектов.Ссылка КАК СвойствоНоменклатуры,
	|	ВЫБОР
	|		КОГДА СвойстваОбъектов.Б_Идентификатор = """"
	|			ТОГДА СвойстваОбъектов.Ссылка
	|		ИНАЧЕ СвойстваОбъектов.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	СвойстваОбъектов.ВерсияДанных,
	|	СвойстваОбъектов.ПометкаУдаления,
	|	СвойстваОбъектов.Наименование КАК СвойствоНаименование,
	|	ВЫБОР
	|		КОГДА СвойстваОбъектов.НазначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДляТоваров,
	|	НастройкиСвойств.ВлияетНаЦену,
	|	НастройкиСвойств.ВыгружатьВХИ
	|ПОМЕСТИТЬ ВремСвойства
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСвойств КАК НастройкиСвойств
	|		ПО СвойстваОбъектов.Ссылка = НастройкиСвойств.Свойство
	|ГДЕ
	|	СвойстваОбъектов.Ссылка В(&СписокСвойств)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвойствоНоменклатуры,
	|	ДляТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремСвойства.СвойствоНоменклатуры КАК СвойствоНоменклатуры,
	|	ВремСвойства.Идентификатор,
	|	ВремСвойства.СвойствоНаименование,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойствОбъектов.Б_Идентификатор = """"
	|				ИЛИ ЗначенияСвойствОбъектов.Б_Идентификатор ЕСТЬ NULL 
	|			ТОГДА ЗначенияСвойствОбъектов.Ссылка
	|		ИНАЧЕ ЗначенияСвойствОбъектов.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЗначения,
	|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка,
	|	ЗначенияСвойствОбъектов.Наименование
	|ПОМЕСТИТЬ ВремЗначенияСвойств
	|ИЗ
	|	ВремСвойства КАК ВремСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ВремСвойства.СвойствоНоменклатуры = ЗначенияСвойствОбъектов.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	СвойствоНоменклатуры";
	
	лМенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= лМенеджерВременныхТаблиц; 
	Запрос.Текст = ТекстЗапроса;
	запрос.Выполнить();	
	
	Возврат лМенеджерВременныхТаблиц;
	
КонецФункции

Процедура ВыгрузитьСвойстваXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, Пакет, тзнСвойств, ТипОбъекта)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка свойств в XML.", ПараметрыОбмена);
	
	
		Итератор = 0;
		
		XDTOСвойстваТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Свойства", Истина, ВладелецТип);
		XDTOСвойства 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСвойстваТип); 
		
		XDTOСвойствоТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Свойство");
		
		XDTOВариантыЗначенийТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ВариантыЗначений", Истина, XDTOСвойствоТип);
		XDTOСправочникТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Справочник", Истина, XDTOВариантыЗначенийТип);
		
		ЗапросЗначенийСвойств = Новый Запрос;
		ЗапросЗначенийСвойств.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

		Для каждого ТекСвойство из тзнСвойств Цикл
		
			Итератор = Итератор + 1;
			
			лУчитываетсяВЦене = Ложь;
			
			XDTOСвойство 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСвойствоТип);  
			XDTOСвойство.Ид 			= XMLСтрока(ТекСвойство.Идентификатор);
			XDTOСвойство.НомерВерсии 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ТекСвойство.ВерсияДанных, "Свойств");
			XDTOСвойство.ПометкаУдаления= XMLСтрока(ТекСвойство.ПометкаУдаления);
			XDTOСвойство.Наименование	= Лев(ТекСвойство.СвойствоНаименование, 250);
			
			XDTOСвойство.Внешний		= XMLСтрока(?(ЗначениеЗаполнено(ТекСвойство.ВыгружатьВХИ), ТекСвойство.ВыгружатьВХИ, Ложь));
			лУчитываетсяВЦене			= ?(ЗначениеЗаполнено(ТекСвойство.ВлияетНаЦену), ТекСвойство.ВлияетНаЦену, Ложь);
			XDTOСвойство.Информационное	= XMLСтрока(НЕ лУчитываетсяВЦене);
			
			Типы = ТекСвойство.СвойствоНоменклатуры.ТипЗначения.Типы();
			
			XDTOСвойство.ТипЗначений = "Строка";
			
			Если НЕ Типы.Количество() <> 1 Тогда
	
			Тип = Типы[0];
			
			Если Тип = Тип("Число") Тогда
				XDTOСвойство.ТипЗначений = "Число";
			ИначеЕсли Тип = Тип("Дата") Тогда
				XDTOСвойство.ТипЗначений = "Строка";
				
			ИначеЕсли Тип = Тип("Булево") Тогда
				
				XDTOСвойство.ТипЗначений = "Справочник";
				
				XDTOВариантыЗначений = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOВариантыЗначенийТип);  
				
					XDTOСправочник = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип);  
					XDTOСправочник.ИдЗначения	= "true";
					XDTOСправочник.Значение		= "Да";
					XDTOВариантыЗначений.Справочник.Добавить(XDTOСправочник);
					
					XDTOСправочник = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип);  
					XDTOСправочник.ИдЗначения	= "false";
					XDTOСправочник.Значение		= "Нет";  					
					XDTOВариантыЗначений.Справочник.Добавить(XDTOСправочник);
				
				XDTOСвойство.ВариантыЗначений = XDTOВариантыЗначений;

			Иначе
				
				Если ТипЗначенияСправочник(Тип) Тогда
					
					XDTOСвойство.ТипЗначений = "Справочник";
					
						XDTOВариантыЗначений = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOВариантыЗначенийТип);  
						
						ОбъектПоТипу = Новый(Тип);
						ТипЗначенияСправочник = ОбъектПоТипу.Метаданные().Имя;
						
						Если ТипЗначенияСправочник = "ЗначенияСвойствОбъектов" тогда
							
								ЗапросЗначенийСвойств.Текст = "ВЫБРАТЬ *
								|ИЗ
								|	ВремЗначенияСвойств КАК ВремЗначенияСвойств
								|ГДЕ
								|	ВремЗначенияСвойств.СвойствоНоменклатуры = &Свойство";
							
							ЗапросЗначенийСвойств.УстановитьПараметр("Свойство", ТекСвойство.СвойствоНоменклатуры);  							
							ВыборкаЗначенийСвойств = ЗапросЗначенийСвойств.Выполнить().Выбрать();
							
							Пока ВыборкаЗначенийСвойств.Следующий() Цикл
								
									XDTOСправочник = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип);  
									XDTOСправочник.ИдЗначения	= XMLСтрока(ВыборкаЗначенийСвойств.ИдентификаторЗначения);
									XDTOСправочник.Значение		= Лев(ВыборкаЗначенийСвойств.Наименование, 1000);
								
								XDTOВариантыЗначений.Справочник.Добавить(XDTOСправочник);
								
							КонецЦикла;
						Иначе
							
							Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Для свойства " + Строка(ТекСвойство.СвойствоНоменклатуры) + " тип значений " + ТипЗначенияСправочник + ". Значения свойств могут очень долго выгружаться(зависит от количества). Если это свойство не нужно - укажите в отборах.", ПараметрыОбмена);
							
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								|	ПользовательскийСправочник.Ссылка КАК Объект,
								|	ПользовательскийСправочник.Наименование КАК Наименование
								|ИЗ
								|	Справочник." +  ТипЗначенияСправочник + " КАК ПользовательскийСправочник";
							
							ВыборкаЗначенийСвойств = Запрос.Выполнить().Выбрать();
							
							Пока ВыборкаЗначенийСвойств.Следующий() Цикл
							    Если ЗначениеЗаполнено(ВыборкаЗначенийСвойств.Объект) тогда
									XDTOСправочник = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип);  
									XDTOСправочник.ИдЗначения	= XMLСтрока(ВыборкаЗначенийСвойств.Объект);
									XDTOСправочник.Значение		= Лев(ВыборкаЗначенийСвойств.Наименование, 1000);
									
									XDTOВариантыЗначений.Справочник.Добавить(XDTOСправочник);
								КонецЕсли;	
							КонецЦикла;
							
						КонецЕсли;	
						
					Если XDTOВариантыЗначений.Справочник.Количество() > 0 тогда	
						XDTOСвойство.ВариантыЗначений = XDTOВариантыЗначений;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если XDTOСвойство.ТипЗначений <> "Справочник" И лУчитываетсяВЦене тогда
			
			XDTOСвойство.ТипЗначений = "Справочник";

			XDTOВариантыЗначений = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOВариантыЗначенийТип);  
			
			//Запрос вытащил сюда, чтобы не лишний раз не засорять память. Вызов этого запроса должен быть редкий.
			Запрос = Новый Запрос;
			запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗначенияСвойствОбъектов.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
			Запрос.УстановитьПараметр("Свойство",ТекСвойство.СвойствоНоменклатуры);
			ВыборкаЗначенийСвойств = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаЗначенийСвойств.Следующий() Цикл
				
				XDTOСправочник = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип);  
				XDTOСправочник.ИдЗначения	= XMLСтрока(ВыборкаЗначенийСвойств.Значение);
				XDTOСправочник.Значение		= Лев(ВыборкаЗначенийСвойств.Значение, 1000);
				
				XDTOВариантыЗначений.Справочник.Добавить(XDTOСправочник);
				
			КонецЦикла;
			
			Если XDTOВариантыЗначений.Справочник.Количество() > 0 тогда	
				XDTOСвойство.ВариантыЗначений = XDTOВариантыЗначений;
			КонецЕсли;
			
		КонецЕсли;
		
		XDTOСвойство.ДляТоваров		= ?(ТекСвойство.СвойствоНоменклатуры.НазначениеСвойства = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура, XMLСтрока(Истина),  XMLСтрока(Ложь));
		
		XDTOСвойства.Свойство.Добавить(XDTOСвойство);
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка свойств в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Владелец.Свойства = XDTOСвойства;
	
КонецПроцедуры

Функция ТипЗначенияСправочник(Тип)
	
	ТипЗначенияСправочник = Ложь;
	
	Попытка
		ОбъектПоТипу = Новый(Тип);
		ТипЗначенияСправочник = Метаданные.Справочники.Содержит(ОбъектПоТипу.Метаданные());
	Исключение
	КонецПопытки;
	
	Возврат ТипЗначенияСправочник;
	
КонецФункции

Функция ПолучитьИдентификаторГруппы(ИдГруппы)
	
	Результат = ИдГруппы;
	
	Если СтрДлина(Результат) > 2 тогда
		
		Если Лев(Результат, 2) = "G_" тогда
			
			Результат = Прав(Результат, СтрДлина(Результат)-2)
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Результат);
	
КонецФункции


			///////////////////////////////////////////////////////////////////
			//			 ВЫГРУЗКА ПОЛЬЗОВАТЕЛЬСКИХ СПРАВОЧНИКОВ             //
			/////////////////////////////////////////////////////////////////

Процедура ВыгрузитьПользовательскиеСправочникиXDTO(ПараметрыОбмена,МассивДанных, Операция)
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, 0); 
	Для Пакет = 1 по КоличествоПакетов Цикл
		
		Итератор = 0;
		МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", Пакет));	
		
		Если МассивСтрок.Количество() > 0 тогда
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет) + " пользовательскиих справочников", ПараметрыОбмена);
			
			ПараметрыОбмена.МояФабрикаXDTO 		= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
			
			XDTOКоммерческаяИнформацияТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");  
			XDTOКоммерческаяИнформация 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
			
			XDTOПользовательскиеСправочникиТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПользовательскиеСправочники", Истина, XDTOКоммерческаяИнформацияТип);
			XDTOСправочникТип					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Справочник"); 
			
			XDTOЭлементыСправочникаТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЭлементыСправочника", Истина, XDTOСправочникТип);
			XDTOЭлементСправочникаТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЭлементСправочника");
			
			ТипpЗначенийРеквизитов	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияРеквизитов", Истина, XDTOЭлементСправочникаТип);
			ТипpЗначенияРеквизита	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначениеРеквизита");
			
			XDTOРеквизитыТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Реквизиты", Истина, XDTOСправочникТип);
			XDTOРеквизитТип			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Реквизит", Истина, XDTOРеквизитыТип);
			
			ТаблицаСправочников 	= ПараметрыОбмена.ВыгружаемыеПоляСправочников;
			лТаблицаСправочников 	= ТаблицаСправочников.Скопировать();
			лТаблицаСправочников.Свернуть("Справочник");
			Если лТаблицаСправочников.Количество() > 0 тогда
				
				XDTOПользовательскиеСправочники		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПользовательскиеСправочникиТип); 
				
				Если (ПараметрыОбмена.ВыгружатьТолькоИзменения И НЕ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно) ИЛИ (ПараметрыОбмена.КоличествоЭлементовСправочникаВПакете <> 0) тогда
					XDTOПользовательскиеСправочники.СодержитТолькоИзменения = XMLСтрока(Истина);
				Иначе
					XDTOПользовательскиеСправочники.СодержитТолькоИзменения = XMLСтрока(Ложь);
				КонецЕсли;
			
				Для каждого ТекСпр из лТаблицаСправочников Цикл
					
					лЕстьЭлементыСправочника = Ложь;
					
					XDTOСправочник				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСправочникТип); 
					XDTOСправочник.Ид 			= ТекСпр.Справочник;	
					XDTOСправочник.Наименование = Метаданные.Справочники[ТекСпр.Справочник].Синоним;	
					
					лРеквезитыСпр 	= ТаблицаСправочников.НайтиСтроки(Новый Структура("Справочник", ТекСпр.Справочник));
					
					XDTOРеквизитыСправочника	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOРеквизитыТип); 
					
					Для каждого ТекРек из лРеквезитыСпр Цикл
						
						Если ТекРек.Выгружаемо тогда
							
							XDTOРеквизитСправочника	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOРеквизитТип); 
							
							XDTOРеквизитСправочника.Ид = ТекРек.Поле;

							Если ТекРек.Поле = "Код" тогда
								XDTOРеквизитСправочника.ТипЗначений = "Строка";	
								XDTOРеквизитСправочника.Наименование = ТекРек.Поле;
							ИначеЕсли ТекРек.Поле = "Наименование" тогда
								XDTOРеквизитСправочника.ТипЗначений = "Строка";	
								XDTOРеквизитСправочника.Наименование = ТекРек.Поле;
							ИначеЕсли ТекРек.Поле = "ПометкаУдаления" тогда
								XDTOРеквизитСправочника.ТипЗначений = "Булево";	
								XDTOРеквизитСправочника.Наименование = ТекРек.Поле;
							ИначеЕсли ТекРек.Поле = "Владелец" тогда
								XDTOРеквизитСправочника.ТипЗначений = "Строка";	
								XDTOРеквизитСправочника.Наименование = ТекРек.Поле;
							ИначеЕсли ТекРек.Поле = "Родитель" тогда
								XDTOРеквизитСправочника.ТипЗначений = "Строка";	
								XDTOРеквизитСправочника.Наименование = ТекРек.Поле;
							Иначе  
								лРеквизит 		= Метаданные.Справочники[ТекСпр.Справочник].Реквизиты[ТекРек.Поле];
								лТипыРеквизита 	= лРеквизит.Тип.Типы();
								
								XDTOРеквизитСправочника.Наименование = лРеквизит.Синоним;
								Если лТипыРеквизита.Количество() > 0 тогда
										
									лТипРеквизита = лТипыРеквизита[0];
									
									Если лТипРеквизита = Тип("Число") тогда
										XDTOРеквизитСправочника.ТипЗначений = "Число";	
									ИначеЕсли лТипРеквизита = Тип("Дата") тогда
										XDTOРеквизитСправочника.ТипЗначений = "Дата";	
									ИначеЕсли лТипРеквизита = Тип("Булево") тогда
										XDTOРеквизитСправочника.ТипЗначений = "Булево";	
									Иначе
										XDTOРеквизитСправочника.ТипЗначений = "Строка";	
									КонецЕсли;  									
								Иначе
									XDTOРеквизитСправочника.ТипЗначений = "Строка";	
								КонецЕсли;
							КонецЕсли;	
							
							Если ТекРек.ВыгружатьКакСтрока тогда
								XDTOРеквизитСправочника.ТипЗначений = "Строка";		
							КонецЕсли;
							
							XDTOРеквизитыСправочника.Реквизит.Добавить(XDTOРеквизитСправочника);
						КонецЕсли;
						
					КонецЦикла;
					
					XDTOСправочник.Реквизиты	= XDTOРеквизитыСправочника;
					
					XDTOЭлементыСправочника		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЭлементыСправочникаТип); 
					
					Для каждого ТекЭлСпр из МассивСтрок Цикл 
						Если ТекЭлСпр.ПользовательскийСправочник = ТекСпр.Справочник тогда
							
								лЕстьЭлементыСправочника = Истина;
								Итератор = Итератор + 1;
								
								XDTOЭлементСправочника	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЭлементСправочникаТип); 
								
								XDTOЭлементСправочника.Ид 			= XMLСтрока(ТекЭлСпр.Объект.Ссылка);
								XDTOЭлементСправочника.НомерВерсии 	= XMLСтрока(ТекЭлСпр.Объект.ВерсияДанных);
								
								ЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(ТипpЗначенийРеквизитов);
								
								Для каждого ТекРек из лРеквезитыСпр Цикл
									
									Если ТекРек.Выгружаемо тогда
										
										лЗначРек 	= ТекЭлСпр.Объект[ТекРек.Поле];
										Если ЗначениеЗаполнено(лЗначРек) тогда
											
											лЗначВХМЛ 	= ?(ТекРек.ВыгружатьКакСтрока = Ложь, XMLСтрока(лЗначРек), Строка(лЗначРек));
											Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, ЗначенияРеквизитов, ТипpЗначенияРеквизита, ТекРек.Поле, лЗначВХМЛ);
										Иначе
											Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, ЗначенияРеквизитов, ТипpЗначенияРеквизита, ТекРек.Поле, "");
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЦикла;
								
								XDTOЭлементСправочника.ЗначенияРеквизитов = ЗначенияРеквизитов; 
								XDTOЭлементыСправочника.ЭлементСправочника.Добавить(XDTOЭлементСправочника);	
						КонецЕсли;	
					КонецЦикла;
					
					Если лЕстьЭлементыСправочника тогда
						XDTOСправочник.ЭлементыСправочника = XDTOЭлементыСправочника;
						
						XDTOПользовательскиеСправочники.Справочник.Добавить(XDTOСправочник);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;	
			
			XDTOКоммерческаяИнформация.ПользовательскиеСправочники = XDTOПользовательскиеСправочники; 
			
			ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\references\" +  Строка(Пакет)); 
			
			Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "references", "reference", Пакет);	
			
			УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(Успешно, ПараметрыОбмена, Операция, Пакет, "ПользовательскиеСправочники", МассивСтрок);
			
			Если Успешно  Или НЕ ПараметрыОбмена.ВыгружатьНаСайт тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета " + Строка(Пакет) + " пользовательскиих справочников завершена. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
			Иначе
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета " + Строка(Пакет) + " пользовательскиих справочников НЕ завершена или завершена с ошибками. НЕ Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 



			///////////////////////////////////////////////////////////////////
			//			 			ВЫГРУЗКА КОНТРАГЕНТОВ                   //
			/////////////////////////////////////////////////////////////////

Функция ВыгрузитьБанкXDTO(ПараметрыОбмена, банк)
	
	XDTOБанкТип				= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Банк");
	XDTOАдресТип			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Адрес");
	
	XDTOБанк				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOБанкТип);
	
	Если Не ЗначениеЗаполнено(Банк) Тогда
		Возврат XDTOБанк;
	КонецЕсли;
	
	XDTOБанк.СчетКорреспондентский 	= Банк.КоррСчет;	
	XDTOБанк.Наименование 			= Банк.Наименование;	
	XDTOБанк.СчетКорреспондентский 	= Банк.КоррСчет;
	
	Если Не ПустаяСтрока(Банк.Адрес) Тогда
		
		XDTOАдрес				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOАдресТип);
		XDTOАдрес.Представление = Банк.Адрес;
		XDTOБанк.Адрес			= XDTOАдрес;
		
	КонецЕсли;
	
	XDTOБанк.БИК 				= Банк.Код;	
	
	Возврат XDTOБанк;
	
КонецФункции
			
Процедура ВыгрузитьБанковскийСчетXDTO(ПараметрыОбмена, Владелец, ВладелецТип, БанковскийСчет)
	
	XDTOРасчетныеСчетаТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "РасчетныеСчета", Истина, ВладелецТип);
	XDTOРасчетныйСчетТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "РасчетныйСчет"); 
	
	XDTOРасчетныеСчета		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOРасчетныеСчетаТип); 
	
		XDTOРасчетныйСчет		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOРасчетныйСчетТип); 
		
		XDTOРасчетныйСчет.НомерСчета		= XMLСтрока(БанковскийСчет.НомерСчета);
		//БВ закомментировал
		//XDTOРасчетныйСчет.БанкКорреспондент	= ВыгрузитьбанкXDTO(ПараметрыОбмена, БанковскийСчет.БанкДляРасчетов);     
		//
		XDTOРасчетныйСчет.Банк				= ВыгрузитьбанкXDTO(ПараметрыОбмена, БанковскийСчет.Банк);
	   	XDTOРасчетныеСчета.РасчетныйСчет.Добавить(XDTOРасчетныйСчет);
		
	Владелец.РасчетныеСчета = XDTOРасчетныеСчета;
	
Конецпроцедуры
			
Процедура ВыгрузитьКонтрагентов(ПараметрыОбмена,МассивДанных, Операция)
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, 0); 
	
	Если КоличествоПакетов > 0 тогда
		
		МенеджерВременныхТаблицКонтрагентов = Новый МенеджерВременныхТаблиц;
		
		ОбщийЗапрос = Новый Запрос;
		ОбщийЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицКонтрагентов;
		
		// намименование полей для контрагента должо быть такое же как и в запросе в функции СформироватьВременныеТаблицыПоДокументам(..). Т.к. в обоих слкчаях контрагенты выгружаются одинаково.
		ОбщийЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	ВЫБОР
		|		КОГДА Контрагенты.Б_Идентификатор = """"
		|			ТОГДА Контрагенты.Ссылка
		|		ИНАЧЕ Контрагенты.Б_Идентификатор
		|	КОНЕЦ КАК Идентификатор
		|ПОМЕСТИТЬ ВремКонтрагенты
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МассивДанных.Объект,
		|	МассивДанных.Пакет
		|ПОМЕСТИТЬ ВремМассивДанных
		|ИЗ
		|	&МассивДанных КАК МассивДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремМассивДанных.Объект КАК Объект,
		|	ВремМассивДанных.Пакет КАК Пакет,
		|	ВремКонтрагенты.Идентификатор КАК ИдентификаторКонтрагента,
		|	ВремКонтрагенты.Контрагент.ВерсияДанных КАК ВерсияДанныхКонтрагента,
		|	ВремКонтрагенты.Контрагент.ПометкаУдаления КАК ПометкаУдаленияКонтрагента,
		|	ВремКонтрагенты.Контрагент.Код КАК КодКонтрагента,
		|	ВремКонтрагенты.Контрагент.Наименование КАК НаименованиеКонтрагента,
		|	ВремКонтрагенты.Контрагент.ИНН КАК ИННКонтрагента,
		//БВ
		//|	ВремКонтрагенты.Контрагент.КодПоОКПО КАК КодПоОКПОКонтрагента,
		|	ВремКонтрагенты.Контрагент.КодПоЕДРПОУ КАК КодПоОКПОКонтрагента,
		//
		|	ВремКонтрагенты.Контрагент.Комментарий КАК КомментарийКонтрагента,
		//БВ
		//|	ВремКонтрагенты.Контрагент.КПП КАК КППКонтрагента,
		|	"""" КАК КППКонтрагента,
		//
		|	ВремКонтрагенты.Контрагент.НаименованиеПолное КАК НаименованиеПолноеКонтрагента,
		|	ВремКонтрагенты.Контрагент.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоКонтрагента,
		|	ВремКонтрагенты.Контрагент.ОсновнойБанковскийСчет КАК ОсновнойБанковскийСчетКонтрагента,
		|	ВремКонтрагенты.Контрагент.ЮрФизЛицо КАК ЮрФизЛицоКонтрагента,
		|	ВремМассивДанных.Объект КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ВремКонтрагенты.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ВремКонтрагенты.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОсновнойБанковскийСчетКонтрагента,
		|	""Контрагенты"" КАК ТипКонтрагента
		|ПОМЕСТИТЬ МассивДанныхСПакетами
		|ИЗ
		|	ВремМассивДанных КАК ВремМассивДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВремКонтрагенты КАК ВремКонтрагенты
		|		ПО (ВремКонтрагенты.Контрагент = ВремМассивДанных.Объект)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Пакет,
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВремКонтрагенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВремМассивДанных";
		ОбщийЗапрос.УстановитьПараметр("МассивДанных",МассивДанных);
		ОбщийЗапрос.Выполнить();
		
		ПространствоИмен 	= ПараметрыОбмена.ПространствоИмен; 
		ПараметрыОбмена.МояФабрикаXDTO 		= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
		
	КонецЕсли;
	
	Для Пакет = 1 по КоличествоПакетов Цикл
		
		Итератор = 0;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицКонтрагентов;
		Запрос.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	МассивДанныхСПакетами КАК МассивДанныхСПакетами
		|ГДЕ
		|	МассивДанныхСПакетами.Пакет В(&Пакет)";
		Запрос.УстановитьПараметр("Пакет", Пакет);
		МассивСтрок = Запрос.Выполнить().Выгрузить();
		
		Если МассивСтрок.Количество() > 0 тогда
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет) + " контрагентов", ПараметрыОбмена);
			
			XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "КоммерческаяИнформация");  
			XDTOКоммерческаяИнформация 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип); 
			
			XDTOКонтрагентыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагенты", Истина, XDTOКоммерческаяИнформацияТип);
			XDTOКонтрагентТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагент"); 
			
			XDTOКонтрагенты	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентыТип); 
			
			
			Если (ПараметрыОбмена.ВыгружатьТолькоИзменения И НЕ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно) ИЛИ (ПараметрыОбмена.КоличествоКонтрагентовВПакете <> 0) тогда
				XDTOКонтрагенты.СодержитТолькоИзменения = XMLСтрока(Истина);
			Иначе
				XDTOКонтрагенты.СодержитТолькоИзменения = XMLСтрока(Ложь);
			КонецЕсли;
			
			Для каждого ТекЭлСпр из МассивСтрок Цикл 
			
				Итератор = Итератор + 1;

				XDTOКонтрагент = ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  ТекЭлСпр);
					
				XDTOКонтрагенты.Контрагент.Добавить(XDTOКонтрагент);		
			КонецЦикла;
			
			XDTOКоммерческаяИнформация.Контрагенты = XDTOКонтрагенты; 
			
			ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\contragents\" + Строка(Пакет)); 
			Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "contragents", "sale", Пакет);		
			
			УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(Успешно, ПараметрыОбмена, Операция, Пакет, "Контрагенты", МассивСтрок);
			
			Если Успешно Или НЕ ПараметрыОбмена.ВыгружатьНаСайт тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета " + Строка(Пакет) + " контрагентов завершена. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
			Иначе
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета " + Строка(Пакет) + " контрагентов НЕ завершена или завершена с ошибками. НЕ Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПакетов > 0 тогда
		МенеджерВременныхТаблицКонтрагентов.Закрыть();;
	КонецЕсли;

КонецПроцедуры 

Функция ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  СтрокаВыборки)
	
	XDTOКонтактнаяИнформацияТип 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "КонтактнаяИнформация");
	XDTOКонтактТип 							= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контакт", Истина, XDTOКонтактнаяИнформацияТип);
	
	XDTOПредставителиТип 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Представители", Истина, XDTOКонтрагентТип);
	XDTOПредставительТип 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Представитель");
	
	XDTOКонтрагент	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентТип); 
	
	XDTOКонтрагент.Ид 				= XMLСтрока(СтрокаВыборки.ИдентификаторКонтрагента);
	XDTOКонтрагент.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, СтрокаВыборки.Контрагент.ВерсияДанных, "Контрагентов"); 
	XDTOКонтрагент.ПометкаУдаления 	= XMLСтрока(СтрокаВыборки.Контрагент.ПометкаУдаления);
	XDTOКонтрагент.Наименование 	= СтрокаВыборки.Контрагент.Наименование;
	
	лПолнНаименование = ?(СтрДлина(СтрокаВыборки.Контрагент.НаименованиеПолное) > 250, Лев(СтрокаВыборки.Контрагент.НаименованиеПолное, 250), СтрокаВыборки.Контрагент.НаименованиеПолное); 
	
	Если СтрокаВыборки.Контрагент.ЮрФизЛицо 		= Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		XDTOКонтрагент.ОфициальноеНаименование		= лПолнНаименование;
	Иначе
		XDTOКонтрагент.ПолноеНаименование			= лПолнНаименование;
	КонецЕсли;
	
	XDTOКонтрагент.Роль 	= "Покупатель";
	
	XDTOКонтрагент.ИНН		= СтрокаВыборки.Контрагент.ИНН;
	//БВ
	//XDTOКонтрагент.КПП		= СтрокаВыборки.Контрагент.КПП;
	//XDTOКонтрагент.КодПоОКПО= СтрокаВыборки.Контрагент.КодПоОКПО;
	XDTOКонтрагент.КодПоОКПО= СтрокаВыборки.Контрагент.КодПоЕДРПОУ;
	//
	
	Если СтрокаВыборки.ЕстьОсновнойБанковскийСчетКонтрагента Тогда
		
		ВыгрузитьБанковскийСчетXDTO(ПараметрыОбмена, XDTOКонтрагент, XDTOКонтрагентТип, СтрокаВыборки.Контрагент.ОсновнойБанковскийСчет);

	КонецЕсли;
	
	XDTOКонтактнаяИнформация = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтактнаяИнформацияТип);
	Выборка = РегистрыСведений.КонтактнаяИнформация.Выбрать(Новый Структура("Объект", СтрокаВыборки.Контрагент));
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрокаВыборки.ТипКонтрагента = "Контрагенты" тогда
			Если Выборка.Вид 		= Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента тогда
				XDTOКонтрагент.АдресРегистрации	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьАдресXDTO(ПараметрыОбмена, Выборка);
			ИначеЕсли Выборка.Вид 	= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента тогда
				XDTOКонтрагент.Адрес= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьАдресXDTO(ПараметрыОбмена, Выборка);
			ИначеЕсли Выборка.Вид 	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента  тогда
				XDTOКонтактнаяИнформация.Контакт.Добавить(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, "Телефон рабочий", Выборка.Представление));
			ИначеЕсли Выборка.Вид 	= Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами тогда
				
				Если СокрЛП(Выборка.Представление) <> "@Mail.ru" тогда	
					XDTOКонтактнаяИнформация.Контакт.Добавить(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, "Электронная почта", Выборка.Представление));
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Если Выборка.Вид 		= Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации тогда
				XDTOКонтрагент.АдресРегистрации	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьАдресXDTO(ПараметрыОбмена, Выборка);
			ИначеЕсли Выборка.Вид 	= Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации тогда
				XDTOКонтрагент.Адрес= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьАдресXDTO(ПараметрыОбмена, Выборка);
			ИначеЕсли Выборка.Тип 	= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты тогда
				XDTOКонтактнаяИнформация.Контакт.Добавить(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, "Почта", Выборка.Представление));
			ИначеЕсли Выборка.Тип 	= Перечисления.ТипыКонтактнойИнформации.Телефон тогда
				XDTOКонтактнаяИнформация.Контакт.Добавить(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, "Телефон рабочий", Выборка.Представление));
			ИначеЕсли Выборка.Вид 	= Справочники.ВидыКонтактнойИнформации.ФаксОрганизации тогда
				XDTOКонтактнаяИнформация.Контакт.Добавить(Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьКонтактнуюИнформациюXDTO(ПараметрыОбмена, XDTOКонтактТип, "Факс", Выборка.Представление));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;                
	
	Если XDTOКонтактнаяИнформация.Контакт.количество() > 0 тогда
		XDTOКонтрагент.Контакты = XDTOКонтактнаяИнформация;
	КонецЕсли;
	
	XDTOПредставители = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредставителиТип);
	
	ВыборкаКонтактныхЛиц = Справочники.КонтактныеЛицаКонтрагентов.Выбрать(,СтрокаВыборки.Контрагент);
	Пока ВыборкаКонтактныхЛиц.Следующий() Цикл
		
		XDTOПредставитель 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредставительТип);
		XDTOПредставитель.Отношение 	= "Контактное лицо";
		XDTOПредставитель.Ид 			= ?(ЗначениеЗаполнено(ВыборкаКонтактныхЛиц.Б_Идентификатор), XMLСтрока(ВыборкаКонтактныхЛиц.Б_Идентификатор),XMLСтрока(ВыборкаКонтактныхЛиц.Ссылка));
		XDTOПредставитель.Наименование 	= ВыборкаКонтактныхЛиц.Наименование;
		
		XDTOПредставители.Представитель.Добавить(XDTOПредставитель);
		
	КонецЦикла;
	
	Если XDTOПредставители.Представитель.количество() > 0 тогда
		XDTOКонтрагент.Представители = XDTOПредставители;
	КонецЕсли;
	
	Возврат XDTOКонтрагент;
	
КонецФункции



			///////////////////////////////////////////////////////////////////
			//			 ВЫГРУЗКА ИНФОРМЦИИ О СКИДКАХ			            //
			/////////////////////////////////////////////////////////////////


Функция СформироватьВременныеТаблицыПоИнформацииОСкидкахПакета(ПараметрыОбмена, СписокСкидок, СписокВидовДисконтныхКарт, спкНоменклатуры, спкКонтрагентов)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Узел"	, ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("ТекДата"	, ТекущаяДата());
	
	Запрос.УстановитьПараметр("СписокСкидок"				, СписокСкидок);
	Запрос.УстановитьПараметр("СписокВидовДисконтныхКарт"	, СписокВидовДисконтныхКарт);
	
	Запрос.УстановитьПараметр("СписокКонтрагентов"			, спкКонтрагентов);
	Запрос.УстановитьПараметр("СписокНоменклатуры"			, спкНоменклатуры);
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	УстановкаСкидокНоменклатуры.Ссылка КАК Идентификатор
	               |ПОМЕСТИТЬ ВремВсеСкидки
	               |ИЗ
	               |	Документ.УстановкаСкидокНоменклатуры КАК УстановкаСкидокНоменклатуры
	               |ГДЕ
	               |	УстановкаСкидокНоменклатуры.Ссылка В(&СписокСкидок)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Идентификатор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидыДисконтныхКарт.Ссылка КАК Идентификатор,
	               |	ВидыДисконтныхКарт.ВерсияДанных,
	               |	ВидыДисконтныхКарт.ПометкаУдаления,
	               |	ВидыДисконтныхКарт.Наименование
	               |ПОМЕСТИТЬ ВремВидыКартЛояльности
	               |ИЗ
	               |	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	               |ГДЕ
	               |	ВидыДисконтныхКарт.Ссылка В(&СписокВидовДисконтныхКарт)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Идентификатор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремВсеСкидки.Идентификатор КАК Идентификатор,
	               |	ВремВсеСкидки.Идентификатор.ВерсияДанных КАК ВерсияДанных,
	               |	ВремВсеСкидки.Идентификатор.ПометкаУдаления КАК ПометкаУдаления,
	               |	ВЫБОР
	               |		КОГДА ВремВсеСкидки.Идентификатор.ДатаНачала <= &ТекДата
	               |				И (ВремВсеСкидки.Идентификатор.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ КОНЕЦПЕРИОДА(ВремВсеСкидки.Идентификатор.ДатаОкончания, ДЕНЬ) >= &ТекДата)
	               |				И НЕ ВремВсеСкидки.Идентификатор В
	               |						(ВЫБРАТЬ
	               |							ОтменаСкидокНоменклатурыДокументы.УстановкаСкидокНоменклатуры
	               |						ИЗ
	               |							Документ.ОтменаСкидокНоменклатуры.Документы КАК ОтменаСкидокНоменклатурыДокументы)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Действует,
	               |	ВремВсеСкидки.Идентификатор.Ссылка КАК Скидка,
	               |	ВремВсеСкидки.Идентификатор.Дата КАК ДатаДокумента,
	               |	ВремВсеСкидки.Идентификатор.ДатаНачала КАК ДатаНачала,
	               |	ВремВсеСкидки.Идентификатор.ДатаОкончания КАК ДатаОкончания,
	               |	ВремВсеСкидки.Идентификатор.Валюта.Наименование КАК ВалютаКод,
	               |	ВремВсеСкидки.Идентификатор.ОбщееВремяНачала КАК ОбщееВремяНачала,
	               |	ВремВсеСкидки.Идентификатор.ОбщееВремяОкончания КАК ОбщееВремяОкончания,
	               |	ВремВсеСкидки.Идентификатор.ПоДнямНедели КАК ПоДнямНедели,
	               |	ВремВсеСкидки.Идентификатор.ДляВсейНоменклатуры КАК ДляВсейНоменклатуры,
	               |	ВремВсеСкидки.Идентификатор.ДляВсехПолучателей КАК ДляВсехПолучателей,
	               |	ВремВсеСкидки.Идентификатор.ВидСкидки КАК ВидСкидки,
	               |	ВремВсеСкидки.Идентификатор.ЗначениеУсловия КАК ЗначениеУсловия,
	               |	ВремВсеСкидки.Идентификатор.ПроцентСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	               |	ВремВсеСкидки.Идентификатор.ТипСкидкиНаценки КАК ТипСкидкиНаценки,
	               |	ВремВсеСкидки.Идентификатор.Условие КАК Условие,
	               |	ВремВсеСкидки.Идентификатор.ОграничениеСкидкиНаценки КАК ОграничениеСкидкиНаценки,
	               |	ВремВсеСкидки.Идентификатор.Номер КАК Номер
	               |ПОМЕСТИТЬ ВремСкидкиСПризнакомНеактивности
	               |ИЗ
	               |	ВремВсеСкидки КАК ВремВсеСкидки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Идентификатор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановкаСкидокНоменклатурыТовары.Ссылка КАК Скидка,
	               |	ВЫБОР
	               |		КОГДА УстановкаСкидокНоменклатурыТовары.Номенклатура.Б_Идентификатор <> """"
	               |			ТОГДА УстановкаСкидокНоменклатурыТовары.Номенклатура.Б_Идентификатор
	               |		ИНАЧЕ УстановкаСкидокНоменклатурыТовары.Номенклатура.Ссылка
	               |	КОНЕЦ КАК ИдентификаторНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА УстановкаСкидокНоменклатурыТовары.ХарактеристикаНоменклатуры.Б_Идентификатор <> """"
	               |			ТОГДА УстановкаСкидокНоменклатурыТовары.ХарактеристикаНоменклатуры.Б_Идентификатор
	               |		ИНАЧЕ УстановкаСкидокНоменклатурыТовары.ХарактеристикаНоменклатуры.Ссылка
	               |	КОНЕЦ КАК ИдентификаторХарактеристики,
	               |	УстановкаСкидокНоменклатурыТовары.ПроцентСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	               |	УстановкаСкидокНоменклатурыТовары.ОграничениеСкидкиНаценки
	               |ПОМЕСТИТЬ ВремТоварыСкидок
	               |ИЗ
	               |	Документ.УстановкаСкидокНоменклатуры.Товары КАК УстановкаСкидокНоменклатурыТовары
	               |ГДЕ
	               |	УстановкаСкидокНоменклатурыТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкаСкидокНоменклатуры.ПоНоменклатуре)
	               |	И УстановкаСкидокНоменклатурыТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВремВсеСкидки.Идентификатор
	               |			ИЗ
	               |				ВремВсеСкидки)
	               |	И УстановкаСкидокНоменклатурыТовары.Номенклатура В(&СписокНоменклатуры)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановкаСкидокНоменклатурыЦеновыеГруппы.Ссылка,
	               |	ВЫБОР
	               |		КОГДА Номенклатура.Б_Идентификатор <> """"
	               |			ТОГДА Номенклатура.Б_Идентификатор
	               |		ИНАЧЕ Номенклатура.Ссылка
	               |	КОНЕЦ,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	               |	УстановкаСкидокНоменклатурыЦеновыеГруппы.ПроцентСкидкиНаценки,
	               |	УстановкаСкидокНоменклатурыЦеновыеГруппы.ОграничениеСкидкиНаценки
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокНоменклатуры.ЦеновыеГруппы КАК УстановкаСкидокНоменклатурыЦеновыеГруппы
	               |		ПО Номенклатура.Ссылка = УстановкаСкидокНоменклатурыЦеновыеГруппы.ЦеноваяГруппа
	               |ГДЕ
	               |	УстановкаСкидокНоменклатурыЦеновыеГруппы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкаСкидокНоменклатуры.ПоЦеновымГруппам)
	               |	И УстановкаСкидокНоменклатурыЦеновыеГруппы.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВремВсеСкидки.Идентификатор
	               |			ИЗ
	               |				ВремВсеСкидки)
	               |	И Номенклатура.Ссылка В(&СписокНоменклатуры)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Скидка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка КАК Скидка,
	               |	ВЫБОР
	               |		КОГДА УстановкаСкидокНоменклатурыПолучателиСкидки.Контрагент.Б_Идентификатор <> """"
	               |			ТОГДА УстановкаСкидокНоменклатурыПолучателиСкидки.Контрагент.Б_Идентификатор
	               |		ИНАЧЕ УстановкаСкидокНоменклатурыПолучателиСкидки.Контрагент.Ссылка
	               |	КОНЕЦ КАК ИдентификаторКонтрагента,
	               |	УстановкаСкидокНоменклатурыПолучателиСкидки.Контрагент
	               |ПОМЕСТИТЬ ВремКонтрагентыСкидок
	               |ИЗ
	               |	Документ.УстановкаСкидокНоменклатуры.ПолучателиСкидки КАК УстановкаСкидокНоменклатурыПолучателиСкидки
	               |ГДЕ
	               |	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВремВсеСкидки.Идентификатор
	               |			ИЗ
	               |				ВремВсеСкидки)
	               |	И УстановкаСкидокНоменклатурыПолучателиСкидки.Контрагент В(&СписокКонтрагентов)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Скидка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.Ссылка КАК Скидка,
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.Выбран,
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.ДеньНедели,
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.ВремяНачала,
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.ВремяОкончания
	               |ПОМЕСТИТЬ ВремВремяПоДнямНеделиСкидок
	               |ИЗ
	               |	Документ.УстановкаСкидокНоменклатуры.ВремяПоДнямНедели КАК УстановкаСкидокНоменклатурыВремяПоДнямНедели
	               |ГДЕ
	               |	УстановкаСкидокНоменклатурыВремяПоДнямНедели.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВремВсеСкидки.Идентификатор
	               |			ИЗ
	               |				ВремВсеСкидки)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Скидка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВремВсеСкидки";
	
	лМенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= лМенеджерВременныхТаблиц; 
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();	
	
	Возврат лМенеджерВременныхТаблиц;
	
КонецФункции

Процедура ВыгрузитьИнформациюОСкидках(ПараметрыОбмена,МассивДанных, Операция)
				
	СписокВидовКарт		= Новый СписокЗначений;
	спкНоменклатуры		= Новый Массив;
	спкКонтрагентов		= Новый Массив;
	
	Успешно = Ложь;
	
	ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
	
	XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, -1); 
	
	Для Пакет = 0 по КоличествоПакетов Цикл
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет), ПараметрыОбмена);
		
		МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", Пакет));	
		
		РазбитаяСтруктураДанных = РазборМассиваДанныхПоТипамОбъектов(МассивСтрок);
			
		Если Пакет = 0 тогда
			
			СписокВидовКарт 	= РазбитаяСтруктураДанных.ВидыДК;
			спкНоменклатуры 	= ПолучитьМассивЭлементовПоОтборуКомпоновки("Справочник.Номенклатура"			, ПараметрыОбмена.ТаблицаОтбораСкидок[0]);
			спкКонтрагентов 	= ПолучитьМассивЭлементовПоОтборуКомпоновки("Справочник.Контрагенты"			, ПараметрыОбмена.ТаблицаОтбораСкидок[1]);
			
		КонецЕсли;
		
		Если (ПараметрыОбмена.ВыгружатьТолькоИзменения И НЕ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно) ИЛИ (ПараметрыОбмена.КоличествоТоваровВПакете <> 0) тогда
			лСодержатТолькоИзменения = Истина;
		Иначе
			лСодержатТолькоИзменения = Ложь;
		КонецЕсли;
			
		СписокСкидок 		= РазбитаяСтруктураДанных.Скидки;
		
		лМенеджерВременныхТаблиц = СформироватьВременныеТаблицыПоИнформацииОСкидкахПакета(ПараметрыОбмена, СписокСкидок, СписокВидовКарт, спкНоменклатуры, спкКонтрагентов);
		
		ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\discount\" + Строка(Пакет)); 
		
		XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);

		Если ПараметрыОбмена.СинхронизацияВидовКартЛояльности И Пакет = 0 тогда
			ВыгрузитьВидыКартЛояльностиXDTO(ПараметрыОбмена, XDTOКоммерческаяИнформация, XDTOКоммерческаяИнформацияТип, лМенеджерВременныхТаблиц);
		КонецЕсли;
		
		Если ПараметрыОбмена.СинхронизацияСкидок тогда
			ВыгрузитьСкидкиXDTO(ПараметрыОбмена, XDTOКоммерческаяИнформация, XDTOКоммерческаяИнформацияТип, лМенеджерВременныхТаблиц);
		КонецЕсли;
		
		лМенеджерВременныхТаблиц.Закрыть();
		
		Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "discount", "catalog", Пакет);		
			
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузки пакета " + Строка(Пакет) + " завершена.", ПараметрыОбмена);
		
	КонецЦикла;			
				
КонецПроцедуры 

Процедура ВыгрузитьВидыКартЛояльностиXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка видов карт лояльности в XML.", ПараметрыОбмена);
	Итератор = 0;
	
	XDTOВидыДисконтныхКартТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ВидыДисконтныхКарт", Истина, ВладелецТип);	
	XDTOВидыДисконтныхКарт 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOВидыДисконтныхКартТип); 
	
	XDTOВидДисконтнойКартыТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ВидДисконтнойКарты");	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремВидыКартЛояльности КАК ВремВидыКартЛояльности";
	ВыборкаВидов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаВидов.Следующий() Цикл
		
		XDTOВидДисконтнойКарты		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOВидДисконтнойКартыТип); 
		
		XDTOВидДисконтнойКарты.Ид				= XMLСтрока(ВыборкаВидов.Идентификатор);
		XDTOВидДисконтнойКарты.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаВидов.ВерсияДанных, "Видов карт лояльности");
		XDTOВидДисконтнойКарты.ПометкаУдаления	= XMLСтрока(ВыборкаВидов.ПометкаУдаления);
		XDTOВидДисконтнойКарты.Наименование		= XMLСтрока(ВыборкаВидов.Наименование);

		XDTOВидыДисконтныхКарт.ВидДисконтнойКарты.Добавить(XDTOВидДисконтнойКарты);
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка видов карт лояльности в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВремВидыКартЛояльности");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Владелец.ВидыДисконтныхКарт = XDTOВидыДисконтныхКарт;
	
КонецПроцедуры

Процедура ВыгрузитьСкидкиXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка скидок в XML.", ПараметрыОбмена);
	Итератор = 0;
	
	XDTOСкидкиТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Скидки", Истина, ВладелецТип);	
	XDTOСкидки 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкиТип); 
	
	XDTOСкидкаТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ИнформацияОСкидке");	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремСкидкиСПризнакомНеактивности КАК ВремСкидкиСПризнакомНеактивности";
	ВыборкаСкидок = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСкидок.Следующий() Цикл
		
		XDTOСкидка		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкаТип); 
		
		XDTOСкидка.Ид				= XMLСтрока(ВыборкаСкидок.Идентификатор);
		XDTOСкидка.НомерВерсии		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаСкидок.ВерсияДанных, "Скидок");
		XDTOСкидка.ПометкаУдаления	= XMLСтрока(ВыборкаСкидок.ПометкаУдаления);
		XDTOСкидка.Наименование		= XMLСтрока(Строка(ВыборкаСкидок.Скидка));
		
		//XDTOСкидка.Приоритет		= XMLСтрока();
		
		XDTOСкидка.Активность		= XMLСтрока(ВыборкаСкидок.Действует);
		
		Если ЗначениеЗаполнено(ВыборкаСкидок.ДатаНачала) тогда
			XDTOСкидка.ДатаНачала		= XMLСтрока(ВыборкаСкидок.ДатаНачала);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаСкидок.ДатаОкончания) тогда
			XDTOСкидка.ДатаЗавершения	= XMLСтрока(ВыборкаСкидок.ДатаОкончания);
		КонецЕсли;
		
		XDTOСкидка.ДатаСозданияСкидки	= XMLСтрока(ВыборкаСкидок.ДатаДокумента);
		XDTOСкидка.ГруппаСовместногоПрименения		= "По дате создания скидки";
		
		XDTOДополнительныеПараметрыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ДополнительныеПараметры", Истина, XDTOСкидкаТип);	
		XDTOДополнительныеПараметры 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДополнительныеПараметрыТип); 
			
		Если ЗначениеЗаполнено(ВыборкаСкидок.ВалютаКод) тогда
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Валюта", Лев(ВыборкаСкидок.ВалютаКод, 3 ));
		КонецЕсли;

		XDTOСкидка.Значение		= XMLСтрока(ВыборкаСкидок.ЗначениеСкидкиНаценки);
		XDTOСкидка.ТипСкидки	= "Скидка (наценка) процентом";
		
		Если XDTOДополнительныеПараметры.ПараметрУсловия.Количество() > 0 тогда
			XDTOСкидка.ДополнительныеПараметры = XDTOДополнительныеПараметры;
       	КонецЕсли;
		
		Если НЕ ВыборкаСкидок.ДляВсейНоменклатуры тогда
			ВыгрузитьУточненияЗначенийСкидок(ПараметрыОбмена, XDTOСкидка, XDTOСкидкаТип, МенеджерВременныхТаблиц, ВыборкаСкидок.Скидка);
		КонецЕсли;
		
		Если НЕ ВыборкаСкидок.ДляВсехПолучателей И ВыборкаСкидок.ВидСкидки <> Перечисления.ВидыСкидок.Оптовая тогда
			
			ВыгрузитьКлиентовДляСкидок(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, МенеджерВременныхТаблиц, ВыборкаСкидок.Скидка,"Ограничение по клиентам");
			
		КонецЕсли;
		
		Если ВыборкаСкидок.Условие <> Перечисления.УсловияСкидкиНаценки.БезУсловий ИЛИ ВыборкаСкидок.ПоДнямНедели тогда
			ВыгрузитьУсловияСкидки(ПараметрыОбмена, XDTOСкидка, XDTOСкидкаТип, МенеджерВременныхТаблиц, ВыборкаСкидок);
		КонецЕсли;
		
		XDTOСкидки.Скидка.Добавить(XDTOСкидка);
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка скидок в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Владелец.Скидки = XDTOСкидки;
	
КонецПроцедуры


/////////
 
Процедура ВыгрузитьУточненияЗначенийСкидок(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, Скидка)
	
	XDTOУточненияЗначенийСкидокТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "УточненияЗначенийСкидок", Истина, ВладелецТип);	
	XDTOУточненияЗначенийСкидок 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOУточненияЗначенийСкидокТип); 
	
	XDTOУточнениеЗначенияСкидкиТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "УточнениеЗначенияСкидки");	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТоварыСкидок КАК ВремТоварыСкидок	
	| ГДЕ
	|ВремТоварыСкидок.Скидка = &Скидка";
	Запрос.УстановитьПараметр("Скидка", Скидка);
	
	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл
		
		XDTOУточнениеЗначенияСкидки 			= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOУточнениеЗначенияСкидкиТип); 
		
		XDTOУточнениеЗначенияСкидки.Товар 		= XMLСтрока(ВыборкаЗначений.ИдентификаторНоменклатуры);
		
		Если ЗначениеЗаполнено(ВыборкаЗначений.ИдентификаторХарактеристики) тогда
			XDTOУточнениеЗначенияСкидки.Предложение = XMLСтрока(ВыборкаЗначений.ИдентификаторНоменклатуры) + "#" + XMLСтрока(ВыборкаЗначений.ИдентификаторХарактеристики); 
		КонецЕсли;
				
		XDTOУточнениеЗначенияСкидки.Значение 	= XMLСтрока(ВыборкаЗначений.ЗначениеСкидкиНаценки);
		 
		XDTOУточненияЗначенийСкидок.УточнениеЗначенияСкидки.Добавить(XDTOУточнениеЗначенияСкидки);
		
	КонецЦикла;
	
	Если XDTOУточненияЗначенийСкидок.УточнениеЗначенияСкидки.Количество() > 0 тогда
		Владелец.УточненияЗначенийСкидок = XDTOУточненияЗначенийСкидок;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьПредложенийСегментаДляСкидок(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, Сегмент, Наименование)
	
	XDTOПараметрУсловияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПараметрУсловия");	
	XDTOПараметрУсловия 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПараметрУсловияТип); 
	
	XDTOПараметрУсловия.Наименование 	= Наименование;	
	
	XDTOПредложенияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Предложения", Истина, XDTOПараметрУсловияТип);	
	XDTOПредложения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложенияТип); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "ВЫБРАТЬ *
	|ИЗ
	|	ВремСегментыНоменклатуры КАК ВремСегментыНоменклатуры
	| ГДЕ
	|ВремСегментыНоменклатуры.Сегмент = &Сегмент";
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	Запрос.Текст = ТекстЗапроса;
	
	тзнТоваров = Запрос.Выполнить().Выгрузить();
	тзнТоваров.Свернуть("ИдентификаторНоменклатуры, ИдентификаторХарактеристики");
	
	Для каждого ТекСтрока из тзнТоваров Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ИдентификаторХарактеристики) тогда
			лИд 	= XMLСтрока(ТекСтрока.ИдентификаторНоменклатуры) + "#" + XMLСтрока(ТекСтрока.ИдентификаторХарактеристики); 
		Иначе
			лИд 	= XMLСтрока(ТекСтрока.ИдентификаторНоменклатуры); 
		КонецЕсли;
		
		XDTOПредложения.Предложение.Добавить(лИд);
		
	КонецЦикла;
	
	Если XDTOПредложения.Предложение.количество() > 0 тогда
		XDTOПараметрУсловия.Предложения = XDTOПредложения;
	КонецЕсли;

	Владелец.ПараметрУсловия.Добавить(XDTOПараметрУсловия);	
	
КонецПроцедуры

Процедура ВыгрузитьУсловияСкидки(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, СтрокаСкидки)
	
	XDTOУсловияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Условия", Истина, ВладелецТип);	
	XDTOУсловия		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOУсловияТип); 
	
	XDTOУсловиеТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Условие", Истина, XDTOУсловияТип);	
	
	Если СтрокаСкидки.Условие <> Перечисления.УсловияСкидкиНаценки.БезУсловий тогда
		
		XDTOДополнительныеПараметрыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ДополнительныеПараметры", Истина, XDTOУсловиеТип);	
		XDTOДополнительныеПараметры 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДополнительныеПараметрыТип); 
		
		XDTOУсловие 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOУсловиеТип); 
		XDTOУсловие.Наименование	= XMLСтрока(Строка(СтрокаСкидки.Скидка));
		
		Если СтрокаСкидки.Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт  тогда
			
			XDTOУсловие.ТипУсловия = "За наличие вида дисконтной карты";	
			
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Вид дисконтной карты", XMLСтрока(СтрокаСкидки.ЗначениеУсловия));
			
		ИначеЕсли СтрокаСкидки.Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте  тогда
			
			XDTOУсловие.ТипУсловия = "За наличие дисконтной карты";	
			
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Дисконтная карта", XMLСтрока(СтрокаСкидки.ЗначениеУсловия));
			
		ИначеЕсли СтрокаСкидки.Условие = Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента  тогда
			
			XDTOУсловие.ТипУсловия = "За разовый объем продаж";	
			
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Мерило для оценки", "Сумма");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Область ограничения", "В документе");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Тип сравнения", "Не менее");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Значение условия ограничения", XMLСтрока(СтрокаСкидки.ЗначениеУсловия));
			
			Если ЗначениеЗаполнено(СтрокаСкидки.ВалютаКод) тогда
				ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Валюта", Лев(СтрокаСкидки.ВалютаКод, 3));
			КонецЕсли;
			
		ИначеЕсли СтрокаСкидки.Условие = Перечисления.УсловияСкидкиНаценки.ПоКоличествуТовара  тогда
			
			XDTOУсловие.ТипУсловия = "За разовый объем продаж";	
			
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Мерило для оценки", "Количество");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Область ограничения", "В строке");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Тип сравнения", "Не менее");
			ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, "Значение условия ограничения", XMLСтрока(СтрокаСкидки.ЗначениеУсловия));
			
		КонецЕсли;	
		
		Если XDTOДополнительныеПараметры.ПараметрУсловия.Количество() > 0 тогда
			XDTOУсловие.ДополнительныеПараметры = XDTOДополнительныеПараметры;
		КонецЕсли;
		
		XDTOУсловия.Условие.Добавить(XDTOУсловие);
		
	КонецЕсли;
	
	
	Если СтрокаСкидки.ПоДнямНедели тогда
		
		XDTOДополнительныеПараметрыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ДополнительныеПараметры", Истина, XDTOУсловиеТип);	
		XDTOДополнительныеПараметры 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДополнительныеПараметрыТип); 
		
		XDTOУсловие 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOУсловиеТип); 
		XDTOУсловие.Наименование	= XMLСтрока(Строка(СтрокаСкидки.Скидка) + " по дням недели");
		
		XDTOУсловие.ТипУсловия = "За время продажи";	
		
		ВыгрузитьВремяПродажДляУсловийСкидок(ПараметрыОбмена, XDTOДополнительныеПараметры, XDTOДополнительныеПараметрыТип, МенеджерВременныхТаблиц, СтрокаСкидки.Скидка, "Ограничение по времени продаж");
		
		Если XDTOДополнительныеПараметры.ПараметрУсловия.Количество() > 0 тогда
			XDTOУсловие.ДополнительныеПараметры = XDTOДополнительныеПараметры;
		КонецЕсли;
		
		XDTOУсловия.Условие.Добавить(XDTOУсловие);
		
	КонецЕсли;
	
	Если XDTOУсловия.Условие.Количество() > 0 тогда
		Владелец.Условия = XDTOУсловия;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПараметрУсловияСкидки(ПараметрыОбмена, Владелец, ВладелецТип, НаименованиеУсловия, ЗначениеУсловия)

	XDTOПараметрУсловияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПараметрУсловия");	
	XDTOПараметрУсловия 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПараметрУсловияТип); 
	
	XDTOПараметрУсловия.Наименование 	= НаименованиеУсловия;	
	XDTOПараметрУсловия.Значение		= ЗначениеУсловия;	
	
	Владелец.ПараметрУсловия.Добавить(XDTOПараметрУсловия);	
	
КонецПроцедуры

Процедура ВыгрузитьВремяПродажДляУсловийСкидок(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, Скидка, Наименование)
	
	XDTOПараметрУсловияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПараметрУсловия");	
	XDTOПараметрУсловия 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПараметрУсловияТип); 
	
	XDTOПараметрУсловия.Наименование 	= Наименование;	
	
	XDTOГрафикВыполненияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ГрафикВыполнения", Истина, XDTOПараметрУсловияТип);	
	XDTOГрафикВыполнения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГрафикВыполненияТип); 
	
	XDTOГрафикТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "График", Истина, XDTOГрафикВыполненияТип);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремВремяПоДнямНеделиСкидок КАК ВремВремяПоДнямНеделиСкидок
	| ГДЕ
	|ВремВремяПоДнямНеделиСкидок.Скидка = &Скидка
	|И ВремВремяПоДнямНеделиСкидок.Выбран";
	Запрос.УстановитьПараметр("Скидка", Скидка);
	
	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл
		
		XDTOГрафик 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГрафикТип); 
		
		лНомерДня = 1;
		
		Если ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Вторник тогда
			лНомерДня = 2;
		ИначеЕсли ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Среда тогда
			лНомерДня = 3;
		ИначеЕсли ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Четверг тогда
			лНомерДня = 4;
		ИначеЕсли ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Пятница тогда
			лНомерДня = 5;
		ИначеЕсли ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Суббота тогда
			лНомерДня = 6;
		ИначеЕсли ВыборкаЗначений.ДеньНедели = Перечисления.ДниНедели.Воскресенье тогда
			лНомерДня = 7;
		КонецЕсли;
		
		XDTOГрафик.НомерДня 		= лНомерДня;
		XDTOГрафик.ВремяНачала 		= XMLСтрока(ВыборкаЗначений.ВремяНачала);
		XDTOГрафик.ВремяЗавершения 	= XMLСтрока(ВыборкаЗначений.ВремяОкончания);
		
		XDTOГрафикВыполнения.График.Добавить(XDTOГрафик);
		
	КонецЦикла;
	
	Если XDTOГрафикВыполнения.График.Количество() > 0 тогда
		XDTOПараметрУсловия.ГрафикВыполнения = XDTOГрафикВыполнения;	
	КонецЕсли;

	Владелец.ПараметрУсловия.Добавить(XDTOПараметрУсловия);	
	
КонецПроцедуры

Процедура ВыгрузитьКлиентовДляСкидок(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц, Скидка, Наименование)
	
	XDTOПараметрУсловияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПараметрУсловия", Истина, ВладелецТип);	
	XDTOПараметрУсловия 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПараметрУсловияТип); 
	
	XDTOПараметрУсловия.Наименование 	= Наименование;	
	
	XDTOКонтрагентыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Контрагенты", Истина, XDTOПараметрУсловияТип);	
	XDTOКонтрагенты 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентыТип); 
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "ВЫБРАТЬ *
	|ИЗ
	|	ВремКонтрагентыСкидок КАК ВремКонтрагентыСкидок
	| ГДЕ
	|ВремКонтрагентыСкидок.Скидка = &Скидка";
	Запрос.УстановитьПараметр("Скидка", Скидка);
	
	Запрос.Текст = ТекстЗапроса;
	
	тзнТоваров = Запрос.Выполнить().Выгрузить();
	тзнТоваров.Свернуть("ИдентификаторКонтрагента");
	
	Для каждого ТекСтрока из тзнТоваров Цикл
		
		XDTOКонтрагенты.Контрагент.Добавить(XMLСтрока(ТекСтрока.ИдентификаторКонтрагента));
		
	КонецЦикла;
	
	Если XDTOКонтрагенты.Контрагент.Количество() > 0 тогда
		XDTOПараметрУсловия.Контрагенты = XDTOКонтрагенты;	
	КонецЕсли;

	Владелец.ПараметрУсловия.Добавить(XDTOПараметрУсловия);	
	
КонецПроцедуры



			///////////////////////////////////////////////////////////////////
			//			 ВЫГРУЗКА ИНФОРМЦИИ О КАРТАХ ЛОЯЛЬНОСТИ	            //
			/////////////////////////////////////////////////////////////////

Функция СформироватьВременныеТаблицыПоКартамЛояльностиПакета(ПараметрыОбмена, СписокКартЛояльности, СписокВидовКарт)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Узел"	, ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("ТекДата"	, ТекущаяДата());
	
	Запрос.УстановитьПараметр("СписокКартЛояльности", СписокКартЛояльности);
	Запрос.УстановитьПараметр("СписокВидовКарт"		, СписокВидовКарт);

	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	КартыЛояльности.ВладелецКарты КАК Контрагент,
	|	КартыЛояльности.КодКарты,
	|	КартыЛояльности.ВидДисконтнойКарты КАК ВидКарты,
	|	КартыЛояльности.Ссылка КАК Идентификатор,
	|	КартыЛояльности.Наименование,
	|	КартыЛояльности.ВерсияДанных,
	|	КартыЛояльности.ПометкаУдаления,
	|	КартыЛояльности.ВладелецКарты,
	|	ВЫБОР
	|		КОГДА КартыЛояльности.ВладелецКарты.Б_Идентификатор <> """"
	|			ТОГДА КартыЛояльности.ВладелецКарты.Б_Идентификатор
	|		ИНАЧЕ КартыЛояльности.ВладелецКарты
	|	КОНЕЦ КАК ИдентификаторКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ВерсияДанных КАК ВерсияДанныхКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ПометкаУдаления КАК ПометкаУдаленияКонтрагента,
	|	КартыЛояльности.ВладелецКарты.Код КАК КодКонтрагента,
	|	КартыЛояльности.ВладелецКарты.Наименование КАК НаименованиеКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ИНН КАК ИННКонтрагента,
	//БВ
	//|	КартыЛояльности.ВладелецКарты.КодПоОКПО КАК КодПоОКПОКонтрагента,
	|	КартыЛояльности.ВладелецКарты.КодПоЕДРПОУ КАК КодПоОКПОКонтрагента,
	//
	|	КартыЛояльности.ВладелецКарты.Комментарий КАК КомментарийКонтрагента,
	//БВ
	//|	КартыЛояльности.ВладелецКарты.КПП КАК КППКонтрагента,
	|	"""" КАК КППКонтрагента,
	//
	|	КартыЛояльности.ВладелецКарты.НаименованиеПолное КАК НаименованиеПолноеКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ОсновнойБанковскийСчет КАК ОсновнойБанковскийСчетКонтрагента,
	|	КартыЛояльности.ВладелецКарты.ЮрФизЛицо КАК ЮрФизЛицоКонтрагента,
	|   ""Контрагенты"" КАК ТипКонтрагента,
	|	ВЫБОР
	|		КОГДА КартыЛояльности.ВладелецКарты.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ КартыЛояльности.ВладелецКарты.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОсновнойБанковскийСчетКонтрагента
	|ПОМЕСТИТЬ ВремКартыЛояльности
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК КартыЛояльности
	|ГДЕ
	|	КартыЛояльности.Ссылка В(&СписокКартЛояльности)
	|	И КартыЛояльности.ВладелецКарты ССЫЛКА Справочник.Контрагенты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыКартЛояльности.Ссылка КАК Идентификатор,
	|	ВидыКартЛояльности.ВерсияДанных,
	|	ВидыКартЛояльности.Наименование,
	|	ВидыКартЛояльности.ПометкаУдаления
	|ПОМЕСТИТЬ ВремВидыКартЛояльности
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыКартЛояльности
	|ГДЕ
	|	ВидыКартЛояльности.Ссылка В(&СписокВидовКарт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор";	
	
	лМенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= лМенеджерВременныхТаблиц; 
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();	
	
	Возврат лМенеджерВременныхТаблиц;
	
КонецФункции

Процедура ВыгрузитьИнформациюОКартахЛояльности(ПараметрыОбмена,МассивДанных, Операция)
				
	СписокВидовКарт		= Новый СписокЗначений;
	Успешно = Ложь;
	
	ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
	
	XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, -1); 
	
	Для Пакет = 0 по КоличествоПакетов Цикл
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет), ПараметрыОбмена);
		
		МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", Пакет));	
		
		РазбитаяСтруктураДанных = РазборМассиваДанныхПоТипамОбъектов(МассивСтрок);
			
		Если Пакет = 0 тогда
			СписокВидовКарт 	= РазбитаяСтруктураДанных.ВидыДК;	
		КонецЕсли;
		
		Если (ПараметрыОбмена.ВыгружатьТолькоИзменения И НЕ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно) ИЛИ (ПараметрыОбмена.КоличествоТоваровВПакете <> 0) тогда
			лСодержатТолькоИзменения = Истина;
		Иначе
			лСодержатТолькоИзменения = Ложь;
		КонецЕсли;
			
		СписокКартЛояльности 		= РазбитаяСтруктураДанных.КартыЛояльности;
		
		лМенеджерВременныхТаблиц = СформироватьВременныеТаблицыПоКартамЛояльностиПакета(ПараметрыОбмена, СписокКартЛояльности, СписокВидовКарт);
		
		ИмяКаталога = ?(Пакет > 0, ПараметрыОбмена.КаталогНаДиске + "\" + Строка(Пакет), ПараметрыОбмена.КаталогНаДиске); 
		ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\discountCard\" + Строка(Пакет)); 
				
		XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);

		Если ПараметрыОбмена.СинхронизацияВидовКартЛояльности И Пакет = 0 тогда
			ВыгрузитьВидыКартЛояльностиXDTO(ПараметрыОбмена, XDTOКоммерческаяИнформация, XDTOКоммерческаяИнформацияТип, лМенеджерВременныхТаблиц);
		КонецЕсли;
		
		Если ПараметрыОбмена.СинхронизацияКартЛояльности тогда
			ВыгрузитьКартыЛояльностиXDTO(ПараметрыОбмена, XDTOКоммерческаяИнформация, XDTOКоммерческаяИнформацияТип, лМенеджерВременныхТаблиц);
		КонецЕсли;

		
		лМенеджерВременныхТаблиц.Закрыть();
		
		Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "discountCard", "catalog", Пакет);		
			
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузки пакета " + Строка(Пакет) + " завершена.", ПараметрыОбмена);
		
	КонецЦикла;			
				
КонецПроцедуры 

Процедура ВыгрузитьКартыЛояльностиXDTO(ПараметрыОбмена, Владелец, ВладелецТип, МенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка карт лояльности в XML.", ПараметрыОбмена);
	Итератор = 0;
	
	XDTOДисконтныеКартыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ДисконтныеКарты", Истина, ВладелецТип);	
	XDTOДисконтныеКарты 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДисконтныеКартыТип); 
	
	XDTOДисконтнаяКартаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ДисконтнаяКарта");	
	
	XDTOКонтрагентТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагент", Истина, XDTOДисконтнаяКартаТип); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремКартыЛояльности КАК ВремКартыЛояльности";
	ВыборкаКарт = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКарт.Следующий() Цикл
		
		
		XDTOДисконтнаяКарта					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДисконтнаяКартаТип); 
		
		XDTOДисконтнаяКарта.Ид					= XMLСтрока(ВыборкаКарт.Идентификатор) + "_" +XMLСтрока(ВыборкаКарт.Контрагент);
		XDTOДисконтнаяКарта.НомерВерсии			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ВыборкаКарт.ВерсияДанных, "Карт лояльности");
		XDTOДисконтнаяКарта.ПометкаУдаления		= XMLСтрока(ВыборкаКарт.ПометкаУдаления);
		XDTOДисконтнаяКарта.Наименование		= XMLСтрока(ВыборкаКарт.Наименование);
		XDTOДисконтнаяКарта.ВидДисконтнойКарты	= XMLСтрока(ВыборкаКарт.ВидКарты);
		XDTOДисконтнаяКарта.Штрихкод			= XMLСтрока(ВыборкаКарт.КодКарты);
		
		Если  ЗначениеЗаполнено(ВыборкаКарт.Контрагент) тогда
			XDTOДисконтнаяКарта.Контрагент			= ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  ВыборкаКарт);
		КонецЕсли;
		
		XDTOДисконтныеКарты.ДисконтнаяКарта.Добавить(XDTOДисконтнаяКарта);
		
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка карт лояльности в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);
	
	Если XDTOДисконтныеКарты.ДисконтнаяКарта.Количество() > 0 тогда
		Владелец.ДисконтныеКарты = XDTOДисконтныеКарты;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивЭлементовПоОтборуКомпоновки(Объект, Отбор) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 	"ВЫБРАТЬ
	|	Объект.Ссылка КАК Объект
	|ИЗ
	|	" + Объект + " КАК Объект
	|";
	
	лУсловие = "";
	                             
	Если Отбор.ВидСравнения = ВидСравнения.Равно тогда
		лУсловие = "Объект.Ссылка = &П";
	ИначеЕсли Отбор.ВидСравнения = ВидСравнения.НеРавно тогда
		лУсловие = "Объект.Ссылка <> &П";
	ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСписке тогда
		лУсловие = "Объект.Ссылка В (&П)";
	ИначеЕсли Отбор.ВидСравнения = ВидСравнения.НеВСписке тогда
		лУсловие = "НЕ Объект.Ссылка В (&П)";
	ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии ИЛИ Отбор.ВидСравнения = ВидСравнения.ВИерархии тогда
		лУсловие = "Объект.Ссылка В ИЕРАРХИИ (&П)";
	ИначеЕсли Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии ИЛИ Отбор.ВидСравнения = ВидСравнения.НеВИерархии тогда
		лУсловие = "НЕ Объект.Ссылка В ИЕРАРХИИ (&П)";
	КонецЕсли;
	
	
	Если Отбор.Использование = Ложь ИЛИ лУсловие = "" тогда
		
		Запрос.Текст = ТекстЗапроса; 
		
	Иначе
		
		Запрос.Текст = ТекстЗапроса + "
		|ГДЕ 
		|" + лУсловие;
		Запрос.УстановитьПараметр("П", Отбор.Значение);	
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
	
	Возврат Результат; 
	
КонецФункции


 
			///////////////////////////////////////////////////////////////////
			//			 			ВЫГРУЗКА ДОКУМЕНТОВ                     //
			/////////////////////////////////////////////////////////////////

			
Процедура ВыгрузитьДокументы(ПараметрыОбмена, ТаблицаДокументов)
	
	ТаблицаДокументов.Колонки.Добавить("Дата");
	Для каждого ТекСтрока из ТаблицаДокументов Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.Объект) тогда
			ТекСтрока.Дата = ТекСтрока.Объект.Дата;	
		КонецЕсли;
		
	КонецЦикла;           
	
	лКоличествоСтрок 	= ТаблицаДокументов.Количество();
	КоличествоПакетов 	= ?(лКоличествоСтрок > 0, ТаблицаДокументов[лКоличествоСтрок - 1].Пакет, 0); 
	
	ТаблицаДокументов.Сортировать("Дата");
	
	лИмяСохраняемогоФайла = "";
	
	Если КоличествоПакетов > 0 тогда
		
		ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
		
		XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");  
		XDTOКонтейнерТип				= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Контейнер", Истина, XDTOКоммерческаяИнформацияТип);

		Для Пакет = 1 по КоличествоПакетов Цикл

			КоличествоКонтейнеров 	= 0;
			КоличествоЗаказов 		= 0;
			КоличествоОтгрузок 		= 0;
			КоличествоОплат 		= 0;
			
			ВыгруженныеДокументы = Новый ТаблицаЗначений;
			ВыгруженныеДокументы.Колонки.Добавить("Объект");
			
			НайденныеДокументы = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пакет",Пакет));

			ВремТаб = ТаблицаДокументов.СкопироватьКолонки("Объект");
			Для каждого НайденныйДокумент из НайденныеДокументы Цикл
				ВремТаб.Добавить().Объект = НайденныйДокумент.Объект;
			КонецЦикла;

			лМенеджерВременныхТаблиц 	= СформироватьВременныеТаблицыПоДокументам(ПараметрыОбмена, ВремТаб);

			XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип); 
			
			Для каждого ТекДокумент из НайденныеДокументы Цикл

				XDTOКонтейнер = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтейнерТип);
			                                                                                         
				Если ТекДокумент.ТипОбъекта = "Заказ" тогда
					
					Запрос = Новый Запрос();
					Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
					Запрос.УстановитьПараметр("Заказ", ТекДокумент.Объект);
					Запрос.Текст = "ВЫБРАТЬ *
					|ИЗ
					|	ВремИнформацияОЗаказах КАК ВремИнформацияОЗаказах
					|ГДЕ
					|ВремИнформацияОЗаказах.Заказ = &Заказ";
					МассивЗаказов = Запрос.Выполнить().Выгрузить();
					
					Для каждого ТекЗаказ из МассивЗаказов Цикл 
						
						XDTOДокумент = ВыгрузитьЗаказXDTO(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекЗаказ, КоличествоЗаказов);
						XDTOКонтейнер.Документ.Добавить(XDTOДокумент);
						
						ВыгруженныеДокументы.Добавить().Объект =  ТекЗаказ.Объект;
						
					КонецЦикла;
					
					Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
					
						Запрос = Новый Запрос();
						Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
						Запрос.УстановитьПараметр("Заказ", ТекДокумент.Объект);
						Запрос.Текст = "ВЫБРАТЬ *
						|ИЗ
						|	ВремИнформацияООтгрузках КАК ВремИнформацияООтгрузках
						|ГДЕ
						|ВремИнформацияООтгрузках.Заказ = &Заказ";
						МассивОтгрузок = Запрос.Выполнить().Выгрузить();
						
						Для каждого ТекОтгрузка из МассивОтгрузок Цикл 
							
							XDTOДокумент = ВыгрузитьОтгрузкуXDTO(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекОтгрузка, КоличествоОтгрузок);
							XDTOКонтейнер.Документ.Добавить(XDTOДокумент);
							
							ВыгруженныеДокументы.Добавить().Объект =  ТекОтгрузка.Объект;
							
						КонецЦикла;
					КонецЕсли;
					
					Если ПараметрыОбмена.ВыгрузкаОплат тогда
						
						Запрос = Новый Запрос();
						Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
						Запрос.УстановитьПараметр("Заказ", ТекДокумент.Объект);
						Запрос.Текст = "ВЫБРАТЬ *
						|ИЗ
						|	ВремИнформацияООплатах КАК ВремИнформацияООплатах
						|ГДЕ
						|ВремИнформацияООплатах.Заказ = &Заказ";
						МассивОплат = Запрос.Выполнить().Выгрузить();
						
						Для каждого ТекОплата из МассивОплат Цикл 
							
							XDTOДокумент = ВыгрузитьОплатуXDTO(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекОплата, КоличествоОплат); 						
							XDTOКонтейнер.Документ.Добавить(XDTOДокумент);
							
							ВыгруженныеДокументы.Добавить().Объект =  ТекОплата.Объект;
							
						КонецЦикла;
					КонецЕсли;
					
				ИначеЕсли ТекДокумент.ТипОбъекта = "Отгрузка" тогда
					
					Запрос = Новый Запрос();
					Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
					Запрос.УстановитьПараметр("Документ", ТекДокумент.Объект);
					Запрос.Текст = "ВЫБРАТЬ *
					|ИЗ
					|	ВремИнформацияООтгрузках КАК ВремИнформацияООтгрузках
					|ГДЕ
					|ВремИнформацияООтгрузках.Документ = &Документ";
					МассивОтгрузок = Запрос.Выполнить().Выгрузить();
					
					Для каждого ТекОтгрузка из МассивОтгрузок Цикл 
						
						XDTOДокумент = ВыгрузитьОтгрузкуXDTO(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекОтгрузка, КоличествоОтгрузок);
						XDTOКонтейнер.Документ.Добавить(XDTOДокумент);
							
						ВыгруженныеДокументы.Добавить().Объект =  ТекОтгрузка.Объект;
							
					КонецЦикла;
					
				КонецЕсли;

				XDTOКоммерческаяИнформация.Контейнер.Добавить(XDTOКонтейнер);
						
				КоличествоКонтейнеров = КоличествоКонтейнеров + 1;	
	
			КонецЦикла;
			
			ИмяКаталогаXMLфайлов = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\documents\" +  Строка(Пакет)); 
			
			Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталогаXMLфайлов, "documents", "sale", Пакет);		
			
			УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(Успешно, ПараметрыОбмена, "Документы", Пакет, "Документы", ВыгруженныеДокументы);
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакета " + Строка(Пакет) + " контейнеров документов завершено. Выгружено " + Строка(КоличествоКонтейнеров) + " контейнеров.", ПараметрыОбмена);
		
			лМенеджерВременныхТаблиц.Закрыть();
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры 			

Функция ПолучитьТаблицуДанныхДляПакетовКонтейнеровДокументов(ПараметрыОбмена, Операция)
	
	ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "Заказы");
	ТаблицаВыгрузкиЗаказов = ЗапросПостроителя.Выполнить().Выгрузить(); 
	
	ТаблицаВыгрузкиОплат 	= ТаблицаВыгрузкиЗаказов.СкопироватьКолонки();
	ТаблицаВыгрузкиОтгрузок = ТаблицаВыгрузкиЗаказов.СкопироватьКолонки();
	
	Если ПараметрыОбмена.ВыгрузкаОплат тогда
		
		ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "Оплаты");
		ТаблицаВыгрузкиОплат = ЗапросПостроителя.Выполнить().Выгрузить(); 
		
	КонецЕсли;
	
	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
		
		ЗапросПостроителя = ПолучитьЗапросДляВыгрузкиДанных(ПараметрыОбмена, Операция, "Отгрузки");
		ТаблицаВыгрузкиОтгрузок = ЗапросПостроителя.Выполнить().Выгрузить(); 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВыгружаемыеЗаказыПоОтборам"		, ПараметрыОбмена.ВыгружаемыеЗаказыПоОтборам);
	Запрос.УстановитьПараметр("ВыгружаемыеОплатыПоОтборам"		, ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам);
	Запрос.УстановитьПараметр("ВыгружаемыеОтгрузкиПоОтборам"	, ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам);
	
	Запрос.УстановитьПараметр("ИспользоватьОтборПоЗаказам"		, ?(ПараметрыОбмена.ВыгружаемыеЗаказыПоОтборам = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("ИспользоватьОтборПоОплатам"		, ?(ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("ИспользоватьОтборПоОтгрузкам"	, ?(ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам = Неопределено, Ложь, Истина));
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВремЗаказы.Объект,
	|	ВремЗаказы.Заказ,
	|	ВремЗаказы.ТипОбъекта
	|ПОМЕСТИТЬ ВремЗаказы
	|ИЗ
	|	&ВремЗаказы КАК ВремЗаказы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоЗаказам
	|				ТОГДА  ВремЗаказы.Объект В (&ВыгружаемыеЗаказыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОплаты.Объект,
	|	ВремОплаты.Заказ,
	|	ВремОплаты.ТипОбъекта
	|ПОМЕСТИТЬ ВремОплаты
	|ИЗ
	|	&ВремОплаты КАК ВремОплаты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам
	|				ТОГДА  ВремОплаты.Объект В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоЗаказам
	|				ТОГДА  ВремОплаты.Заказ В (&ВыгружаемыеЗаказыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОтгрузки.Объект,
	|	ВремОтгрузки.Заказ,
	|	ВремОтгрузки.ТипОбъекта
	|ПОМЕСТИТЬ ВремОтгрузки
	|ИЗ
	|	&ВремОтгрузки КАК ВремОтгрузки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОтгрузкам
	|				ТОГДА  ВремОтгрузки.Объект В (&ВыгружаемыеОтгрузкиПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоЗаказам
	|				ТОГДА  ВремОтгрузки.Заказ В (&ВыгружаемыеЗаказыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремЗаказы.Заказ КАК Объект,
	|	ВремЗаказы.ТипОбъекта
	|ИЗ
	|	ВремЗаказы КАК ВремЗаказы
	|ГДЕ
	|	ВремЗаказы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ВремЗаказы.Заказ <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремОплаты.Заказ,
	|	""Заказ""
	|ИЗ
	|	ВремОплаты КАК ВремОплаты
	|ГДЕ
	|	ВремОплаты.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ВремОплаты.Заказ <> НЕОПРЕДЕЛЕНО
	|	И ВремОплаты.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ВремОтгрузки.Заказ ССЫЛКА Документ.ЗаказПокупателя  ИЛИ ВремОтгрузки.Заказ ЕСТЬ NULL
	|				ИЛИ ВремОтгрузки.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) 
	|			ТОГДА ВремОтгрузки.Объект
	|		ИНАЧЕ ВремОтгрузки.Заказ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВремОтгрузки.Заказ ССЫЛКА Документ.ЗаказПокупателя  ИЛИ ВремОтгрузки.Заказ ЕСТЬ NULL
	|				ИЛИ ВремОтгрузки.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) 
	|			ТОГДА ВремОтгрузки.ТипОбъекта
	|		ИНАЧЕ ""Заказ""
	|	КОНЕЦ
	|ИЗ
	|	ВремОтгрузки КАК ВремОтгрузки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ВремОтгрузки.Заказ ССЫЛКА Документ.ЗаказПокупателя  ИЛИ ВремОтгрузки.Заказ ЕСТЬ NULL
	|					ИЛИ ВремОтгрузки.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) 
	|				ТОГДА ВремОтгрузки.Объект
	|			ИНАЧЕ ВремОтгрузки.Заказ
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НЕ ВремОтгрузки.Заказ ССЫЛКА Документ.ЗаказПокупателя  ИЛИ ВремОтгрузки.Заказ ЕСТЬ NULL
	|					ИЛИ ВремОтгрузки.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) 
	|				ТОГДА ВремОтгрузки.Объект
	|			ИНАЧЕ ВремОтгрузки.Заказ
	|		КОНЕЦ <> НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОтгрузки";
	
	Запрос.УстановитьПараметр("ВремЗаказы",ТаблицаВыгрузкиЗаказов);
	Запрос.УстановитьПараметр("ВремОплаты",ТаблицаВыгрузкиОплат);
	Запрос.УстановитьПараметр("ВремОтгрузки",ТаблицаВыгрузкиОтгрузок);
	
	ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
	ТаблицаОбъектовОбменаВыгрузки.Свернуть("Объект, ТипОбъекта");
	
	Возврат ТаблицаОбъектовОбменаВыгрузки; 
	
КонецФункции

Функция СформироватьВременныеТаблицыПоДокументам(ПараметрыОбмена, МассивДанных)
	
	ОбщийЗапрос = Новый Запрос;
	
	ОбщийЗапрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	ОбщийЗапрос.УстановитьПараметр("СвойствоИдМетодаОплаты"	, ПараметрыОбмена.СвойствоИдМетодаОплаты);
	ОбщийЗапрос.УстановитьПараметр("СвойствоИдентификаторОтправления", ПараметрыОбмена.СвойствоИдентификаторОтправления);
	
	
	лИспользуетсяСтатусЗаказаСвойство 	= Ложь;
	лСтатусЗаказаСвойство 				= Ложь;
	
	лНастройкиСтатусовЗаказа = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСтатусовЗаказа");
	Если лНастройкиСтатусовЗаказа <> Неопределено тогда
		лИспользуетсяСтатусЗаказаСвойство = Истина;
		лСтатусЗаказаСвойство = ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа;
	КонецЕсли;
			
	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСтатусЗаказаСвойство"	, лИспользуетсяСтатусЗаказаСвойство);
	ОбщийЗапрос.УстановитьПараметр("СтатусЗаказаСвойство"				, лСтатусЗаказаСвойство);
	
	
	лИспользуетсяСлужбыДоставкиЗаказаСвойство 	= Ложь;
	лИспользуетсяСлужбыДоставкиОтгрузкиСвойство = Ложь;
	лСлужбаДоставкиЗаказСвойство 	= Ложь;
	лСлужбаДоставкиОтгрузкиСвойство = Ложь;
	
	лНастройкиСлужбДоставкиДокументов = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСлужбДоставкиДокументов");
	Если лНастройкиСлужбДоставкиДокументов <> Неопределено тогда
		
		лСлужбаДоставкиЗаказСвойство 	= ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа;
		лСлужбаДоставкиОтгрузкиСвойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки;
		
		лИспользуетсяСлужбыДоставкиЗаказаСвойство = Истина;
		
		Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
			лИспользуетсяСлужбыДоставкиОтгрузкиСвойство = Истина;
		КонецЕсли;
		
	КонецЕсли;
			
	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСлужбыДоставкиЗаказаСвойство"	, лИспользуетсяСлужбыДоставкиЗаказаСвойство);
	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСлужбыДоставкиОтгрузкиСвойство"	, лИспользуетсяСлужбыДоставкиОтгрузкиСвойство);
	ОбщийЗапрос.УстановитьПараметр("СлужбаДоставкиЗаказСвойство"				, лСлужбаДоставкиЗаказСвойство);
	ОбщийЗапрос.УстановитьПараметр("СлужбаДоставкиОтгрузкиСвойство"				, лСлужбаДоставкиОтгрузкиСвойство);
	
	ОбщийЗапрос.УстановитьПараметр("ВыгружаемыеОплатыПоОтборам"		, ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам);
	ОбщийЗапрос.УстановитьПараметр("ВыгружаемыеОтгрузкиПоОтборам"	, ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам);
	
	ОбщийЗапрос.УстановитьПараметр("ИспользоватьОтборПоОплатам"		, ?(ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам = Неопределено, Ложь, Истина));
	ОбщийЗапрос.УстановитьПараметр("ИспользоватьОтборПоОтгрузкам"	, ?(ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам = Неопределено, Ложь, Истина));
	
	МенеджерВременныхТаблицДокументов 	= Новый МенеджерВременныхТаблиц;
	ОбщийЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДокументов;
	
	ЗапросПоЗаказам = "ВЫБРАТЬ
	|	МассивДанных.Объект КАК Объект
	|ПОМЕСТИТЬ ВремМассивДанных
	|ИЗ
	|	&МассивДанных КАК МассивДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Документ,
	|	""Заказ"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ Ссылка В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВремОтмененныеЗаказы
	|ИЗ
	|Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ ЗаказПокупателя В (ВЫБРАТЬ Документ ИЗ ВремЗаказы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЗаказСсылка.Б_Идентификатор = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВложенныйЗапрос.ЗаказСсылка.НомерВходящегоДокументаЭлектронногоОбмена = """"
	|						ТОГДА ВложенныйЗапрос.ЗаказСсылка.Ссылка
	|					ИНАЧЕ ВложенныйЗапрос.ЗаказСсылка.НомерВходящегоДокументаЭлектронногоОбмена
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныйЗапрос.ЗаказСсылка.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	ВложенныйЗапрос.ЗаказСсылка.Ссылка КАК Объект,
	|	ВложенныйЗапрос.ЗаказСсылка.ВерсияДанных КАК ВерсияДанных,
	|	ВложенныйЗапрос.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
	|	ВложенныйЗапрос.ЗаказСсылка.Номер КАК Номер,
	|	ВложенныйЗапрос.ЗаказСсылка.Дата КАК Дата,
	|	ВложенныйЗапрос.ЗаказСсылка.Б_Идентификатор КАК НомерССайта,
	|	ВложенныйЗапрос.ЗаказСсылка.Б_ДатаДокумента КАК ДатаССайта,
	|	ВложенныйЗапрос.ЗаказСсылка.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.ЗаказСсылка.ВалютаДокумента.Наименование КАК ВалютаКод,
	|	ВложенныйЗапрос.ЗаказСсылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ВложенныйЗапрос.ЗаказСсылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВложенныйЗапрос.ЗаказСсылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВложенныйЗапрос.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
	|	ВложенныйЗапрос.ЗаказСсылка.Комментарий КАК Комментарий,
	|	""Заказ"" КАК ТипДокумента,
	|	ВложенныйЗапрос.ЗаказСсылка.Проведен КАК Проведен,
	|	ВложенныйЗапрос.Отгружен КАК Отгружен,
	|	ВложенныйЗапрос.Оплачен КАК Оплачен,
	|	ВложенныйЗапрос.ДокументОплаты КАК ДокументОплаты,
	|	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЗаказСсылка.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ВложенныйЗапрос.ЗаказСсылка.Контрагент.Ссылка
	|		ИНАЧЕ ВложенныйЗапрос.ЗаказСсылка.Контрагент.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторКонтрагента,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЗаказСсылка.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ВложенныйЗапрос.ЗаказСсылка.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОсновнойБанковскийСчетКонтрагента,
	|	""Контрагенты"" КАК ТипКонтрагента,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЗаказСсылка.СкладГруппа.Б_Идентификатор = """"
	|			ТОГДА ВложенныйЗапрос.ЗаказСсылка.СкладГруппа.Ссылка
	|		ИНАЧЕ ВложенныйЗапрос.ЗаказСсылка.СкладГруппа.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклад,
	|	ВложенныйЗапрос.ЗаказСсылка.СкладГруппа.Наименование КАК НаименованиеСклад,
	|	ВложенныйЗапрос.ЗаказСсылка.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЗаказСсылка.Ссылка В
	|				(ВЫБРАТЬ
	|					ВремОтмененныеЗаказы.ЗаказПокупателя
	|				ИЗ
	|					ВремОтмененныеЗаказы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВложенныйЗапрос.ЗаказСсылка.ПометкаУдаления
	|	КОНЕЦ КАК Отменен,
	|	ВложенныйЗапрос.ЗаказСсылка.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВремИнформацияОЗаказахПромежуточная
	|ИЗ
	|	ВремЗаказы КАК ВремЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Заказы.ЗаказСсылка КАК ЗаказСсылка,
	|			Заказы.Отгружен КАК Отгружен,
	|			Заказы.Оплачен КАК Оплачен,
	|			МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты,
	|			МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки
	|		ИЗ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				НашиЗаказы.Ссылка КАК ЗаказСсылка,
	|				ВЫБОР
	|					КОГДА НЕ НашиЗаказы.Проведен
	|							ИЛИ ЗаказыПокупателей.Регистратор ЕСТЬ NULL 
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ЗаказыПокупателейОстатки.СуммаВзаиморасчетовОстаток, 0) <= 0
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОНЕЦ КАК Отгружен,
	|				ВЫБОР
	|					КОГДА НЕ НашиЗаказы.Проведен
	|							ИЛИ РасчетыСКонтрагентами.Регистратор ЕСТЬ NULL 
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток, 0) <= 0
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОНЕЦ КАК Оплачен,
	|				РасчетыСКонтрагентами.Регистратор КАК ДокументОплаты,
	|				ЗаказыПокупателей.Регистратор КАК ДокументОтгрузки
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ЗаказПокупателя.Ссылка КАК Ссылка,
	|					ЗаказПокупателя.Проведен КАК Проведен
	|				ИЗ
	|					ВремЗаказы КАК ВремЗаказы
	|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|						ПО ВремЗаказы.Документ = ЗаказПокупателя.Ссылка) КАК НашиЗаказы
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, ) КАК ЗаказыПокупателейОстатки
	|					ПО НашиЗаказы.Ссылка = ЗаказыПокупателейОстатки.ЗаказПокупателя
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентами.Остатки(, ) КАК РасчетыСКонтрагентамиОстатки
	|					ПО НашиЗаказы.Ссылка = РасчетыСКонтрагентамиОстатки.Сделка
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|					ПО НашиЗаказы.Ссылка = ЗаказыПокупателей.ЗаказПокупателя
	|						И (ЗаказыПокупателей.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)
	|						И (ЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход))
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентами КАК РасчетыСКонтрагентами
	|					ПО НашиЗаказы.Ссылка = РасчетыСКонтрагентами.Сделка
	|						И (
	//БВ закомментировал
	//РасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.АккредитивПолученный
	//|							ИЛИ 
	|РасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ОплатаОтПокупателяПлатежнойКартой
	|							ИЛИ РасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	|							ИЛИ РасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	|						И (РасчетыСКонтрагентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход))) КАК Заказы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Заказы.ЗаказСсылка,
	|			Заказы.Отгружен,
	|			Заказы.Оплачен) КАК ВложенныйЗапрос
	|		ПО ВремЗаказы.Документ = ВложенныйЗапрос.ЗаказСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение,
	|	ЗначенияСвойствОбъектов.Объект
	|ПОМЕСТИТЬ ВремСтатусСвойствоЗаказов
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСтатусЗаказаСвойство
	|	И ЗначенияСвойствОбъектов.Свойство = &СтатусЗаказаСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение,
	|	ЗначенияСвойствОбъектов.Объект
	|ПОМЕСТИТЬ ВремСлужбаДоставкиСвойствоЗаказов
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСлужбыДоставкиЗаказаСвойство
	|	И ЗначенияСвойствОбъектов.Свойство = &СлужбаДоставкиЗаказСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнформацияОЗаказахПромежуточная.Объект,
	|	ВремИнформацияОЗаказахПромежуточная.Заказ КАК Заказ,
	|	ВремИнформацияОЗаказахПромежуточная.Идентификатор КАК ИдентификаторДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.ВерсияДанных,
	|	ВремИнформацияОЗаказахПромежуточная.ПометкаУдаления,
	|	ВремИнформацияОЗаказахПромежуточная.Номер,
	|	ВремИнформацияОЗаказахПромежуточная.Дата,
	|	ВремИнформацияОЗаказахПромежуточная.НомерССайта,
	|	ВремИнформацияОЗаказахПромежуточная.ДатаССайта,
	|	ВремИнформацияОЗаказахПромежуточная.Контрагент,
	|	ВремИнформацияОЗаказахПромежуточная.ВалютаКод,
	|	ВремИнформацияОЗаказахПромежуточная.УчитыватьНДС,
	|	ВремИнформацияОЗаказахПромежуточная.СуммаВключаетНДС,
	|	ВремИнформацияОЗаказахПромежуточная.КурсВзаиморасчетов,
	|	ВремИнформацияОЗаказахПромежуточная.СуммаДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.Комментарий,
	|	ВремИнформацияОЗаказахПромежуточная.ТипДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.Проведен,
	|	ВремИнформацияОЗаказахПромежуточная.Отгружен,
	|	ВремИнформацияОЗаказахПромежуточная.Оплачен,
	|	ВремИнформацияОЗаказахПромежуточная.ДокументОплаты,
	|	ВремИнформацияОЗаказахПромежуточная.ДокументОтгрузки,
	|	ВремИнформацияОЗаказахПромежуточная.ИдентификаторКонтрагента,
	|	ВремИнформацияОЗаказахПромежуточная.ЕстьОсновнойБанковскийСчетКонтрагента,
	|	ВремИнформацияОЗаказахПромежуточная.ТипКонтрагента,
	|	ВремИнформацияОЗаказахПромежуточная.ИдентификаторСклад,
	|	ВремИнформацияОЗаказахПромежуточная.НаименованиеСклад,
	|	ВремИнформацияОЗаказахПромежуточная.АдресДоставки,
	|	ВремИнформацияОЗаказахПромежуточная.Отменен,
	|	ВремСтатусСвойствоЗаказов.Значение КАК СвойствоСтатусЗаказа,
	|	ВремСлужбаДоставкиСвойствоЗаказов.Значение КАК СвойствоСлужбаДоставкиЗаказа
	|ПОМЕСТИТЬ ВремИнформацияОЗаказах
	|ИЗ
	|	ВремИнформацияОЗаказахПромежуточная КАК ВремИнформацияОЗаказахПромежуточная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСтатусСвойствоЗаказов КАК ВремСтатусСвойствоЗаказов
	|		ПО ВремИнформацияОЗаказахПромежуточная.Объект = ВремСтатусСвойствоЗаказов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСлужбаДоставкиСвойствоЗаказов КАК ВремСлужбаДоставкиСвойствоЗаказов
	|		ПО ВремИнформацияОЗаказахПромежуточная.Объект = ВремСлужбаДоставкиСвойствоЗаказов.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнформацияОЗаказахПромежуточная
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСлужбаДоставкиСвойствоЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСтатусСвойствоЗаказов";
	
	ЗапросПоОтгрузкам = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	""Отгрузка"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ (Сделка В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных) 
	|	ИЛИ Ссылка В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных))
	|И
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОтгрузкам 
	|				ТОГДА РеализацияТоваровУслуг.Ссылка В (&ВыгружаемыеОтгрузкиПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение,
	|	ЗначенияСвойствОбъектов.Объект
	|ПОМЕСТИТЬ ВремСлужбаДоставкиСвойствоОтгрузок
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|	И &ИспользуетсяСлужбыДоставкиОтгрузкиСвойство
	|	И ЗначенияСвойствОбъектов.Свойство = &СлужбаДоставкиОтгрузкиСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ ВремИдентификаторыОтправленияОтгрузки
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоИдентификаторОтправления
	|	И ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОтгрузки.Документ КАК Объект,
	|	ВремОтгрузки.Документ.Сделка КАК Заказ,
	|	ВремОтгрузки.Документ.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА ВремОтгрузки.Документ.Б_Идентификатор = """"
	|			ТОГДА ВремОтгрузки.Документ.Ссылка
	|		ИНАЧЕ ВремОтгрузки.Документ.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторДокумента,
	|	ВремОтгрузки.Документ.ВерсияДанных КАК ВерсияДанных,
	|	ВремОтгрузки.Документ.ПометкаУдаления КАК ПометкаУдаления,
	|	ВремОтгрузки.Документ.Номер КАК Номер,
	|	ВремОтгрузки.Документ.Дата КАК Дата,
	|	ВремОтгрузки.Документ.Проведен КАК Проведен,
	|	ВремОтгрузки.Документ.АдресДоставки КАК АдресДоставки,
	|	ВремОтгрузки.Документ.ВалютаДокумента КАК ВалютаДокумента,
	|	ВремОтгрузки.Документ.УчитыватьНДС КАК УчитыватьНДС,
	|	ВремОтгрузки.Документ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВремОтгрузки.Документ.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВремОтгрузки.Документ.Контрагент КАК Контрагент,
	|	ВремОтгрузки.Документ.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВремОтгрузки.Документ.Склад.Б_Идентификатор = """"
	|			ТОГДА ВремОтгрузки.Документ.Склад
	|		ИНАЧЕ ВремОтгрузки.Документ.Склад.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклада,
	|	ВремОтгрузки.Документ.Склад.Наименование КАК НаименованиеСклада,
	|	ВремОтгрузки.Документ.Комментарий КАК Комментарий,
	|	ВремОтгрузки.Документ.Б_Идентификатор КАК НомерССайта,
	|	ВремОтгрузки.Документ.Б_ДатаДокумента КАК ДатаССайта,
	|	ВЫБОР
	|		КОГДА ВремОтгрузки.Документ.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ВремОтгрузки.Документ.Сделка.Б_Идентификатор = """"
	|						ТОГДА ВремОтгрузки.Документ.Сделка
	|					ИНАЧЕ ВремОтгрузки.Документ.Сделка.Б_Идентификатор
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИдентификаторОснования,
	|	ВремОтгрузки.Документ.ВалютаДокумента.Наименование КАК ВалютаКод,
	|	ВремОтгрузки.Документ.СуммаДокумента КАК СуммаДокумента,
	|	ВремОтгрузки.Документ.ПометкаУдаления КАК Отменен,
	|	ВремОтгрузки.Документ.Проведен КАК Отгружен,
	|	ВЫБОР
	|		КОГДА ВремОтгрузки.Документ.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ВремОтгрузки.Документ.Контрагент.Ссылка
	|		ИНАЧЕ ВремОтгрузки.Документ.Контрагент.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторКонтрагента,
	|	ВЫБОР
	|		КОГДА ВремОтгрузки.Документ.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ВремОтгрузки.Документ.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОсновнойБанковскийСчетКонтрагента,
	|	""Контрагенты"" КАК ТипКонтрагента,
	|	ВремСлужбаДоставкиСвойствоОтгрузок.Значение КАК СвойствоСлужбаДоставкиОтгрузки,
	|	ВремИдентификаторыОтправленияОтгрузки.Значение КАК ИдентификаторОтправления,
	|	""Отгрузка"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремИнформацияООтгрузках
	|ИЗ
	|	ВремОтгрузки КАК ВремОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСлужбаДоставкиСвойствоОтгрузок КАК ВремСлужбаДоставкиСвойствоОтгрузок
	|		ПО ВремОтгрузки.Документ = ВремСлужбаДоставкиСвойствоОтгрузок.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремИдентификаторыОтправленияОтгрузки КАК ВремИдентификаторыОтправленияОтгрузки
	|		ПО ВремОтгрузки.Документ = ВремИдентификаторыОтправленияОтгрузки.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИдентификаторыОтправленияОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСлужбаДоставкиСвойствоОтгрузок";
	
	ЗапросПоТоварамЗаказов = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка КАК Заказ,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	Товары.Количество * Товары.Коэффициент КАК Количество,
	|	Товары.КоличествоМест КАК КоличествоМест,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.Цена / ВЫБОР
	|		КОГДА Товары.Коэффициент = 0
	|			ТОГДА 1
	|		ИНАЧЕ Товары.Коэффициент
	|	КОНЕЦ КАК Цена,
	|	Товары.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|	Товары.УсловиеАвтоматическойСкидки КАК УсловиеАвтоматическойСкидки,
	|	Товары.ЗначениеУсловияАвтоматическойСкидки КАК ЗначениеУсловияАвтоматическойСкидки,
	|	Товары.КлючСтроки КАК КлючСтроки,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА Товары.Номенклатура.Ссылка
	|		ИНАЧЕ Товары.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары.ХарактеристикаНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА Товары.ХарактеристикаНоменклатуры.Ссылка
	|		ИНАЧЕ Товары.ХарактеристикаНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторХарактеристики,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Товар не найден""
	|		ИНАЧЕ Товары.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА Товары.Номенклатура.БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ Товары.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА Товары.ХарактеристикаНоменклатуры.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Характеристика не найдена""
	|		ИНАЧЕ Товары.ХарактеристикаНоменклатуры.Наименование
	|	КОНЕЦ КАК ХарактеристикаНаименование,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК НаименованиеПолноеЕдиницыИзмерения,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
	|	Товары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
	|	Товары.Номенклатура.СтавкаНДС,
	|	Товары.Номенклатура.ВидНоменклатуры.Наименование КАК НоменклатураВидНоменклатуры
	|ПОМЕСТИТЬ ВремТабТоваров
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияОЗаказах.Объект
	|			ИЗ
	|				ВремИнформацияОЗаказах)
	|";
	
	ЗапросПоТоварамОтгрузок = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Сделка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	Товары.Количество * Товары.Коэффициент КАК Количество,
	|	Товары.КоличествоМест КАК КоличествоМест,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.Цена / ВЫБОР
	|		КОГДА Товары.Коэффициент = 0
	|			ТОГДА 1
	|		ИНАЧЕ Товары.Коэффициент
	|	КОНЕЦ КАК Цена,
	|	Товары.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|	Товары.УсловиеАвтоматическойСкидки КАК УсловиеАвтоматическойСкидки,
	|	Товары.ЗначениеУсловияАвтоматическойСкидки КАК ЗначениеУсловияАвтоматическойСкидки,
	|	Товары.КлючСтроки КАК КлючСтроки,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА Товары.Номенклатура.Ссылка
	|		ИНАЧЕ Товары.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары.ХарактеристикаНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА Товары.ХарактеристикаНоменклатуры.Ссылка
	|		ИНАЧЕ Товары.ХарактеристикаНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторХарактеристики,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Товар не найден""
	|		ИНАЧЕ Товары.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА Товары.Номенклатура.БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ Товары.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА Товары.ХарактеристикаНоменклатуры.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Характеристика не найдена""
	|		ИНАЧЕ Товары.ХарактеристикаНоменклатуры.Наименование
	|	КОНЕЦ КАК ХарактеристикаНаименование,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК НаименованиеПолноеЕдиницыИзмерения,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Товары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
	|	Товары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
	|	Товары.Номенклатура.СтавкаНДС,
	|	Товары.Номенклатура.ВидНоменклатуры.Наименование КАК НоменклатураВидНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияООтгрузках.Объект
	|			ИЗ
	|				ВремИнформацияООтгрузках)
	|";
	
	ЗапросПоТоварамКонец = "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|";
	
	ЗапросПоСвойствамТоваров = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабТоваров.Документ КАК Документ,
	|	ВремТабТоваров.Заказ КАК Заказ,
	|	ВремТабТоваров.Номенклатура КАК Номенклатура,
	|	ВремТабТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Б_СвойстваТоваровДокументов.НаименованиеСвойства,
	|	Б_СвойстваТоваровДокументов.Значение,
	|	Б_СвойстваТоваровДокументов.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВремСвойстваТоваровДокументов
	|ИЗ
	|	ВремТабТоваров КАК ВремТабТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Б_СвойстваТоваровДокументов КАК Б_СвойстваТоваровДокументов
	|		ПО (Б_СвойстваТоваровДокументов.Документ = ВремТабТоваров.Заказ)
	|			И (Б_СвойстваТоваровДокументов.Номенклатура = ВремТабТоваров.Номенклатура)
	|			И (Б_СвойстваТоваровДокументов.ХарактеристикаНоменклатуры = ВремТабТоваров.ХарактеристикаНоменклатуры)
	//|			И (Б_СвойстваТоваровДокументов.КлючСтроки = ВремТабТоваров.КлючСтроки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Заказ,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	КлючСтроки
	|";
	
	ЗапросПоУслугамЗаказов = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Ссылка КАК Документ,
	|	Услуги.Ссылка КАК Заказ,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.Содержание КАК Содержание,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	Услуги.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|	Услуги.УсловиеАвтоматическойСкидки КАК УсловиеАвтоматическойСкидки,
	|	Услуги.ЗначениеУсловияАвтоматическойСкидки КАК ЗначениеУсловияАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА Услуги.Номенклатура.Ссылка
	|		ИНАЧЕ Услуги.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Товар не найден""
	|		ИНАЧЕ Услуги.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК НаименованиеПолноеЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
	|	Услуги.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
	|	Услуги.Номенклатура.СтавкаНДС,
	|	Услуги.Номенклатура.ВидНоменклатуры.Наименование КАК НоменклатураВидНоменклатуры,
	|	0 КАК КлючСтроки
	|ПОМЕСТИТЬ ВремТабУслуг
	|ИЗ
	|	Документ.ЗаказПокупателя.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияОЗаказах.Объект
	|			ИЗ
	|				ВремИнформацияОЗаказах)
	|";
	
	ЗапросПоУслугамОтгрузок = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.Ссылка КАК Документ,
	|	Услуги.Ссылка.Сделка,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.Содержание КАК Содержание,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	Услуги.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|	Услуги.УсловиеАвтоматическойСкидки КАК УсловиеАвтоматическойСкидки,
	|	Услуги.ЗначениеУсловияАвтоматическойСкидки КАК ЗначениеУсловияАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА Услуги.Номенклатура.Ссылка
	|		ИНАЧЕ Услуги.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.Наименование ЕСТЬ NULL 
	|			ТОГДА ""Товар не найден""
	|		ИНАЧЕ Услуги.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК НаименованиеПолноеЕдиницыИзмерения,
	|	Услуги.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
	|	Услуги.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
	|	Услуги.Номенклатура.СтавкаНДС,
	|	Услуги.Номенклатура.ВидНоменклатуры.Наименование КАК НоменклатураВидНоменклатуры,
	|	0 КАК КлючСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияООтгрузках.Объект
	|			ИЗ
	|				ВремИнформацияООтгрузках)
	|";
	
	ЗапросПоУслугамКонец = "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|";
	
	
	ЗапросПоОплатам = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Оплата наличными"" КАК ТипДокумента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыНаличные
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремМассивДанных.Объект
	|			ИЗ
	|				ВремМассивДанных)
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам
	|				ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Эквайринг"" КАК ТипДокумента,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыЭквайринг
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремМассивДанных.Объект
	|			ИЗ
	|				ВремМассивДанных)
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам
	|				ТОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Оплата безналичными"" КАК ТипДокумента,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыБезнал
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремМассивДанных.Объект
	|			ИЗ
	|				ВремМассивДанных)
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам
	|				ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Оплата безналичными"" КАК ТипДокумента,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыБезналПОПДС
	|ИЗ
	|	Документ.ПлатежныйОрдерПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремМассивДанных.Объект
	|			ИЗ
	|				ВремМассивДанных)
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам
	|				ТОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Объект,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Документ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка КАК Заказ,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Б_Идентификатор = """"
	|			ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Ссылка
	|		ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторДокумента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВерсияДанных,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Номер,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен,
	|	""Оплата наличными"" КАК ТипДокумента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Комментарий,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Б_Идентификатор КАК НомерССайта,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Б_ДатаДокумента КАК ДатаССайта,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка.Б_Идентификатор = """"
	|						ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка
	|					ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка.Б_Идентификатор
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИдентификаторОснования,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВалютаДокумента КАК Валюта,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВалютаДокумента.Наименование КАК ВалютаКод,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Касса КАК КассаДоговорЭквайринга,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Основание,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ПометкаУдаления КАК Отменен,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Оплачено КАК Оплачен,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.КурсВзаиморасчетов КАК Курс,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент.Ссылка
	|		ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторКонтрагента,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОсновнойБанковскийСчетКонтрагента,
	|	""Контрагенты"" КАК ТипКонтрагента
	|ПОМЕСТИТЬ ВремОплатыВсе
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремОплатыНаличные.Заказ
	|			ИЗ
	|				ВремОплатыНаличные)
	|	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОплатыНаличные.Документ
	|			ИЗ
	|				ВремОплатыНаличные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка,
	|	ВЫБОР
	|		КОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Б_Идентификатор = """"
	|			ТОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Ссылка
	|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Б_Идентификатор
	|	КОНЕЦ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВерсияДанных,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Номер,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Дата,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Проведен,
	|	""Эквайринг"",
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Комментарий,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Б_Идентификатор,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Б_ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка.Б_Идентификатор = """"
	|						ТОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка
	|					ИНАЧЕ ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка.Б_Идентификатор
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВалютаДокумента.Наименование,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ДоговорЭквайринга,
	|	NULL,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Проведен,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.КурсВзаиморасчетов,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент.Ссылка
	|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	""Контрагенты""
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремОплатыЭквайринг.Заказ
	|			ИЗ
	|				ВремОплатыЭквайринг)
	|	И ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОплатыЭквайринг.Документ
	|			ИЗ
	|				ВремОплатыЭквайринг)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка,
	|	ВЫБОР
	|		КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Б_Идентификатор = """"
	|			ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Ссылка
	|		ИНАЧЕ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Б_Идентификатор
	|	КОНЕЦ,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВерсияДанных,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Номер,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Дата,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен,
	|	""Оплата безналичными"",
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Комментарий,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Б_Идентификатор,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Б_ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка.Б_Идентификатор = """"
	|						ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка
	|					ИНАЧЕ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка.Б_Идентификатор
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВалютаДокумента.Наименование,
	|	NULL,
	|	NULL,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсВзаиморасчетов,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент.Ссылка
	|		ИНАЧЕ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	""Контрагенты""
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремОплатыБезнал.Заказ
	|			ИЗ
	|				ВремОплатыБезнал)
	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОплатыБезнал.Документ
	|			ИЗ
	|				ВремОплатыБезнал)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка,
	|	ВЫБОР
	|		КОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Б_Идентификатор = """"
	|			ТОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Ссылка
	|		ИНАЧЕ ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Б_Идентификатор
	|	КОНЕЦ,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВерсияДанных,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Номер,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен,
	|	""Оплата безналичными"",
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Комментарий,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Б_Идентификатор,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Б_ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка.Б_Идентификатор = """"
	|						ТОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка
	|					ИНАЧЕ ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка.Б_Идентификатор
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВалютаДокумента.Наименование,
	|	NULL,
	|	NULL,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ПометкаУдаления,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.КурсВзаиморасчетов,
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор = """"
	|			ТОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент.Ссылка
	|		ИНАЧЕ ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|				И НЕ ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент.ОсновнойБанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	""Контрагенты""
	|ИЗ
	|	Документ.ПлатежныйОрдерПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Сделка В
	|			(ВЫБРАТЬ
	|				ВремОплатыБезналПОПДС.Заказ
	|			ИЗ
	|				ВремОплатыБезналПОПДС)
	|	И ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОплатыБезналПОПДС.Документ
	|			ИЗ
	|				ВремОплатыБезналПОПДС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыНаличные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыЭквайринг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыБезнал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыБезналПОПДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ ВремСведенияОМетодеОплатыПришедшемССайта
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоИдМетодаОплаты
	|	И ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремОплатыВсе.Объект
	|			ИЗ
	|				ВремОплатыВсе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОплатыВсе.Объект,
	|	ВремОплатыВсе.Документ,
	|	ВремОплатыВсе.Заказ,
	|	ВремОплатыВсе.ИдентификаторДокумента,
	|	ВремОплатыВсе.ВерсияДанных,
	|	ВремОплатыВсе.ПометкаУдаления,
	|	ВремОплатыВсе.Номер,
	|	ВремОплатыВсе.Дата,
	|	ВремОплатыВсе.Проведен,
	|	ВремОплатыВсе.ТипДокумента,
	|	ВремОплатыВсе.Комментарий,
	|	ВремОплатыВсе.Контрагент,
	|	ВремОплатыВсе.НомерССайта,
	|	ВремОплатыВсе.ДатаССайта,
	|	ВремОплатыВсе.ИдентификаторОснования,
	|	ВремОплатыВсе.Валюта,
	|	ВремОплатыВсе.ВалютаКод,
	|	ВремОплатыВсе.Основание,
	|	ВремОплатыВсе.Отменен,
	|	ВремОплатыВсе.Оплачен,
	|	ВремОплатыВсе.Курс,
	|	ВремОплатыВсе.СуммаВзаиморасчетов,
	|	ВремОплатыВсе.ИдентификаторКонтрагента,
	|	ВремОплатыВсе.ЕстьОсновнойБанковскийСчетКонтрагента,
	|	ВремОплатыВсе.ТипКонтрагента,
	|	ВремСведенияОМетодеОплатыПришедшемССайта.Значение КАК ИдМетодаОплатыССайта,
	|	ВремОплатыВсе.КассаДоговорЭквайринга
	|ПОМЕСТИТЬ ВремИнформацияООплатах
	|ИЗ
	|	ВремОплатыВсе КАК ВремОплатыВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСведенияОМетодеОплатыПришедшемССайта КАК ВремСведенияОМетодеОплатыПришедшемССайта
	|		ПО ВремОплатыВсе.Объект = ВремСведенияОМетодеОплатыПришедшемССайта.Объект
	|ГДЕ
	|	ВремОплатыВсе.Номер <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б_ИнформацияОЧеках.Документ КАК Документ,
	|	Б_ИнформацияОЧеках.НомерЧека,
	|	Б_ИнформацияОЧеках.ИдСвойства,
	|	Б_ИнформацияОЧеках.Значение
	|ПОМЕСТИТЬ ВремСведенияОЧеках
	|ИЗ
	|	РегистрСведений.Б_ИнформацияОЧеках КАК Б_ИнформацияОЧеках
	|ГДЕ
	|	Б_ИнформацияОЧеках.Документ В
	|			(ВЫБРАТЬ
	|				ВремОплатыВсе.Объект
	|			ИЗ
	|				ВремОплатыВсе)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСведенияОМетодеОплатыПришедшемССайта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыВсе";
	
	КонецЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремМассивДанных";
	
	
	ТекстЗапроса = ЗапросПоЗаказам;	
	
	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
		
		ТекстЗапроса = ТекстЗапроса + ЗапросПоОтгрузкам;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамЗаказов;
	
	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
		
		ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамОтгрузок;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамКонец;
	ТекстЗапроса = ТекстЗапроса + ЗапросПоСвойствамТоваров;
	
	ТекстЗапроса = ТекстЗапроса + ЗапросПоУслугамЗаказов;
	
	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда
		
		ТекстЗапроса = ТекстЗапроса + ЗапросПоУслугамОтгрузок;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ЗапросПоУслугамКонец;
	
	Если ПараметрыОбмена.ВыгрузкаОплат тогда
		
		ТекстЗапроса = ТекстЗапроса + ЗапросПоОплатам;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + КонецЗапроса;
		
	//ЗапросПоЗаказам
	//ЗапросПоОтгрузкам
	//ЗапросПоТоварамЗаказов
	//ЗапросПоТоварамОтгрузок
	//ЗапросПоТоварамКонец
	//ЗапросПоСвойствамТоваров
	//ЗапросПоУслугамЗаказов
	//ЗапросПоУслугамОтгрузок
	//ЗапросПоУслугамКонец	
	//ЗапросПоОплатам
	//КонецЗапроса
	
	
	ОбщийЗапрос.Текст = ТекстЗапроса;  	
	
	ОбщийЗапрос.Выполнить();	
	
	Возврат МенеджерВременныхТаблицДокументов;
	
КонецФункции		

Функция ВыгрузитьЗаказXDTO(ПараметрыОбмена, МенеджерВременныхТаблиц, Документ, КоличествоЗаказов)
	
	XDTOДокументТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Документ");
	XDTOНалогиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налоги"		, Истина, XDTOДокументТип);	
	XDTOНалогТип   		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налог"			, Истина, XDTOНалогиТип);
	
	XDTOКонтрагентыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагенты"	, Истина, XDTOДокументТип);  	
	XDTOКонтрагентТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагент"	, Истина, XDTOКонтрагентыТип); 
	
	XDTOТоварыТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Товары", Истина, XDTOДокументТип);
	
	XDTOСкладыТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склады"	, Истина, XDTOДокументТип);
	XDTOСкладТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склад"		, Истина, XDTOСкладыТип);
	
	XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияРеквизитов", Истина, XDTOДокументТип);
	XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначениеРеквизита");
	
	XDTOДокумент		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДокументТип);
	
	XDTOДокумент.Ид 			= XMLСтрока(Документ.ИдентификаторДокумента);
	XDTOДокумент.Номер1С 		= Документ.Номер;
	XDTOДокумент.Дата1С 		= XMLСтрока(Формат(Документ.Дата,"ДФ=yyyy-MM-dd"));
	
	Если ЗначениеЗаполнено(Документ.НомерССайта) тогда
		XDTOДокумент.Номер 			= Документ.НомерССайта;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Документ.ДатаССайта) тогда
		лДатаВремяЭлДокумента  		= ?(ЗначениеЗаполнено(Документ.ДатаССайта), Документ.ДатаССайта, ТекущаяДата());
		XDTOДокумент.Дата 			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=yyyy-MM-dd"));
		XDTOДокумент.Время			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=ЧЧ:мм:сс"));
	//КонецЕсли;
	
	XDTOДокумент.ПометкаУдаления= XMLСтрока(Документ.ПометкаУдаления);
	XDTOДокумент.НомерВерсии 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, Документ.ВерсияДанных, "Документов"); 
	XDTOДокумент.Комментарий 	= Документ.Комментарий;
	
	XDTOДокумент.ХозОперация= "Заказ товара";
		
	КоличествоЗаказов 		= КоличествоЗаказов + 1;
	
	XDTOДокумент.Роль 			= "Продавец";
	
	Если ЗначениеЗаполнено(Документ.ВалютаКод) тогда
		XDTOДокумент.Валюта			= Лев(Документ.ВалютаКод, 3);
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найдена валюта для документа: " + Строка(Документ.Объект) + ".Валюта документа будет не выгружена", ПараметрыОбмена);
	КонецЕсли;
	
	XDTOДокумент.Курс			= Документ.КурсВзаиморасчетов;
	XDTOДокумент.Сумма			= Документ.СуммаДокумента;
	
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТабТоваров КАК ВремТабТоваров
	|ГДЕ
	|	ВремТабТоваров.Документ =&Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", Документ.Объект);
	МассивТоваров = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТабУслуг КАК ВремТабУслуг
	|ГДЕ
	|	ВремТабУслуг.Документ =&Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", Документ.Объект);
	МассивУслуг = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	Если Документ.УчитыватьНДС Тогда
		
		XDTOНалоги	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогиТип);
		XDTOНалог	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
		XDTOНалог.Наименование = ПараметрыОбмена.НаименованиеНалога;
		XDTOНалог.УчтеноВСумме = XMLСтрока(Документ.СуммаВключаетНДС);
		XDTOНалог.Сумма        = ПолучитьСуммуНДС(Документ.Объект);
		
		XDTOНалоги.Налог.Добавить(XDTOНалог);
		XDTOДокумент.Налоги = XDTOНалоги; 
		
	КонецЕсли;
	
	Если Документ.ИдентификаторКонтрагента <> Null тогда
		XDTOКонтрагенты	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентыТип);
		XDTOКонтрагенты.Контрагент.Добавить(ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  Документ));
		
		XDTOДокумент.Контрагенты 	= XDTOКонтрагенты;
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найден контрагент в документе: " + Строка(Документ.Объект), ПараметрыОбмена);
	КонецЕсли;
	
	Если Документ.ИдентификаторСклад <> Null тогда
		XDTOСклады	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладыТип);
		
			XDTOСклад				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладТип);
			XDTOСклад.Ид 			= XMLСтрока(Документ.ИдентификаторСклад); 
			XDTOСклад.Наименование 	= Документ.НаименованиеСклад; 
			
		XDTOСклады.Склад.Добавить(XDTOСклад);
		XDTOДокумент.Склады 		= XDTOСклады;	
	КонецЕсли;
	
	XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
			
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Проведен"	, XMLСтрока(Документ.Проведен));
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Отменен"	, Документ.Отменен);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Отгружен"	, Документ.Отгружен);
		
		Если ЗначениеЗаполнено(Документ.АдресДоставки) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Адрес доставки"	, Документ.АдресДоставки);
		КонецЕсли;
		
		Если Документ.Оплачен Тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Номер оплаты по 1С"	, Документ.ДокументОплаты.Номер);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Дата оплаты по 1С"	, XMLСтрока(Документ.ДокументОплаты.Дата));
		КонецЕсли;
		
		Если Документ.Отгружен Тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Номер отгрузки по 1С"	, Документ.ДокументОтгрузки.Номер);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Дата отгрузки по 1С"	, XMLСтрока(Документ.ДокументОтгрузки.Дата));
		КонецЕсли;
		
	    лСтатусЗаказа = "";
	
		лНастройкиСтатусовЗаказа = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСтатусовЗаказа");
		
		Если лНастройкиСтатусовЗаказа <> Неопределено тогда
			
			НайденныйСтатусЗаказа = ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияЗначенийСвойствЗаказа.Найти(Документ.СвойствоСтатусЗаказа);
			
			Если НайденныйСтатусЗаказа <> Неопределено тогда
				лСтатусЗаказа = НайденныйСтатусЗаказа.ИдСтатуса;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(лСтатусЗаказа) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Статуса заказа ИД"	, лСтатусЗаказа);
		КонецЕсли;
		
		лСлужбаДоставки = "";	
		
		лНастройкиСлужбДоставкиДокументов = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСлужбДоставкиДокументов");
		
		Если лНастройкиСлужбДоставкиДокументов <> Неопределено тогда
			
				НайденнаяСлужбаДоставкиЗаказа = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствЗаказа.Найти(Документ.СвойствоСлужбаДоставкиЗаказа);
				Если НайденнаяСлужбаДоставкиЗаказа <> Неопределено тогда
					лСлужбаДоставки = НайденнаяСлужбаДоставкиЗаказа.ИдСлужбы;
				КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(лСлужбаДоставки) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Метод доставки ИД"	, лСлужбаДоставки);
		КонецЕсли;
		
		
	XDTOДокумент.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
	
	ЕстьТовары 	= МассивТоваров.Количество() 	> 0;
	ЕстьУслуги 	= МассивУслуг.Количество() 		> 0;
	
	Если ЕстьТовары или ЕстьУслуги тогда
		
		XDTOТовары		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварыТип);
	
		Если ЕстьТовары тогда
			ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOТовары, XDTOТоварыТип, Документ, МассивТоваров, Истина)
		КонецЕсли;
			
		Если ЕстьУслуги тогда
			ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOТовары, XDTOТоварыТип, Документ, МассивУслуг, Ложь)
		КонецЕсли;
		
       XDTOДокумент.Товары = XDTOТовары;
	КонецЕсли;
	
	Возврат XDTOДокумент;
	
КонецФункции

Функция ВыгрузитьОтгрузкуXDTO(ПараметрыОбмена, МенеджерВременныхТаблиц, Документ, КоличествоОтгрузок)
	
	XDTOДокументТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Документ");
	XDTOНалогиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налоги"		, Истина, XDTOДокументТип);	
	XDTOНалогТип   		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налог"			, Истина, XDTOНалогиТип);
	
	XDTOКонтрагентыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагенты"	, Истина, XDTOДокументТип);  	
	XDTOКонтрагентТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Контрагент"	, Истина, XDTOКонтрагентыТип); 
	
	XDTOТоварыТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Товары", Истина, XDTOДокументТип);
	
	XDTOСкладыТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склады"	, Истина, XDTOДокументТип);
	XDTOСкладТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Склад"		, Истина, XDTOСкладыТип);
	
	XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияРеквизитов", Истина, XDTOДокументТип);
	XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначениеРеквизита");
	
	XDTOДокумент		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДокументТип);
	
	XDTOДокумент.Ид 			= XMLСтрока(Документ.ИдентификаторДокумента);
	XDTOДокумент.Номер1С 		= Документ.Номер;
	XDTOДокумент.Дата1С 		= XMLСтрока(Формат(Документ.Дата,"ДФ=yyyy-MM-dd"));
	
	Если ЗначениеЗаполнено(Документ.НомерССайта) тогда
		XDTOДокумент.Номер 			= Документ.НомерССайта;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Документ.ДатаССайта) тогда
		лДатаВремяЭлДокумента  		= ?(ЗначениеЗаполнено(Документ.ДатаССайта), Документ.ДатаССайта, ТекущаяДата());
		XDTOДокумент.Дата 			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=yyyy-MM-dd"));
		XDTOДокумент.Время			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=ЧЧ:мм:сс"));
	//КонецЕсли;
	
	XDTOДокумент.ПометкаУдаления= XMLСтрока(Документ.ПометкаУдаления);
	XDTOДокумент.НомерВерсии 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, Документ.ВерсияДанных, "Документов"); 
	XDTOДокумент.Комментарий 	= Документ.Комментарий;
	
	XDTOДокумент.ХозОперация= "Отпуск товара";	
		
	КоличествоОтгрузок 		= КоличествоОтгрузок + 1;
		
	XDTOДокумент.Основание	= XMLСтрока(Документ.ИдентификаторОснования);
	
	XDTOДокумент.Роль 			= "Продавец";
	
	Если ЗначениеЗаполнено(Документ.ВалютаКод) тогда
		XDTOДокумент.Валюта			= Лев(Документ.ВалютаКод, 3);
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найдена валюта для документа: " + Строка(Документ.Объект) + ".Валюта документа будет не выгружена", ПараметрыОбмена);
	КонецЕсли;
	
	XDTOДокумент.Курс			= Документ.КурсВзаиморасчетов;
	XDTOДокумент.Сумма			= Документ.СуммаДокумента;
	
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТабТоваров КАК ВремТабТоваров
	|ГДЕ
	|	ВремТабТоваров.Документ =&Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", Документ.Объект);
	МассивТоваров = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремТабУслуг КАК ВремТабУслуг
	|ГДЕ
	|	ВремТабУслуг.Документ =&Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", Документ.Объект);
	МассивУслуг = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	Если Документ.УчитыватьНДС Тогда
		
		XDTOНалоги	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогиТип);
		XDTOНалог	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
		XDTOНалог.Наименование = ПараметрыОбмена.НаименованиеНалога;
		XDTOНалог.УчтеноВСумме = XMLСтрока(Документ.СуммаВключаетНДС);
		XDTOНалог.Сумма        = ПолучитьСуммуНДС(Документ.Объект);
		
		XDTOНалоги.Налог.Добавить(XDTOНалог);
		XDTOДокумент.Налоги = XDTOНалоги; 
		
	КонецЕсли;
	
	Если Документ.ИдентификаторКонтрагента <> Null тогда
		XDTOКонтрагенты	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентыТип);
		XDTOКонтрагенты.Контрагент.Добавить(ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  Документ));
		
		XDTOДокумент.Контрагенты 	= XDTOКонтрагенты;
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найден контрагент в документе: " + Строка(Документ.Объект), ПараметрыОбмена);
	КонецЕсли;
	
	Если Документ.ИдентификаторСклада <> Null тогда
		XDTOСклады	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладыТип);
		
			XDTOСклад				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладТип);
			XDTOСклад.Ид 			= XMLСтрока(Документ.ИдентификаторСклада); 
			XDTOСклад.Наименование 	= Документ.НаименованиеСклада; 
			
		XDTOСклады.Склад.Добавить(XDTOСклад);
		XDTOДокумент.Склады 		= XDTOСклады;	
	КонецЕсли;
	
	XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
	
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Проведен", XMLСтрока(Документ.Проведен));
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Отменен"	, Документ.Отменен);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Отгружен", Документ.Отгружен);
		
		Если ЗначениеЗаполнено(Документ.АдресДоставки) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Адрес доставки"	, Документ.АдресДоставки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Документ.ИдентификаторОтправления) Тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Идентификатор отправления"	, XMLСтрока(Документ.ИдентификаторОтправления));
		КонецЕсли;
		
		лСлужбаДоставки = "";	
		
		лНастройкиСлужбДоставкиДокументов = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСлужбДоставкиДокументов");
		
		Если лНастройкиСлужбДоставкиДокументов <> Неопределено тогда
			
			НайденнаяСлужбаДоставкиЗаказа = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствОтгрузки.Найти(Документ.СвойствоСлужбаДоставкиОтгрузки);
			Если НайденнаяСлужбаДоставкиЗаказа <> Неопределено тогда
				лСлужбаДоставки = НайденнаяСлужбаДоставкиЗаказа.ИдСлужбы;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(лСлужбаДоставки) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Метод доставки ИД"	, лСлужбаДоставки);
		КонецЕсли;		
		
	XDTOДокумент.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
	
	ЕстьТовары 	= МассивТоваров.Количество() 	> 0;
	ЕстьУслуги 	= МассивУслуг.Количество() 		> 0;
	
	Если ЕстьТовары или ЕстьУслуги тогда
		
		XDTOТовары		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварыТип);
	
		Если ЕстьТовары тогда
			ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOТовары, XDTOТоварыТип, Документ, МассивТоваров, Истина)
		КонецЕсли;
			
		Если ЕстьУслуги тогда
			ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOТовары, XDTOТоварыТип, Документ, МассивУслуг, Ложь)
		КонецЕсли;
		
       XDTOДокумент.Товары = XDTOТовары;
	КонецЕсли;
	
	Возврат XDTOДокумент;
	
КонецФункции

Функция ВыгрузитьОплатуXDTO(ПараметрыОбмена, МенеджерВременныхТаблиц, Документ, КоличествоОплат)
	
	XDTOДокументТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Документ");
	XDTOДокумент		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOДокументТип);
	
	XDTOНалогиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Налоги"		, Истина, XDTOДокументТип);	
	XDTOНалогТип   		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Налог"		, Истина, XDTOНалогиТип);
	
	XDTOКонтрагентыТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Контрагенты"	, Истина, XDTOДокументТип);  	
	XDTOКонтрагентТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Контрагент"	, Истина, XDTOКонтрагентыТип); 
	
	
	XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияРеквизитов", Истина, XDTOДокументТип);
	XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначениеРеквизита");
	
	
	XDTOДокумент.Ид 			= XMLСтрока(Документ.ИдентификаторДокумента);
	XDTOДокумент.Номер1С 		= Документ.Номер;
	XDTOДокумент.Дата1С 		= XMLСтрока(Формат(Документ.Дата,"ДФ=yyyy-MM-dd"));
	
	XDTOДокумент.Номер 			= Документ.НомерССайта;
	
	лДатаВремяЭлДокумента  		= ?(ЗначениеЗаполнено(Документ.ДатаССайта), Документ.ДатаССайта, Дата(1, 1,1, 0,0,1));
	XDTOДокумент.Дата 			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=yyyy-MM-dd"));
	XDTOДокумент.Время			= XMLСтрока(Формат(лДатаВремяЭлДокумента,"ДФ=ЧЧ:мм:сс"));	
	
	XDTOДокумент.ПометкаУдаления= XMLСтрока(Документ.ПометкаУдаления);
	XDTOДокумент.НомерВерсии 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, Документ.ВерсияДанных, "Документов"); 
	XDTOДокумент.Комментарий 	= Документ.Комментарий;
	
	КоличествоОплат 			= КоличествоОплат + 1;
	
	Если Документ.ТипДокумента  = "Оплата безналичными" тогда
		XDTOДокумент.ХозОперация= "Выплата безналичных денег";
	ИначеЕсли Документ.ТипДокумента  = "Оплата наличными" тогда
		XDTOДокумент.ХозОперация= "Выплата наличных денег";	
	ИначеЕсли Документ.ТипДокумента  = "Эквайринг" тогда
		XDTOДокумент.ХозОперация= "Эквайринговая операция";	
	КонецЕсли;
	
	XDTOДокумент.Основание	= XMLСтрока(Документ.ИдентификаторОснования);
	
	XDTOДокумент.Роль 			= "Продавец";
	Если НЕ ЗначениеЗаполнено(Документ.ВалютаКод) тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("У документа: " + Документ.Номер + " не заполнена валюта." , ПараметрыОбмена);
	Иначе	
		XDTOДокумент.Валюта			= Лев(Документ.ВалютаКод, 3);
	КонецЕсли;

	XDTOДокумент.Курс			= Формат(Документ.Курс, "ЧЦ=10; ЧДЦ=4; ЧРД=.");
	XDTOДокумент.Сумма			= Формат(Документ.СуммаВзаиморасчетов , ПараметрыОбмена.ФорматСуммы); 
	
	
	Если Документ.ИдентификаторКонтрагента <> Null тогда
		XDTOКонтрагенты	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКонтрагентыТип);
		XDTOКонтрагенты.Контрагент.Добавить(ВыгрузитьКонтрагентаXDTO(ПараметрыОбмена, XDTOКонтрагентТип,  Документ));
		
		XDTOДокумент.Контрагенты 	= XDTOКонтрагенты;
	Иначе
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не найден контрагент в документе: " + Строка(Документ.Объект), ПараметрыОбмена);
	КонецЕсли;
	
	XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
			
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Проведен", XMLСтрока(Документ.Проведен));
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Отменен"	, Документ.Отменен);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Оплачен"	, Документ.Оплачен);
		
		Если Документ.Оплачен Тогда   			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Номер оплаты по 1С", Документ.Номер);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Дата оплаты по 1С"	, XMLСтрока(Формат(Документ.Дата,"ДФ=yyyy-MM-dd")));
		КонецЕсли;
		
		лИдПлатежнойСистемы = "";
		
		Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено И ЗначениеЗаполнено(Документ.КассаДоговорЭквайринга) тогда 
				
			Если Документ.ТипДокумента  = "Оплата наличными" ИЛИ Документ.ТипДокумента  = "Эквайринг" тогда
					
				НайденныйСтатус = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(Документ.КассаДоговорЭквайринга);
				Если НайденныйСтатус <> Неопределено тогда
					лИдПлатежнойСистемы =  НайденныйСтатус.ИдПлатежнойСистемы;
				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;
		
		Если лИдПлатежнойСистемы = "" И ЗначениеЗаполнено(Документ.ИдМетодаОплатыССайта) тогда
			лИдПлатежнойСистемы = Документ.ИдМетодаОплатыССайта;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(лИдПлатежнойСистемы) тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Метод оплаты ИД"	, лИдПлатежнойСистемы);
		КонецЕсли;
		
	XDTOДокумент.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
	
	Если Документ.ТипДокумента  = "Оплата наличными" ИЛИ Документ.ТипДокумента  = "Эквайринг" 
		И Константы.Б_ИспользоватьМеханизмПечатиЧеков.Получить() И ЗначениеЗаполнено(Документ.НомерССайта) тогда
		ЗаполнитьИнформациюОЧеке(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOДокумент, Документ, XDTOДокументТип);		
	КонецЕсли;
	
	Возврат XDTOДокумент;
	
КонецФункции

Процедура ЗаполнитьИнформациюОЧеке(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOДокумент, Документ, XDTOДокументТип)
	
	XDTOИнформацияОЧекахТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ИнформацияОЧеках", Истина, XDTOДокументТип);
	XDTOИнформацияОЧекеТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ИнформацияОЧеке");
	
	XDTOЗначенияСвойствТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияСвойств", Истина, XDTOИнформацияОЧекеТип);
	XDTOЗначениеСвойстваТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияСвойства");
	
	XDTOИнформацияОЧеках 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOИнформацияОЧекахТип); 
	
	XDTOИнформацияОЧеке 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOИнформацияОЧекеТип);
	
	Выборка = РегистрыСведений.Б_ОчередьПечати.Выбрать(Новый Структура("Документ",Документ.Объект));
	Пока Выборка.Следующий() Цикл
		лИдЧека = Выборка.ИдЧекаНаСайте;
	КонецЦикла;
	
	Если лИдЧека = "" тогда
		Возврат;
	КонецЕсли;
	
	XDTOИнформацияОЧеке.Ид = XMLСтрока(лИдЧека);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Документ", Документ.Объект);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВремСведенияОЧеках.ИдСвойства,
	|	ВремСведенияОЧеках.НомерЧека,
	|	ВремСведенияОЧеках.Значение
	|ИЗ
	|	ВремСведенияОЧеках КАК ВремСведенияОЧеках
	|ГДЕ
	|	ВремСведенияОЧеках.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремСведенияОЧеках.ИдСвойства";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	XDTOЗначенияСвойств 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойствТип);
	
	Пока Выборка.Следующий() Цикл;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, XDTOЗначенияСвойств, XDTOЗначениеСвойстваТип, Выборка.ИдСвойства, "", Выборка.Значение);
		
	КонецЦикла;
	XDTOИнформацияОЧеке.ЗначенияСвойств = XDTOЗначенияСвойств;
	XDTOИнформацияОЧеках.ИнформацияОЧеке.Добавить(XDTOИнформацияОЧеке);
	//Возврат XDTOИнформацияОЧеках;
	
	XDTOДокумент.ИнформацияОЧеках = XDTOИнформацияОЧеках;
	
КонецПроцедуры

Процедура ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, Владелец, ВладелецТип, Документ, МассивНоменклатуры, ВыгрузкаТоваров)
	
	XDTOТоварТип		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Товар"		, Истина, ВладелецТип);
	XDTOНалогиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налоги"	, Истина, XDTOТоварТип);	
	XDTOНалогТип   		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Налог"		, Истина, XDTOНалогиТип);
	
	XDTOСтавкиНалоговТип= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "СтавкиНалогов"	, Истина, XDTOТоварТип);	
	XDTOСтавкаНалогаТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "СтавкаНалога"	, Истина, XDTOСтавкиНалоговТип);
	
	XDTOСкидкиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Скидки"	, Истина, XDTOТоварТип);	
	XDTOСкидкаТип   	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Скидка"	, Истина, XDTOСкидкиТип);
	
	XDTOЕдиницаИзмеренияТип	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЕдиницаИзмерения");
	
	XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияРеквизитов", Истина, XDTOТоварТип);
	XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначениеРеквизита");
	
	Для каждого ТекНоменклатура из МассивНоменклатуры Цикл 	
		
		XDTOТовар	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварТип);
		Если ВыгрузкаТоваров тогда
			
			Если ЗначениеЗаполнено(ТекНоменклатура.ХарактеристикаНоменклатуры) И ВыгрузкаТоваров тогда
				лИд = XMLСтрока(ТекНоменклатура.ИдентификаторНоменклатуры) + "#" + XMLСтрока(ТекНоменклатура.ИдентификаторХарактеристики); 
				лНаименование   	= ТекНоменклатура.НоменклатураНаименование + " (" + ТекНоменклатура.ХарактеристикаНаименование + ")";
			Иначе
				лИд = XMLСтрока(ТекНоменклатура.ИдентификаторНоменклатуры); 
				лНаименование   	= ТекНоменклатура.НоменклатураНаименование;
			КонецЕсли;
		Иначе
			лИд = XMLСтрока(ТекНоменклатура.ИдентификаторНоменклатуры); 
			лНаименование   	= ТекНоменклатура.НоменклатураНаименование;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(лНаименование) тогда
			Продолжить;
		КонецЕсли;
		
		XDTOТовар.Ид 			= лИд;
		XDTOТовар.Наименование 	= лНаименование;
		
		лТипНоменклатуры = "Товар";
		Если ТекНоменклатура.НоменклатураТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
			лТипНоменклатуры = "Услуга";
		ИначеЕсли ТекНоменклатура.НоменклатураТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор тогда
			лТипНоменклатуры = "Набор";
		ИначеЕсли ТекНоменклатура.НоменклатураТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект тогда
			лТипНоменклатуры = "Комплект";
		КонецЕсли;
		
		XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
			
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ВидНоменклатуры", ТекНоменклатура.НоменклатураВидНоменклатуры);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ТипНоменклатуры", лТипНоменклатуры);
		
		ДобавитьСвойстваПозицийТовараДокумента(ПараметрыОбмена, Документ, МенеджерВременныхТаблиц, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, ТекНоменклатура, ВыгрузкаТоваров);
		
		XDTOТовар.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
		
		Если ЗначениеЗаполнено(ТекНоменклатура.НоменклатураСтавкаНДС) Тогда
			
			XDTOСтавкиНалогов	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкиНалоговТип);
			
				XDTOСтавкаНалога	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкаНалогаТип);
				
				XDTOСтавкаНалога.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOСтавкаНалога.Ставка 		= ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекНоменклатура.СтавкаНДС);
			
			XDTOСтавкиНалогов.СтавкаНалога.Добавить(XDTOСтавкаНалога);
			
			XDTOТовар.СтавкиНалогов = XDTOСтавкиНалогов;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекНоменклатура.СтавкаНДС) Тогда
			
			XDTOНалоги	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогиТип);
			
				XDTOНалог	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
				
				XDTOНалог.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOНалог.УчтеноВСумме 	= Документ.СуммаВключаетНДС;
				XDTOНалог.Сумма 		= ТекНоменклатура.СуммаНДС;
				XDTOНалог.Ставка 		= ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекНоменклатура.СтавкаНДС);
			
			XDTOНалоги.Налог.Добавить(XDTOНалог);
			
			XDTOТовар.Налоги = XDTOНалоги;
			
		КонецЕсли;
		
		XDTOТовар.Цена			= Формат(ТекНоменклатура.Цена		, ПараметрыОбмена.ФорматСуммы);   
		XDTOТовар.Количество	= Формат(ТекНоменклатура.Количество	, ПараметрыОбмена.ФорматКоличества);
		XDTOТовар.Сумма			= Формат(ТекНоменклатура.Сумма		, ПараметрыОбмена.ФорматСуммы);
		
		XDTOТовар.Коэффициент 	= "1";
		
		Если ЗначениеЗаполнено(ТекНоменклатура.ИдентификаторЕдиницыИзмерения) Тогда
			XDTOЕдиницаИзмерения	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЕдиницаИзмеренияТип);
				XDTOЕдиницаИзмерения.Ид 				= XMLСтрока(ТекНоменклатура.ИдентификаторЕдиницыИзмерения);
				XDTOЕдиницаИзмерения.Код				= Сокрлп(ТекНоменклатура.КодЕдиницыИзмерения);
				XDTOЕдиницаИзмерения.НаименованиеКраткое= Лев(ТекНоменклатура.НаименованиеЕдиницыИзмерения, 3);
				XDTOЕдиницаИзмерения.НаименованиеПолное	= ТекНоменклатура.НаименованиеПолноеЕдиницыИзмерения;
			XDTOТовар.Единица 		= XDTOЕдиницаИзмерения;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекНоменклатура.СтавкаНДС) Тогда
			
			XDTOНалоги	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогиТип);
			
				XDTOНалог	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
				
				XDTOНалог.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOНалог.УчтеноВСумме 	= Документ.СуммаВключаетНДС;
				XDTOНалог.Сумма 		= ТекНоменклатура.СуммаНДС;
				XDTOНалог.Ставка 		= ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекНоменклатура.СтавкаНДС);
			
			XDTOНалоги.Налог.Добавить(XDTOНалог);
			
			XDTOТовар.Налоги = XDTOНалоги;
			
		КонецЕсли;
	
		Если ТекНоменклатура.ПроцентСкидкиНаценки <> 0 Тогда
			
			СуммаСкидки = ТекНоменклатура.Количество * ТекНоменклатура.Цена * ТекНоменклатура.ПроцентСкидкиНаценки / 100;
			
			XDTOСкидки	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкиТип);
				
				XDTOСкидка	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкаТип);
				
				XDTOСкидка.Наименование = "Скидка";
				
				XDTOСкидка.Сумма 		= Формат(СуммаСкидки, ПараметрыОбмена.ФорматСуммы);	
				XDTOСкидка.Процент 		= ТекНоменклатура.ПроцентСкидкиНаценки;
				XDTOСкидка.УчтеноВСумме = XMLСтрока(истина);
				
			XDTOСкидки.Скидка.Добавить(XDTOСкидка);
			
			XDTOТовар.Скидки = XDTOСкидки;
			
		КонецЕсли;
	
		Владелец.Товар.Добавить(XDTOТовар);	
		
	КонецЦикла;	
	
КонецПроцедуры 

Функция ПолучитьСуммуНДС(Док)
	
	СуммаНДС = 0;
	
	Если НЕ Док.Товары = НеОпределено Тогда
		Для Каждого СтрокаТЧ Из Док.Товары Цикл
			СуммаНДС = СуммаНДС + СтрокаТЧ.СуммаНДС;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Док.Услуги = НеОпределено Тогда
		Для Каждого СтрокаТЧ Из Док.Услуги Цикл
			СуммаНДС = СуммаНДС + СтрокаТЧ.СуммаНДС;
		КонецЦикла;
	КонецЕсли;

	Возврат СуммаНДС;
	
КонецФункции

Процедура ДобавитьСвойстваПозицийТовараДокумента(ПараметрыОбмена, ИнформацияОДокументе, МенеджерВременныхТаблиц, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, ПозицияТовара, ВыгрузкаТоваров);
	
	Если ВыгрузкаТоваров тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВремСвойстваТоваровДокументов КАК ВремСвойстваТоваровДокументов
		|ГДЕ
	|   НЕ ВремСвойстваТоваровДокументов.НаименованиеСвойства ЕСТЬ NULL
		|	И ВремСвойстваТоваровДокументов.Заказ = &Заказ
		|	И ВремСвойстваТоваровДокументов.Документ = &Документ
		|	И ВремСвойстваТоваровДокументов.Номенклатура = &Номенклатура"
		+?(ПозицияТовара.КлючСтроки <> 0, "
		|	И ВремСвойстваТоваровДокументов.КлючСтроки = &КлючСтроки", "")+ "
		|	И ВремСвойстваТоваровДокументов.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
		
		Запрос.УстановитьПараметр("Заказ"		, ИнформацияОДокументе.Заказ);
		Запрос.УстановитьПараметр("Документ"	, ИнформацияОДокументе.Объект);
		
		Запрос.УстановитьПараметр("Номенклатура", ПозицияТовара.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ПозицияТовара.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("КлючСтроки"	,ПозицияТовара.КлючСтроки);
		
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.НаименованиеСвойства <> "НомерПозицииКорзины" тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "СвойствоКорзины#" + Выборка.НаименованиеСвойства, Выборка.Значение);
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры


            ///////////////////////////////////////////////////////////////////
			//			    ВЫГРУЗКА ИНФОРМАЦИИ ПО ТОВАРАМ                  //
			/////////////////////////////////////////////////////////////////

Процедура ВыгрузитьИнформациюОТоварах(ПараметрыОбмена, МассивДанных, Операция, СтрокаТаблицыКаталогов, НомерСтроки)
	
	//получаем таблицу свойств анологично выгрузке свойств в XML, поэтому указываем операцию "Свойства"
	ТаблицаСвойствБезДопНастроек 	= ПолучитьТаблицуПоИспользуемымСвойствамТоваров(ПараметрыОбмена, "Свойства", СтрокаТаблицыКаталогов);
	
	мСвойства = ТаблицаСвойствБезДопНастроек.ВыгрузитьКолонку("Объект");			
				
	Успешно = Ложь;
	
	ПараметрыОбмена.МояФабрикаXDTO 	= СоздатьФабрикуXDTO(ПараметрыОбмена.ФайлСхемы); 
	
	XDTOКоммерческаяИнформацияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "КоммерческаяИнформация");
	XDTOКаталогТип 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Каталог");
	XDTOКлассификаторТип 			= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Классификатор");
	XDTOПакетПредложенийТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ПакетПредложений");
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка пакетов каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
	
	лКоличествоСтрок = МассивДанных.Количество();
	КоличествоПакетов = ?(лКоличествоСтрок > 0, МассивДанных[лКоличествоСтрок - 1].Пакет, -1); 
	
	Для Пакет = 1 по КоличествоПакетов Цикл
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Начало выгрузки пакета " + Строка(Пакет) + " каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена);
		
		МассивСтрок = МассивДанных.НайтиСтроки(Новый структура("Пакет", Пакет));	
		
		Если массивСтрок.Количество() > 0 тогда
					
			МассивКартинок 	= новый Массив;
			МассивФайлов   	= новый Массив;
			УспешноВсе		= Истина;		
			
			РазбитаяСтруктураДанных 	= РазборМассиваДанныхПоТипамОбъектов(МассивСтрок);
			
			СписокТоваров 				= РазбитаяСтруктураДанных.Номенклатура;
			
			лМенеджерВременныхТаблиц 	= СформироватьВременныеТаблицыПоИнформацииОТоварахПакета(ПараметрыОбмена, СтрокаТаблицыКаталогов.ИдКаталога, СписокТоваров, мСвойства);
			
			XDTOКаталог 				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКаталогТип); 
			XDTOКаталог.Ид				= СтрокаТаблицыКаталогов.ИдКаталога;
			XDTOКаталог.ИдКлассификатора= СтрокаТаблицыКаталогов.ИдКаталога;
			XDTOКаталог.Наименование	= СтрокаТаблицыКаталогов.Каталог;
			XDTOКаталог.Описание 		= СтрокаТаблицыКаталогов.Каталог;
			XDTOКаталог.СодержитТолькоИзменения = XMLСтрока(Истина);
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка данных о товарах.", ПараметрыОбмена);
			
			ИмяКаталога = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ПараметрыОбмена.КаталогНаДиске + "\goods\" + Строка(Пакет)); 
			
			//выгрузка товаров
			Если ПараметрыОбмена.ВыгружатьТовары тогда
				
				XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
				
				ВыгрузитьТоварыXDTO(ПараметрыОбмена, ИмяКаталога, XDTOКаталог, XDTOКаталогТип, лМенеджерВременныхТаблиц, СтрокаТаблицыКаталогов, МассивКартинок, МассивФайлов);
				XDTOКоммерческаяИнформация.Каталог = XDTOКаталог;
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "import" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				УспешноВсе = ?(УспешноВсе = Истина, Успешно, УспешноВсе);	
				
			КонецЕсли;
				
			//выгрузка предложений
			Если ПараметрыОбмена.ВыгружатьПредложения тогда
				XDTOКоммерческаяИнформация 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
					
				XDTOПакетПредложений						= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПакетПредложенийТип);  
				XDTOПакетПредложений.Ид						= СтрокаТаблицыКаталогов.ИдКаталога + "#";
				XDTOПакетПредложений.Наименование			= "Пакет предложений (" + СтрокаТаблицыКаталогов.Каталог + ")";
				XDTOПакетПредложений.ИдКаталога				= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.ИдКлассификатора		= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.СодержитТолькоИзменения= XMLСтрока(Истина);
					
				ВыгрузитьПредложенияXDTO(ПараметрыОбмена, ИмяКаталога, XDTOПакетПредложений, XDTOПакетПредложенийТип, лМенеджерВременныхТаблиц, МассивКартинок, МассивФайлов);
				
				XDTOКоммерческаяИнформация.ПакетПредложений = XDTOПакетПредложений;
					
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "offers" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				УспешноВсе = ?(УспешноВсе = Истина, Успешно, УспешноВсе);	
				
			КонецЕсли;
				
			//выгрузка цен
			Если ПараметрыОбмена.ВыгружатьЦены тогда  
					
				XDTOКоммерческаяИнформация 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
					
				XDTOПакетПредложений						= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПакетПредложенийТип);  
				XDTOПакетПредложений.Ид						= СтрокаТаблицыКаталогов.ИдКаталога + "#";
				XDTOПакетПредложений.Наименование			= "Пакет предложений (" + СтрокаТаблицыКаталогов.Каталог + ")";
				XDTOПакетПредложений.ИдКаталога				= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.ИдКлассификатора		= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.СодержитТолькоИзменения= XMLСтрока(Истина);
					
				XDTOПредложенияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Предложения", Истина, XDTOПакетПредложенийТип);
					
				XDTOПредложения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложенияТип); 
					
				ВыгрузитьПрайсы(ПараметрыОбмена, XDTOПредложения, XDTOПредложенияТип, лМенеджерВременныхТаблиц);
				XDTOПакетПредложений.Предложения = XDTOПредложения;
					
				XDTOКоммерческаяИнформация.ПакетПредложений = XDTOПакетПредложений;
					
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "prices" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				УспешноВсе = ?(УспешноВсе = Истина, Успешно, УспешноВсе);	
				
			КонецЕсли;
				
			//выгрузка остатков
			Если ПараметрыОбмена.ВыгружатьОстатки тогда  
					
				XDTOКоммерческаяИнформация 					= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьXDTOКоммерческаяИнформация(ПараметрыОбмена, XDTOКоммерческаяИнформацияТип);
					
				XDTOПакетПредложений						= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПакетПредложенийТип);  
				XDTOПакетПредложений.Ид						= СтрокаТаблицыКаталогов.ИдКаталога + "#";
				XDTOПакетПредложений.Наименование			= "Пакет предложений (" + СтрокаТаблицыКаталогов.Каталог + ")";
				XDTOПакетПредложений.ИдКаталога				= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.ИдКлассификатора		= СтрокаТаблицыКаталогов.ИдКаталога;
				XDTOПакетПредложений.СодержитТолькоИзменения= XMLСтрока(Истина);
					
				XDTOПредложенияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Предложения", Истина, XDTOПакетПредложенийТип);
					
				XDTOПредложения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложенияТип); 
					
				ВыгрузитьОстаткиXDTO(ПараметрыОбмена, XDTOПредложения, XDTOПредложенияТип, лМенеджерВременныхТаблиц);
				XDTOПакетПредложений.Предложения = XDTOПредложения;
					
				XDTOКоммерческаяИнформация.ПакетПредложений = XDTOПакетПредложений;
					
				Успешно = ЗаписьИОтправкаXMLДанныхНаСайт(ПараметрыОбмена, XDTOКоммерческаяИнформация, ИмяКаталога, "rests" + ?(НомерСтроки > 0 ,Строка(НомерСтроки), ""), "catalog", Пакет);		
				УспешноВсе = ?(УспешноВсе = Истина, Успешно, УспешноВсе);	
				
			КонецЕсли;
			
			УдалениеПакетовИРегистрацийИзмененияПослеВыгрузкиНаСайт(УспешноВсе, ПараметрыОбмена, Операция, Пакет, СтрокаТаблицыКаталогов.ИдКаталога, МассивСтрок, МассивКартинок, МассивФайлов);
			
			лМенеджерВременныхТаблиц.Закрыть();
			
		КонецЕсли;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Завершение выгрузки пакета " + Строка(Пакет) + " каталога: " + СтрокаТаблицыКаталогов.Каталог, ПараметрыОбмена, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуПоИспользуемымСвойствамТоваров(ПараметрыОбмена, Операция, СтрокаТаблицыКаталогов)
	
	мТаблицаКаталогов 		 = ПараметрыОбмена.СохраненнаяТаблицаКаталогов.Получить();
	мТаблицаОтборовКаталогов = ПараметрыОбмена.СохраненнаяТаблицаОтборовКаталогов.Получить();
	
	
	ПостроительЗапроса = Новый ПостроительОтчета;
	НайденнаяСтрокаСОтбором = мТаблицаОтборовКаталогов.Найти(СтрокаТаблицыКаталогов.ИдКаталога);
	
	ПланыОбмена.Б_ОбменССайтом.НастроитьПостроительСвойствДляТоваров(ПостроительЗапроса, ПараметрыОбмена);
	ПланыОбмена.Б_ОбменССайтом.ЗаполнитьОтборПостроителяСвойств(ПостроительЗапроса, ПараметрыОбмена);
	
	Если НайденнаяСтрокаСОтбором <> Неопределено тогда  
		
		Если НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета <> Неопределено Тогда 
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ЗаполнитьОтборПоТаблицеЗначений(ПостроительЗапроса.Отбор, НайденнаяСтрокаСОтбором.ОтборПостроителяОтчета, Операция);
		КонецЕсли;
		
	КонецЕсли;	
	
	ЗапросПостроителя = ПостроительЗапроса.ПолучитьЗапрос();
	ТаблицаСвойств = ЗапросПостроителя.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаСвойств;	
	
КонецФункции

Функция СформироватьВременныеТаблицыПоИнформацииОТоварахПакета(ПараметрыОбмена, ИдентификаторКаталога, СписокТоваров, СписокСвойств) Экспорт
	
	Запрос = Новый Запрос;
	
	КлассифицироватьПоЦеновымГруппам 			= ПараметрыОбмена.КлассифицироватьПоЦеновымГруппам;
	
	ТекДата = ТекущаяДата();
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ТекДата));
	
	Если НЕ ПараметрыОбмена.УчетнаяПолитика = НеОпределено Тогда
		ПериодНакопленияСкидок = ОбработкаТабличныхЧастей.ПолучитьПериодРасчетаНакопительныхСкидок(ТекДата, ПараметрыОбмена.УчетнаяПолитика);
	Иначе
		ПериодНакопленияСкидок = Новый Структура("ДатаНач,ДатаКон", '00010101000000', КонецДня(ТекДата));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНач", ПериодНакопленияСкидок.ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ПериодНакопленияСкидок.ДатаКон);
	
	МассивУсловийСкидок = Новый Массив;
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.БезУсловий);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоКоличествуТовара);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента);
	
	Запрос.УстановитьПараметр("МассивУсловийСкидок", МассивУсловийСкидок);
	
	Запрос.УстановитьПараметр("КлассифицироватьПоЦеновымГруппам"	, КлассифицироватьПоЦеновымГруппам);
	Запрос.УстановитьПараметр("ВыгружатьВсеХарактеристики"			, Истина);
	Запрос.УстановитьПараметр("ВыгружатьТолькоСЦеной"				, ПараметрыОбмена.ВыгружатьПредложенияТолькоСЦеной);
	Запрос.УстановитьПараметр("ВыгружатьНоменклатуруКакПредложение"	, ПараметрыОбмена.ВыгружатьНоменклатуруКакПредложение);
	Запрос.УстановитьПараметр("ВыгружатьПредложенияТолькоСОстатками", ПараметрыОбмена.ВыгружатьХарактеристикиТолькоСОстатками);
	Запрос.УстановитьПараметр("ВыгружатьНаборы"						, ПараметрыОбмена.ВыгружатьНаборы);
	
	Запрос.УстановитьПараметр("СписокРасширенийКартинок"			, ПараметрыОбмена.РасширенияКартинок);
	
	Запрос.УстановитьПараметр("Узел", ПараметрыОбмена.Ссылка);
	
	Запрос.УстановитьПараметр("СписокТоваров"	, СписокТоваров);
	Запрос.УстановитьПараметр("СписокСвойств"	, СписокСвойств);
	
	НайданнаяСтрока = ПараметрыОбмена.КэшДанных.Найти(ИдентификаторКаталога, "ИдКаталога");
	Если НайданнаяСтрока <> Неопределено тогда
	
		Запрос.УстановитьПараметр("СписокСкладов"	, НайданнаяСтрока.ОбщийСписокСкладов);
		Запрос.УстановитьПараметр("СписокТиповЦен"	, НайданнаяСтрока.ОбщийСписокТиповЦен);
		Запрос.УстановитьПараметр("СписокЕдиниц" 	, НайданнаяСтрока.ОбщийСписокЕдиницИзмерений);
			
	Иначе
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Произошла ошибка в модуле. Информация по складам и остаткам может быть некорректной.", ПараметрыОбмена, Истина);
		
		Запрос.УстановитьПараметр("СписокСкладов"	, "");
		Запрос.УстановитьПараметр("СписокТиповЦен", "");
		Запрос.УстановитьПараметр("СписокЕдиниц" 	, "");
	КонецЕсли;
	
	
	
	Запрос.УстановитьПараметр("ВыгружатьВсеКартинки", 	ПараметрыОбмена.ПринудительнаяПолноеОбновлениеДанныхТовара ИЛИ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно);
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТекстЗапроса =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВремНоменклатураОтбор
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(НЕ &КлассифицироватьПоЦеновымГруппам
	|			ИЛИ &КлассифицироватьПоЦеновымГруппам
	|				И НЕ Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка))
	|	И Номенклатура.Ссылка В(&СписокТоваров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦены,
	|	ТипыЦенНоменклатуры.ВерсияДанных,
	|	ТипыЦенНоменклатуры.ПометкаУдаления,
	|	ТипыЦенНоменклатуры.Наименование,
	|	ТипыЦенНоменклатуры.Рассчитывается,
	|	ТипыЦенНоменклатуры.ПроцентСкидкиНаценки,
	|	ТипыЦенНоменклатуры.ЦенаВключаетНДС,
	|	ТипыЦенНоменклатуры.СпособРасчетаЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены.Наименование КАК ВалютаЦеныКод,
	|	ТипыЦенНоменклатуры.БазовыйТипЦен,
	|	ВЫБОР
	|		КОГДА ТипыЦенНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ТипыЦенНоменклатуры.Ссылка
	|		ИНАЧЕ ТипыЦенНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор
	|ПОМЕСТИТЬ ВремТипыЦен
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|ГДЕ
	|	ТипыЦенНоменклатуры.Ссылка В(&СписокТиповЦен)
	|{ГДЕ
	|	ТипыЦенНоменклатуры.Ссылка.* КАК ТипЦен}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены КАК ВалютаЦены,
	|	ТипыЦенНоменклатуры.Рассчитывается КАК Рассчитывается,
	|	ТипыЦенНоменклатуры.БазовыйТипЦен КАК БазовыйТипЦен,
	|	ТипыЦенНоменклатуры.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ТипыЦенНоменклатуры.СпособРасчетаЦены КАК СпособРасчетаЦены
	|ПОМЕСТИТЬ ВремВсеТипыЦен
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|ГДЕ
	|	(ТипыЦенНоменклатуры.Ссылка В
	|				(ВЫБРАТЬ
	|					ВремТипыЦен.ТипЦены
	|				ИЗ
	|					ВремТипыЦен)
	|			ИЛИ НЕ ТипыЦенНоменклатуры.Рассчитывается)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК БазоваяЦена,
	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаБазовойЦены,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияБазовойЦены,
	|	ВЫБОР
	|		КОГДА ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки ЕСТЬ NULL 
	|			ТОГДА ВремВсеТипыЦен.ПроцентСкидкиНаценки
	|		ИНАЧЕ ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	ВремВсеТипыЦен.ТипЦены КАК ТипЦен,
	|	ВремВсеТипыЦен.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	ВремВсеТипыЦен.ВалютаЦены КАК ВалютаТипЦены
	|ПОМЕСТИТЬ ВремБазовыеЦены
	|ИЗ
	|	ВремВсеТипыЦен КАК ВремВсеТипыЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураОтбор.Номенклатура
	|						ИЗ
	|							ВремНоменклатураОтбор)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремВсеТипыЦен.ТипЦены
	|						ИЗ
	|							ВремВсеТипыЦен)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (ВремВсеТипыЦен.Рассчитывается)
	|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = ВремВсеТипыЦен.БазовыйТипЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураОтбор.Номенклатура
	|						ИЗ
	|							ВремНоменклатураОтбор)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремВсеТипыЦен.ТипЦены
	|						ИЗ
	|							ВремВсеТипыЦен)) КАК ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних
	|		ПО (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ТипЦен = ВремВсеТипыЦен.ТипЦены)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Валюта = ВремВсеТипыЦен.ВалютаЦены)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БазоваяЦена,
	|	ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремВсеТипыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазовыеЦены.ТипЦен КАК ТипЦен,
	|	БазовыеЦены.ВалютаТипЦены КАК ВалютаТипаЦен,
	|	БазовыеЦены.Номенклатура КАК Номенклатура,
	|	БазовыеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	БазовыеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	БазовыеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	БазовыеЦены.БазоваяЦена КАК БазоваяЦена,
	|	БазовыеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	|	БазовыеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	|	МИНИМУМ(ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница) КАК ВерхняяГраница
	|ПОМЕСТИТЬ ВремДинамическиеЦены
	|ИЗ
	|	ВремБазовыеЦены КАК БазовыеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ТекДата, ) КАК ДиапазоныЦенДляНаценкиСрезПоследних
	|		ПО БазовыеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|			И БазовыеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	|
	|СГРУППИРОВАТЬ ПО
	|	БазовыеЦены.ХарактеристикаНоменклатуры,
	|	БазовыеЦены.СпособРасчетаЦены,
	|	БазовыеЦены.ТипЦен,
	|	БазовыеЦены.ВалютаТипЦены,
	|	БазовыеЦены.Номенклатура,
	|	БазовыеЦены.ВалютаБазовойЦены,
	|	БазовыеЦены.ЕдиницаИзмеренияБазовойЦены,
	|	БазовыеЦены.ПроцентСкидкиНаценки,
	|	БазовыеЦены.БазоваяЦена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	БазоваяЦена,
	|	ВерхняяГраница,
	|	ВалютаБазовойЦены,
	|	ВалютаТипаЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремБазовыеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДинамическиеЦены.Номенклатура КАК Номенклатура,
	|	ДинамическиеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДинамическиеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ДинамическиеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	ДинамическиеЦены.ТипЦен КАК ТипЦен,
	|	ДинамическиеЦены.ВалютаТипаЦен КАК ВалютаТипаЦен,
	|	ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) КАК КурсВалютыЦены,
	|	ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) КАК КратностьКурсаВалютыЦены,
	|	ДинамическиеЦены.БазоваяЦена КАК БазоваяЦена,
	|	ДинамическиеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	|	ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) КАК КурсВалютыБазовойЦены,
	|	ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) КАК КратностьКурсаВалютыБазовойЦены,
	|	ДинамическиеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	|	ЕСТЬNULL(ДиапазоныЦенДляНаценкиСрезПоследних.Цена, 0) КАК ЦенаПоДиапазону,
	|	ДиапазоныЦенДляНаценкиСрезПоследних.Валюта КАК ВалютаЦеныПоДиапазону,
	|	ВЫБОР
	|		КОГДА ДинамическиеЦены.ВалютаТипаЦен = ДинамическиеЦены.ВалютаБазовойЦены
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 1
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) / ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	|						КОНЕЦ
	|				КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) <> 1
	|						И ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) = 1
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	|							ТОГДА 0
	|						ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоэффициентПересчетаБазовойЦены
	|ПОМЕСТИТЬ ВремРасчетныеЦены
	|ИЗ
	|	ВремДинамическиеЦены КАК ДинамическиеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ТекДата, ) КАК ДиапазоныЦенДляНаценкиСрезПоследних
	|		ПО ДинамическиеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|			И ДинамическиеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	|			И ДинамическиеЦены.ВерхняяГраница = ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютыЦены
	|		ПО ДинамическиеЦены.ВалютаТипаЦен = КурсыВалютыЦены.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютыБазовойЦены
	|		ПО ДинамическиеЦены.ВалютаБазовойЦены = КурсыВалютыБазовойЦены.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремДинамическиеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦеныИдентификатор
	|ПОМЕСТИТЬ ВремЦеныНоменклатурыСрезПоследних
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетныеЦены.Номенклатура КАК Номенклатура,
	|		РасчетныеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		РасчетныеЦены.ТипЦен КАК ТипЦен,
	|		ВЫБОР
	|			КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|				ТОГДА РасчетныеЦены.ВалютаТипаЦен
	|			ИНАЧЕ РасчетныеЦены.ВалютаЦеныПоДиапазону
	|		КОНЕЦ КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|				ТОГДА РасчетныеЦены.БазоваяЦена * РасчетныеЦены.КоэффициентПересчетаБазовойЦены * (1 + РасчетныеЦены.ПроцентСкидкиНаценки / 100)
	|			ИНАЧЕ РасчетныеЦены.ЦенаПоДиапазону
	|		КОНЕЦ КАК Цена,
	|		РасчетныеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмерения,
	|		NULL КАК ТипЦеныИдентификатор
	|	ИЗ
	|		ВремРасчетныеЦены КАК РасчетныеЦены
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|		ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	|		ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|		ЦеныНоменклатурыСрезПоследних.Валюта,
	|		ЦеныНоменклатурыСрезПоследних.Цена,
	|		ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА ЦеныНоменклатурыСрезПоследних.ТипЦен.Б_Идентификатор = """"
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.ТипЦен.Ссылка
	|			ИНАЧЕ ЦеныНоменклатурыСрезПоследних.ТипЦен.Б_Идентификатор
	|		КОНЕЦ
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				НЕ ТипЦен.Рассчитывается
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураОтбор.Номенклатура
	|						ИЗ
	|							ВремНоменклатураОтбор)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремТипыЦен.ТипЦены
	|						ИЗ
	|							ВремТипыЦен) {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРасчетныеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦены,
	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаЦеныСсылка,
	|	ЦеныНоменклатурыСрезПоследних.Валюта.Наименование КАК ВалютаКод,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаБезХарактеристики,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ПорядокОкругления КАК ПорядокОкругления,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЦены,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ВремЦены
	|ИЗ
	|	ВремЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	|ПОМЕСТИТЬ ВремКомплектующиеНоменклатурыОтбор
	|ИЗ
	|	ВремНоменклатураОтбор КАК ВремНоменклатураОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|		ПО ВремНоменклатураОтбор.Номенклатура = КомплектующиеНоменклатуры.Номенклатура
	|ГДЕ
	|	&ВыгружатьНаборы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Комплектующая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураОтбор.Номенклатура КАК Номенклатура,
	|	ЛОЖЬ КАК Комплектующая
	|ПОМЕСТИТЬ ВремНоменклатураОтбораИкомплектов
	|ИЗ
	|	ВремНоменклатураОтбор КАК ВремНоменклатураОтбор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремКомплектующиеНоменклатурыОтбор.Комплектующая,
	|	ИСТИНА
	|ИЗ
	|	ВремКомплектующиеНоменклатурыОтбор КАК ВремКомплектующиеНоменклатурыОтбор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремКомплектующиеНоменклатурыОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура КАК Объект,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Б_Идентификатор,
	|	ВЫБОР
	|		КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.Ссылка
	|		ИНАЧЕ ВремНоменклатураОтбораИкомплектов.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ВерсияДанных КАК ВерсияДанных,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Код КАК Код,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Артикул КАК Артикул,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Наименование КАК Наименование,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ВестиУчетПоХарактеристикам КАК ВестиУчетПоХарактеристикам,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ЕдиницаХраненияОстатков.Вес КАК Вес,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.СтранаПроисхождения.Наименование КАК СтранаПроисхождения,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ОсновнойПоставщик.Наименование КАК ОсновнойПоставщик,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ДополнительноеОписаниеНоменклатурыВФорматеHTML КАК ДополнительноеОписаниеНоменклатурыВФорматеHTML,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Комментарий КАК Комментарий,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Родитель КАК Родитель,
	|	ВЫБОР
	|		КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.Родитель.Б_Идентификатор = """"
	|			ТОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.Родитель.Ссылка
	|		ИНАЧЕ ВремНоменклатураОтбораИкомплектов.Номенклатура.Родитель.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторРодителя,
	//
	//|	ВремНоменклатураОтбораИкомплектов.Номенклатура.НомерГТД.Код КАК НомерГТД,
	|	"""" КАК НомерГТД,
	//
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ОсновноеИзображение КАК ОсновноеИзображение,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.БазоваяЕдиницаИзмерения.Код
	|		ИНАЧЕ ВремНоменклатураОтбораИкомплектов.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторБазовойЕдиницы,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура В
	|							(ВЫБРАТЬ
	|								КомплектующиеНоменклатуры.Номенклатура
	|							ИЗ
	|								РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры)
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВремНоменклатураОтбораИкомплектов.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|						ИЛИ ВремНоменклатураОтбораИкомплектов.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Комплект)
	|					ТОГДА 3
	|				ИНАЧЕ 4
	|			КОНЕЦ
	|	КОНЕЦ КАК ПриоритетСортировки,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Комплект КАК Комплект,
	|	ВремНоменклатураОтбораИкомплектов.Номенклатура.Набор КАК Набор,
	|	ВремНоменклатураОтбораИкомплектов.Комплектующая КАК ЭтоКомплектующая
	|ПОМЕСТИТЬ ВремНоменклатура
	|ИЗ
	|	ВремНоменклатураОтбораИкомплектов КАК ВремНоменклатураОтбораИкомплектов
	|ГДЕ
	|	(НЕ &КлассифицироватьПоЦеновымГруппам
	|			ИЛИ &КлассифицироватьПоЦеновымГруппам
	|				И НЕ ВремНоменклатураОтбораИкомплектов.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ВестиУчетПоХарактеристикам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремНоменклатура.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	|ПОМЕСТИТЬ ВремНоменклатураСХарактеристикамиВся
	|ИЗ
	|	ВремНоменклатура КАК ВремНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремНоменклатура.Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|		ПО ХарактеристикиНоменклатуры.Владелец.Ссылка = ВремНоменклатура.Номенклатура
	|			И (ВремНоменклатура.ВестиУчетПоХарактеристикам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураОтбораИкомплектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Склад,
	|	ВЫБОР
	|		КОГДА Склады.Б_Идентификатор = """"
	|			ТОГДА Склады.Ссылка
	|		ИНАЧЕ Склады.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор
	|ПОМЕСТИТЬ ВремСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|	И Склады.Ссылка В(&СписокСкладов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыНаСкладахОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВРозницеОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВРознице.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВНТТОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТ.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	НоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ВремОстатки
	|ИЗ
	|	ВремНоменклатураСХарактеристикамиВся КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыНаСкладахОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураСХарактеристиками.Номенклатура,
	|	НоменклатураСХарактеристиками.Характеристика,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	ВремНоменклатураСХарактеристикамиВся КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыВРозницеОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураСХарактеристиками.Номенклатура,
	|	НоменклатураСХарактеристиками.Характеристика,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	ВремНоменклатураСХарактеристикамиВся КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыВНТТОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыНаСкладахОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВРозницеОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВНТТОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремНоменклатура.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВремНоменклатура.Идентификатор = """"
	|			ТОГДА ВремНоменклатура.Номенклатура
	|		ИНАЧЕ ВремНоменклатура.Идентификатор
	|	КОНЕЦ КАК НоменклатураИдентификатор,
	|	ВремНоменклатура.ВерсияДанных КАК НоменклатураВерсияДанных,
	|	ВремНоменклатура.ПометкаУдаления КАК НоменклатураПометкаУдаления,
	|	ВремНоменклатура.Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	"""" КАК ХарактеристикаИдентификатор,
	|	"""" КАК ХарактеристикаВерсияДанных,
	|	"""" КАК ХарактеристикаПометкаУдаления,
	|	"""" КАК ХарактеристикаНаименование,
	|	ВремНоменклатура.ВестиУчетПоХарактеристикам,
	|	ВремНоменклатура.Набор
	|		ИЛИ ВремНоменклатура.Комплект КАК КомплектНабор,
	|	ВремНоменклатура.ПриоритетСортировки
	|ПОМЕСТИТЬ ВремНоменклатураСХарактеристиками
	|ИЗ
	|	ВремНоменклатура КАК ВремНоменклатура
	|ГДЕ
	|	(ВремНоменклатура.ВестиУчетПоХарактеристикам
	|				И &ВыгружатьНоменклатуруКакПредложение
	|			ИЛИ НЕ ВремНоменклатура.ВестиУчетПоХарактеристикам)
	|	И ВЫБОР
	|			КОГДА &ВыгружатьТолькоСЦеной
	|					И НЕ ВремНоменклатура.ЭтоКомплектующая
	|				ТОГДА (ВремНоменклатура.Номенклатура, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) В
	|						(ВЫБРАТЬ
	|							ВремЦены.Номенклатура,
	|							ВремЦены.Характеристика
	|						ИЗ
	|							ВремЦены КАК ВремЦены)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремНоменклатура.Номенклатура,
	|	ВЫБОР
	|		КОГДА ВремНоменклатура.Идентификатор = """"
	|			ТОГДА ВремНоменклатура.Номенклатура
	|		ИНАЧЕ ВремНоменклатура.Идентификатор
	|	КОНЕЦ,
	|	ВремНоменклатура.ВерсияДанных,
	|	ВремНоменклатура.ПометкаУдаления,
	|	ВремНоменклатура.Наименование,
	|	ХарактеристикиНоменклатуры.Ссылка,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|		ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|	КОНЕЦ,
	|	ХарактеристикиНоменклатуры.ВерсияДанных,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления,
	|	ХарактеристикиНоменклатуры.Наименование,
	|	ИСТИНА,
	|	ВремНоменклатура.Набор
	|		ИЛИ ВремНоменклатура.Комплект,
	|	ВремНоменклатура.ПриоритетСортировки
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|		ПО ХарактеристикиНоменклатуры.Владелец = ВремНоменклатура.Номенклатура
	|			И (ВремНоменклатура.ВестиУчетПоХарактеристикам)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВыгружатьТолькоСЦеной
	|					И НЕ ВремНоменклатура.ЭтоКомплектующая
	|				ТОГДА ХарактеристикиНоменклатуры.Ссылка В
	|						(ВЫБРАТЬ
	|							ВремЦены.Характеристика
	|						ИЗ
	|							ВремЦены КАК ВремЦены)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ &ВыгружатьПредложенияТолькоСОстатками
	|					ИЛИ ВремНоменклатура.ЭтоКомплектующая
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ (ВремНоменклатура.Номенклатура, ХарактеристикиНоменклатуры.Ссылка) В
	|					(ВЫБРАТЬ
	|						ВремОстатки.Номенклатура,
	|						ВремОстатки.Характеристика
	|					ИЗ
	|						ВремОстатки КАК ВремОстатки)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ ВремЗначенияСвойствТоваровДляВыгрузкиРеквизитовПоПользовательсокмуАлгоритму
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВремНоменклатура.Номенклатура
	|			ИЗ
	|				ВремНоменклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураСХарактеристикамиВся
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦены";
	
	Если ПараметрыОбмена.ВыгружатьНаборы тогда
		
		ТекстЗапроса = ТекстЗапроса + "	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомплектующиеНоменклатуры.Количество * КомплектующиеНоменклатуры.ЕдиницаИзмерения.Коэффициент КАК Количество,
		|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
		|	ВремНоменклатураСХарактеристиками.НоменклатураИдентификатор,
		|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
		|	ВремНоменклатураСХарактеристиками.ХарактеристикаИдентификатор,
		|	КомплектующиеНоменклатуры.Комплектующая,
		|	ВЫБОР
		|		КОГДА КомплектующиеНоменклатуры.Комплектующая.Б_Идентификатор = """"
		|			ТОГДА КомплектующиеНоменклатуры.Комплектующая
		|		ИНАЧЕ КомплектующиеНоменклатуры.Комплектующая.Б_Идентификатор
		|	КОНЕЦ КАК ИдентификаторКомплектующей,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей,
		|	ВЫБОР
		|		КОГДА КомплектующиеНоменклатуры.ХарактеристикаКомплектующей.Б_Идентификатор = """"
		|			ТОГДА КомплектующиеНоменклатуры.ХарактеристикаКомплектующей
		|		ИНАЧЕ КомплектующиеНоменклатуры.ХарактеристикаКомплектующей.Б_Идентификатор
		|	КОНЕЦ КАК ИдентификаторХарактеристикиКомплектующей,
		|	КомплектующиеНоменклатуры.Комплектующая.Наименование,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей.Наименование
		|ПОМЕСТИТЬ ВремКомплектующиеНоменклатуры
		|ИЗ
		|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ПО ВремНоменклатураСХарактеристиками.Номенклатура = КомплектующиеНоменклатуры.Номенклатура
		|			И ВремНоменклатураСХарактеристиками.Характеристика = КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика";
	КонецЕсли;
	
	ЗапросПоСвойствам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвойстваОбъектов.Ссылка КАК СвойствоНоменклатуры,
	|	ВЫБОР
	|		КОГДА СвойстваОбъектов.Б_Идентификатор = """"
	|			ТОГДА СвойстваОбъектов.Ссылка
	|		ИНАЧЕ СвойстваОбъектов.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	СвойстваОбъектов.ВерсияДанных КАК ВерсияДанных,
	|	СвойстваОбъектов.Наименование КАК СвойствоНаименование,
	|	СвойстваОбъектов.НазначениеСвойства КАК НазначениеСвойства,
	|	СвойстваОбъектов.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СвойстваОбъектов.НазначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНоменклатуры
	|ПОМЕСТИТЬ ВремВсеСвойства
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Ссылка В(&СписокСвойств)
	|{ГДЕ
	|	СвойстваОбъектов.Ссылка.* КАК СвойствоНоменклатуры}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвойствоНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремНоменклатура.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.СвойствоНоменклатуры КАК Свойство,
	|	ВложенныйЗапрос.ИдентификаторСвойства
	|ПОМЕСТИТЬ ВремНазначенныеСвойстваТовара
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НазначенияСвойствОбъектов.Объект КАК Объект,
	|		ВремВсеСвойства.СвойствоНоменклатуры КАК СвойствоНоменклатуры,
	|		ВремВсеСвойства.Идентификатор КАК ИдентификаторСвойства
	|	ИЗ
	|		ВремВсеСвойства КАК ВремВсеСвойства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенияСвойствОбъектов КАК НазначенияСвойствОбъектов
	|			ПО (НазначенияСвойствОбъектов.Объект ЕСТЬ NULL 
	|					ИЛИ ВремВсеСвойства.СвойствоНоменклатуры = НазначенияСвойствОбъектов.Свойство)
	|	ГДЕ
	|		ВремВсеСвойства.ЭтоНоменклатуры = ИСТИНА) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|		ПО (ВложенныйЗапрос.Объект ЕСТЬ NULL 
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
	|				ИЛИ ВложенныйЗапрос.Объект = ВремНоменклатура.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНазначенныеСвойстваТовара.Номенклатура КАК Номенклатура,
	|	ВремНазначенныеСвойстваТовара.ИдентификаторСвойства,
	|	ЗначенияСвойствОбъектов.Значение,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойствОбъектов.Значение.Б_Идентификатор = """"
	|				ИЛИ ЗначенияСвойствОбъектов.Значение.Б_Идентификатор ЕСТЬ NULL 
	|			ТОГДА ЗначенияСвойствОбъектов.Значение
	|		ИНАЧЕ ЗначенияСвойствОбъектов.Значение.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЗначения
	|ПОМЕСТИТЬ ВремЗначенияСвойствТовара
	|ИЗ
	|	ВремНазначенныеСвойстваТовара КАК ВремНазначенныеСвойстваТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ВремНазначенныеСвойстваТовара.Номенклатура = ЗначенияСвойствОбъектов.Объект
	|			И ВремНазначенныеСвойстваТовара.Свойство = ЗначенияСвойствОбъектов.Свойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Значение КАК Значение,
	|	ВложенныйЗапрос.ИдентификаторСвойства,
	|	ВложенныйЗапрос.Свойство.Наименование КАК СвойствоНаименование,
	|	ВложенныйЗапрос.Свойство,
	|	ВложенныйЗапрос.ИдентификаторЗначения,
	|	ВложенныйЗапрос.БулевоЗначение
	|ПОМЕСТИТЬ ВремЗначенияСвойствХарактеристик
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение,
	|			ВремВсеСвойства.Идентификатор КАК ИдентификаторСвойства,
	|			ВЫБОР
	|				КОГДА ЗначенияСвойствОбъектов.Значение.Б_Идентификатор = """"
	|						ИЛИ ЗначенияСвойствОбъектов.Значение.Б_Идентификатор ЕСТЬ NULL 
	|					ТОГДА ЗначенияСвойствОбъектов.Значение
	|				ИНАЧЕ ЗначенияСвойствОбъектов.Значение.Б_Идентификатор
	|			КОНЕЦ КАК ИдентификаторЗначения,
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ЗначенияСвойствОбъектов.Значение) = ТИП(БУЛЕВО)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ КАК БулевоЗначение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВремВсеСвойства КАК ВремВсеСвойства
	|				ПО ЗначенияСвойствОбъектов.Свойство = ВремВсеСвойства.СвойствоНоменклатуры) КАК ВложенныйЗапрос
	|		ПО ВремНоменклатураСХарактеристиками.Характеристика = ВложенныйЗапрос.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНазначенныеСвойстваТовара";
	
	
	ЗапросПоКартинкам =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХранилищеДополнительнойИнформации.Объект КАК Номенклатура,
	|	ХранилищеДополнительнойИнформации.Ссылка КАК ХранилищеСсылка,
	|	ХранилищеДополнительнойИнформации.ВидДанных КАК ВидДанных
	|ПОМЕСТИТЬ ВремФайлыНоменклатурыВсе
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект В
	|			(ВЫБРАТЬ
	|				ВремНоменклатура.Номенклатура
	|			ИЗ
	|				ВремНоменклатура)
	|	И НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХранилищеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХранилищеДополнительнойИнформацииИзменения.Ссылка КАК ХранилищеСсылка,
	|	ХранилищеДополнительнойИнформацииИзменения.Ссылка.Объект КАК Номенклатура
	|ПОМЕСТИТЬ ВремФайлыНоменклатурыИзменения
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации.Изменения КАК ХранилищеДополнительнойИнформацииИзменения
	|ГДЕ
	|	ХранилищеДополнительнойИнформацииИзменения.Ссылка.Объект В
	|			(ВЫБРАТЬ
	|				ВремНоменклатура.Номенклатура
	|			ИЗ
	|				ВремНоменклатура)
	|	И НЕ ХранилищеДополнительнойИнформацииИзменения.Ссылка.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформацииИзменения.Узел = &Узел
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХранилищеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремФайлыНоменклатурыВсе.Номенклатура КАК Номенклатура,
	|	ВремФайлыНоменклатурыВсе.ХранилищеСсылка КАК ХранилищеСсылка,
	|	ВремФайлыНоменклатурыВсе.ВидДанных КАК ВидДанных,
	|	ВЫБОР
	|		КОГДА &ВыгружатьВсеКартинки = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВремФайлыНоменклатурыВсе.ХранилищеСсылка В
	|						(ВЫБРАТЬ
	|							ВремФайлыНоменклатурыИзменения.ХранилищеСсылка
	|						ИЗ
	|							ВремФайлыНоменклатурыИзменения)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК НадоВыгружать
	|ПОМЕСТИТЬ ВремФайлыНоменклатуры
	|ИЗ
	|	ВремФайлыНоменклатурыВсе КАК ВремФайлыНоменклатурыВсе
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХранилищеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремФайлыНоменклатурыВсе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремФайлыНоменклатурыИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Изображения.ХранилищеСсылка,
	|	Изображения.НадоВыгружать,
	|	Изображения.Номенклатура КАК Номенклатура,
	|	ХранилищеДополнительнойИнформации.Наименование
	|ПОМЕСТИТЬ ВремКартинки
	|ИЗ
	|	ВремФайлыНоменклатуры КАК Изображения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|		ПО Изображения.ХранилищеСсылка = ХранилищеДополнительнойИнформации.Ссылка
	|ГДЕ
	|	Изображения.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Изображение)
	|	И НЕ Изображения.ХранилищеСсылка = ЗНАЧЕНИЕ(Справочник.ХранилищеДополнительнойИнформации.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Изображения.ХранилищеСсылка,
	|	Изображения.Номенклатура КАК Номенклатура,
	|	Изображения.НадоВыгружать,
	|	ХранилищеДополнительнойИнформации.Наименование
	|ПОМЕСТИТЬ ВремФайлы
	|ИЗ
	|	ВремФайлыНоменклатуры КАК Изображения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|		ПО Изображения.ХранилищеСсылка = ХранилищеДополнительнойИнформации.Ссылка
	|ГДЕ
	|	Изображения.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
	|	И НЕ Изображения.ХранилищеСсылка = ЗНАЧЕНИЕ(Справочник.ХранилищеДополнительнойИнформации.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремФайлыНоменклатуры";
	
	ЗапросПоКартинкамИФайламПредложений ="ВЫБРАТЬ
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Ссылка КАК Файл,
	|	ВремНоменклатураСХарактеристиками.Номенклатура,
	|	ВремНоменклатураСХарактеристиками.Характеристика,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Расширение,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Описание,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Наименование,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Основная КАК Основная,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ДатаСоздания
	|ПОМЕСТИТЬ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы КАК Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы
	|		ПО ВремНоменклатураСХарактеристиками.Характеристика = Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Владелец
	|			И (НЕ Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ПометкаУдаления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл
	|ПОМЕСТИТЬ ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВыгружатьВсеКартинки
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл В
	|					(ВЫБРАТЬ
	|						Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения.Ссылка
	|					ИЗ
	|						Справочник.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Изменения КАК Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения
	|					ГДЕ
	|						Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения.Узел = &Узел)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами.Файл КАК Файл,
	|	Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ХранимыйФайл КАК ХранимыйФайл
	|ПОМЕСТИТЬ ВремНужныеФайлыХарактеристикНоменклатуры
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Б_ПрисоединенныеФайлыХарактеристикНоменклатуры КАК Б_ПрисоединенныеФайлыХарактеристикНоменклатуры
	|		ПО ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами.Файл = Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ПрисоединенныйФайл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Номенклатура КАК Номенклатура,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Наименование,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Описание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе) КАК ТипХраненияФайла,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Расширение,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Основная,
	|	ВремНужныеФайлыХарактеристикНоменклатуры.ХранимыйФайл,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВремНужныеФайлыХарактеристикНоменклатуры.ХранимыйФайл ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НадоВыгружать,
	|	ВЫБОР
	|		КОГДА ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Расширение В (&СписокРасширенийКартинок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКартинка,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВремФайлыХарактеристикНоменклатуры
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремНужныеФайлыХарактеристикНоменклатуры КАК ВремНужныеФайлыХарактеристикНоменклатуры
	|		ПО ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл = ВремНужныеФайлыХарактеристикНоменклатуры.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНужныеФайлыХарактеристикНоменклатуры";
	
	ЗапросПоШтрихКодам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	Штрихкоды.Штрихкод
	|ПОМЕСТИТЬ ВремШтрихКоды
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ВремНоменклатураСХарактеристиками.Номенклатура = Штрихкоды.Владелец
	|			И ВремНоменклатураСХарактеристиками.Характеристика = Штрихкоды.ХарактеристикаНоменклатуры
	|			И ВремНоменклатураСХарактеристиками.Номенклатура.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	
	ЗапросПоПланируемойДатеПоступления = "ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВремПланируемыеДатыПоступления
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления >= &ТекДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	
	
	ЗапросПоЦенам =  "ВЫБРАТЬ
	|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦены,
	|	ТипыЦенНоменклатуры.ВалютаЦены КАК ВалютаЦены,
	|	ТипыЦенНоменклатуры.Рассчитывается КАК Рассчитывается,
	|	ТипыЦенНоменклатуры.БазовыйТипЦен КАК БазовыйТипЦен,
	|	ТипыЦенНоменклатуры.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ВЫБОР
	|		КОГДА ТипыЦенНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ТипыЦенНоменклатуры.Ссылка
	|		ИНАЧЕ ТипыЦенНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	ТипыЦенНоменклатуры.СпособРасчетаЦены КАК СпособРасчетаЦены
	|ПОМЕСТИТЬ ВремВсеТипыЦен
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|ГДЕ
	|	(ТипыЦенНоменклатуры.Ссылка В
	|				(ВЫБРАТЬ
	|					ВремТипыЦен.ТипЦены
	|				ИЗ
	|					ВремТипыЦен)
	|			ИЛИ НЕ ТипыЦенНоменклатуры.Рассчитывается)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК БазоваяЦена,
	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаБазовойЦены,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияБазовойЦены,
	|	ВЫБОР
	|		КОГДА ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки ЕСТЬ NULL 
	|			ТОГДА ВремВсеТипыЦен.ПроцентСкидкиНаценки
	|		ИНАЧЕ ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	ВремВсеТипыЦен.ТипЦены КАК ТипЦен,
	|	ВремВсеТипыЦен.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	ВремВсеТипыЦен.Идентификатор КАК ТипЦеныИдентификатор,
	|	ВремВсеТипыЦен.ВалютаЦены КАК ВалютаТипЦены
	|ПОМЕСТИТЬ ВремБазовыеЦены
	|ИЗ
	|	ВремВсеТипыЦен КАК ВремВсеТипыЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				(Номенклатура, ХарактеристикаНоменклатуры) В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураСХарактеристиками.Номенклатура,
	|							ВремНоменклатураСХарактеристиками.Характеристика
	|						ИЗ
	|							ВремНоменклатураСХарактеристиками)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремВсеТипыЦен.ТипЦены
	|						ИЗ
	|							ВремВсеТипыЦен)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремВсеТипыЦен.ТипЦены
	|						ИЗ
	|							ВремВсеТипыЦен)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (ВремВсеТипыЦен.Рассчитывается)
	|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = ВремВсеТипыЦен.БазовыйТипЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				(Номенклатура, ХарактеристикаНоменклатуры) В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураСХарактеристиками.Номенклатура,
	|							ВремНоменклатураСХарактеристиками.Характеристика
	|						ИЗ
	|							ВремНоменклатураСХарактеристиками)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремВсеТипыЦен.ТипЦены
	|						ИЗ
	|							ВремВсеТипыЦен)) КАК ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних
	|		ПО (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ТипЦен = ВремВсеТипыЦен.ТипЦены)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Валюта = ВремВсеТипыЦен.ВалютаЦены)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения)
	|			И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БазоваяЦена,
	|	ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремВсеТипыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазовыеЦены.ТипЦен КАК ТипЦен,
	|	БазовыеЦены.ВалютаТипЦены КАК ВалютаТипаЦен,
	|	БазовыеЦены.Номенклатура КАК Номенклатура,
	|	БазовыеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	БазовыеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	БазовыеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	БазовыеЦены.БазоваяЦена КАК БазоваяЦена,
	|	БазовыеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	|	БазовыеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	|	МИНИМУМ(ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница) КАК ВерхняяГраница,
	|	БазовыеЦены.ТипЦеныИдентификатор
	|ПОМЕСТИТЬ ВремДинамическиеЦены
	|ИЗ
	|	ВремБазовыеЦены КАК БазовыеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ТекДата, ) КАК ДиапазоныЦенДляНаценкиСрезПоследних
	|		ПО БазовыеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|			И БазовыеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	|
	|СГРУППИРОВАТЬ ПО
	|	БазовыеЦены.ХарактеристикаНоменклатуры,
	|	БазовыеЦены.СпособРасчетаЦены,
	|	БазовыеЦены.ТипЦен,
	|	БазовыеЦены.ВалютаТипЦены,
	|	БазовыеЦены.Номенклатура,
	|	БазовыеЦены.ВалютаБазовойЦены,
	|	БазовыеЦены.ЕдиницаИзмеренияБазовойЦены,
	|	БазовыеЦены.ПроцентСкидкиНаценки,
	|	БазовыеЦены.БазоваяЦена,
	|	БазовыеЦены.ТипЦеныИдентификатор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	БазоваяЦена,
	|	ВерхняяГраница,
	|	ВалютаБазовойЦены,
	|	ВалютаТипаЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремБазовыеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДинамическиеЦены.Номенклатура КАК Номенклатура,
	|	ДинамическиеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДинамическиеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ДинамическиеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	|	ДинамическиеЦены.ТипЦен КАК ТипЦен,
	|	ДинамическиеЦены.ВалютаТипаЦен КАК ВалютаТипаЦен,
	|	ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) КАК КурсВалютыЦены,
	|	ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) КАК КратностьКурсаВалютыЦены,
	|	ДинамическиеЦены.БазоваяЦена КАК БазоваяЦена,
	|	ДинамическиеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	|	ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) КАК КурсВалютыБазовойЦены,
	|	ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) КАК КратностьКурсаВалютыБазовойЦены,
	|	ДинамическиеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	|	ЕСТЬNULL(ДиапазоныЦенДляНаценкиСрезПоследних.Цена, 0) КАК ЦенаПоДиапазону,
	|	ДиапазоныЦенДляНаценкиСрезПоследних.Валюта КАК ВалютаЦеныПоДиапазону,
	|	ВЫБОР
	|		КОГДА ДинамическиеЦены.ВалютаТипаЦен = ДинамическиеЦены.ВалютаБазовойЦены
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 1
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) / ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	|						КОНЕЦ
	|				КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) <> 1
	|						И ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) = 1
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	|							ТОГДА 0
	|						ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоэффициентПересчетаБазовойЦены,
	|	ДинамическиеЦены.ТипЦеныИдентификатор
	|ПОМЕСТИТЬ ВремРасчетныеЦены
	|ИЗ
	|	ВремДинамическиеЦены КАК ДинамическиеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ТекДата, ) КАК ДиапазоныЦенДляНаценкиСрезПоследних
	|		ПО ДинамическиеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|			И ДинамическиеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	|			И ДинамическиеЦены.ВерхняяГраница = ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютыЦены
	|		ПО ДинамическиеЦены.ВалютаТипаЦен = КурсыВалютыЦены.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютыБазовойЦены
	|		ПО ДинамическиеЦены.ВалютаБазовойЦены = КурсыВалютыБазовойЦены.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремДинамическиеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦеныИдентификатор
	|ПОМЕСТИТЬ ВремЦеныНоменклатурыСрезПоследних
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетныеЦены.Номенклатура КАК Номенклатура,
	|		РасчетныеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		РасчетныеЦены.ТипЦен КАК ТипЦен,
	|		ВЫБОР
	|			КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|				ТОГДА РасчетныеЦены.ВалютаТипаЦен
	|			ИНАЧЕ РасчетныеЦены.ВалютаЦеныПоДиапазону
	|		КОНЕЦ КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|				ТОГДА РасчетныеЦены.БазоваяЦена * РасчетныеЦены.КоэффициентПересчетаБазовойЦены * (1 + РасчетныеЦены.ПроцентСкидкиНаценки / 100)
	|			ИНАЧЕ РасчетныеЦены.ЦенаПоДиапазону
	|		КОНЕЦ КАК Цена,
	|		РасчетныеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмерения,
	|		РасчетныеЦены.ТипЦеныИдентификатор КАК ТипЦеныИдентификатор
	|	ИЗ
	|		ВремРасчетныеЦены КАК РасчетныеЦены
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|		ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	|		ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|		ЦеныНоменклатурыСрезПоследних.Валюта,
	|		ЦеныНоменклатурыСрезПоследних.Цена,
	|		ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА ЦеныНоменклатурыСрезПоследних.ТипЦен.Б_Идентификатор = """"
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.ТипЦен.Ссылка
	|			ИНАЧЕ ЦеныНоменклатурыСрезПоследних.ТипЦен.Б_Идентификатор
	|		КОНЕЦ
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекДата,
	|				НЕ ТипЦен.Рассчитывается
	|					И (Номенклатура, ХарактеристикаНоменклатуры) В
	|						(ВЫБРАТЬ
	|							ВремНоменклатураСХарактеристиками.Номенклатура,
	|							ВремНоменклатураСХарактеристиками.Характеристика
	|						ИЗ
	|							ВремНоменклатураСХарактеристиками)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ВремТипыЦен.ТипЦены
	|						ИЗ
	|							ВремТипыЦен) {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремРасчетныеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦены,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦеныИдентификатор,
	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаЦеныСсылка,
	|	ЦеныНоменклатурыСрезПоследних.Валюта.Наименование КАК ВалютаКод,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаБезХарактеристики,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ПорядокОкругления КАК ПорядокОкругления,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.БазоваяЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК БазоваяЕдиницаИзмеренияИдентификатор,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЦены,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Б_Идентификатор = """"
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Б_Идентификатор
	|	КОНЕЦ КАК НоменклатураИдентификатор,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры.Ссылка
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ХарактеристикаИдентификатор,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ ВремЦены
	|ИЗ
	|	ВремЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныНоменклатурыСрезПоследних";				 
	
	
	ТекстЗапросаСкидки = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Скидки.Условие КАК Условие,
	|	Скидки.ЗначениеУсловия КАК ЗначениеУсловия,
	|	Скидки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	Скидки.ОграничениеСкидкиНаценки КАК ОграничениеСкидкиНаценки,
	|	Скидки.ДатаОкончания КАК ДатаОкончания,
	|	Скидки.ПолучательСкидки КАК ПолучательСкидки,
	|	Скидки.Валюта КАК Валюта,
	|	Скидки.Номенклатура КАК Номенклатура,
	|	Скидки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Скидки.НоменклатураЦеноваяГруппа КАК НоменклатураЦеноваяГруппа,
	|	Скидки.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВремСкидкиНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		СкидкиНаценкиНоменклатурыСрезПоследних.Условие КАК Условие,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ЗначениеУсловия КАК ЗначениеУсловия,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ОграничениеСкидкиНаценки КАК ОграничениеСкидкиНаценки,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ПолучательСкидки КАК ПолучательСкидки,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.Валюта КАК Валюта,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа, ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)) КАК НоменклатураЦеноваяГруппа,
	|		СкидкиНаценкиНоменклатурыСрезПоследних.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
	|				,
	|				(ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &ТекДата)
	|					И Условие В (&МассивУсловийСкидок)
	|					И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК СкидкиНаценкиНоменклатурыСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Условие,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ЗначениеУсловия,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ПроцентСкидкиНаценки,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ОграничениеСкидкиНаценки,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ДатаОкончания,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ПолучательСкидки,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Валюта,
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ЦеноваяГруппа,
	|		СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Регистратор
	|	ИЗ
	|		РегистрСведений.СкидкиНаценкиПоЦеновымГруппам.СрезПоследних(
	|				,
	|				(ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &ТекДата)
	|					И Условие В (&МассивУсловийСкидок)
	|					И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК СкидкиНаценкиПоЦеновымГруппамСрезПоследних) КАК Скидки
	|ГДЕ
	|	(Скидки.ПроцентСкидкиНаценки = 0
	|				И (Скидки.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоДисконтнойКарте)
	|					ИЛИ Скидки.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт))
	|			ИЛИ Скидки.ПроцентСкидкиНаценки <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	НоменклатураЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Скидки.Условие КАК Условие,
	|	Скидки.ЗначениеУсловия,
	|	МАКСИМУМ(Скидки.ПроцентСкидкиНаценки) КАК ПроцентСкидкиНаценки,
	|	Скидки.ОграничениеСкидкиНаценки,
	|	Скидки.ДатаОкончания,
	|	Скидки.ПолучательСкидки КАК ПолучательСкидки,
	|	Скидки.Валюта,
	|	Скидки.Регистратор КАК Регистратор,
	|	Скидки.Валюта.Наименование КАК ВалютаКод
	|ПОМЕСТИТЬ ВремСкидки
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремСкидкиНоменклатуры КАК Скидки
	|		ПО (Товары.Номенклатура = Скидки.Номенклатура
	|					И Товары.Характеристика = Скидки.ХарактеристикаНоменклатуры
	|				ИЛИ Товары.Номенклатура.ЦеноваяГруппа = Скидки.НоменклатураЦеноваяГруппа
	|					И Скидки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					И Скидки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ИЛИ Скидки.НоменклатураЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|					И Скидки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					И Скидки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Скидки.Условие,
	|	Скидки.ЗначениеУсловия,
	|	Скидки.ОграничениеСкидкиНаценки,
	|	Скидки.ДатаОкончания,
	|	Скидки.ПолучательСкидки,
	|	Скидки.Валюта,
	|	Скидки.Регистратор,
	|	Скидки.Валюта.Наименование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Условие,
	|	Регистратор,
	|	ПолучательСкидки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремСкидки.Регистратор КАК Регистратор,
	|	ВремяДействияСкидокСрезПоследних.ДеньНедели,
	|	ВремяДействияСкидокСрезПоследних.ВремяНачала,
	|	ВремяДействияСкидокСрезПоследних.ВремяОкончания
	|ПОМЕСТИТЬ ВремСкидкиВремяДействия
	|ИЗ
	|	ВремСкидки КАК ВремСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяДействияСкидок.СрезПоследних КАК ВремяДействияСкидокСрезПоследних
	|		ПО ВремСкидки.Регистратор = ВремяДействияСкидокСрезПоследних.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор";
	
	ЗапросОстаткиПоСкладам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыНаСкладахОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВРозницеОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВРознице.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВНТТОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТ.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток,
	|	Остатки.Склад
	|ПОМЕСТИТЬ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВремНоменклатура.Номенклатура
	|					ИЗ
	|						ВремНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	НоменклатураСХарактеристиками.НоменклатураИдентификатор,
	|	НоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	НоменклатураСХарактеристиками.ХарактеристикаИдентификатор,
	|	ТоварыОстатки.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ТоварыОстатки.Склад.Б_Идентификатор = """"
	|			ТОГДА ТоварыОстатки.Склад
	|		ИНАЧЕ ТоварыОстатки.Склад.Б_Идентификатор
	|	КОНЕЦ КАК СкладИдентификатор,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ВремОстатки
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыНаСкладахОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураСХарактеристиками.Номенклатура,
	|	НоменклатураСХарактеристиками.НоменклатураИдентификатор,
	|	НоменклатураСХарактеристиками.Характеристика,
	|	НоменклатураСХарактеристиками.ХарактеристикаИдентификатор,
	|	ТоварыОстатки.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыОстатки.Склад.Б_Идентификатор = """"
	|			ТОГДА ТоварыОстатки.Склад
	|		ИНАЧЕ ТоварыОстатки.Склад.Б_Идентификатор
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыВРозницеОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураСХарактеристиками.Номенклатура,
	|	НоменклатураСХарактеристиками.НоменклатураИдентификатор,
	|	НоменклатураСХарактеристиками.Характеристика,
	|	НоменклатураСХарактеристиками.ХарактеристикаИдентификатор,
	|	ТоварыОстатки.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыОстатки.Склад.Б_Идентификатор = """"
	|			ТОГДА ТоварыОстатки.Склад
	|		ИНАЧЕ ТоварыОстатки.Склад.Б_Идентификатор
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТоварыВНТТОстаткиПоСкладам КАК ТоварыОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам КАК ТоварыКПередачеСоСкладовОстатки
	|		ПО НоменклатураСХарактеристиками.Номенклатура = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	|			И НоменклатураСХарактеристиками.Характеристика = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	|			И (ТоварыОстатки.Склад = ТоварыКПередачеСоСкладовОстатки.Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыНаСкладахОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВРозницеОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВНТТОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВРезервеНаСкладахОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыКПередачеСоСкладовОстаткиПоСкладам";
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//                          ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ ГРУПП НОМЕНКЛАТУРЫ                        ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТекстЗапросаГруппыНоменклатуры =
	"ВЫБРАТЬ
	|	ВремНоменклатура.Номенклатура КАК Номенклатура,
	|	ВремНоменклатура.Наименование КАК Наименование
	|ИЗ
	|	ВремНоменклатура КАК ВремНоменклатура
	|{УПОРЯДОЧИТЬ ПО
	|	Номенклатура.* КАК Номенклатура}
	|ИТОГИ ПО
	|	Номенклатура ТОЛЬКО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстЗапросаЦеновыеГруппы =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВремНоменклатура.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВремНоменклатура КАК ВремНоменклатура
	|{УПОРЯДОЧИТЬ ПО
	|	Номенклатура.* КАК Номенклатура}
	|ИТОГИ ПО
	|	ЦеноваяГруппа ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//                              СЛУЖЕБНЫЕ ЗАПРОСЫ                                                  ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	МассивЧастейЗапроса = Новый Массив;
	
	Если ПараметрыОбмена.ВыгружатьСвойства ИЛИ ПараметрыОбмена.ВыгружатьЗначенияСвойствВТовары ИЛИ ПараметрыОбмена.ВыгружатьХарактеристикиПредложений ИЛИ ПараметрыОбмена.ВыгружатьЗначенияСвойствВПредложения Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоСвойствам);
	КонецЕсли;
	
	
	Если ПараметрыОбмена.ВыгружатьКартинкиИФайлы Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоКартинкам);
	КонецЕсли;
	
	Если ПараметрыОбмена.ВыгружатьКартинкиИФайлыПредложений Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоКартинкамИФайламПредложений);
	КонецЕсли;
	
	Если ПараметрыОбмена.ВыгружатьЦены Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоЦенам);
	КонецЕсли;
	
	//Если ВыгружатьСкидки Тогда
	//	МассивЧастейЗапроса.Добавить(ТекстЗапросаСкидки);
	//КонецЕсли;
	
	Если ПараметрыОбмена.ВыгружатьОстатки Тогда
		МассивЧастейЗапроса.Добавить(ЗапросОстаткиПоСкладам);
	КонецЕсли;
	
	Если ПараметрыОбмена.ВыгружатьШтрихкоды Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоШтрихКодам);
	КонецЕсли;
	
		Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения Тогда
		МассивЧастейЗапроса.Добавить(ЗапросПоПланируемойДатеПоступления);
	КонецЕсли;
	             	
	Для Каждого ЧастьЗапроса Из МассивЧастейЗапроса Цикл
		ТекстЗапроса = ТекстЗапроса + ";" + ЧастьЗапроса;
	КонецЦикла;
	
	Если КлассифицироватьПоЦеновымГруппам Тогда
		ТекстЗапроса = ТекстЗапроса + ";" + ТекстЗапросаЦеновыеГруппы;
	Иначе
		ТекстЗапроса = ТекстЗапроса + ";" + ТекстЗапросаГруппыНоменклатуры;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	лМенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц; 
	запрос.Выполнить();	
	
	Возврат лМенеджерВременныхТаблиц;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьТоварыXDTO(ПараметрыОбмена, ИмяКаталога, Владелец, ВладелецТип, лМенеджерВременныхТаблиц, СтрокаТаблицыКаталогов, МассивКартинок, МассивФайлов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	ТекстЗапроса = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	ВремНоменклатура КАК ВремНоменклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВремНоменклатура.ПриоритетСортировки";
	
	Запрос.Текст = ТекстЗапроса; 
	
	ТзнТоваров = Запрос.Выполнить().Выгрузить();
	
	
	Если ТзнТоваров.Количество() > 0 тогда	
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка товаров в XML.", ПараметрыОбмена);
		
		Итератор = 0;
		ВыгруженоКартинок 	= 0;
		ВыгруженоФайлов		= 0;
		СозданоКартинок		= 0;
		СозданоФайлов		= 0;
		
		ДеревоГрупп = СтрокаТаблицыКаталогов.ДеревоГрупп;  
		ВыгружатьПоДеревуТоваров = ЗначениеЗаполнено(ДеревоГрупп);
		
		Если ВыгружатьПоДеревуТоваров тогда
			
			ТаблицаДереваГрупп = ПолучитьНоменклатуруГруппДерева(ДеревоГрупп, лМенеджерВременныхТаблиц);
			
		КонецЕсли;
		
		XDTOТоварыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Товары", Истина, ВладелецТип);
		XDTOТовары 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварыТип); 
		
		XDTOТоварТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Товар");
		
		XDTOЕдиницаИзмеренияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЕдиницаИзмерения");
		
		XDTOСтавкиНалоговТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "СтавкиНалогов", Истина, XDTOТоварТип);	
		XDTOСтавкаНалогаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "СтавкаНалога", Истина, XDTOСтавкиНалоговТип);	
		
		XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияРеквизитов", Истина, XDTOТоварТип);
		XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначениеРеквизита");
		
		Для каждого ТекТовар из ТзнТоваров Цикл
			
			XDTOТовар 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварТип); 
			
			XDTOТовар.Ид 				= XMLСтрока(ТекТовар.Идентификатор);
			XDTOТовар.НомерВерсии 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, ТекТовар.ВерсияДанных, "Товаров");

			XDTOТовар.ПометкаУдаления 	= XMLСтрока(ТекТовар.ПометкаУдаления);
			
			XDTOТовар.БазоваяЕдиница	= XMLСтрока(ТекТовар.ИдентификаторБазовойЕдиницы);
			
			ВыгрузитьГруппыНоменклатурыXDTO(ПараметрыОбмена, XDTOТовар, XDTOТоварТип, ТекТовар, ВыгружатьПоДеревуТоваров, ТаблицаДереваГрупп);
			
			лОписаниеТовара = ТекТовар.Объект.ДополнительноеОписаниеНоменклатуры;
			лДополнительноеОписаниеНоменклатуры = ?(СтрДлина(лОписаниеТовара) > 10000, Лев(лОписаниеТовара, 10000), лОписаниеТовара);
			
			Для каждого ТекСтр из ПараметрыОбмена.СоответствиеОсновныхРеквизитовНоменклатуры Цикл
				
				лЗначение = ПолучитьЗначениеПоля1СДляТовара(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекСтр, ТекТовар, лДополнительноеОписаниеНоменклатуры);
				
				Если лЗначение <> Неопределено тогда 
					
					XDTOТовар[ТекСтр.НаименованиеПоля]	= ?(лЗначение = NULL, ?(ТекСтр.НаименованиеПоля = "Вес" , 0, ""), лЗначение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПараметрыОбмена.ВыгружатьЗначенияСвойствВТовары тогда
				ВыгрузитьСвойстваНоменклатурыXDTO(ПараметрыОбмена, XDTOТовар, XDTOТоварТип, ТекТовар, лМенеджерВременныхТаблиц);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекТовар.СтавкаНДС) Тогда
				
				XDTOСтавкиНалогов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкиНалоговТип); 
				XDTOСтавкаНалога 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкаНалогаТип); 
				
				XDTOСтавкаНалога.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOСтавкаНалога.Ставка 		= ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекТовар.СтавкаНДС);
				
				XDTOСтавкиНалогов.СтавкаНалога.Добавить(XDTOСтавкаНалога);
				XDTOТовар.СтавкиНалогов = XDTOСтавкиНалогов;
				
			КонецЕсли;
			
			XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
			
			Если ТекТовар.ДополнительноеОписаниеНоменклатурыВФорматеHTML тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ОписаниеВФорматеHTML", лДополнительноеОписаниеНоменклатуры);
			КонецЕсли;
			
			Если ПараметрыОбмена.ВыгружатьКартинкиИФайлы тогда
				
				ОписаниеФайлов 		= Новый Соответствие;
				Файлы 				= Новый Массив;
				
				ВыгрузитьИзображенияНоменклатуры(ПараметрыОбмена, ИмяКаталога, XDTOТовар, лМенеджерВременныхТаблиц, ТекТовар, ОписаниеФайлов, ВыгруженоКартинок, МассивКартинок, СозданоКартинок);
				ВыгрузитьФайлыНоменклатуры(ПараметрыОбмена, ИмяКаталога, XDTOТовар, лМенеджерВременныхТаблиц, ТекТовар, Файлы, ОписаниеФайлов, ВыгруженоФайлов, МассивФайлов, СозданоФайлов);

				Для Каждого Файл Из Файлы Цикл
					
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Файл", Файл);				
					
				КонецЦикла;
				
				Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
					
					Файл = ОписаниеФайла.Ключ;
					Описание = ОписаниеФайла.Значение;
					
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ОписаниеФайла", Файл + "#" + Описание);
					
				КонецЦикла;
				
			КонецЕсли;
			
			лТипНоменклатуры = "Товар";
			
			Если ТекТовар.ПриоритетСортировки = 2 тогда
				лТипНоменклатуры = "Комплект";
			ИначеЕсли ТекТовар.ПриоритетСортировки = 3 тогда
				лТипНоменклатуры = "Набор";
			ИначеЕсли ТекТовар.ПриоритетСортировки = 4 тогда
				лТипНоменклатуры = "Услуга";          			
			КонецЕсли;
			
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ВидНоменклатуры", ТекТовар.ВидНоменклатуры.Наименование);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ТипНоменклатуры", лТипНоменклатуры);
			
			Для каждого ТекСтр из ПараметрыОбмена.СоответствиеДополнительныхРеквизитовНоменклатуры Цикл
				
				лЗначение = ПолучитьЗначениеПоля1СДляТовара(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекСтр, ТекТовар, лДополнительноеОписаниеНоменклатуры);
				
				Если лЗначение <> Неопределено тогда 

					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, ТекСтр.НаименованиеПоля, ?(лЗначение = NULL, "", лЗначение));
					
				КонецЕсли;
			
			КонецЦикла;
			
			XDTOТовар.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
			
			Итератор = Итератор + 1;
			XDTOТовары.Товар.Добавить(XDTOТовар);   
		КонецЦикла;
		
		Владелец.Товары = XDTOТовары;
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгружено " + Строка(ВыгруженоКартинок) + " картинок.", ПараметрыОбмена);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Создано " + Строка(СозданоКартинок) + " картинок для товаров.", ПараметрыОбмена);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгружено " + Строка(ВыгруженоФайлов) + " файлов.", ПараметрыОбмена);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Создано " + Строка(СозданоФайлов) + " файлов для товаров.", ПараметрыОбмена);
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка товаров в XML завершено. Выгружено " + Строка(Итератор) + " элементов.", ПараметрыОбмена);

	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьЗначениеПоля1СДляТовара(ПараметрыОбмена, лМенеджерВременныхТаблиц, ТекСтр, ТекТовар, лДополнительноеОписаниеНоменклатуры)
	
	лЗначение = "";	
	Если ТекСтр.НаименованиеПоля1С = "Код" тогда
		лЗначение = СокрЛП(ТекТовар.Код);	
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Наименование" тогда
		лЗначение = ТекТовар.Наименование;	
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Полное наименование" тогда
		лЗначение = ТекТовар.НаименованиеПолное;	
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Штрихкод" тогда
		
		Если ПараметрыОбмена.ВыгружатьШтрихкоды тогда
			
			лЗначение = ПолучитьШтрихКод(ТекТовар.Номенклатура, лМенеджерВременныхТаблиц);
			
		КонецЕсли;
		
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Артикул" тогда
		лЗначение = ТекТовар.Артикул;	
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Описание" тогда
		
		Если НЕ ТекТовар.ДополнительноеОписаниеНоменклатурыВФорматеHTML тогда
			лЗначение = лДополнительноеОписаниеНоменклатуры;
		КонецЕсли;
		
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Страна происхождения" тогда
		лЗначение = ТекТовар.СтранаПроисхождения;	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Основной поставщик" тогда
		лЗначение = ТекТовар.ОсновнойПоставщик;	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Вес" тогда
		лЗначение = ТекТовар.Вес;	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Комментарий" тогда
		лЗначение = ТекТовар.Комментарий;	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Ценовая группа" тогда
		лЗначение = Строка(ТекТовар.ЦеноваяГруппа);	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Родитель" тогда
		лЗначение = Строка(ТекТовар.Родитель);	                    
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Номер ГТД" тогда
		//БВ
		//лЗначение = ТекТовар.НомерГТД;
		лЗначение = "";
		//
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Вид номенклатуры" тогда
		лЗначение = Строка(ТекТовар.ВидНоменклатуры);
	ИначеЕсли ТекСтр.НаименованиеПоля1С = "Планируемая дата поступления" тогда
		
		Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения тогда
			лЗначение = ПолучитьДатуПланирования(лМенеджерВременныхТаблиц, ТекТовар.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Иначе
			лЗначение = "";	
		КонецЕсли;
	
	Иначе
		
		Если ТекСтр.НаименованиеПоля1С = "" тогда
			
			лЗначение = Неопределено;
			
		Иначе
			
			лИтоговоеНазваниеПоля = стрЗаменить(ТекСтр.НаименованиеПоля1С, "[Номенклатура]", "ТекТовар.Номенклатура");
			лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Результат]", "лЗначение");
			лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[МенеджерВременныхТаблиц]", "МенеджерВременныхТаблиц");
			
			Если ЗначениеЗаполнено(лИтоговоеНазваниеПоля) тогда
				Выполнить(лИтоговоеНазваниеПоля);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат лЗначение;	
	
КонецФункции

Функция ПолучитьШтрихКод(НоменклатураСсылка, лМенеджерВременныхТаблиц, ХарактеристикаСсылка = НеОпределено)
	
	мЗапросПоШК = Новый Запрос(	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Штрихкод
	|ИЗ
	|	ВремШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Номенклатура = &Номенклатура
	|	И ШтрихКоды.Характеристика = &Характеристика");
	
	мЗапросПоШК.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;

	ШтрихКод = "";
	
	мЗапросПоШК.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	
	Если ЗначениеЗаполнено(ХарактеристикаСсылка) Тогда
		мЗапросПоШК.УстановитьПараметр("Характеристика", ХарактеристикаСсылка);
	Иначе
		мЗапросПоШК.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	
	РезультатЗапроса = мЗапросПоШК.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ШтрихКод = РезультатЗапроса.Выгрузить()[0][0];
	КонецЕсли;
	
	Возврат ШтрихКод;
	
КонецФункции

Функция ПолучитьДатуПланирования(лМенеджерВременныхТаблиц, НоменклатураСсылка, ХарактеристикаСсылка = НеОпределено)
	
	мЗапросПоДП = Новый Запрос(	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВремПланируемыеДатыПоступления.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	ВремПланируемыеДатыПоступления КАК ВремПланируемыеДатыПоступления
	|ГДЕ
	|	ВремПланируемыеДатыПоступления.Номенклатура = &Номенклатура
	|	И ВремПланируемыеДатыПоступления.Характеристика = &Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоступления");
	
	мЗапросПоДП.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;

	ДатыПоступления = "";
	
	мЗапросПоДП.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	
	Если ЗначениеЗаполнено(ХарактеристикаСсылка) Тогда
		мЗапросПоДП.УстановитьПараметр("Характеристика", ХарактеристикаСсылка);
	Иначе
		мЗапросПоДП.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	
	РезультатЗапроса = мЗапросПоДП.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		ДатыПоступления = ДатыПоступления + Строка(РезультатЗапроса.ДатаПоступления); 	
	КонецЦикла;
	
	Возврат ДатыПоступления;
	
КонецФункции

Функция ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(СтавкаНДС)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ЗначениеНалога = "Без налога";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		ЗначениеНалога = "0";
	//БВ	
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
	//	ЗначениеНалога = "10";
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
	//	ЗначениеНалога = "10/110";
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
	//	ЗначениеНалога = "18";
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
	//	ЗначениеНалога = "18/118";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		ЗначениеНалога = "20";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		ЗначениеНалога = "7";	
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
	//	ЗначениеНалога = "20/120";
	Иначе
		ЗначениеНалога = "";
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции

Функция ПолучитьНДСПоставке(СтавкаНДС) Экспорт
	
	лНДС = Перечисления.СтавкиНДС.БезНДС;
	//БВ
	//Если СтавкаНДС = "18" тогда
	//	лНДС = Перечисления.СтавкиНДС.НДС18;	
	//ИначеЕсли СтавкаНДС = "10" тогда
	//	лНДС = Перечисления.СтавкиНДС.НДС10;	
	//КонецЕсли;
	Если СтавкаНДС = "20" тогда 
	    лНДС = Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДС = "7" тогда
	    лНДС = Перечисления.СтавкиНДС.НДС7;
	ИначеЕсли СтавкаНДС = "0" тогда
	    лНДС = Перечисления.СтавкиНДС.НДС0;
	КонецЕсли;	
	//
	Возврат лНДС;
	
КонецФункции

Функция ПолучитьНоменклатуруГруппДерева(ДеревоГрупп, лМенеджерВременныхТаблиц)
	
	ТаблицаТоваровДереваГрупп = Новый ТаблицаЗначений;
	ТаблицаТоваровДереваГрупп.Колонки.Добавить("ИдГруппы");
	ТаблицаТоваровДереваГрупп.Колонки.Добавить("Номенклатура");
	ТаблицаТоваровДереваГрупп.Индексы.Добавить("Номенклатура");
	
	ЗапросГрупп = Новый Запрос;
	ЗапросГрупп.Текст = "ВЫБРАТЬ
	|	Б_ПользовательскиеГруппыТоваровТовары.Номенклатура КАК Номенклатура,
	|	Б_ПользовательскиеГруппыТоваровТовары.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	Б_ПользовательскиеГруппыТоваровТовары.Ссылка.ИдентификаторРаздела КАК ИдентификаторРаздела
	|ИЗ
	|	Справочник.Б_ПользовательскиеГруппыТоваров.Товары КАК Б_ПользовательскиеГруппыТоваровТовары
	|ГДЕ
	|	Б_ПользовательскиеГруппыТоваровТовары.Ссылка В ИЕРАРХИИ(&Инфоблок)";
	ЗапросГрупп.УстановитьПараметр("Инфоблок", ДеревоГрупп); 
	ВыборкаГрупп = ЗапросГрупп.Выполнить().Выбрать();
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	
	Пока ВыборкаГрупп.Следующий() Цикл
		
		Если ВыборкаГрупп.ЭтоГруппа = Истина тогда
			ЗапросТоваров.Текст = 
			"ВЫБРАТЬ
			|	ВремНоменклатура.Номенклатура
			|ИЗ
			|	ВремНоменклатура КАК ВремНоменклатура
			|ГДЕ
			|	ВремНоменклатура.Номенклатура В ИЕРАРХИИ(&Группа)";
			ЗапросТоваров.УстановитьПараметр("Группа", ВыборкаГрупп.Номенклатура);
		Иначе
			ЗапросТоваров.Текст = 
			"ВЫБРАТЬ
			|	ВремНоменклатура.Номенклатура
			|ИЗ
			|	ВремНоменклатура КАК ВремНоменклатура
			|ГДЕ
			|	ВремНоменклатура.Номенклатура = &Номенклатура";
			ЗапросТоваров.УстановитьПараметр("Номенклатура", ВыборкаГрупп.Номенклатура);
		КонецЕсли;
		
		Результат = ЗапросТоваров.Выполнить();
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаТоваров = Результат.Выбрать();
		
		Пока ВыборкаТоваров.Следующий() Цикл
				
			НовСтрока = ТаблицаТоваровДереваГрупп.Добавить();
			НовСтрока.ИдГруппы 		= ВыборкаГрупп.ИдентификаторРаздела; 
			НовСтрока.Номенклатура 	= ВыборкаТоваров.Номенклатура; 
				
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаТоваровДереваГрупп.Свернуть("ИдГруппы, Номенклатура");
	
	Возврат ТаблицаТоваровДереваГрупп;	
	
КонецФункции

Процедура ВыгрузитьГруппыНоменклатурыXDTO(ПараметрыОбмена, Владелец, ВладелецТип, ВыборкаНоменклатуры, ВыгружатьПоДеревуТоваров, ДеревоГрупп)
	
	XDTOГруппыТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Группы", Истина, ВладелецТип);
	
	Если ВыгружатьПоДеревуТоваров Тогда
		
		XDTOГруппы = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип);
		Владелец.Группы = XDTOГруппы;
		
			
		МассивГрупп = Новый Массив;
		
		Найдено = ДеревоГрупп.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНоменклатуры.Номенклатура));
		
		Для Каждого СтрокаНайдено Из Найдено Цикл
			
			МассивГрупп.Добавить(СтрокаНайдено.ИдГруппы);
			
		КонецЦикла;
		
		Если МассивГрупп.Количество() > 0 Тогда
			
			XDTOГруппы = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип);
			
			Для Каждого ИдГруппы Из МассивГрупп Цикл
				
				XDTOГруппы.Ид.Добавить(XMLСтрока(ИдГруппы));
			
			КонецЦикла;
			
		КонецЕсли;
			
		Владелец.Группы = XDTOГруппы;

	Иначе
	
		Если ПараметрыОбмена.КлассифицироватьПоЦеновымГруппам Тогда
			
			Если ЗначениеЗаполнено(ВыборкаНоменклатуры.ЦеноваяГруппа) Тогда
				
				XDTOГруппы = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип);
								
				XDTOГруппы.Ид.Добавить(XMLСтрока(ВыборкаНоменклатуры.ЦеноваяГруппа));
	
				Владелец.Группы = XDTOГруппы;
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ВыборкаНоменклатуры.ИдентификаторРодителя) Тогда
				
				XDTOГруппы = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппыТип);
								
				XDTOГруппы.Ид.Добавить(ПолучитьИдентификаторГруппы(XMLСтрока(ВыборкаНоменклатуры.ИдентификаторРодителя)));
				
				Владелец.Группы = XDTOГруппы;

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьСвойстваНоменклатурыXDTO(ПараметрыОбмена, Владелец, ВладелецТип, ВыборкаНоменклатуры, лМенеджерВременныхТаблиц);
	
	XDTOЗначенияСвойствТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияСвойств", Истина, ВладелецТип);
	XDTOЗначенияСвойстваТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияСвойства");
	
	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	запрос.Текст =  "ВЫБРАТЬ *
	|ИЗ
	|	ВремЗначенияСвойствТовара КАК ВремЗначенияСвойствТовара
	|ГДЕ
	|	(ВремЗначенияСвойствТовара.Номенклатура = &Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", ВыборкаНоменклатуры.Номенклатура);
	Выборка = Запрос.Выполнить();
	
	Если НЕ Выборка.Пустой() тогда	
		ВыборкаСвойств = Выборка.Выбрать();
		XDTOЗначенияСвойств = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойствТип);
		                                                 
		Пока ВыборкаСвойств.Следующий() Цикл
			
			XDTOЗначенияСвойства = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойстваТип);
			
			XDTOЗначенияСвойства.Ид = XMLСтрока(ВыборкаСвойств.ИдентификаторСвойства);
			
			XDTOЗначенияСвойства.Значение.Добавить(XMLСтрока(ВыборкаСвойств.ИдентификаторЗначения));
			
			XDTOЗначенияСвойств.ЗначенияСвойства.Добавить(XDTOЗначенияСвойства);	
			
		КонецЦикла;
		Владелец.ЗначенияСвойств = XDTOЗначенияСвойств;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьИзображенияНоменклатуры(ПараметрыОбмена, ИмяКаталога, Владелец, лМенеджерВременныхТаблиц, ВыборкаНоменклатуры, ОписаниеФайлов, ВыгруженоКартинок, МассивКартинок, СозданоКартинок)

	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремКартинки КАК ВремКартинки
	| ГДЕ ВремКартинки.Номенклатура = &Номенклатура
	| 
	| УПОРЯДОЧИТЬ ПО
	|   ВремКартинки.Наименование";
    Запрос.УстановитьПараметр("Номенклатура", ВыборкаНоменклатуры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаКартинок  = РезультатЗапроса.Выбрать();
		 
		тзнКартинок   = Новый ТаблицаЗначений;
		тзнКартинок.Колонки.Добавить("Картинка");
		тзнКартинок.Колонки.Добавить("НадоВыгружать");
		тзнКартинок.Колонки.Добавить("Основная");
		
		ОсновнаяКартинка = ВыборкаНоменклатуры.ОсновноеИзображение;
		
		Пока ВыборкаКартинок.Следующий() Цикл
			
			ТекКартинка = ВыборкаКартинок.ХранилищеСсылка;
			
			МассивКартинок.Добавить(ТекКартинка);
			
			НовСтр = тзнКартинок.Добавить();
			НовСтр.Картинка 		= ТекКартинка;
			НовСтр.НадоВыгружать 	= ВыборкаКартинок.НадоВыгружать;
			
			Если ТекКартинка = ОсновнаяКартинка тогда
				НовСтр.Основная 	= Истина;
			иначе
				НовСтр.Основная 	= Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		тзнКартинок.Сортировать("Основная Убыв");
		
		Для Каждого КартинкаДляВыгрузки Из тзнКартинок Цикл
			
			АдресКартинки = ВыгрузитьКартинку(ПараметрыОбмена, ИмяКаталога, ВыборкаНоменклатуры.Номенклатура, КартинкаДляВыгрузки.Картинка, КартинкаДляВыгрузки.НадоВыгружать, СозданоКартинок);
			
			Если ЗначениеЗаполнено(АдресКартинки) Тогда
				
				ОписаниеКартинки = СокрЛП(КартинкаДляВыгрузки.Картинка.Наименование);
				
				Владелец.Картинка.Добавить(АдресКартинки);
				
				Если НЕ ПустаяСтрока(ОписаниеКартинки) Тогда
					
					ОписаниеФайлов.Вставить(АдресКартинки, ОписаниеКартинки);
					
				КонецЕсли;
				
				ВыгруженоКартинок = ВыгруженоКартинок + 1;
				
			КонецЕсли;
			
		КонецЦикла; 		
	КонецЕсли; 
КонецПроцедуры

Процедура ВыгрузитьФайлыНоменклатуры(ПараметрыОбмена, ИмяКаталога, Владелец, лМенеджерВременныхТаблиц, ВыборкаНоменклатуры, Файлы, ОписаниеФайлов, ВыгруженоФайлов, МассивФайлов, СозданоФайлов)
		
	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремФайлы КАК ВремФайлы
	| ГДЕ ВремФайлы.Номенклатура = &Номенклатура
	| 
	| УПОРЯДОЧИТЬ ПО
	|   ВремФайлы.Наименование";
    Запрос.УстановитьПараметр("Номенклатура", ВыборкаНоменклатуры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаФайлов = РезультатЗапроса.Выбрать();
		
		тзнФайлов   = Новый ТаблицаЗначений;
		тзнФайлов.Колонки.Добавить("Файл");
		тзнФайлов.Колонки.Добавить("НадоВыгружать");
		
		
		Пока ВыборкаФайлов.Следующий() Цикл
			
			ТекФайл = ВыборкаФайлов.ХранилищеСсылка;
			
			МассивФайлов.Добавить(ТекФайл);
			
			НовСтр = тзнФайлов.Добавить();
			НовСтр.Файл 			= ТекФайл;
			НовСтр.НадоВыгружать 	= ВыборкаФайлов.НадоВыгружать;
			
		КонецЦикла;
		
		Для Каждого ФайлДляВыгрузки Из тзнФайлов Цикл
			
			АдресФайла = ВыгрузитьФайл(ПараметрыОбмена, ИмяКаталога, ВыборкаНоменклатуры.Номенклатура, ФайлДляВыгрузки.Файл, ФайлДляВыгрузки.НадоВыгружать, СозданоФайлов);
			
			Если ЗначениеЗаполнено(АдресФайла) Тогда
				
				ОписаниеФайла = СокрЛП(ФайлДляВыгрузки.Файл.Наименование);
				
				Файлы.Добавить(АдресФайла);
				
				Если НЕ ПустаяСтрока(ОписаниеФайла) Тогда
					
					ОписаниеФайлов.Вставить(АдресФайла, ОписаниеФайла);
					
				КонецЕсли;
				
				ВыгруженоФайлов = ВыгруженоФайлов + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	          
КонецПроцедуры

Функция ВыгрузитьКартинку(ПараметрыОбмена, ИмяКаталога, Номенклатура, ХранилищеСсылка, НадоВыгружать, СозданоКартинок)
	
	Результат = НеОпределено;
	
	Если НЕ ЗначениеЗаполнено(ХранилищеСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Картинка = ХранилищеСсылка.Хранилище.Получить();
	
	Если ТипЗнч(Картинка) <> Тип("Картинка") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ФорматКартинкиРазрешен  = Истина;
	РасширениеФайлаКартинки = "";
	
	Попытка
		ФорматКартинкиОбъекта = Картинка.Формат();
	Исключение
		ФорматКартинкиОбъекта = ФорматКартинки.НеизвестныйФормат;
	КонецПопытки;
	
	Если ФорматКартинкиОбъекта = ФорматКартинки.НеизвестныйФормат Тогда
		ФорматКартинкиРазрешен = Ложь;
	Иначе
		Если НЕ (ФорматКартинкиОбъекта = ФорматКартинки.GIF
			 ИЛИ ФорматКартинкиОбъекта = ФорматКартинки.JPEG
			 ИЛИ ФорматКартинкиОбъекта = ФорматКартинки.PNG) Тогда
			Попытка
				ФорматКартинкиОбъекта = Картинка.Преобразовать(ФорматКартинки.JPEG);
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось преобразовать формат картинки. Номенклатура: " + Номенклатура + ". Преобразование из " + Строка(ФорматКартинкиОбъекта) + " в JPEG", ПараметрыОбмена);
				Возврат Результат;
			КонецПопытки;
		КонецЕсли;
		РасширениеФайлаКартинки = Строка(ФорматКартинкиОбъекта);
	КонецЕсли;
	
	Если НЕ ФорматКартинкиРазрешен Тогда
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Формат основного изображения неизвестен или запрещен. Номенклатура: " + Номенклатура, ПараметрыОбмена);
		Возврат Результат;
	КонецЕсли;
	
	ИмяПоНоменклатуре = Строка(Номенклатура.УникальныйИдентификатор());
	ИмяПоХранилищу    = Строка(ХранилищеСсылка.УникальныйИдентификатор());
	
	ИмяФайлаКартинки = ИмяПоНоменклатуре + "_" + ИмяПоХранилищу + "." + НРег(РасширениеФайлаКартинки);
	КаталогПоИмени   = Лев(ИмяПоНоменклатуре, 2);
	КаталогКартинки	 = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (ИмяКаталога + "\" + ПараметрыОбмена.ПодкаталогФайлов + "\" + КаталогПоИмени));
	
	Если НадоВыгружать тогда
		
		СоздатьКаталог(КаталогКартинки);
	
		ПолноеИмяФайлаКартинки = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (КаталогКартинки + "\" + ИмяФайлаКартинки));
		
		Попытка
			Картинка.Записать(ПолноеИмяФайлаКартинки);
		Исключение
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать файл картинки на диск. Номенклатура: " + Номенклатура, ПараметрыОбмена);
			Возврат Результат;
		КонецПопытки;	
	КонецЕсли;
	
	Результат = ПараметрыОбмена.ПодкаталогФайлов + "/" + КаталогПоИмени + "/" + ИмяФайлаКартинки;
	
	СозданоКартинок = СозданоКартинок + 1;
	
	Возврат Результат;
	
КонецФункции

Функция ВыгрузитьФайл(ПараметрыОбмена, ИмяКаталога, Номенклатура, ХранилищеСсылка, НадоВыгружать, СозданоФайлов)
	
	Результат = НеОпределено;
	
	Если НЕ ЗначениеЗаполнено(ХранилищеСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДвоичныеДанные = ХранилищеСсылка.Хранилище.Получить();
	
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		Возврат Результат;
	КонецЕсли;
	
	РасширениеФайла = ".file";
	
	Файл = Новый Файл(ХранилищеСсылка.ИмяФайла);
	РасширениеФайла = Файл.Расширение;
	
	ИмяПоНоменклатуре = Строка(Номенклатура.УникальныйИдентификатор());
	ИмяПоХранилищу    = Строка(ХранилищеСсылка.УникальныйИдентификатор());
	
	ИмяФайла		 = ИмяПоНоменклатуре + "_" + ИмяПоХранилищу + НРег(РасширениеФайла);
	КаталогПоИмени   = Лев(ИмяПоНоменклатуре, 2);
	КаталогФайла	 = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (ИмяКаталога + "\" + ПараметрыОбмена.ПодкаталогФайлов + "\" + КаталогПоИмени));
	
	Если НадоВыгружать тогда
		СоздатьКаталог(КаталогФайла);
		
		ПолноеИмяФайла = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (КаталогФайла + "\" + ИмяФайла));
		
		Попытка
			ДвоичныеДанные.Записать(ПолноеИмяФайла);
		Исключение
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать файл на диск. Номенклатура: " + Номенклатура, ПараметрыОбмена);
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	Результат = ПараметрыОбмена.ПодкаталогФайлов + "/" + КаталогПоИмени + "/" + ИмяФайла;
	
	СозданоФайлов = СозданоФайлов + 1;
	
	Возврат Результат;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьПредложенияXDTO(ПараметрыОбмена, ИмяКаталога, Владелец, ВладелецТип, лМенеджерВременныхТаблиц, МассивКартинок, МассивФайлов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|																	                		              		                              							
	|УПОРЯДОЧИТЬ ПО																		
	|	ВремНоменклатураСХарактеристиками.ПриоритетСортировки";
	
	ТзнПредложений = Запрос.Выполнить().Выгрузить();
	
	Если ТзнПредложений.Количество() > 0 тогда	
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка предложений в XML.", ПараметрыОбмена);
		
		Итератор			= 0;
		ВыгруженоКартинок 	= 0;
		ВыгруженоФайлов		= 0;
		СозданоКартинок 	= 0;
		СозданоФайлов		= 0;
		
		XDTOПредложенияТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Предложения", Истина, ВладелецТип);
		XDTOПредложения 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложенияТип); 
		
		XDTOПредложениеТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Предложение");
		
		XDTOХарактеристикиТовараТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ХарактеристикиТовара");
		XDTOХарактеристикаТовараТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ХарактеристикаТовара", Истина, XDTOХарактеристикиТовараТип);
		
		XDTOЗначенияСвойствТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияСвойств", Истина, XDTOПредложениеТип);
		XDTOЗначенияСвойстваТип = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияСвойства");
		
		XDTOЗначенияРеквизитовТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначенияРеквизитов", Истина, XDTOПредложениеТип);
		XDTOЗначениеРеквизитаТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "ЗначениеРеквизита");
		
		Для каждого ТекПредложение из ТзнПредложений Цикл
			
			XDTOПредложение 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложениеТип); 
			
			Если ЗначениеЗаполнено(ТекПредложение.Характеристика) тогда
				лИд 			= XMLСтрока(ТекПредложение.НоменклатураИдентификатор) + "#" + XMLСтрока(ТекПредложение.ХарактеристикаИдентификатор); 
				
				Если ПараметрыОбмена.ВыгружатьШтрихкоды тогда
					лШтрихкод 	= ПолучитьШтрихКод(ТекПредложение.Номенклатура, лМенеджерВременныхТаблиц, ТекПредложение.Характеристика);
				КонецЕсли;
				
				Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения тогда
					лПланируемаяДатаПоступления = ПолучитьДатуПланирования(лМенеджерВременныхТаблиц, ТекПредложение.Номенклатура, ТекПредложение.Характеристика);
				КонецЕсли;
				
				//лНаименование   = ТекПредложение.Наименование + " (" + ТекПредложение.ХарактеристикаНаименование + ")";
				лНаименование   = ТекПредложение.Наименование + " (" + ТекПредложение.ХарактеристикаНаименование + ")";
				лВерсияДанных   = ТекПредложение.ХарактеристикаВерсияДанных;
				лПометкаУдаления= XMLСтрока(ТекПредложение.НоменклатураПометкаУдаления ИЛИ ТекПредложение.ХарактеристикаПометкаУдаления);
			Иначе
				лИд 			= XMLСтрока(ТекПредложение.НоменклатураИдентификатор); 
				
				Если ПараметрыОбмена.ВыгружатьШтрихкоды тогда
					лШтрихкод 	= ПолучитьШтрихКод(ТекПредложение.Номенклатура, лМенеджерВременныхТаблиц);
				КонецЕсли;
				
				Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения тогда
					лПланируемаяДатаПоступления = ПолучитьДатуПланирования(лМенеджерВременныхТаблиц, ТекПредложение.Номенклатура);
				КонецЕсли;
				
				лНаименование   = ТекПредложение.Наименование;
				лВерсияДанных   = ТекПредложение.НоменклатураВерсияДанных;
				лПометкаУдаления= XMLСтрока(ТекПредложение.НоменклатураПометкаУдаления);
			КонецЕсли;
			
			
			XDTOПредложение.Ид 				= лИд;
			XDTOПредложение.НомерВерсии 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьВерсиюОбъекта(ПараметрыОбмена, лВерсияДанных, "Предложений");
			XDTOПредложение.ПометкаУдаления	= лПометкаУдаления;
			
			Если ПараметрыОбмена.ВыгружатьШтрихкоды тогда
				XDTOПредложение.Штрихкод 	= лШтрихкод;
			КонецЕсли;
				
			XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип);  
			
			Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения тогда
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Планируемая дата поступления", лПланируемаяДатаПоступления);
				
			КонецЕсли;
			
			XDTOПредложение.Наименование 	= лНаименование;
			
			Если ПараметрыОбмена.ВыгружатьКартинкиИФайлыПредложений тогда
				
				Файлы = Новый Массив;
				ОписаниеФайлов = Новый Соответствие;
				
				ВыгрузкаФайловХарактеристикНоменклатуры(ПараметрыОбмена, ИмяКаталога, XDTOПредложение, лМенеджерВременныхТаблиц, ТекПредложение, Файлы, ОписаниеФайлов, ВыгруженоКартинок, МассивКартинок, ВыгруженоФайлов, МассивФайлов, СозданоКартинок, СозданоФайлов);
				
				Для Каждого Файл Из Файлы Цикл
					
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "Файл", Файл);				
					
				КонецЦикла;
				
				Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
					
					Файл = ОписаниеФайла.Ключ;
					Описание = ОписаниеФайла.Значение;
					
					Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ОписаниеФайла", Файл + "#" + Описание);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если XDTOЗначенияРеквизитов.ЗначениеРеквизита.Количество() > 0 тогда
								
				XDTOПредложение.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
	
			КонецЕсли;
			
			Если ПараметрыОбмена.ВыгружатьНаборы тогда 
				ВыгрузитьКомплектующиеНоменклатурыXDTO(ПараметрыОбмена, XDTOПредложение, XDTOПредложениеТип, ТекПредложение.Номенклатура, ТекПредложение.Характеристика, лМенеджерВременныхТаблиц, ТекПредложение.ПриоритетСортировки);
			КонецЕсли;
			
			Если (ТекПредложение.ВестиУчетПоХарактеристикам  И ЗначениеЗаполнено(ТекПредложение.Характеристика))
				И (ПараметрыОбмена.ВыгружатьХарактеристикиПредложений ИЛИ ПараметрыОбмена.ВыгружатьЗначенияСвойствВПредложения) Тогда	
			
				Запрос = Новый Запрос;
				запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
				запрос.Текст =  "ВЫБРАТЬ
				| *
				|ИЗ
				|	ВремЗначенияСвойствХарактеристик КАК ВремЗначенияСвойствХарактеристик
				|ГДЕ
				|	ВремЗначенияСвойствХарактеристик.Характеристика = &Характеристика";
				
				Запрос.УстановитьПараметр("Характеристика", ТекПредложение.Характеристика);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					
					XDTOХарактеристикиТовара 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOХарактеристикиТовараТип); 
					
					XDTOЗначенияСвойств = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойствТип);
					
					Выборка = РезультатЗапроса.Выбрать();
					Пока Выборка.Следующий() Цикл
						
						Если Выборка.СвойствоНаименование = NULL тогда
							Продолжить;
						КонецЕсли;
						
						Если ПараметрыОбмена.ВыгружатьХарактеристикиПредложений тогда
						
							
							XDTOХарактеристикаТовара 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOХарактеристикаТовараТип);
							
							XDTOХарактеристикаТовара.Наименование 	= Выборка.СвойствоНаименование;
							XDTOХарактеристикаТовара.Значение		= Строка(Выборка.Значение);
							
							XDTOХарактеристикиТовара.ХарактеристикаТовара.Добавить(XDTOХарактеристикаТовара);
							
						КонецЕсли;	
						
						Если ПараметрыОбмена.ВыгружатьЗначенияСвойствВПредложения тогда
						
							XDTOЗначенияСвойства = ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойстваТип);
							
							XDTOЗначенияСвойства.Ид = XMLСтрока(Выборка.ИдентификаторСвойства);
							
							XDTOЗначенияСвойства.Значение.Добавить(XMLСтрока(Выборка.ИдентификаторЗначения));
							
							XDTOЗначенияСвойств.ЗначенияСвойства.Добавить(XDTOЗначенияСвойства);	
							
						КонецЕсли;
						
					КонецЦикла;
					
					XDTOПредложение.ХарактеристикиТовара = XDTOХарактеристикиТовара;
					
					Если XDTOЗначенияСвойств.ЗначенияСвойства.количество() > 0 тогда
						XDTOПредложение.ЗначенияСвойств = XDTOЗначенияСвойств;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			XDTOПредложения.Предложение.Добавить(XDTOПредложение);
			Итератор = Итератор + 1;
			
		КонецЦикла;
		
		Если ПараметрыОбмена.ВыгружатьКартинкиИФайлыПредложений тогда
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгружено " + Строка(ВыгруженоКартинок) + " картинок в предложениях.", ПараметрыОбмена);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Создано " + Строка(СозданоКартинок) + " картинок для предложений.", ПараметрыОбмена);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгружено " + Строка(ВыгруженоФайлов) + " файлов в предложениях.", ПараметрыОбмена);
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Создано " + Строка(СозданоФайлов) + " файлов для предложений.", ПараметрыОбмена);
		КонецЕсли;
		
		Владелец.Предложения = XDTOПредложения;
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка предложений в XML завершено. Выгружено " + Строка(Итератор) + " предложений." , ПараметрыОбмена);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыгрузитьКомплектующиеНоменклатурыXDTO(ПараметрыОбмена, Владелец, ВладелецТип, Номенклатура, Характеристика, лМенеджерВременныхТаблиц, ПриоритетСортировки)
	
	Если ПриоритетСортировки = 2 или ПриоритетСортировки = 3  тогда
		
		XDTOКомплектующиеТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Комплектующие", Истина, ВладелецТип);
		XDTOКомплектующееТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Комплектующее", Истина, XDTOКомплектующиеТип);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	ВремКомплектующиеНоменклатуры КАК ВремКомплектующиеНоменклатуры
		|ГДЕ
		|	ВремКомплектующиеНоменклатуры.Номенклатура = &Номенклатура
		|	И ВремКомплектующиеНоменклатуры.Характеристика = &Характеристика";
		Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);
		Запрос.УстановитьПараметр("Характеристика"	, Характеристика);
		Выборка = Запрос.Выполнить();
		
		Если НЕ Выборка.Пустой() тогда
			
			XDTOКомплектующие 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКомплектующиеТип); 

			ВыборкаКомплектов =  Выборка.Выбрать();
			Пока ВыборкаКомплектов.Следующий() Цикл
				
				XDTOКомплектующее 			= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOКомплектующееТип); 
				Если ЗначениеЗаполнено(ВыборкаКомплектов.ХарактеристикаКомплектующей) тогда
					XDTOКомплектующее.Ид 			= XMLСтрока(ВыборкаКомплектов.ИдентификаторКомплектующей) + "#" + XMLСтрока(ВыборкаКомплектов.ИдентификаторХарактеристикиКомплектующей);
					XDTOКомплектующее.Наименование 	= Лев(ВыборкаКомплектов.КомплектующаяНаименование + " (" + ВыборкаКомплектов.ХарактеристикаКомплектующейНаименование+ ")", 250);
				Иначе
					XDTOКомплектующее.Ид 			= XMLСтрока(ВыборкаКомплектов.ИдентификаторКомплектующей);
					XDTOКомплектующее.Наименование	= ВыборкаКомплектов.КомплектующаяНаименование;
				КонецЕсли;
				XDTOКомплектующее.Количество= ВыборкаКомплектов.Количество;
				
				XDTOКомплектующие.Комплектующее.Добавить(XDTOКомплектующее);   
				                                             
			КонецЦикла;
			
       		Владелец.Комплектующие = XDTOКомплектующие;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаФайловХарактеристикНоменклатуры(ПараметрыОбмена,ИмяКаталога, Владелец, МенеджерВременныхТаблиц, ИнформацияОНоменклатуре, Файлы, ОписаниеФайлов, ВыгруженоКартинок, МассивКартинок, ВыгруженоФайлов, МассивФайлов, СозданоКартинок, СозданоФайлов)

	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремФайлыХарактеристикНоменклатуры КАК ВремФайлыХарактеристикНоменклатуры
	| ГДЕ ВремФайлыХарактеристикНоменклатуры.Номенклатура = &Номенклатура
	| И ВремФайлыХарактеристикНоменклатуры.Характеристика = &Характеристика
	|УПОРЯДОЧИТЬ ПО
	| ВремФайлыХарактеристикНоменклатуры.ДатаСоздания";
    Запрос.УстановитьПараметр("Номенклатура", ИнформацияОНоменклатуре.Номенклатура);
    Запрос.УстановитьПараметр("Характеристика", ИнформацияОНоменклатуре.Характеристика);
	
	тзнФайлов = Запрос.Выполнить().Выгрузить();
	
	Если тзнФайлов.Количество() > 0  Тогда
		
		Для каждого ТекФайл из тзнФайлов Цикл
			
			Если ТекФайл.ЭтоКартинка тогда 
				МассивКартинок.Добавить(ТекФайл.Файл);
			Иначе
				МассивФайлов.Добавить(ТекФайл.Файл);
			КонецЕсли;
			
		КонецЦикла;
		
		тзнФайлов.Сортировать("Основная Убыв, ЭтоКартинка Убыв");
		
		Для Каждого ФайлДляВыгрузки Из тзнФайлов Цикл
			
			АдресКартинки = ВыгрузитьФайлНоменклатуры(ПараметрыОбмена, ИмяКаталога, ИнформацияОНоменклатуре.Номенклатура, ИнформацияОНоменклатуре.Характеристика, ФайлДляВыгрузки, СозданоКартинок, СозданоФайлов);
			
			Если ЗначениеЗаполнено(АдресКартинки) Тогда
				
				ОписаниеКартинки = ?(НЕ ПустаяСтрока(ФайлДляВыгрузки.Файл.Описание), ФайлДляВыгрузки.Файл.Описание, ФайлДляВыгрузки.Файл.Наименование);
				
				Если НЕ ПустаяСтрока(ОписаниеКартинки) Тогда
					
					ОписаниеФайлов.Вставить(АдресКартинки, ОписаниеКартинки);
					
				КонецЕсли;
				
				Если ФайлДляВыгрузки.ЭтоКартинка тогда
					
					Владелец.Картинка.Добавить(АдресКартинки);
					
					ВыгруженоКартинок 	= ВыгруженоКартинок + 1;
				Иначе
					
					Файлы.Добавить(АдресКартинки);
					
					ВыгруженоФайлов 	= ВыгруженоФайлов + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 		
	КонецЕсли; 
КонецПроцедуры

Функция ВыгрузитьФайлНоменклатуры(ПараметрыОбмена, ИмяКаталога, Номенклатура, Характеристика, ФайлДляВыгрузки, СозданоКартинок, СозданоФайлов)
	
	Результат = НеОпределено;
	
	Если НЕ ЗначениеЗаполнено(ФайлДляВыгрузки.Файл) Тогда
		Возврат Результат;
	КонецЕсли;
	
	пОбъект = ?(ЗначениеЗаполнено(Характеристика), Характеристика, Номенклатура);
	
	ИмяПоНоменклатуре = Строка(пОбъект.УникальныйИдентификатор());
	ИмяПоХранилищу    = Строка(ФайлДляВыгрузки.Файл.УникальныйИдентификатор());
	
 	ИмяФайлаКартинки = ИмяПоНоменклатуре + "_" + ИмяПоХранилищу  + ?(НРег(ФайлДляВыгрузки.Расширение) = "",".jpg", НРег(ФайлДляВыгрузки.Расширение));	
	
	КаталогПоИмени   = Лев(ИмяПоНоменклатуре, 2);
	КаталогКартинки	 = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (ИмяКаталога + "\" + ПараметрыОбмена.ПодкаталогФайлов + "\" + КаталогПоИмени));
	
	Если ФайлДляВыгрузки.НадоВыгружать тогда
		
		СоздатьКаталог(КаталогКартинки);
	
		ПолноеИмяФайлаКартинки = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, (КаталогКартинки + "\" + ИмяФайлаКартинки));
	
		ФайлВХранилище = ФайлДляВыгрузки.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
		
		Если ФайлВХранилище Тогда
			
			Если ФайлДляВыгрузки.ХранимыйФайл = NULL Тогда
				ДвоичныеДанныеФайла = НеОпределено;
			Иначе
				ДвоичныеДанныеФайла = ФайлДляВыгрузки.ХранимыйФайл.Получить();
			КонецЕсли;
			
			Если ДвоичныеДанныеФайла = НеОпределено Тогда
				
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось получить данные файла " + Строка(ФайлДляВыгрузки.Файл) + " объекта " + Строка(пОбъект), ПараметрыОбмена);	
						
				Возврат Результат;
				
			КонецЕсли;
			
		Иначе
			
			ИмяФайла = Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучитьПутьДляПлатформы(ПараметрыОбмена.ПлатформаWindows, ?(ПараметрыОбмена.ПлатформаWindows, ФайлДляВыгрузки.ТомПолныйПутьWindows, ФайлДляВыгрузки.ТомПолныйПутьLinux) + "\" + ФайлДляВыгрузки.ПутьКФайлу);
			
			Попытка
				
				ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
				
			Исключение
				Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно(ОписаниеОшибки() + " Выгрузка файла объекта: " + Строка(пОбъект), ПараметрыОбмена);	
						
				Возврат Результат;
				
			КонецПопытки;
			
		КонецЕсли;
			
		
		Попытка
			ДвоичныеДанныеФайла.Записать(ПолноеИмяФайлаКартинки);
		Исключение
			Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Не удалось записать файл картинки на диск. Объект: " + пОбъект, ПараметрыОбмена);
			Возврат Результат;
		КонецПопытки;	
		
		Если ФайлДляВыгрузки.ЭтоКартинка тогда
			СозданоКартинок 	= СозданоКартинок + 1;
		Иначе
			
			СозданоФайлов 		= СозданоФайлов + 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = ПараметрыОбмена.ПодкаталогФайлов + "/" + КаталогПоИмени + "/" + ИмяФайлаКартинки;
	
	Возврат Результат;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьПрайсы(ПараметрыОбмена, Владелец, ВладелецТип, лМенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремЦены КАК ВремЦены
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураИдентификатор,
	|	ХарактеристикаИдентификатор";
	
	ТзнЦен = Запрос.Выполнить().Выгрузить();
	
	Если ТзнЦен.Количество() > 0 тогда
		
		Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка цен в XML.", ПараметрыОбмена);
		Итератор = 0;
		
		XDTOПредложениеТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Предложение");
		XDTOЦеныТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Цены", Истина, XDTOПредложениеТип);
		XDTOЦенаТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена, "Цена");
	
		XDTOНалогТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Налог", Истина, XDTOЦенаТип);	
	
		КоличествоСтрок = ТзнЦен.Количество() -1 ;
		ИдПредложенияПре= "";
		
		Для НомерСтроки = 0 по  КоличествоСтрок Цикл
			
			ТекЦена = ТзнЦен[НомерСтроки];
			
			ИдПредложения = ?(ЗначениеЗаполнено(ТекЦена.Характеристика), XMLСтрока(ТекЦена.НоменклатураИдентификатор) + "#" + XMLСтрока(ТекЦена.ХарактеристикаИдентификатор), XMLСтрока(ТекЦена.НоменклатураИдентификатор));
			
			Если НомерСтроки = КоличествоСтрок тогда
				ИдПредложенияСлед = "";
			Иначе
				ТекЦенаСлед = ТзнЦен[НомерСтроки + 1];
				ИдПредложенияСлед = ?(ЗначениеЗаполнено(ТекЦенаСлед.Характеристика), XMLСтрока(ТекЦенаСлед.НоменклатураИдентификатор) + "#" + XMLСтрока(ТекЦенаСлед.ХарактеристикаИдентификатор), XMLСтрока(ТекЦенаСлед.НоменклатураИдентификатор));
			КонецЕсли;
			
			Если НомерСтроки = 0 или ИдПредложения <> ИдПредложенияПре тогда
				
				XDTOПредложение 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложениеТип); 
				XDTOПредложение.Ид 	= ИдПредложения;
				
				XDTOЦены 			= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЦеныТип); 
				
			КонецЕсли;
			
			XDTOЦена 			= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЦенаТип); 
			
			ЦенаТовара 			= ОкруглитьЦену(ТекЦена.Цена/ТекЦена.Коэффициент, ТекЦена.ПорядокОкругления, ТекЦена.ОкруглятьВБольшуюСторону);
			ПредставлениеЦены 	= СокрЛП(ТекЦена.Цена) + " " + СокрЛП(ТекЦена.ВалютаЦеныСсылка) + " за " + СокрЛП(ТекЦена.ЕдиницаИзмеренияЦены);
			
			XDTOЦена.Представление 		= ПредставлениеЦены;
			XDTOЦена.ИдТипаЦены			= XMLСтрока(ТекЦена.ТипЦеныИдентификатор);
			XDTOЦена.ЦенаЗаЕдиницу 		= ЦенаТовара;
			//БВ
			//XDTOЦена.Валюта       		= Лев(ТекЦена.ВалютаКод, 3);
			Если СокрЛП(НРег(Лев(ТекЦена.ВалютаКод, 3))) = "грн"  Тогда
				ТекЦенаВалютаКод = "UAH";
			Иначе
				ТекЦенаВалютаКод = ТекЦена.ВалютаКод;
			КонецЕсли; 
			XDTOЦена.Валюта       		= Лев(ТекЦенаВалютаКод, 3);
			//
			//XDTOЦена.ИдЕдиницыИзмерения = XMLСтрока(ТекЦена.БазоваяЕдиницаИзмеренияИдентификатор);
		
			XDTOНалог				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
			XDTOНалог.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
			XDTOНалог.УчтеноВСумме 	= XMLСтрока(ТекЦена.ЦенаВключаетНДС);
		
			XDTOЦена.Налог.Добавить(XDTOНалог);
		
			XDTOЦены.Цена.Добавить(XDTOЦена);
			
			Если ИдПредложения <> ИдПредложенияСлед тогда
				XDTOПредложение.Цены = XDTOЦены;
				Владелец.Предложение.Добавить(XDTOПредложение);
			КонецЕсли;
			
			ИдПредложенияПре = ИдПредложения; 
			Итератор 		 = Итератор + 1;
			
		КонецЦикла;
		
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	Запрос.Текст = "Уничтожить ВремЦены";
	Запрос.Выполнить();
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка цен в XML завершено. Выгружено " + Строка(Итератор) + " цен предложений." , ПараметрыОбмена);
	
КонецПроцедуры

Функция ОкруглитьЦену(Число, ПараметрПорядокОкругления, ОкруглятьВБольшуюСторону) 

	Перем Результат;

	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	Если НЕ ЗначениеЗаполнено(ПараметрПорядокОкругления) Тогда
		ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01; 
	Иначе
		ПорядокОкругления = ПараметрПорядокОкругления;
	КонецЕсли;

	Порядок = Число(Строка(ПорядокОкругления));
		
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
		
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
		
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону Тогда
			
			// При порядке округления "0.05" 0.371 должно округлитья до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе

			// При порядке округления "0.05" 0.371 должно округлитья до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал,0,РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ВыгрузитьОстаткиXDTO(ПараметрыОбмена, Владелец, ВладелецТип, лМенеджерВременныхТаблиц)
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка остатков в XML.", ПараметрыОбмена);
	
	лВыгрузкаПоСкладам 	= ПараметрыОбмена.ВыгружатьОстаткиПоСкладам;	
	Итератор 		 = 0;
	ЗапросПоСкладам = Новый Запрос;
	ЗапросПоСкладам.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВремСклады КАК ВремСклады";
	ТзнСкладов = ЗапросПоСкладам.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками";
    Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗапросПоОстаткам = Новый Запрос;
		ЗапросПоОстаткам.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
		//Временная таблица формируется в функции СформироватьВременныеТаблицыПоИнформацииОТоварахПакета
		ЗапросПоОстаткам.Текст = "ВЫБРАТЬ * ИЗ ВремОстатки КАК ВремОстаткиПоСкладам
		|ГДЕ ВремОстаткиПоСкладам.Номенклатура = &Номенклатура И ВремОстаткиПоСкладам.Характеристика = &Характеристика  
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураИдентификатор,
		|	ХарактеристикаИдентификатор";
		ЗапросПоОстаткам.УстановитьПараметр("Номенклатура",Выборка.Номенклатура);
		ЗапросПоОстаткам.УстановитьПараметр("Характеристика",Выборка.Характеристика);
		
		ТзнОстатков = ЗапросПоОстаткам.Выполнить().Выгрузить();
		
		XDTOПредложениеТип 	= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Предложение");
		XDTOОстаткиТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Остатки", Истина, XDTOПредложениеТип);
		XDTOОстатокТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Остаток");
		XDTOСкладТип 		= Б_ОбщиеПроцедурыИФункцииОбменаССайтом.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Склад");
		
		ИдПредложения 		= ?(ЗначениеЗаполнено(Выборка.Характеристика), XMLСтрока(Выборка.НоменклатураИдентификатор) + "#" + XMLСтрока(Выборка.ХарактеристикаИдентификатор), XMLСтрока(Выборка.НоменклатураИдентификатор));
		
		XDTOПредложение 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOПредложениеТип); 
		XDTOПредложение.Ид 	= ИдПредложения;
				
		XDTOОстатки 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOОстаткиТип); 
		
		Если лВыгрузкаПоСкладам тогда
			
			Для Каждого ТекСклад Из ТзнСкладов Цикл 
				
				НайденнаяСтрока = ТзнОстатков.Найти(ТекСклад.Склад);
				
				XDTOОстаток					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOОстатокТип); 

				Если НайденнаяСтрока = Неопределено тогда
					
					XDTOСклад				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладТип);	
					XDTOСклад.Ид			= XMLСтрока(ТекСклад.Идентификатор);
					XDTOСклад.Количество	= 0;
					
					XDTOОстаток.Склад		= XDTOСклад;
					
				Иначе
					XDTOСклад				= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкладТип);	
					XDTOСклад.Ид			= XMLСтрока(ТекСклад.Идентификатор);
					XDTOСклад.Количество	= НайденнаяСтрока.Остаток;
					
					XDTOОстаток.Склад		= XDTOСклад;
					
				КонецЕсли;
				
				XDTOОстатки.Остаток.Добавить(XDTOОстаток);
                Итератор 		 = Итератор + 1;
			КонецЦикла;
			
		Иначе
			
			XDTOОстаток					= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOОстатокТип); 

			ТзнОстатков.Свернуть("НоменклатураИдентификатор, ХарактеристикаИдентификатор", "Остаток");	
			
			Если ТзнОстатков.Количество() > 0 тогда
				XDTOОстаток.Количество 	= ТзнОстатков[0].Остаток;
			Иначе
				XDTOОстаток.Количество 	= 0;
			Конецесли; 
			XDTOОстатки.Остаток.Добавить(XDTOОстаток);  
			Итератор 		 = Итератор + 1;
			
		КонецЕсли;
		
		XDTOПредложение.Остатки = XDTOОстатки;
    	
		Владелец.Предложение.Добавить(XDTOПредложение);

	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
	Запрос.Текст = "Уничтожить ВремОстатки";
	Запрос.Выполнить();
	
	Б_ОбщиеПроцедурыИФункцииОбменаССайтом.СообщитьПодробно("Выгрузка остатков в XML завершено. Выгружено " + Строка(Итератор) + " элементов." , ПараметрыОбмена);

КонецПроцедуры
