#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов.
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

ОписаниеТиповСтрока254 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока254);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока254);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);

// Таблица значений хранит данные дополнительной страницы многостраничных разделов отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя дополнительной страницы (отображается в списке дополнительных страниц);
//    - булево, признак текущей страницы (отображенной в поле табличного документа);
//    - структура, содержащая имена и значения редактируемых ячеек дополнительной страницы.
//
ТаблицаСтраницыРаздела            = Новый ТаблицаЗначений;
ТаблицаСтраницыРаздела.Колонки.Добавить("Представление",              ОписаниеТиповСтрока254, НСтр("ru='Наименование';uk='Найменування'"));
ТаблицаСтраницыРаздела.Колонки.Добавить("АктивнаяСтраница",           ОписаниеТиповБулево);
ТаблицаСтраницыРаздела.Колонки.Добавить("Данные");

мСтруктураВариантыЗаполнения      = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Янв";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета"
"и уплаты страхователями и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20050101';
НоваяФорма.ДатаКонецДействия  = '20060430';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Май";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета"
"и уплаты страхователями и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20060501';
НоваяФорма.ДатаКонецДействия  = '20061231';


НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Янв";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета"
"и уплаты страхователями и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20070101';
НоваяФорма.ДатаКонецДействия  = '20080131';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Фев";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета и уплаты страхователями"
"и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20080201';
НоваяФорма.ДатаКонецДействия  = '20081130';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Дек";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета и уплаты страхователями"
"и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20081201';
НоваяФорма.ДатаКонецДействия  = '20090228';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Март";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 23 к пунтку 11.11 Инструкции о порядке расчета и уплаты страхователями"
"и застрахованными лицами взносов на общеобязательное государственное "
"пенсионное страхование в Пенсионный фонд Украины ';uk=""Додаток 23 до пункту 11.11 Інструкції про порядок розрахунку"
"і сплати страхувальниками й застрахованими особами внесків на загальнообов'язкове державне "
"пенсійне страхування в Пенсійний фонд України """);
НоваяФорма.ДатаНачалоДействия = '20090301';
НоваяФорма.ДатаКонецДействия  = '20091231';


НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Янв";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Приложение 4 к Порядку формирования и подачи страхователями 
                                      |отчета относительно сумм начисленных взносов на общеобязательное государственное 
                                      |пенсионное страхование органам Пенсионного фонда Украины,
                                      |утвержденному постановлением правления ПФУ №26-1 от 5.11.2009 года.'; uk = 'Додаток 4 до Порядку формування та подання страхувальниками 
                                      |звіту щодо сум нарахованих внесків на загальнообов’язкове державне
                                      |пенсійне страхування органам Пенсійного фонду України,
                                      |затвержденому постановою правління ПФУ №26-1 від 5.11.2009 року.'");
НоваяФорма.ДатаНачалоДействия = '20100101';

НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
#КонецЕсли
