Функция ПолучитьТаблицуХарактеристик(Номенклатура,Цвет, Ткань = "", Подкладка = "") Экспорт
	
	
	Запрос = Новый Запрос;
	Если Ткань = "" И Подкладка = "" И Цвет = "" Тогда  
		
	    Запрос.Текст = "ВЫБРАТЬ
               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
               |ИЗ
               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
               |ГДЕ			   
               |	ХарактеристикиНоменклатуры.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Номенклатура);
		
	ИначеЕсли Ткань = "" И Подкладка = "" Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ
               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
               |ИЗ
               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
               |ГДЕ
               |	ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Цвет 			   
               |	И ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
		Запрос.УстановитьПараметр("Цвет","%"+СокрЛП(Цвет)+"%");
		Запрос.УстановитьПараметр("Владелец",Номенклатура);
		
	ИначеЕсли Ткань <> "" И Подкладка <> "" Тогда
		
		 Запрос.Текст = "ВЫБРАТЬ
               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
               |ИЗ
               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
               |ГДЕ
               |	ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Цвет 
			   |	И ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Подкладка
			     |	И ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Ткань
               |	И ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
		Запрос.УстановитьПараметр("Цвет","%"+СокрЛП(Цвет)+"%");
		Запрос.УстановитьПараметр("Подкладка","%"+СокрЛП(Подкладка)+"%");
		Запрос.УстановитьПараметр("Ткань","%"+СокрЛП(Ткань)+"%");		
		Запрос.УстановитьПараметр("Владелец",Номенклатура);
		
	ИначеЕсли Подкладка <> "" Тогда
		 Запрос.Текст = "ВЫБРАТЬ
               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
               |ИЗ
               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
               |ГДЕ
               |	ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Цвет 
			   |	И ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Подкладка			   
               |	И ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
		Запрос.УстановитьПараметр("Цвет","%"+СокрЛП(Цвет)+"%");
		Запрос.УстановитьПараметр("Подкладка","%"+СокрЛП(Подкладка)+"%");		
		Запрос.УстановитьПараметр("Владелец",Номенклатура);

	ИначеЕсли Ткань <> "" Тогда
		Запрос.Текст = "ВЫБРАТЬ
               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
               |ИЗ
               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
               |ГДЕ
               |	ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Цвет 
			   |	И ХарактеристикиНоменклатуры.Наименование ПОДОБНО &Ткань	   
               |	И ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
		Запрос.УстановитьПараметр("Цвет","%"+СокрЛП(Цвет)+"%");
		Запрос.УстановитьПараметр("Ткань","%"+СокрЛП(Ткань)+"%");		
		Запрос.УстановитьПараметр("Владелец",Номенклатура);

	КонецЕсли;
		
	Рез = Запрос.Выполнить().Выгрузить();
	
	НужноУдалить = Новый Массив;
	Если Цвет <> "" Тогда
		ДЛя Каждого Стр Из Рез Цикл
			Сост =  ОбщегоНазначения.СоставныеПоРазделителю(Стр.Характеристика.Наименование,",");
			Соответсвует = Ложь;
			Для Каждого Сос Из Сост Цикл
				Если  Сос.Значение = Цвет Тогда
					Соответсвует = Истина;
				КонецЕсли;
			КонецЦикла;
			Если НЕ Соответсвует Тогда
				НужноУдалить.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Стр Из НужноУдалить Цикл
			Рез.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Рез;
	
КонецФункции
