Перем мУдалятьДвижения;

// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;
//Хранит схему налогообложения юр./физ. лица для отражения единого налога.
Перем мТекущаяСхемаНалогообложения;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;

Перем ТаблицаПлатежейУпр;

Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;

Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

Перем мРазделятьПоСтавкамНДС Экспорт;

Перем ЕстьАналитикаПоОбособленнымПодразделениям Экспорт;

Перем мСтруктураПараметровДенежныхСредств;

// Формирует номер приходного оредера в пределах организации
//

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

Функция ПечатьПКО(Вариант2009)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата  КАК ДатаДокумента,
	|	Организация КАК Орган,
	|	Организация,
	|	Организация КАК Руководители,
	|	Касса.ОбособленноеПодразделение КАК ОбособленноеПодразделениеОрганизации,
	|	Касса.ОбособленноеПодразделение.НаименованиеПолное КАК ОбособленноеПодразделениеОрганизацииПредставление,
	|	Контрагент,
	|	Контрагент.Представление КАК Контрагент,
	|	ПринятоОт      КАК ПринятоОт,
	|	Основание      КАК Основание,
	|	Приложение     КАК Приложение,
	|	СуммаДокумента КАК Сумма,
	|	ВалютаДокумента,
	|	ВалютаДокумента.Представление КАК ВалютаПредставление,
	|	СтавкаНДС,
	|	НомерОрдера
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйКассовыйОрдер_КО1";
	
	Если Вариант2009 Тогда
		Макет       = ПолучитьОбщийМакет("КО1_2009");
	Иначе
		Макет       = ПолучитьОбщийМакет("КО1");
	КонецЕсли;
	
	КодЯзыкаПечать = "uk";
	
	// Выводим шапку ПКО
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Орган, Шапка.ДатаДокумента);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		ОбластьМакета.Параметры.ПолноеНаименование 	= СведенияОбОрганизации.ПолноеНаименование;
	Иначе
		ОбластьМакета.Параметры.ПолноеНаименование = Шапка.ОбособленноеПодразделениеОрганизацииПредставление;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Сумма             	= ОбщегоНазначения.ФорматСумм(Шапка.Сумма, Шапка.ВалютаДокумента);
	ОбластьМакета.Параметры.СуммаПрописью     	= ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.Сумма, Шапка.ВалютаДокумента, КодЯзыкаПечать);
	ОбластьМакета.Параметры.КодПоЕДРПОУ 		= УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		
		ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
		Для каждого Строка Из ТаблицаВыручки Цикл
			Если Строка.Возврат = Истина Тогда
				Строка.СуммаНДС = - Строка.СуммаНДС;	
				Строка.Сумма = - Строка.Сумма;
			КонецЕсли; 
		КонецЦикла; 
		
		СуммаНДС = ?(ТаблицаВыручки.Итог("Сумма") = 0, 0, ТаблицаВыручки.Итог("СуммаНДС") / ТаблицаВыручки.Итог("Сумма") * (ТаблицаВыручки.Итог("Сумма") - ОплатаПлатежнымиКартами.Итог("Сумма") - ОплатаБанковскимиКредитами.Итог("Сумма")));	
		СуммаНДС = Макс(СуммаНДС, 0)
		
	Иначе
		
		СуммаНДС = РасшифровкаПлатежа.Итог("СуммаНДС");	
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.УстановитьПараметр("Счет", СчетКасса);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Проводки.СчетКт КАК СчетКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Проводки
	|
	|ГДЕ
	|	Проводки.Регистратор = &ТекущийДокумент И
	|	Проводки.СчетДт = &Счет"+
	?(СчетКасса <> ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте,"
	|// проводки по курсовой разнице (без валютной суммы) пропускаем
	|	И Проводки.ВалютнаяСуммаДт <> 0","");
 
	ВыборкаСчетов = Запрос.Выполнить().Выбрать();
	
	СписокСчетов = ""; Разделитель = "";
	
	Пока ВыборкаСчетов.Следующий() Цикл
		Если Найти(СписокСчетов, Строка(ВыборкаСчетов.СчетКТ)) <> 0 Тогда
			Продолжить;
		КонецЕсли;	
		СписокСчетов = СписокСчетов + Разделитель + Строка(ВыборкаСчетов.СчетКТ);
		Разделитель = ", ";
	КонецЦикла;	
    ОбластьМакета.Параметры.Счет = СписокСчетов;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ВыводитьНаПечатьСуммуНДС Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("СекцияВТомЧисле");
			
		Если СуммаНДС = 0 Тогда
			ОбластьМакета.Параметры.ВТомЧисле = "0,00"+ " " + СокрП(Шапка.ВалютаДокумента);
		Иначе
			ОбластьМакета.Параметры.ВТомЧисле = ОбщегоНазначения.ФорматСумм(СуммаНДС, Шапка.ВалютаДокумента);
		КонецЕсли;
	
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");

	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		Руководители = ОбщегоНазначения.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаДокумента);
	Иначе
		Руководители = ОбщегоНазначения.ОтветственныеЛицаОбособленногоПодразделения(Шапка.ОбособленноеПодразделениеОрганизации, Шапка.ДатаДокумента);
	КонецЕсли;

	Если ЗначениеЗаполнено(Руководители.РуководительФИО) Тогда
		Руководитель = ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(Руководители.РуководительФИО.Фамилия, Руководители.РуководительФИО.Имя, Руководители.РуководительФИО.Отчество);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Руководители.ГлавныйБухгалтерФИО) Тогда
		Бухгалтер = ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(Руководители.ГлавныйБухгалтерФИО.Фамилия, Руководители.ГлавныйБухгалтерФИО.Имя, Руководители.ГлавныйБухгалтерФИО.Отчество);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Руководители.КассирФИО) Тогда
		Кассир = ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(Руководители.КассирФИО.Фамилия, Руководители.КассирФИО.Имя, Руководители.КассирФИО.Отчество);
    КонецЕсли;

	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Бухгалтер;
	ОбластьМакета.Параметры.ФИОКассира 			  = Кассир;
	
	Если НЕ Вариант2009 Тогда 
		ОбластьМакета.Параметры.ДатаДокумента = Шапка.ДатаДокумента;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Приложение	  = Шапка.Приложение;

	ТабДокумент.Вывести(ОбластьМакета);
    	
	Возврат ТабДокумент;

КонецФункции // ПечатьПКО()

Функция ПечатьПКОвБланк()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата  КАК ДатаДокумента,
	|	Организация КАК Орган,
	|	Организация,
	|	Организация КАК Руководители,
	|	Касса.ОбособленноеПодразделение КАК ОбособленноеПодразделениеОрганизации,
	|	Касса.ОбособленноеПодразделение.НаименованиеПолное КАК ОбособленноеПодразделениеОрганизацииПредставление,
	|	Контрагент,
	|	Контрагент.Представление КАК Контрагент,
	|	ПринятоОт      КАК ПринятоОт,
	|	Основание      КАК Основание,
	|	Приложение     КАК Приложение,
	|	СуммаДокумента КАК Сумма,
	|	ВалютаДокумента,
	|	ВалютаДокумента.Представление КАК ВалютаПредставление,
	|	СтавкаНДС,
	|	НомерОрдера
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйКассовыйОрдер_КО1вБланк";
	Макет       = ПолучитьОбщийМакет("КО1вБланк");
	КодЯзыкаПечать = "uk";
	
	// Выводим шапку ПКО
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Орган, Шапка.ДатаДокумента);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		ОбластьМакета.Параметры.ПолноеНаименование 	= СведенияОбОрганизации.ПолноеНаименование;
	Иначе
		ОбластьМакета.Параметры.ПолноеНаименование = Шапка.ОбособленноеПодразделениеОрганизацииПредставление;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Сумма = ОбщегоНазначения.ФорматСумм(Шапка.Сумма, Шапка.ВалютаДокумента); 
								 
	ЧислоМесяц = СокрЛП(Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДФ=ддММММ"));
	ОбластьМакета.Параметры.Месяц = Прав(ЧислоМесяц, СтрДлина(ЧислоМесяц)-2);
	ОбластьМакета.Параметры.Число = Лев(ЧислоМесяц, 2);
	ОбластьМакета.Параметры.Год = СокрЛП(Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДФ=гг"));
	
	СуммаПрописью = СтрЗаменить( СокрЛП(ЧислоПрописью(Шапка.Сумма, "Л = "+КодЯзыкаПечать+"; НП = Ложь; НД = Ложь",
	                             "гривна, гривны, гривен, ж, копейка, копейки, копеек, ж, 2")), Символы.НПП, " ");
								 
	ОбластьМакета.Параметры.СуммаПрописью = СтрЗаменить(СокрЛП(Лев(СуммаПрописью, СтрДлина(СуммаПрописью)-2)) + 
	  Символы.НПП+Символы.НПП+Символы.НПП+Символы.НПП+Символы.НПП + СокрЛП(Прав(СуммаПрописью, 2)),
	  Символы.НПП, Символы.НПП+Символы.НПП+Символы.НПП);
	  	  
	ОбластьМакета.Параметры.ПринятоОт = "                                    " + ОбластьМакета.Параметры.ПринятоОт;
	  
	ОбластьМакета.Параметры.КодПоЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		
		ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
		Для каждого Строка Из ТаблицаВыручки Цикл
			Если Строка.Возврат = Истина Тогда
				Строка.СуммаНДС = - Строка.СуммаНДС;	
			КонецЕсли; 
		КонецЦикла; 
		
		СуммаНДС = ТаблицаВыручки.Итог("СуммаНДС");	
		
	Иначе
		
		СуммаНДС = РасшифровкаПлатежа.Итог("СуммаНДС");	
		
	КонецЕсли;      	

	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		Руководители = ОбщегоНазначения.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаДокумента);
	Иначе
		Руководители = ОбщегоНазначения.ОтветственныеЛицаОбособленногоПодразделения(Шапка.ОбособленноеПодразделениеОрганизации, Шапка.ДатаДокумента);
	КонецЕсли;
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	Кассир       = Руководители.Кассир; 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.УстановитьПараметр("Счет", СчетКасса);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Проводки.СчетКт КАК СчетКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Проводки
	|
	|ГДЕ
	|	Проводки.Регистратор = &ТекущийДокумент И
	|	Проводки.СчетДт = &Счет"+
	?(СчетКасса <> ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте,"
	|// проводки по курсовой разнице (без валютной суммы) пропускаем
	|	И Проводки.ВалютнаяСуммаДт <> 0","");
 
	ВыборкаСчетов = Запрос.Выполнить().Выбрать();
	
	СписокСчетов = ""; Разделитель = "";
	
	Пока ВыборкаСчетов.Следующий() Цикл
		Если Найти(СписокСчетов, Строка(ВыборкаСчетов.СчетКТ)) <> 0 Тогда
			Продолжить;
		КонецЕсли;	
		СписокСчетов = СписокСчетов + Разделитель + Строка(ВыборкаСчетов.СчетКТ);
		Разделитель = ", ";
	КонецЦикла;	
    ОбластьМакета.Параметры.Счет = СписокСчетов;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
    	
	Возврат ТабДокумент;

КонецФункции // ПечатьПКОвБланк()

Функция ПечатьПКОвБланкА4()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата  КАК ДатаДокумента,
	|	Организация КАК Орган,
	|	Организация,
	|	Организация КАК Руководители,
	|	Касса.ОбособленноеПодразделение КАК ОбособленноеПодразделениеОрганизации,
	|	Касса.ОбособленноеПодразделение.НаименованиеПолное КАК ОбособленноеПодразделениеОрганизацииПредставление,
	|	Контрагент,
	|	Контрагент.Представление КАК Контрагент,
	|	ПринятоОт      КАК ПринятоОт,
	|	Основание      КАК Основание,
	|	Приложение     КАК Приложение,
	|	СуммаДокумента КАК Сумма,
	|	ВалютаДокумента,
	|	ВалютаДокумента.Представление КАК ВалютаПредставление,
	|	СтавкаНДС,
	|	НомерОрдера
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйКассовыйОрдер_КО1вБланкА4";
	Макет       = ПолучитьОбщийМакет("КО1вБланкА4");
	КодЯзыкаПечать = "uk";
	// Выводим шапку ПКО

	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Орган, Шапка.ДатаДокумента);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		ОбластьМакета.Параметры.ПолноеНаименование 	= СведенияОбОрганизации.ПолноеНаименование;
	Иначе
		ОбластьМакета.Параметры.ПолноеНаименование = Шапка.ОбособленноеПодразделениеОрганизацииПредставление;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Сумма = ОбщегоНазначения.ФорматСумм(Шапка.Сумма, Шапка.ВалютаДокумента); 
	
	ЧислоМесяц = СокрЛП(Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДФ=ддММММ"));
	ОбластьМакета.Параметры.Месяц = Прав(ЧислоМесяц, СтрДлина(ЧислоМесяц)-2);
	ОбластьМакета.Параметры.Число = Лев(ЧислоМесяц, 2);
	ОбластьМакета.Параметры.Год = СокрЛП(Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДФ=гг"));
	
	СуммаПрописью = СтрЗаменить( СокрЛП(ЧислоПрописью(Шапка.Сумма, "Л = "+КодЯзыкаПечать+"; НП = Ложь; НД = Ложь",
	                             "гривна, гривны, гривен, ж, копейка, копейки, копеек, ж, 2")), Символы.НПП, " ");
								 
	ОбластьМакета.Параметры.СуммаПрописью = СтрЗаменить(СокрЛП(Лев(СуммаПрописью, СтрДлина(СуммаПрописью)-2)) + 
	  Символы.НПП+Символы.НПП+Символы.НПП+Символы.НПП+Символы.НПП + СокрЛП(Прав(СуммаПрописью, 2)),
	  Символы.НПП, Символы.НПП+Символы.НПП+Символы.НПП);
	  
	ОбластьМакета.Параметры.ПринятоОт = "                                    " + ОбластьМакета.Параметры.ПринятоОт;
	
	ОбластьМакета.Параметры.КодПоЕДРПОУ	= УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		
		ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
		Для каждого Строка Из ТаблицаВыручки Цикл
			Если Строка.Возврат = Истина Тогда
				Строка.СуммаНДС = - Строка.СуммаНДС;	
			КонецЕсли; 
		КонецЦикла; 
		
		СуммаНДС = ТаблицаВыручки.Итог("СуммаНДС");	
		
	Иначе
		
		СуммаНДС = РасшифровкаПлатежа.Итог("СуммаНДС");	
		
	КонецЕсли;     	

	Если НЕ ЗначениеЗаполнено(Шапка.ОбособленноеПодразделениеОрганизации) Тогда
		Руководители = ОбщегоНазначения.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаДокумента);
	Иначе
		Руководители = ОбщегоНазначения.ОтветственныеЛицаОбособленногоПодразделения(Шапка.ОбособленноеПодразделениеОрганизации, Шапка.ДатаДокумента);
	КонецЕсли;
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	Кассир       = Руководители.Кассир; 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.УстановитьПараметр("Счет", СчетКасса);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Проводки.СчетКт КАК СчетКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Проводки
	|
	|ГДЕ
	|	Проводки.Регистратор = &ТекущийДокумент И
	|	Проводки.СчетДт = &Счет"+
	?(СчетКасса <> ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте,"
	|// проводки по курсовой разнице (без валютной суммы) пропускаем
	|	И Проводки.ВалютнаяСуммаДт <> 0","");
 
	ВыборкаСчетов = Запрос.Выполнить().Выбрать();
	
	СписокСчетов = ""; Разделитель = "";
	
	Пока ВыборкаСчетов.Следующий() Цикл
		Если Найти(СписокСчетов, Строка(ВыборкаСчетов.СчетКТ)) <> 0 Тогда
			Продолжить;
		КонецЕсли;	
		СписокСчетов = СписокСчетов + Разделитель + Строка(ВыборкаСчетов.СчетКТ);
		Разделитель = ", ";
	КонецЦикла;	
    ОбластьМакета.Параметры.Счет = СписокСчетов;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб = Ложь;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	
	Возврат ТабДокумент;

КонецФункции // ПечатьПКОвБланкА4()                  

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПКО" Тогда
		
		ТабДокумент = ПечатьПКО(Истина);
		
	ИначеЕсли ИмяМакета = "ПКОДо2009" Тогда
		
		ТабДокумент = ПечатьПКО(Ложь);
		
	ИначеЕсли ИмяМакета = "ПКОвБланк" Тогда
		
		ТабДокумент = ПечатьПКОвБланк();  
		
	ИначеЕсли ИмяМакета = "ПКОвБланкА4" Тогда
		
		ТабДокумент = ПечатьПКОвБланкА4();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), Ссылка);
	
КонецПроцедуры // Печать()

// Процедура заполняет реквизиты, используемые для формирования печатной формы (ПринтоОт, 
// Основание и Приложение). 
// Параметры:
//  ЧтоИзменилось - имя реквизита документа
//
Процедура ЗаполнитьРеквизитыПечати(ЧтоИзменилось = Неопределено) Экспорт

	// если не передали название реквизита считаем, что это ВидОперации.
	// Как следствие будет проведено заполнение всех реквизитов по-умолчанию.
	Если ЧтоИзменилось = Неопределено Тогда
	
		ЧтоИзменилось = "ВидОперации";
	
	КонецЕсли; 
	
	Если  ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя 
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком 
	  ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда 
		
		// ПринятоОт
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "Контрагент" Тогда
			
			Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			
				ПринятоОт = ?(Контрагент.НаименованиеПолное="", Контрагент.Наименование, Контрагент.НаименованиеПолное);	
			
			КонецЕсли; 
			
		КонецЕсли;
		
		// Основание
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "ДоговорКонтрагента" 
			ИЛИ ЧтоИзменилось = "Сделка" 
			ИЛИ ЧтоИзменилось = "ДокументРасчетовСКонтрагентом" Тогда
			
			Основание = "";	
			
			РасшифровкаКопия = РасшифровкаПлатежа.Выгрузить();
			РасшифровкаКопия.Свернуть("ДоговорКонтрагента, Сделка,ДокументРасчетовСКонтрагентом","");
			РасшифровкаКопия.Сортировать("ДоговорКонтрагента, Сделка,ДокументРасчетовСКонтрагентом");
			
			ТекДоговор = Неопределено;
			
			Для Инд = 0 По РасшифровкаКопия.Количество() - 1 Цикл
				
				СтрокаРасшифровки = РасшифровкаКопия[Инд];
				
				Шапка = Новый Структура();
				Шапка.Вставить("ДоговорКонтрагента", 			СтрокаРасшифровки.ДоговорКонтрагента);
				Шапка.Вставить("ДоговорНаименованиеДляПечати", 	СтрокаРасшифровки.ДоговорКонтрагента.Наименование);
				Шапка.Вставить("ДоговорВедениеВзаиморасчетов", 	СтрокаРасшифровки.ДоговорКонтрагента.ВедениеВзаиморасчетов);
				Шапка.Вставить("ДоговорДата",  					СтрокаРасшифровки.ДоговорКонтрагента.Дата);
				Шапка.Вставить("ДоговорНомер", 					СтрокаРасшифровки.ДоговорКонтрагента.Номер);
				Шапка.Вставить("Сделка", 						?(СтрокаРасшифровки.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл, СтрокаРасшифровки.ДокументРасчетовСКонтрагентом, СтрокаРасшифровки.Сделка));	
				
				// Выводим дополнительно информацию о договоре и сделке
				Если НЕ ТекДоговор = СтрокаРасшифровки.ДоговорКонтрагента Тогда
				
					СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";	
				    ТекДоговор = СтрокаРасшифровки.ДоговорКонтрагента;
					
				Иначе	
					
					СписокДополнительныхПараметров = "";
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Шапка.Сделка) Тогда
					СписокДополнительныхПараметров = СписокДополнительныхПараметров + "Сделка,";
				КонецЕсли;
				
				МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,"uk");
				
				Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
					Основание = Основание + СтруктураСтроки.НазваниеПараметра + " " + СтруктураСтроки.ЗначениеПараметра + ", ";
				КонецЦикла;	
				
				
			КонецЦикла;
			
			// обрежем последнюю запятую
			Если Прав(Основание, 2) = ", " Тогда
				Основание = Сред(Основание, 1, СтрДлина(Основание) - 2);
			КонецЕсли;

		КонецЕсли;
		
		// Приложение
		// не заполняется ни в одном случае
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда

		// ПринятоОт
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "Контрагент" Тогда
			
			ПринятоОт = "";	
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
			|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо=&ФизЛицо) КАК ФИОФизЛицСрезПоследних";
			Запрос.УстановитьПараметр("Дата",?(Дата = '00010101', ОбщегоНазначения.ПолучитьРабочуюДату(), Дата));
			Запрос.УстановитьПараметр("ФизЛицо",Контрагент);

			Результат=Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда

				ПринятоОт = ?(НЕ ПустаяСтрока(Результат.Фамилия), 
							  Результат.Фамилия + ?(НЕ ПустаяСтрока(Результат.Имя)," " + Результат.Имя + " " + ?(НЕ ПустаяСтрока(Результат.Отчество),Результат.Отчество, ""), "")
							  ,"");

			КонецЕсли;
			
		КонецЕсли;
		
		// Основание
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "РасчетныйДокумент" Тогда
			
			Основание = "";	
			
			//Если ЗначениеЗаполнено(РасчетныйДокумент) Тогда
			//	
			//	НазваниеДокумента = "";
			//	Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
			//		НазваниеДокумента = "Видатковий касовий ордер";		
			//	КонецЕсли;
			//	
			//	Основание = НазваниеДокумента + " № " + ОбщегоНазначения.ПолучитьНомерНаПечать(РасчетныйДокумент) + " від " + Формат(РасчетныйДокумент.Дата, "ДФ=dd.MM.yyyy");
			//	
			//КонецЕсли;			
			
		КонецЕсли;		
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
		
		// ПринятоОт
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "СчетОрганизации" Тогда
			
			ПринятоОт = "";	
			Если Не СчетОрганизации.Пустая() Тогда
			
				ПринятоОт = "р/р " + СчетОрганизации.НомерСчета + " у " + СчетОрганизации.Банк;
			
			КонецЕсли; 
			
		КонецЕсли;
		
		// Основание
		Если    ЧтоИзменилось = "ВидОперации"  
			ИЛИ ЧтоИзменилось = "ДенежныйЧек" Тогда
			
			Основание = "";	
			//Если Не ДенежныйЧек.Пустая() Тогда
			//
			//	Основание = "Чек № " + ОбщегоНазначения.ПолучитьНомерНаПечать(ДенежныйЧек) + " від " + Формат(ДенежныйЧек.Дата, "ДФ=dd.MM.yyyy");
			//	
			//КонецЕсли; 
			
		КонецЕсли;		
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
		
		// ПринятоОт
		Если    ЧтоИзменилось = "ВидОперации" Тогда
			
			ПринятоОт = "";	
			
		КонецЕсли;
		
		// Основание
		Если    ЧтоИзменилось = "ВидОперации" Тогда
			
			Основание = "";	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли


Функция НаОснованииЗаказаПокупателя(Основание,мСуммаПлатежа,мКасса="",СодержаниеОснование="")Экспорт
 	
	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

	#Если Клиент Тогда
    Дата = РабочаяДата;
	#КонецЕсли
	ВалютаДокумента = ?(НЕ Касса.ВалютаДенежныхСредств.Пустая(),Касса.ВалютаДенежныхСредств,мВалютаРегламентированногоУчета);
	
	Если ДоговорКонтрагента.Внешнеэкономический Тогда
		ВалютаДокумента  = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	СписокПолей = новый СписокЗначений;
	СписокПолей.Добавить("ВалютаДенежныхСредств");
	
	Касса = мКасса; // каса задана
    	
	Если НЕ ЗначениеЗаполнено(Касса) Тогда 	
		Касса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяКасса");
	КонецЕсли;
	
	
	СчетКасса       = ?(ВалютаДокумента=мВалютаРегламентированногоУчета,ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте,ПланыСчетов.Хозрасчетный.КассаВИностраннойВалюте); 

	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
	
	Оплачено = Истина;

	ДокументОснование = Основание.Ссылка;
	СпособЗаполнения  = "Не заполнять";

		ВидОперации  = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		Контрагент   = Основание.Контрагент;
		Содержание = СодержаниеОснование;
		
		//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И Основание.Проведен  Тогда
		//	СпособЗаполнения = "По заказу";
		//Иначе
		//	СпособЗаполнения = "По сумме документа";
		//КонецЕсли;

		ДоговорКонтрагента   = Основание.ДоговорКонтрагента;
		СтатьяДвиженияДенежныхСредств = ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
		
		РасшифровкаПлатежа.Очистить();
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);//Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(мСуммаПлатежа); 
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтатьяДвиженияДенежныхСредств,"СтатьяДвиженияДенежныхСредств");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Основание.Организация, 
		                                                Основание.Контрагент, Основание.ДоговорКонтрагента);
		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетРасчетовПокупателя, "СчетУчетаРасчетовСКонтрагентом") ;
		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетАвансовПокупателя,  "СчетУчетаРасчетовПоАвансам") ;
		
		Сделка = Неопределено;
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"))
			И (ТаблицаПлатежей[0].ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ ТаблицаПлатежей[0].ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Сделка=Основание;
			Иначе
				Сделка=Основание.ЗаказПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") И ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			Сделка=Основание;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			Сделка=Основание.ЗаказПокупателя;
						
			//заполняем заказ покупателя из табличной части
			
			   
			
				СтрокаТЧ = ТаблицаПлатежей.Найти(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
				СтрокаТЧ.Сделка = Сделка;
				
					НоваяСтрока = ТаблицаПлатежей.Добавить();
					ТаблицаПлатежей.Очистить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 
					
					НоваяСтрока.Сделка       = Основание;
					НоваяСтрока.СуммаПлатежа =  мСуммаПлатежа;////ВыборкаСделка.Сумма;
					НоваяСтрока.СуммаНДС     = 0;
					
					СтрокаТЧ.СуммаПлатежа = СтрокаТЧ.СуммаПлатежа - НоваяСтрока.СуммаПлатежа;
					СтрокаТЧ.СуммаНДС 	  = СтрокаТЧ.СуммаНДС 	  - НоваяСтрока.СуммаНДС;
				
								
				Если СтрокаТЧ.СуммаПлатежа <= 0 Тогда
					ТаблицаПлатежей.Удалить(СтрокаТЧ);
				КонецЕсли;
				
			
			СпособЗаполнения = "Не заполнять";
			
		КонецЕсли;
		
		Если НЕ СпособЗаполнения = "Не заполнять" Тогда
		
			ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");	
		    
		КонецЕсли;
		ТаблицаПлатежей.ЗаполнитьЗначения(мСуммаПлатежа,"СуммаВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(мСуммаПлатежа,"СуммаПлатежа");
		
		Если ТипЗнч(Основание)= ТИп("ДокументСсылка.ЗаказПокупателя") ИЛИ ТипЗнч(Основание)= ТИп("ДокументОбъект.ЗаказПокупателя") Тогда
	    	ТаблицаПлатежей.ЗаполнитьЗначения(Основание.Ссылка,"Сделка");
			Реал = Документы.ЗаказПокупателя.РеализацияЗаказаСсылка(Основание.Ссылка);
			ТаблицаПлатежей.ЗаполнитьЗначения(Реал,"ДокументРасчетовСКонтрагентом");
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.Ссылка,"ДокументРасчетовСКонтрагентом");
		КонецЕсли;
		
		

		//ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		
		СуммаДокумента = мСуммаПлатежа;//РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Если СокрЛП(Ответственный) = "" Тогда 
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		Возврат ЭтотОбъект.Ссылка;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) Экспорт

	КурсДокумента=?(КурсДокумента=0,1, КурсДокумента);
	КратностьДокумента=?(КратностьДокумента=0,1, КратностьДокумента);
	
	Если Не СтрокаПлатеж=Неопределено Тогда
		СтрокаПлатеж.КурсВзаиморасчетов=?(СтрокаПлатеж.КурсВзаиморасчетов=0,1,СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов=?(СтрокаПлатеж.КратностьВзаиморасчетов=0,1,СтрокаПлатеж.КратностьВзаиморасчетов);
	КонецЕсли;

КонецПроцедуры // ПроверкаКурсовВалют()

Процедура ПересчитатьСуммуДокументаПриемВыручки(СтрокаПлатеж) Экспорт
	СтрокаПлатеж.СуммаПлатежа = СуммаПродаж - СуммаВозврата + СуммаРазменнойМонеты - СуммаОплатыПлатежнымиКартами - СуммаОплатыБанковскимиКредитами;
	СуммаДокумента = СтрокаПлатеж.СуммаПлатежа;
КонецПроцедуры

// Процедура выполняет заполнение суммы документа,
// по регистру "СуммыЗаказов".
//
// Параметры:
//  ДокументОснование  - документ ссылка (Заказ покупателя, Заказ поставщику).
//  ВалютаДокумента    - валюта документа (валюта регламентированного учета организаций)
//  КурсВзаиморасчетов - курс взаиморасчетов по договору
//  КратностьВзаиморасчетов - кратность взаиморасчетов по договору
//
Процедура ЗаполнитьПоЗаказуУпр(СтрокаПлатеж)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);

	Запрос.Текст ="ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.Сделка Как Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(, Сделка = &Заказ) КАК РасчетыСКонтрагентамиОстатки";
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.Сделка=Выборка.Сделка;
		Если Выборка.Сумма > 0 Тогда
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.Сумма;
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма,
			                            СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, 
			                            ВалютаДокумента,
			                            СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
			                            СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
										
			СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоЗаказуУпр()

// Процедура выполняет заполнение суммы документа,
// суммы взаиморасчетов по регистру "ВзаиморасчетыСПодотчетнымиЛицами".
//
Процедура ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодОтчетник", Контрагент);
	Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетовРаботника", ВалютаВзаиморасчетовРаботника);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммаВзаиморасчетовОстаток КАК СуммаДолга // в валюте взаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(,
	|	                                                          ФизЛицо = &ПодОтчетник
	|	                                                        И РасчетныйДокумент = &РасчетныйДокумент
	|	                                                        И Валюта = &ВалютаВзаиморасчетовРаботника)
	|ГДЕ
	|	СуммаВзаиморасчетовОстаток > 0
	|";
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.СуммаДолга;
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, 
						ВалютаВзаиморасчетовРаботника, ВалютаДокумента,
						СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
						СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
						
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр()

// Процедура выполняет заполнение суммы документа по регистру "РозничнаяВыручкаКомпании".
//
// Параметры:
//  КассаККМ - ссылка на справочник "Кассы ККМ".
//
Процедура ЗаполнитьПоРозничнойВыручкеУпр(СтрокаПлатеж)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РозничнаяТочка", Контрагент);
	СписокЗнач = Новый СписокЗначений;
	
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	ОтчетККМОПродажахТовары.СтавкаНДС,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА ОтчетККМОПродажахТовары.СуммаНДС > 0
	              	|				ТОГДА ОтчетККМОПродажахТовары.СуммаНДС
	              	|			ИНАЧЕ 0
	              	|		КОНЕЦ) КАК СуммаНДСПродаж,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА ОтчетККМОПродажахТовары.Сумма > 0
	              	|				ТОГДА ОтчетККМОПродажахТовары.Сумма + ВЫБОР
	              	|						КОГДА ОтчетККМОПродажахТовары.Ссылка.СуммаВключаетНДС
	              	|							ТОГДА 0
	              	|						ИНАЧЕ ОтчетККМОПродажахТовары.СуммаНДС
	              	|					КОНЕЦ
	              	|			ИНАЧЕ 0
	              	|		КОНЕЦ) КАК СуммаПродаж,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА ОтчетККМОПродажахТовары.СуммаНДС < 0
	              	|				ТОГДА ОтчетККМОПродажахТовары.СуммаНДС
	              	|			ИНАЧЕ 0
	              	|		КОНЕЦ) КАК СуммаНДСВозвратов,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА ОтчетККМОПродажахТовары.Сумма < 0
	              	|				ТОГДА ОтчетККМОПродажахТовары.Сумма + ВЫБОР
	              	|						КОГДА ОтчетККМОПродажахТовары.Ссылка.СуммаВключаетНДС
	              	|							ТОГДА 0
	              	|						ИНАЧЕ ОтчетККМОПродажахТовары.СуммаНДС
	              	|					КОНЕЦ
	              	|			ИНАЧЕ 0
	              	|		КОНЕЦ) КАК СуммаВозвратов,
	              	|	ВЫБОР
	              	|		КОГДА ОтчетККМОПродажахТовары.СтавкаНДС = &НДС20
	              	|			ТОГДА &СтатьяКнигиПродажНДС20
	              	|		КОГДА ОтчетККМОПродажахТовары.СтавкаНДС = &НДС0
	              	|			ТОГДА &СтатьяКнигиПродажНДС0
	              	|		КОГДА ОтчетККМОПродажахТовары.СтавкаНДС = &НеНДС
	              	|			ТОГДА &СтатьяКнигиПродажНеНДС
	              	|		КОГДА ОтчетККМОПродажахТовары.СтавкаНДС = &БезНДС
	              	|			ТОГДА &СтатьяКнигиПродажБезНДС
	              	|		ИНАЧЕ &СтатьяКнигиПродажПустая
	              	|	КОНЕЦ КАК СтатьяКнигиПродаж
	              	|ИЗ
	              	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетККМОПродажахТовары
	              	|ГДЕ
	              	|	ОтчетККМОПродажахТовары.Ссылка = &ДокОснование
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	ОтчетККМОПродажахТовары.СтавкаНДС
	              	|ИТОГИ
	              	|	СУММА(СуммаПродаж),
	              	|	СУММА(СуммаВозвратов)
	              	|ПО
	              	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НДС20",Перечисления.СтавкиНДС.НДС20);
	Запрос.УстановитьПараметр("СтатьяКнигиПродажНДС20",Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20);
	Запрос.УстановитьПараметр("НДС0",Перечисления.СтавкиНДС.НДС0);
	Запрос.УстановитьПараметр("СтатьяКнигиПродажНДС0",Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Другие);
	Запрос.УстановитьПараметр("БезНДС",Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("СтатьяКнигиПродажБезНДС",Справочники.СтатьиНалоговыхДеклараций.НДС_НООсвобожден);
	Запрос.УстановитьПараметр("НеНДС",Перечисления.СтавкиНДС.НеНДС);
	Запрос.УстановитьПараметр("СтатьяКнигиПродажНеНДС",Справочники.СтатьиНалоговыхДеклараций.НДС_НОНеОбъектНалог);
	Запрос.УстановитьПараметр("СтатьяКнигиПродажПустая",Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка());				
	Запрос.УстановитьПараметр("ДокОснование", ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоВсемПродажамВозвратам = "";
	СуммаПродажПоОснованию		= 0;
	СуммаВозвратовПоОснованию	= 0;
	СуммаРазменнойМонеты		= 0;
	СуммаОплатыБанковскимиКредитами	= 0;
	СуммаОплатыПлатежнымиКартами	= 0;
	
	ОбщиеСуммыПродажВозвратов	= Новый Соответствие();	
	Если Выборка.Следующий() Тогда
		// Итоги общие
		СуммаПродажПоОснованию		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаПродаж,	мВалютаРегламентированногоУчета, ВалютаДокумента, 1, КурсДокумента, 1, КратностьДокумента);
		СуммаВозвратовПоОснованию	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаВозвратов,мВалютаРегламентированногоУчета, ВалютаДокумента, 1, КурсДокумента, 1, КратностьДокумента);
		// Детализация по ставкам НДС
		ВыборкаПоВсемПродажамВозвратам = Выборка.Выбрать();
	Иначе
		ВыборкаПоВсемПродажамВозвратам = Неопределено;
	КонецЕсли;
	
	СуммаОплатаПлатежнымиКартамиПоОснованию	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ДокументОснование.ОплатаПлатежнымиКартами.Итог("Сумма"),мВалютаРегламентированногоУчета, ВалютаДокумента, 1, КурсДокумента, 1, КратностьДокумента);
	СуммаОплатаБанковскимиКредитамиПоОснованию	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ДокументОснование.ОплатаБанковскимиКредитами.Итог("Сумма"),мВалютаРегламентированногоУчета, ВалютаДокумента, 1, КурсДокумента, 1, КратностьДокумента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РозничнаяВыручкаОстаткиИОбороты.ВидРозничнойВыручки,
	|	СУММА(РозничнаяВыручкаОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.РозничнаяВыручка.ОстаткиИОбороты(
	|		,
	|		,
	|		,
	|		,
	|		РозничнаяТочка = &РозничнаяТочка
	|			И ВидРозничнойВыручки В (&ВидРозничнойВыручки)) КАК РозничнаяВыручкаОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РозничнаяВыручкаОстаткиИОбороты.ВидРозничнойВыручки";
	
	СписокЗнач = Новый СписокЗначений();
	СписокЗнач.Добавить(Перечисления.ВидыРозничнойВыручки.Продажа);
	СписокЗнач.Добавить(Перечисления.ВидыРозничнойВыручки.Возврат);
	СписокЗнач.Добавить(Перечисления.ВидыРозничнойВыручки.РазменнаяМонета);
	СписокЗнач.Добавить(Перечисления.ВидыРозничнойВыручки.ОплатаБанковскимиКредитами);
	СписокЗнач.Добавить(Перечисления.ВидыРозничнойВыручки.ОплатаПлатежнымиКартами);
	Запрос.УстановитьПараметр("ВидРозничнойВыручки", СписокЗнач);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если (Выборка.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.Возврат) Тогда
			СуммаВозврата = Мин(-МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаКонечныйОстаток,
									мВалютаРегламентированногоУчета, ВалютаДокумента,
									1, КурсДокумента, 1, КратностьДокумента),
								-СуммаВозвратовПоОснованию);

		ИначеЕсли (Выборка.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.Продажа) Тогда
			СуммаПоОснованиюПродажи = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ОбщиеСуммыПродажВозвратов[Выборка.ВидРозничнойВыручки],  мВалютаРегламентированногоУчета, ВалютаДокумента, 1, КурсДокумента, 1, КратностьДокумента);
			СуммаПродаж = Мин(МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаКонечныйОстаток,
									мВалютаРегламентированногоУчета, ВалютаДокумента,
									1, КурсДокумента, 1, КратностьДокумента),
								СуммаПродажПоОснованию);
		ИначеЕсли (Выборка.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.РазменнаяМонета) Тогда	
			СуммаРазменнойМонеты = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаКонечныйОстаток,
									мВалютаРегламентированногоУчета, ВалютаДокумента,
									1, КурсДокумента, 1, КратностьДокумента);			
		ИначеЕсли (Выборка.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.ОплатаБанковскимиКредитами) Тогда	
			СуммаОплатыБанковскимиКредитами = МИН(- МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаКонечныйОстаток,
														мВалютаРегламентированногоУчета, ВалютаДокумента,
														1, КурсДокумента, 1, КратностьДокумента),
												   СуммаОплатаБанковскимиКредитамиПоОснованию);			
		ИначеЕсли (Выборка.ВидРозничнойВыручки = Перечисления.ВидыРозничнойВыручки.ОплатаПлатежнымиКартами) Тогда	
			СуммаОплатыПлатежнымиКартами = МИН(- МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаКонечныйОстаток,
													мВалютаРегламентированногоУчета, ВалютаДокумента,
													1, КурсДокумента, 1, КратностьДокумента),
												СуммаОплатаПлатежнымиКартамиПоОснованию);			
		КонецЕсли
	КонецЦикла;
	
	Если (ВыборкаПоВсемПродажамВозвратам <> Неопределено)
	   И (СуммаПродаж = СуммаПродажПоОснованию) И (-СуммаВозврата = СуммаВозвратовПоОснованию) Тогда
		Пока ВыборкаПоВсемПродажамВозвратам.Следующий() Цикл
			Если ВыборкаПоВсемПродажамВозвратам.СуммаПродаж <> 0 Тогда
				СтрокаРозничнойВыручки = ПриемРозничнойВыручки.Добавить();
				СтрокаРозничнойВыручки.СтавкаНДС = ВыборкаПоВсемПродажамВозвратам.СтавкаНДС;
				СтрокаРозничнойВыручки.Сумма	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ВыборкаПоВсемПродажамВозвратам.СуммаПродаж, мВалютаРегламентированногоУчета, ВалютаДокумента,
				1, КурсДокумента, 1, КратностьДокумента);
				СтрокаРозничнойВыручки.Возврат = Ложь;
				СтрокаРозничнойВыручки.СуммаНДС = ВыборкаПоВсемПродажамВозвратам.СуммаНДСПродаж;
				СтрокаРозничнойВыручки.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;
			КонецЕсли;
			Если ВыборкаПоВсемПродажамВозвратам.СуммаВозвратов <> 0 Тогда
				СтрокаРозничнойВыручки = ПриемРозничнойВыручки.Добавить();
				СтрокаРозничнойВыручки.СтавкаНДС = ВыборкаПоВсемПродажамВозвратам.СтавкаНДС;
				СтрокаРозничнойВыручки.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(-ВыборкаПоВсемПродажамВозвратам.СуммаВозвратов, мВалютаРегламентированногоУчета, ВалютаДокумента,
				1, КурсДокумента, 1, КратностьДокумента);
				СтрокаРозничнойВыручки.Возврат = Истина;
				СтрокаРозничнойВыручки.СуммаНДС = -ВыборкаПоВсемПродажамВозвратам.СуммаНДСВозвратов;
				СтрокаРозничнойВыручки.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПересчитатьСуммуДокументаПриемВыручки(СтрокаПлатеж);

	СуммаДокумента = СтрокаПлатеж.СуммаПлатежа;
		
КонецПроцедуры // ЗаполнитьПоРозничнойВыручкеУпр()

Процедура ЗаполнитьПоСуммеДокументаУпр(СтрокаПлатеж, фСуммаВознаграждения)
	
	СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОснование.ВалютаДокумента, ДокументОснование.Дата);
	КурсОснования=СтруктураКурсаОснования.Курс;
	КратностьОснования=СтруктураКурсаОснования.Кратность;

	ОснованиеСуммаДокумента  = ДокументОснование.СуммаДокумента;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		Если Основание.УдержатьКомиссионноеВознаграждение = Истина И фСуммаВознаграждения = ЛОЖЬ Тогда
			Если СтрокаПлатеж.СуммаПлатежа>Основание.СуммаВознаграждения Тогда
				СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаПлатежа - Основание.СуммаВознаграждения;
				фСуммаВознаграждения = ИСТИНА;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, ДокументОснование.ВалютаДокумента, ДокументОснование.ДоговорКонтрагента.ВалютаВзаиморасчетов,
									 КурсОснования, ДокументОснование.КурсВзаиморасчетов, КратностьОснования, ДокументОснование.КратностьВзаиморасчетов);
	СуммаДокумента      = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ВалютаДокумента, ДокументОснование.КурсВзаиморасчетов,
									 КурсДокумента, ДокументОснование.КратностьВзаиморасчетов,КратностьДокумента);
	СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
	
КонецПроцедуры

Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина) Экспорт

	Если НЕ (ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами)Тогда

		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком тогда
			
            Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
				
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется 				= СчетаУчета.Амортизируется;
						
		Иначе
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
			
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
			
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
						
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует структуру полей, обязательных для заполнения при отражении операции во 
// взаиморасчетах
// Возвращаемое значение:
//   СтруктурахПолей   – структура для проверки
//
Функция СтруктураОбязательныхПолейРасчеты()

	Если ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком ИЛИ
		 ВидОперации=Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда

		 СтруктураПолей= Новый Структура("Организация,Касса,
	                        |Контрагент, СуммаДокумента");

	ИначеЕсли ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
		СтруктураПолей = Новый Структура("Организация,Касса,Контрагент,
	                        |ВалютаВзаиморасчетовРаботника, СуммаДокумента");
	Иначе
		СтруктураПолей= Новый Структура("Организация,Касса");
	КонецЕсли;

	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейОплата()

// Проверяет значение, необходимое при проведении
Процедура ПроверитьЗначение(Значение, Отказ, Заголовок, ИмяРеквизита)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда 
		
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита """+ИмяРеквизита+"""",Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗначение()

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧ(Отказ, Заголовок)
	
	Для Каждого Платеж Из РасшифровкаПлатежа Цикл
		
		ПроверитьЗначение(Платеж.ДоговорКонтрагента,Отказ, Заголовок,"Договор");
		ПроверитьЗначение(Платеж.СуммаВзаиморасчетов,Отказ, Заголовок,"Сумма взаиморасчетов");
		
		Если Не Отказ Тогда
			
			// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
			Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Заказ покупателя","Заказ поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);
				
				Если Отказ Тогда
				
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по заказам""! 
					|Заполните поле """+ТекстСделка+"""!");
					
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Счет покупателя","Счет поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);

				Если Отказ Тогда
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по счетам""! 
					|Заполните поле """+ТекстСделка+"""!");
				КонецЕсли;
						
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Организация) 
				И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧ

// Формирует движения по регистрам
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	ДвиженияПоРегистрамУпр(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);

	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	КонецЕсли; 
	
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Режим, Отказ, Заголовок);

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамУпр(Режим, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыПоКредитам",     ЕстьРасчетыПоКредитам);
	мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКасса",       Касса);
	мСтруктураПараметровДенежныхСредств.Вставить("ДатаДвижений",              Дата);
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
		мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКассаОтправитель", СчетОрганизации);
		мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредствОтправитель",  Перечисления.ВидыДенежныхСредств.Безналичные);
		ПоДенежномуЧеку = НЕ ДенежныйЧек.Пустая();
		мСтруктураПараметровДенежныхСредств.Вставить("ПоДенежномуЧеку", ПоДенежномуЧеку);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда	
		мСтруктураПараметровДенежныхСредств.Вставить("ВидПриемаРозничнойВыручки",	 ВидПриемаРозничнойВыручки);
		мСтруктураПараметровДенежныхСредств.Вставить("ПриемРозничнойВыручки",	 	 ПриемРозничнойВыручки.Выгрузить());
		мСтруктураПараметровДенежныхСредств.Вставить("РазделятьПоСтавкамНДС",	 	 мРазделятьПоСтавкамНДС);
		мСтруктураПараметровДенежныхСредств.Вставить("СуммаПродаж",	 	 			 СуммаПродаж);
		мСтруктураПараметровДенежныхСредств.Вставить("СуммаВозврата",	 	 		 СуммаВозврата);
		мСтруктураПараметровДенежныхСредств.Вставить("СуммаРазменнойМонеты",	 	 СуммаРазменнойМонеты);
		мСтруктураПараметровДенежныхСредств.Вставить("СуммаОплатыБанковскимиКредитами",	 	 СуммаОплатыБанковскимиКредитами);
		мСтруктураПараметровДенежныхСредств.Вставить("СуммаОплатыПлатежнымиКартами",	 	 СуммаОплатыПлатежнымиКартами);
		мСтруктураПараметровДенежныхСредств.Вставить("Проект",	 	 				 РасшифровкаПлатежа[0].Проект);
		мСтруктураПараметровДенежныхСредств.Вставить("Подразделение",	 	 		 Подразделение);
	КонецЕсли;
	
	УправлениеДенежнымиСредствами.ПровестиПоступлениеДенежныхСредствУпр(
		СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок);
		
	// По регистрам взаиморасчетов отражаются безналичные расчеты
	Если  ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка
		И ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ
		И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Склады")
		И Контрагент.СуммовойУчет Тогда

		Если СуммаОплатыПлатежнымиКартами<>0 ИЛИ СуммаОплатыБанковскимиКредитами<>0 Тогда
		
			НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыСКонтрагентами;
			ТаблицаВзаиморасчеты      = НаборЗаписейВзаиморасчеты.ВыгрузитьКолонки();
			НаборЗаписейРасчеты       = Движения.РасчетыСКонтрагентами;
			ТаблицаРасчеты            = НаборЗаписейРасчеты.ВыгрузитьКолонки();
		
			// Взаиморасчеты с эквайрером
			ВалютаУправленческогоУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");
			СтруктураКурсВалютыУправленческогоУчета = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, Дата);
			
			СуммаВзаиморасчетовПоКартам = СуммаОплатыПлатежнымиКартами;
			
			Если СуммаВзаиморасчетовПоКартам <> 0 Тогда
				
				СуммаУпрПоКартам = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
					СуммаВзаиморасчетовПоКартам, 
					мВалютаРегламентированногоУчета, ВалютаУправленческогоУчета,
					1, СтруктураКурсВалютыУправленческогоУчета.Курс,	
					1, СтруктураКурсВалютыУправленческогоУчета.Кратность);
				
				СтрокаВзаиморасчеты = ТаблицаВзаиморасчеты.Добавить();
				
				СтрокаВзаиморасчеты.ДоговорКонтрагента  = ДоговорКонтрагента;
				СтрокаВзаиморасчеты.Контрагент          = Эквайрер;
				СтрокаВзаиморасчеты.Организация         = Организация;
				СтрокаВзаиморасчеты.Сделка              = Неопределено;
				СтрокаВзаиморасчеты.СуммаВзаиморасчетов = СуммаВзаиморасчетовПоКартам;
				СтрокаВзаиморасчеты.СуммаУпр            = СуммаУпрПоКартам;
				
				СтрокаРасчеты = ТаблицаРасчеты.Добавить();
				
				СтрокаРасчеты.ДоговорКонтрагента  = ДоговорКонтрагента;
				СтрокаРасчеты.Контрагент  		  = Эквайрер;
				СтрокаРасчеты.Организация  	      = Организация;
				СтрокаРасчеты.Сделка              = Неопределено;
				СтрокаРасчеты.РасчетыВозврат      = Перечисления.РасчетыВозврат.Расчеты;
				СтрокаРасчеты.СуммаВзаиморасчетов = СуммаВзаиморасчетовПоКартам;
				СтрокаРасчеты.СуммаУпр            = СуммаУпрПоКартам;
				
			КонецЕсли;
			
			// Взаиморасчеты с банками по кредитам
			
			Для каждого СтрокаКредита Из ОплатаБанковскимиКредитами Цикл
			
				СуммаУпрПоКредиту = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
					СтрокаКредита.Сумма, 
					мВалютаРегламентированногоУчета, ВалютаУправленческогоУчета,
					1, СтруктураКурсВалютыУправленческогоУчета.Курс,	
					1, СтруктураКурсВалютыУправленческогоУчета.Кратность);
				
				СтрокаВзаиморасчеты = ТаблицаВзаиморасчеты.Добавить();
				
				СтрокаВзаиморасчеты.ДоговорКонтрагента  = СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора;
				СтрокаВзаиморасчеты.Контрагент          = СтрокаКредита.БанкКредитор;
				СтрокаВзаиморасчеты.Организация         = Организация;
				СтрокаВзаиморасчеты.Сделка              = Неопределено;
				СтрокаВзаиморасчеты.СуммаВзаиморасчетов = СтрокаКредита.Сумма;
				СтрокаВзаиморасчеты.СуммаУпр            = СуммаУпрПоКредиту;
				
				СтрокаРасчеты = ТаблицаРасчеты.Добавить();
				
				СтрокаРасчеты.ДоговорКонтрагента  = СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора;
				СтрокаРасчеты.Контрагент  		  = СтрокаКредита.БанкКредитор;
				СтрокаРасчеты.Организация  	      = Организация;
				СтрокаРасчеты.Сделка              = Неопределено;
				СтрокаРасчеты.РасчетыВозврат      = Перечисления.РасчетыВозврат.Расчеты;
				СтрокаРасчеты.СуммаВзаиморасчетов = СтрокаКредита.Сумма;
				СтрокаРасчеты.СуммаУпр            = СуммаУпрПоКредиту;
				
			КонецЦикла;
				
			НаборЗаписейВзаиморасчеты.мПериод            = Дата;
			НаборЗаписейВзаиморасчеты.мТаблицаДвижений   = ТаблицаВзаиморасчеты;
				
			Если Не Отказ Тогда
				НаборЗаписейВзаиморасчеты.ВыполнитьПриход();
			КонецЕсли;
				
			НаборЗаписейРасчеты.мПериод            = Дата;
			НаборЗаписейРасчеты.мТаблицаДвижений   = ТаблицаРасчеты;
				
			Если Не Отказ Тогда
				НаборЗаписейРасчеты.ВыполнитьПриход();
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ (Оплачено И ОтражатьВУправленческомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	Иначе
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, Дата, "РасшифровкаПлатежа", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРаспределениюОплат(СтруктураШапкиДокумента)
	
	СчетКт       = ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
	СчетНаличные = СтруктураШапкиДокумента.СчетКасса;
	ПроводкиБУ   = Движения.Хозрасчетный;
	ДатаДока     = Дата;
	
    // Взаиморасчеты с эквайрером
    Если СуммаОплатыПлатежнымиКартами <> 0 Тогда
    		
    	Проводка = ПроводкиБУ.Добавить();
    	
        Проводка.Период      = ДатаДока;
    	Проводка.Организация = СтруктураШапкиДокумента.Организация;
    	Проводка.Сумма       = СуммаОплатыПлатежнымиКартами;
    	Проводка.Содержание  = "Оплата платежными картами";
    	
    	Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаРасчетовСЭквайрером;
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Эквайрер);
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДоговорКонтрагента);
        
        Проводка.СчетКт       =  СчетКт;
    	
    КонецЕсли;
	
    // Взаиморасчеты с банками по кредитам
	
	ТаблицаПоБанковскимКредитам = ОплатаБанковскимиКредитами.Выгрузить();
	
    Для каждого СтрокаКредита Из ТаблицаПоБанковскимКредитам Цикл
    	
    	Проводка = ПроводкиБУ.Добавить();
    	
        Проводка.Период      = ДатаДока;
    	Проводка.Организация = СтруктураШапкиДокумента.Организация;
    	Проводка.Сумма       = СтрокаКредита.Сумма;
    	Проводка.Содержание  = "Оплата банковским кредитом";
    	
    	Проводка.СчетДт = СтрокаКредита.СчетУчетаРасчетовСКонтрагентом;
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаКредита.БанкКредитор);
    	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", СтрокаКредита.ДоговорВзаиморасчетовБанкаКредитора);
        
        Проводка.СчетКт       =  СчетКт;
		
    КонецЦикла;
	
	НаличнаяОплата = СуммаДокумента;
	
	Если НаличнаяОплата <> 0 Тогда
		
		Проводка = ПроводкиБУ.Добавить();
		
        Проводка.Период      = ДатаДока;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма       = НаличнаяОплата;
		Проводка.Содержание = НСтр("ru='Реализация товаров в розницу за наличную оплату';uk='Реалізація товарів у роздріб за готівкову оплату'");
		
		Проводка.СчетДт = СчетНаличные;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", СтруктураШапкиДокумента.СтатьяДвиженияДенежныхСредств);
		Если мУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", Касса.ОбособленноеПодразделение);
		КонецЕсли;
		
		Проводка.СчетКт = СчетКт;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, РежимПроведения, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.Оплачено Тогда
		Возврат;
	Конецесли;
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// Бухгалтерские проводки документа

	ПроводкиБУ         = Движения.Хозрасчетный;
	ПроводкиНУ         = Движения.Налоговый;

	ВалютаРег          = мВалютаРегламентированногоУчета;
	ДанныеОВалюте      = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРег, СтруктураШапкиДокумента.ДатаОплаты);

	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	КассаВВалюте       = СчетКасса.Валютный;
	СчетДт             = СчетКасса;

	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда

		СтруктураШапкиДокумента.Вставить("КоррСчет",СчетДт);

		Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,ЕстьРасчетыСКонтрагентами,Отказ,Заголовок,?(ЕстьРасчетыПоКредитам,"Расчеты по кредитам и займам",""))=Ложь тогда
			Возврат;
		КонецЕсли;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		
		ВыручкаСНТТ = (ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ)
					И (ТипЗнч(Контрагент) = Тип("СправочникСсылка.Склады")) 
					И Контрагент.СуммовойУчет;
					
		Если ВыручкаСНТТ И (СуммаОплатыБанковскимиКредитами <> 0 ИЛИ СуммаОплатыПлатежнымиКартами<>0) Тогда
			СчетДт = ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
		КонецЕсли;
		
		СуммаБезналичныхОплат = СуммаОплатыБанковскимиКредитами + СуммаОплатыПлатежнымиКартами;
		
		Для Каждого Строка Из ПриемРозничнойВыручки Цикл
				
			// Запишем проводки по выручке
			Если НЕ Строка.Возврат Тогда
				
				Если НЕ ВыручкаСНТТ И СуммаБезналичныхОплат > 0 Тогда
					
					СуммаПроводки = МАКС(0, Строка.Сумма - СуммаБезналичныхОплат);
					СуммаБезналичныхОплат = СуммаБезналичныхОплат - Строка.Сумма;
					
					Если СуммаПроводки <= 0 Тогда
						Продолжить;	
					КонецЕсли;
					
				Иначе
					
					СуммаПроводки = Строка.Сумма;	
					
				КонецЕсли;
				
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.ДатаОплаты;
				Проводка.Организация = Организация;
				Проводка.Содержание  = "Оприходована выручка из розничной торговли";
						
				Проводка.СчетДт      = СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
				Если мУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", Касса.ОбособленноеПодразделение);
				КонецЕсли;

				Если ВыручкаСНТТ Тогда
						
					// берем все из схемы реализации
					Проводка.СчетКт      = Строка.СхемаРеализации.СчетДоходов;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Строка.СхемаРеализации.СубконтоДоходов1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Строка.СхемаРеализации.СубконтоДоходов2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Строка.СхемаРеализации.СубконтоДоходов3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
					
				Иначе
						
					Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом; // он же - счет доходов
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов",  СтатьяДоходов);
						
				КонецЕсли; 
						
				Проводка.Сумма       = СуммаПроводки;
				
				Если ВыручкаСНТТ
				   И мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
					
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначениеДоходовИЗатрат;
					
					Если НЕ Строка.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
				
				КонецЕсли;
						
			Иначе
						
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.ДатаОплаты;
				Проводка.Организация = Организация;
				Проводка.Содержание  = "Оприходована выручка из розничной торговли (возврат)";
						
				Если ВыручкаСНТТ Тогда
					// берем все из схемы реализации
					Проводка.СчетДт      = Строка.СхемаРеализации.СчетВычетовИзДоходов;
						
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.СхемаРеализации.СубконтоВычетовИзДоходов1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.СхемаРеализации.СубконтоВычетовИзДоходов2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоВычетовИзДоходов3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
						
				Иначе
					Проводка.СчетДт      = СчетВычетаИзДоходовРозничныхПродаж;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  СтатьяДоходов);
				КонецЕсли;
						
				Проводка.СчетКт      = СчетДт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
				Если мУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", Касса.ОбособленноеПодразделение);
				КонецЕсли;
	
				Проводка.Сумма       = Строка.Сумма;
						
				Если ВыручкаСНТТ
				   И мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат;
					
					Если НЕ Строка.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда					
						Проводка.СуммаНУДт = Проводка.Сумма;					
					КонецЕсли;
				
				КонецЕсли;
					
			КонецЕсли; 
			
			//отражение продажи товаров  (как при реализации)
			//списание товаров по продажным ценам
			Если ВыручкаСНТТ Тогда
			
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.ДатаОплаты;
				Проводка.Организация = Организация;
				Если Строка.Возврат Тогда
					Проводка.Содержание  = "Отражен возврат товаров";
					
					Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимостиПриВозврате;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.СхемаРеализации.СубконтоСебестоимостиПриВозврате1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.СхемаРеализации.СубконтоСебестоимостиПриВозврате2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоСебестоимостиПриВозврате3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
					
				Иначе
					Проводка.Содержание  = "Отражена продажа товаров";
					
					Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимости;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.СхемаРеализации.СубконтоСебестоимости1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.СхемаРеализации.СубконтоСебестоимости2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоСебестоимости3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
					
				КонецЕсли; 
									
				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.Контрагент);
									
				Проводка.Сумма       = ?(Строка.Возврат,-1,1)*Строка.Сумма;
					
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				
				Если мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат;
					Если НЕ Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если ВыручкаСНТТ И (СуммаОплатыБанковскимиКредитами <> 0 ИЛИ СуммаОплатыПлатежнымиКартами<>0) Тогда
		
			ДвиженияПоРаспределениюОплат(СтруктураШапкиДокумента);	
		
		КонецЕсли; 
					
		// проводки по НДС
		ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
		Если ВыручкаСНТТ Тогда
			ТаблицаВыручки.Свернуть("Возврат,СхемаРеализации,НоменклатурнаяГруппа,СчетУчетаНДС","СуммаНДС");
		Иначе
			ТаблицаВыручки.Свернуть("Возврат,СчетУчетаНДС","СуммаНДС");
		КонецЕсли; 
		Для Каждого СтрокаНДС из ТаблицаВыручки Цикл
					
			Если СтрокаНДС.СуммаНДС = 0 Тогда
				Продолжить;
			КонецЕсли;	
					
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = СтруктураШапкиДокумента.ДатаОплаты;
			Проводка.Активность  = Истина;
			Проводка.Организация = Организация;
			Если СтрокаНДС.Возврат = Истина Тогда
				Проводка.Содержание  = "НДС розничной выручки (возврат)";
				Проводка.Сумма       = - СтрокаНДС.СуммаНДС;
				Если ВыручкаСНТТ Тогда
					// берем все из схемы реализации
					Проводка.СчетДт      = СтрокаНДС.СхемаРеализации.СчетВычетовИзДоходов;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаНДС.СхемаРеализации.СубконтоВычетовИзДоходов1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаНДС.СхемаРеализации.СубконтоВычетовИзДоходов2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаНДС.СхемаРеализации.СубконтоВычетовИзДоходов3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаНДС.НоменклатурнаяГруппа);
						
				Иначе
					Проводка.СчетДт      = СчетВычетаИзДоходовРозничныхПродаж;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  СтатьяДоходов);
				КонецЕсли;
			Иначе
				Проводка.Содержание  = "НДС розничной выручки";
				Проводка.Сумма       = СтрокаНДС.СуммаНДС;
				Если ВыручкаСНТТ Тогда
					// берем все из схемы реализации
					Проводка.СчетДт      = СтрокаНДС.СхемаРеализации.СчетДоходов;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаНДС.СхемаРеализации.СубконтоДоходов1);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаНДС.СхемаРеализации.СубконтоДоходов2);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаНДС.СхемаРеализации.СубконтоДоходов3);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаНДС.НоменклатурнаяГруппа);
				Иначе
					Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом; // он же - счет доходов
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  СтатьяДоходов);
				КонецЕсли; 					
			КонецЕсли;
					
			Проводка.СчетКт      = СтрокаНДС.СчетУчетаНДС;
			
			Если мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат;
				Если НЕ Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
			КонецЕсли;
					
		КонецЦикла;
		
		// Двжижения по регистру ОжидаемыйИПодтвержденныйНДСПродаж
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
				
			НаборДвижений   = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
				
			ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
			ТаблицаВыручки.Свернуть("Возврат,СтавкаНДС","Сумма,СуммаНДС");					
				
			ТаблицаВыручки.Колонки.Добавить("БазаНДС", 	  ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
			ТаблицаВыручки.Колонки.Добавить("СобытиеНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СобытияОжидаемыйИПодтвержденныйНДСПродаж"));
			Для каждого СтрокаВыручки Из ТаблицаВыручки Цикл
					
				СтрокаВыручки.БазаНДС = СтрокаВыручки.Сумма - СтрокаВыручки.СуммаНДС;
				Если СтрокаВыручки.Возврат = Истина Тогда
					СтрокаВыручки.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.ВозвратРозница;
				Иначе
					СтрокаВыручки.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.РеализацияРозница;
				КонецЕсли;
					
			КонецЦикла; 
				
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаВыручки, ТаблицаДвижений);
				
			ТаблицаДвижений.ЗаполнитьЗначения(Организация       						    		, "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
				
			Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
					
				НаборДвижений.мПериод          = СтруктураШапкиДокумента.ДатаОплаты;
				НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
					
				Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьПриход();
				Движения.ОжидаемыйИПодтвержденныйНДСПродаж.Записать();
					
			КонецЕсли;
				
		КонецЕсли; 
		
	Иначе
		
		СтруктураШапкиДокумента.Вставить("КоррСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = СтруктураШапкиДокумента.ДатаОплаты;
		Проводка.Организация = Организация;

		Проводка.СчетДт      = СчетДт;
		Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
		Если мУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
			Проводка.СубконтоДт.ОбособленныеПодразделенияБезОбразованияЮрЛица = Касса.ОбособленноеПодразделение;	
		КонецЕсли;
		
		Если КассаВВалюте Тогда

			Проводка.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаДокумента, 
										СтруктураШапкиДокумента.ВалютаДокумента, ВалютаРег,
										КурсДокумента, ДанныеОВалюте.Курс, 
										КратностьДокумента, ДанныеОВалюте.Кратность);
		Иначе

			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;

		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда

			Если КассаВВалюте Тогда
				СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте;
			Иначе
				СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;
			КонецЕсли;

			Проводка.СчетКт     = СчетКт;
			Проводка.Содержание = "Возврат средств от подотчетника";

			Проводка.СубконтоКт.РаботникиОрганизаций = Контрагент;

		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда

			СчетКт = СчетУчетаРасчетовСКонтрагентом;

			Проводка.СчетКт     = СчетКт;
			Проводка.Содержание = "Прочие поступления";

			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СубконтоКт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,СубконтоКт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,СубконтоКт3);
		                                                                                       
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначениеПриПрочемПоступлении;
			
			Если НЕ НалоговоеНазначениеПриПрочемПоступлении = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда			
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			

		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда

			СчетКт = СчетУчетаРасчетовСКонтрагентом;

			Проводка.Содержание = "Получение наличных в банке";
			Проводка.СчетКт     = СчетКт;
			Проводка.СубконтоКт.БанковскиеСчета = СчетОрганизации;
			Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;

		КонецЕсли; // Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда

		Если КассаВВалюте Тогда
			
			Если СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			Если СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

		КонецЕсли; // Если КассаВВалюте Тогда

	КонецЕсли; // Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
	
	Если   ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда

		Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			
			Если НЕ СтрокаРасшифровки.ВозвратАвансаДо01042011НУ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПриобретение = (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ВХОДЯЩ") > 0) ИЛИ (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ПРИХОД") > 0);			
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			СуммаСторноДоходовЗатрат = - СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011;
				
			Если ЭтоПриобретение Тогда
				Проводка.СчетДт    = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
				Проводка.СчетКт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно расходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно витрат при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
					
			Иначе	
				Проводка.СчетКт    = ПланыСчетов.Хозрасчетный.ДругиеДоходыОтОбычнойДеятельности;
				Проводка.СчетДт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно доходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно доходів при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;

	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
		
		//Отдельно переоценим счет взаиморасчетов с подотчетником на сумму возврата
		Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
				
			СчетПереоценки = новый структура("Счет,Субконто1,ВалютныйОстаток",ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте,Контрагент,СуммаДокумента);
			УчетнаяПолитика	= РегистрыСведений.УчетнаяПолитикаБухгалтерскийУчет.ПолучитьПоследнее(СтруктураШапкиДокумента.ДатаОплаты, Новый Структура("Организация",СтруктураШапкиДокумента.Организация));
			СтруктураШапкиДокумента.Вставить("СчетаУчетаКР", БухгалтерскийУчет.ПараметрыУчетаКурсовыхРазниц(УчетнаяПолитика.ИспользуемыеКлассыСчетовРасходов));
			
			БухгалтерскийУчет.ПереоценкаСчетаРегл(СтруктураШапкиДокумента,ПроводкиБУ,СчетПереоценки, мВалютаРегламентированногоУчета,Истина,Истина,,Истина);
				
		КонецЕсли;	

		
	КонецЕсли; // Учет курсовых разниц

	Если (ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам или
			(ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником)) 
			и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
		НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
	ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее
		или ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка) и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
		НалоговыйУчет.ДвиженияПоЕдиномуНалогуПрочее(ЭтотОбъект,СтруктураШапкиДокумента,Отказ);	
	КонецЕсли;	
	
	Если (ЕстьРасчетыСКонтрагентами и не ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами) 
	   И СтруктураШапкиДокумента.ЕстьНДС Тогда
	
		РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
		НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
			
	КонецЕсли; 
		
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоУмолчаниюУпр()

	ОтражатьВУправленческомУчете = Истина;

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок)

	Если НЕ Оплачено Тогда
		ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолейРасчеты(), Отказ, Заголовок);	
	КонецЕсли;
	
	Если ВидОперации=Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке 
		И НЕ СчетОрганизации.ВалютаДенежныхСредств=Касса.ВалютаДенежныхСредств Тогда
			Сообщить("Не совпадают валюты банковского счета и кассы");
			Отказ=Истина;
	КонецЕсли;

	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		Сообщить(Заголовок+"
		         |не совпадают сумма документа и ее расшифровка.");                
		Отказ = Истина;
	КонецЕсли;


	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда

		ПроверитьЗаполнениеТЧ(Отказ, Заголовок);
		
		Если Не Отказ Тогда
			УправлениеДенежнымиСредствами.КонтрольОстатковПоТЧ(Дата, ТаблицаПлатежейУпр, Отказ, Заголовок,,Истина);
		КонецЕсли;
			
	ИначеЕсли ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником 
		И РасшифровкаПлатежа[0].СуммаВзаиморасчетов=0 Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Не указана сумма взаиморасчетов с физическим лицом.",Отказ, Заголовок);
		
	КонецЕсли;

	Если ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка 
		И НЕ Касса.ВалютаДенежныхСредств=мВалютаРегламентированногоУчета Тогда
		Сообщить("Прием розничной выручки производится только в валюте регламентированного учета.");
		Отказ=Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда

		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, Платеж.ДоговорКонтрагента, 
													  Платеж.ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЦикла;

	ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка) Тогда
		
		ВыручкаСНТТ = (ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ)
					И (ТипЗнч(Контрагент) = Тип("СправочникСсылка.Склады")) 
					И Контрагент.СуммовойУчет;
		
		СтруктураПолей = Новый Структура();
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураПолей.Вставить("СтавкаНДС");
			СтруктураПолей.Вставить("СчетУчетаНДС");	
		КонецЕсли;
		
		Если ВыручкаСНТТ Тогда
			//СтруктураПолей.Вставить("НоменклатурнаяГруппа");
			СтруктураПолей.Вставить("СхемаРеализации");
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				СтруктураПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
			КонецЕсли; 
			Если СтруктураШапкиДокумента.ЕстьНДС Тогда
				СтруктураПолей.Вставить("НалоговоеНазначение");
			КонецЕсли; 
			
		КонецЕсли; 
				
		УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "ПриемРозничнойВыручки", СтруктураПолей, Отказ, Заголовок);

	КонецЕсли;
	
	Если  ЕстьРасчетыСКонтрагентами 
		И НЕ ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС (неподтвержденный)!");
						
					КонецЕсли;
				КонецЕсли;
				
				Если Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС н/о (н/к)!");
						
					КонецЕсли;
				КонецЕсли;

                Если Платеж.НалоговоеНазначение.Пустая() Тогда
						
                    Отказ = истина;
						
                    Если Отказ Тогда
						
                        Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указано Налоговое назначение!");
							
                    КонецЕсли;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Платеж.СтатьяДвиженияДенежныхСредств) Тогда
						
                    Отказ = истина;
						
                    Если Отказ Тогда
						
                        Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указана Статья движения денежных средств!");
							
                    КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
        КонецЦикла; 	
        
	КонецЕсли;
		
КонецПроцедуры //ПроверитьЗаполнениеДокументаРегл()

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Режим, Заголовок)

	//Проверяем заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей.Вставить("Касса");
	СтруктураОбязательныхПолей.Вставить("СуммаДокумента","Не указана сумма по документу.");

	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		СтруктураОбязательныхПолей.Удалить("СуммаДокумента");	
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
		СтруктураОбязательныхПолей.Вставить("СчетОрганизации","Не указан банковский счет организации");
	КонецЕсли;
		
	Если Не (ВидОперации=Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке ИЛИ ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее) Тогда
		СтруктураОбязательныхПолей.Вставить("Контрагент");
	КонецЕсли;
	
	// Регл. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетКасса","Не указан счет учета денежных средств.");
		
		Если СчетКасса.Валютный Тогда
			 СтруктураОбязательныхПолей.Вставить("ВалютаДокумента","Не указана валюта документа.");
		КонецЕсли;

		Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
		КонецЕсли;
	
		Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
		КонецЕсли;
	
		Если (ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка) Тогда 
			
			ВыручкаСНТТ = (ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ)
						И (ТипЗнч(Контрагент) = Тип("СправочникСсылка.Склады")) 
						И Контрагент.СуммовойУчет;
			
			Если НЕ ВыручкаСНТТ Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет доходов.");
				СтруктураОбязательныхПолей.Вставить("СчетВычетаИзДоходовРозничныхПродаж","Не указан счет вычета из доходов.");
				СтруктураОбязательныхПолей.Вставить("СтатьяДоходов","Не указана статья доходов.");
			КонецЕсли;
		КонецЕсли;
	
		//Если ПоОбособленномуПодразделению Тогда
		//	СтруктураОбязательныхПолей.Вставить("ОбособленноеПодразделениеОрганизации","Не указано обособленное подразделение.");
		//КонецЕсли;
		
		Если (ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее)
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
		   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда

		   СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПриПрочемПоступлении","Не указано налоговое назначение!");
			
		КонецЕсли;       
		
	КонецЕсли;
	
	Если ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком ИЛИ
		 ВидОперации=Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
		 
		СтруктураОбязательныхПолей.Вставить("Ответственный");

	ИначеЕсли ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
		СтруктураОбязательныхПолей.Вставить("ВалютаВзаиморасчетовРаботника");
		СтруктураОбязательныхПолей.Вставить("Ответственный");
	КонецЕсли;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверка ТЧ
	СтруктураОбязательныхПолейТЧ = Новый Структура();
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолейТЧ.Вставить("СуммаВзаиморасчетов");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорКонтрагента");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕСли;
	КонецЕСли;
	
	УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "РасшифровкаПлатежа", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		Сообщить(Заголовок+" 
		|не совпадают сумма документа и ее расшифровка.");
		
		Отказ=Истина;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			//Проверим на возможность проведения в БУ и НУ
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(Платеж.ДоговорКонтрагента, ВалютаДокумента,
												 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
												 Ложь, Отказ, Заголовок, "", Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		КонецЦикла;
	КонецЕСли;	
	
	// Проверка ТЧ ОплатаПлатежнымиКартами
	Если  ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка
		И ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ
		И ТипЗнч("Контрагент") = Тип("СправочникСсылка.Склады")
		И Контрагент.СуммовойУчет Тогда
	
		СтруктураОбязательныхПолейТЧ = Новый Структура();
		СтруктураОбязательныхПолейТЧ.Вставить("ВидОплаты");
		СтруктураОбязательныхПолейТЧ.Вставить("Сумма");
		УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "ОплатаПлатежнымиКартами", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
		
		СтруктураПолей = Новый Структура;
		СтруктураПолей.Вставить("ВидОплаты", "ВидОплаты");
		СтруктураПолей.Вставить("ТипОплаты", "ВидОплаты.ТипОплаты");
		СтруктураПолей.Вставить("Сумма"    , "Сумма");

		ТаблицаПоПлатежнымКартам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОплатаПлатежнымиКартами", СтруктураПолей).Выгрузить();
		
		УправлениеРозничнойТорговлей.ПроверитьКорректностьТипаОплатыВТЧ(ЭтотОбъект, "ОплатаПлатежнымиКартами",
		   ТаблицаПоПлатежнымКартам, Отказ, Заголовок, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);
	
		// Проверка ТЧ ОплатаБанковскимиКредитами
		СтруктураОбязательныхПолейТЧ = Новый Структура();
		СтруктураОбязательныхПолейТЧ.Вставить("ВидОплаты");
		СтруктураОбязательныхПолейТЧ.Вставить("Сумма");
		СтруктураОбязательныхПолейТЧ.Вставить("БанкКредитор");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорВзаиморасчетовБанкаКредитора");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда  
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕсли;
		УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "ОплатаБанковскимиКредитами", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
		
		СтруктураПолей = Новый Структура;
		СтруктураПолей.Вставить("ВидОплаты"                          , "ВидОплаты");
		СтруктураПолей.Вставить("ТипОплаты"                          , "ВидОплаты.ТипОплаты");
		СтруктураПолей.Вставить("Сумма"                              , "Сумма");
		СтруктураПолей.Вставить("БанкКредитор"                       , "БанкКредитор");
		СтруктураПолей.Вставить("ДоговорВзаиморасчетовБанкаКредитора", "ДоговорВзаиморасчетовБанкаКредитора");
		СтруктураПолей.Вставить("СуммаБанковскойКомиссии"            , "СуммаБанковскойКомиссии");
		СтруктураПолей.Вставить("СчетУчетаРасчетовСКонтрагентом"	 , "СчетУчетаРасчетовСКонтрагентом");

		ТаблицаПоБанковскимКредитам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОплатаБанковскимиКредитами", СтруктураПолей).Выгрузить();
		
		УправлениеРозничнойТорговлей.ПроверитьКорректностьТипаОплатыВТЧ(ЭтотОбъект, "ОплатаБанковскимиКредитами",
		   ТаблицаПоБанковскимКредитам, Отказ, Заголовок, Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок);
	КонецЕСли;	
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕСли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СуммаПлатежа = СуммаДокумента;
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		СтруктураДействий = Новый Структура("УстановитьДоговор");
		УправлениеДенежнымиСредствами.ВыполнитьДействияПередЗаписьюПлатежногоДокумента(ЭтотОбъект, СтруктураДействий, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерОрдера) ИЛИ ЭтоНовый() Тогда
		НомерОрдера = БИАС.УстановитьНомерПриходныйОрдера(Ссылка);         
	КонецЕсли;
	
	Если НЕ мУчетнаяПолитикаНУ.ЕстьНДС Тогда
		Для каждого Строка Из ПриемРозничнойВыручки Цикл
			Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

	#Если Клиент Тогда
    Дата = РабочаяДата;
	#КонецЕсли
	ВалютаДокумента = ?(НЕ Касса.ВалютаДенежныхСредств.Пустая(),Касса.ВалютаДенежныхСредств,мВалютаРегламентированногоУчета);
	
	Если ДоговорКонтрагента.Внешнеэкономический Тогда
		ВалютаДокумента  = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Касса)
		И НЕ ВалютаДокумента = Касса.ВалютаДенежныхСредств Тогда
	    Касса = Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Касса) Тогда 
		Если ВалютаДокумента = Организация.ОсновнаяКасса.ВалютаДенежныхСредств Тогда
			Касса = Организация.ОсновнаяКасса;
		КонецЕсли;
	КонецЕсли;

	СчетКасса       = ?(ВалютаДокумента=мВалютаРегламентированногоУчета,ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте,ПланыСчетов.Хозрасчетный.КассаВИностраннойВалюте); 

	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	ДокументОснование = Основание.Ссылка;
	СпособЗаполнения  = "Не заполнять";

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") 
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда

		ВидОперации  = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		Контрагент   = Основание.Контрагент;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И Основание.Проведен  Тогда
			СпособЗаполнения = "По заказу";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;

		ДоговорКонтрагента   = Основание.ДоговорКонтрагента;
		СтатьяДвиженияДенежныхСредств = ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтатьяДвиженияДенежныхСредств,"СтатьяДвиженияДенежныхСредств");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Основание.Организация, 
		                                                Основание.Контрагент, Основание.ДоговорКонтрагента);
		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетРасчетовПокупателя, "СчетУчетаРасчетовСКонтрагентом") ;
		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетАвансовПокупателя,  "СчетУчетаРасчетовПоАвансам") ;
		
		Сделка = Неопределено;
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"))
			И (ТаблицаПлатежей[0].ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ ТаблицаПлатежей[0].ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Сделка=Основание;
			Иначе
				Сделка=Основание.ЗаказПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") И ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			Сделка=Основание;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			Сделка=Основание.ЗаказПокупателя;
						
			//заполняем заказ покупателя из табличной части
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетНаОплатуПокупателюТовары.ЗаказПокупателя,
			|	СчетНаОплатуПокупателюТовары.СтавкаНДС,
			|	СУММА(ВЫБОР
			|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.УчитыватьНДС
			|					И (НЕ СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС)
			|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
			|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДС
			|ПОМЕСТИТЬ СУММЫ
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
			|ГДЕ
			|	СчетНаОплатуПокупателюТовары.Ссылка = &СчетНаОплату
			|
			|СГРУППИРОВАТЬ ПО
			|	СчетНаОплатуПокупателюТовары.ЗаказПокупателя,
			|	СчетНаОплатуПокупателюТовары.СтавкаНДС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СчетНаОплатуПокупателУслуги.ЗаказПокупателя,
			|	СчетНаОплатуПокупателУслуги.СтавкаНДС,
			|	СУММА(ВЫБОР
			|			КОГДА СчетНаОплатуПокупателУслуги.Ссылка.УчитыватьНДС
			|					И (НЕ СчетНаОплатуПокупателУслуги.Ссылка.СуммаВключаетНДС)
			|				ТОГДА СчетНаОплатуПокупателУслуги.Сумма + СчетНаОплатуПокупателУслуги.СуммаНДС
			|			ИНАЧЕ СчетНаОплатуПокупателУслуги.Сумма
			|		КОНЕЦ),
			|	СУММА(СчетНаОплатуПокупателУслуги.СуммаНДС)
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателУслуги
			|ГДЕ
			|	СчетНаОплатуПокупателУслуги.Ссылка = &СчетНаОплату
			|
			|СГРУППИРОВАТЬ ПО
			|	СчетНаОплатуПокупателУслуги.ЗаказПокупателя,
			|	СчетНаОплатуПокупателУслуги.СтавкаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММЫ.ЗаказПокупателя,
			|	СУММЫ.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(СУММЫ.Сумма) КАК Сумма,
			|	СУММА(СУММЫ.СуммаНДС) КАК СуммаНДС
			|ИЗ
			|	СУММЫ КАК СУММЫ
			|
			|СГРУППИРОВАТЬ ПО
			|	СУММЫ.ЗаказПокупателя,
			|	СУММЫ.СтавкаНДС
			|ИТОГИ ПО
			|	СтавкаНДС";
			
			Запрос.УстановитьПараметр("СчетНаОплату",Основание.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				
				СтрокаТЧ = ТаблицаПлатежей.Найти(Выборка.СтавкаНДС, "СтавкаНДС");
				СтрокаТЧ.Сделка = Сделка;
				
				ВыборкаСделка = Выборка.Выбрать();
				Пока ВыборкаСделка.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(ВыборкаСделка.ЗаказПокупателя) Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ТаблицаПлатежей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 
					
					НоваяСтрока.Сделка       = ВыборкаСделка.ЗаказПокупателя;
					НоваяСтрока.СуммаПлатежа = ВыборкаСделка.Сумма;
					НоваяСтрока.СуммаНДС     = ВыборкаСделка.СуммаНДС;
					
					СтрокаТЧ.СуммаПлатежа = СтрокаТЧ.СуммаПлатежа - НоваяСтрока.СуммаПлатежа;
					СтрокаТЧ.СуммаНДС 	  = СтрокаТЧ.СуммаНДС 	  - НоваяСтрока.СуммаНДС;
				
				КонецЦикла;
				
				Если СтрокаТЧ.СуммаПлатежа <= 0 Тогда
					ТаблицаПлатежей.Удалить(СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			СпособЗаполнения = "Не заполнять";
			
		КонецЕсли;
		
		Если НЕ СпособЗаполнения = "Не заполнять" Тогда
		
			ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");	
		
		КонецЕсли; 

		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"))
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) Тогда

		ВидОперации  = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		Контрагент   = Основание.Контрагент;

		ДоговорКонтрагента      = Основание.ДоговорКонтрагента;
		СтатьяДвиженияДенежныхСредств = ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
			
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") и Основание.УдержатьКомиссионноеВознаграждение тогда
			СуммаКоррПлатежа= СуммаДокументаОснования.Итог("СуммаПлатежа") - Основание.СуммаВознаграждения;
			//НДС должен рассчитаться пропорционально платежу
			СуммаКоррНДС = 0;
			Если СуммаДокументаОснования.Итог("СуммаПлатежа") > 0 Тогда
				СуммаКоррНДС	= СуммаДокументаОснования.Итог("СуммаНДС") * (1 - Основание.СуммаВознаграждения/СуммаДокументаОснования.Итог("СуммаПлатежа"));	
			КонецЕсли;
				                         
			НоваяКолонкаСумм = ОбщегоНазначения.РаспределитьПропорционально(СуммаКоррПлатежа,СуммаДокументаОснования.ВыгрузитьКолонку("СуммаПлатежа"));
			Если не НоваяКолонкаСумм = Неопределено Тогда
				СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаСумм,"СуммаПлатежа");
			КонецЕсли; 
				
			НоваяКолонкаНДС = ОбщегоНазначения.РаспределитьПропорционально(СуммаКоррНДС,СуммаДокументаОснования.ВыгрузитьКолонку("СуммаНДС"));
			Если не НоваяКолонкаНДС = Неопределено Тогда
				СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаНДС,"СуммаНДС");
			КонецЕсли; 
		КонецЕсли;
			
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(Основание.Проект, "Проект");
		
        Если ОтражатьВБухгалтерскомУчете Тогда
     		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") тогда
     			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом,          "СчетУчетаРасчетовСКонтрагентом"); 
     			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансамПолученным,    "СчетУчетаРасчетовПоАвансам") ;
     		Иначе
     			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом,"СчетУчетаРасчетовСКонтрагентом") ;
     			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам,    "СчетУчетаРасчетовПоАвансам") ;
            КонецЕсли;
        КонецЕсли;    
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			Сделка = Основание.СделкаПоРеализации;
		Иначе
			Сделка = Основание.Сделка;
		КонецЕсли;
		ДокументРасчетовСКонтрагентом = Неопределено;
		Если ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			ДокументРасчетовСКонтрагентом = Основание;
			Если Основание.Проведен Тогда
				СпособЗаполнения = "По взаиморасчетам";
			Иначе
				СпособЗаполнения = "По сумме документа";
			КонецЕсли;
		Иначе

			Если Основание.Проведен Тогда
				СпособЗаполнения = "По взаиморасчетам";
			Иначе
				СпособЗаполнения = "По сумме документа";
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");
		ТаблицаПлатежей.ЗаполнитьЗначения(ДокументРасчетовСКонтрагентом,"ДокументРасчетовСКонтрагентом");

		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		 или ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаОС")
		 или ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаНМА") Тогда
		 
		ВидОперации  = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		
		ВидОперации  = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		Контрагент   = Основание.Контрагент;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;

		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсДокумента           = СтруктураКурсаДокумента.Курс;
		КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		Если Не ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") или ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаНМА") тогда
			СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
			СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		Иначе
		    СуммаДокументаОснования = Новый ТаблицаЗначений();
			СуммаДокументаОснования.Колонки.Добавить("СуммаПлатежа",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
			СуммаДокументаОснования.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
			СуммаДокументаОснования.Колонки.Добавить("СуммаНДС",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
			СтрокаТаблицыСумм = СуммаДокументаОснования.Добавить();
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") тогда
				СтрокаТаблицыСумм.СуммаПлатежа = Основание.СуммаВознаграждения;
				СтрокаТаблицыСумм.СтавкаНДС    = Основание.СтавкаНДСВознаграждения;
				СтрокаТаблицыСумм.СуммаНДС     = Основание.Товары.Итог("СуммаНДСВознаграждения");
				
			ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаНМА") тогда
				СтрокаТаблицыСумм.СуммаПлатежа = Основание.СуммаДокумента;
				СтрокаТаблицыСумм.СтавкаНДС    = Основание.СтавкаНДС;
				СтрокаТаблицыСумм.СуммаНДС     = Основание.СуммаНДС;
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
		Сделка = Основание.Сделка;
		ДокументРасчетовСКонтрагентом = Неопределено;
		Если ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			
			ДокументРасчетовСКонтрагентом = Основание;
			
			Если Основание.Проведен Тогда
				СпособЗаполнения = "По взаиморасчетам";
			КонецЕсли;
		Иначе

			Если Основание.Проведен Тогда
				СпособЗаполнения = "По сумме документа";
			КонецЕсли;
		КонецЕсли;

		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");
		ТаблицаПлатежей.ЗаполнитьЗначения(ДокументРасчетовСКонтрагентом,"ДокументРасчетовСКонтрагентом");
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 

		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоВознаграждению,    "СчетУчетаРасчетовСКонтрагентом") ;
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансамПолученным, "СчетУчетаРасчетовПоАвансам") ;
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом,"СчетУчетаРасчетовСКонтрагентом") ;
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам,    "СчетУчетаРасчетовПоАвансам") ;
		КонецЕсли;
		
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") 
	      ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда

		СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
		ВидОперации  = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком;
		Контрагент   = Основание.Контрагент;

		
		Контрагент   = Основание.Контрагент;

		ДоговорКонтрагента      = Основание.ДоговорКонтрагента;
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		ТаблицаПлатежей.Очистить();
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
			
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
		ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом,"СчетУчетаРасчетовСКонтрагентом") ;
		ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам,    "СчетУчетаРасчетовПоАвансам") ;
		
		Сделка = Основание.Сделка;
		ДокументРасчетовСКонтрагентом = Неопределено;
		Если ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			
			ДокументРасчетовСКонтрагентом = Основание;
			
			Если Основание.Проведен Тогда
				СпособЗаполнения = "По взаиморасчетам";
			КонецЕсли;
		Иначе

			Если Основание.Проведен Тогда
				СпособЗаполнения = "По сумме документа";
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");
		ТаблицаПлатежей.ЗаполнитьЗначения(ДокументРасчетовСКонтрагентом,"ДокументРасчетовСКонтрагентом");

		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда

		ВалютаДокумента = Основание.ВалютаДокумента;
		СчетКасса       = Основание.СчетКасса;
		
		ЗаполнитьПоРКО();

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда

		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		СтрокаПлатеж = ТаблицаПлатежей.Добавить();
		ВидОперации  = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка;
		
		Если Основание.ВидОперации=Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах Тогда
			ВидПриемаРозничнойВыручки=Перечисления.ВидПриемаРозничнойВыручки.ИзКассы; 	
			Контрагент   = Основание.КассаККМ;
		ИначеЕсли Основание.ВидОперации=Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетНТТОПродажах Тогда
			ВидПриемаРозничнойВыручки=Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ; 	
			Контрагент   = Основание.Склад;
		КонецЕсли;

		СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
		СпособЗаполнения = "По розничной выручке";
		
		ОплатаПлатежнымиКартами.Загрузить(Основание.ОплатаПлатежнымиКартами.Выгрузить());
		СуммаОплатыПлатежнымиКартами = ОплатаПлатежнымиКартами.Итог("Сумма");
		
		СуммаДокумента = СуммаПродаж - СуммаВозврата - СуммаОплатыПлатежнымиКартами;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ДенежныйЧек") Тогда

		СтрокаПлатеж = РасшифровкаПлатежа.Добавить();

		ВалютаДокумента = Основание.ВалютаДокумента;
		Касса           = Основание.Касса;
		СчетОрганизации = Основание.СчетОрганизации;
		Организация     = Основание.Организация;
		СуммаДокумента  = Основание.СуммаДокумента;
		ВидОперации     = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке;
		
		СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
		
		ДенежныйЧек=Основание.Ссылка;

		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=Основание.СтатьяДвиженияДенежныхСредств;

	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ПланируемоеПоступлениеДенежныхСредств") Тогда
		
		Если Основание.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Безналичные Тогда
			Сообщить("Документом планировалось поступление безналичных денежных средств.");
			Возврат;
		КонецЕсли;
		
		ВидОперацииПоступление = Основание.ВидОперации;
		СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяСтавкаНДС");
		
		УправлениеДенежнымиСредствами.ОпределитьОперациюПоОснованиюУпр(ВидОперации,ВидОперацииПоступление);
		
		Организация = Основание.Организация;
		ВалютаДокумента = Основание.ВалютаДокумента;
		
		Если ЗначениеЗаполнено(Основание.БанковскийСчетКасса) Тогда
			Касса = Основание.БанковскийСчетКасса;
		КонецЕсли;
		
		Если ВалютаДокумента.Пустая() Тогда
			ВалютаДокумента = мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		Если ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
			
			ВидПриемаРозничнойВыручки=Основание.ВидПриемаРозничнойВыручки;
			Контрагент=Основание.КассаККМ;
			
		КонецЕсли;
		
		УправлениеДенежнымиСредствами.ЗаполнитьПоПланируемомуПоступлениюУпр(РасшифровкаПлатежа,
							Основание,
							СтавкаНДС, 
							ВалютаДокумента,
							КурсДокумента,
							КратностьДокумента,
							ВидОперации);
		
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		
		ВалютаДокумента = Основание.ВалютаДокумента;
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		НоваяСтрока.КурсВзаиморасчетов           = СтруктураКурсаДокумента.Курс;
		НоваяСтрока.КратностьВзаиморасчетов      = СтруктураКурсаДокумента.Кратность;		
		
		Запрос = Новый Запрос;
		
		Если НЕ (ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда
	 		Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте);
		Иначе
			Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте);
		КонецЕсли;
	
		Запрос.УстановитьПараметр("Сотрудник",  Основание.ФизЛицо);
		Запрос.УстановитьПараметр("Организация",Основание.Организация);
		Запрос.УстановитьПараметр("ДатаИтогов", Основание.Дата+1);
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки."+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"","Валютная")+"СуммаОстатокДт КАК СуммаОстатокКт,
		|	ХозрасчетныйОстатки."+?(ВалютаДокумента = мВалютаРегламентированногоУчета,"","Валютная")+"СуммаОстатокКт КАК СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаИтогов, Счет В ИЕРАРХИИ (&СчетРасчетов), ,
		|	                                        Организация = &Организация И Субконто1 = &Сотрудник) КАК ХозрасчетныйОстатки";
        	
		ПредыдущийАванс = Запрос.Выполнить().Выбрать();
		ПредыдущийАванс.Следующий();
		
		Перерасход = ?(ЗначениеЗаполнено(ПредыдущийАванс.СуммаОстатокДт), ПредыдущийАванс.СуммаОстатокДт, 0);
		Остаток    = ?(ЗначениеЗаполнено(ПредыдущийАванс.СуммаОстатокКт), ПредыдущийАванс.СуммаОстатокКт, 0);
		
		ВидОперации 	= Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником;
		
		СуммаДокумента  = Остаток + Перерасход;
		Контрагент 		= Основание.ФизЛицо;
		
		Если СуммаДокумента > 0 Тогда 
			НоваяСтрока.СуммаПлатежа = СуммаДокумента;
			НоваяСтрока.СуммаВзаиморасчетов = СуммаДокумента;
		КонецЕсли;
		ВалютаВзаиморасчетовРаботника = Основание.ВалютаДокумента;
	КонецЕсли;

	ПроверкаКурсовВалют(СтрокаПлатеж);
	
	// Если не проводится по упр. учету, то и заполнять по упр. правилам не будем.
	СпособЗаполнения = ?(ОтражатьВУправленческомУчете,СпособЗаполнения,"Не заполнять");
	
	Если СпособЗаполнения = "По заказу" Тогда
		
		ОписаниеТиповЧ = Новый ОписаниеТипов("Число");
		ТаблицаПлатежей.Колонки.Добавить("Коэф",ОписаниеТиповЧ);
		
		Если ТаблицаПлатежей.Количество()>1 Тогда
			Если ТаблицаПлатежей.Итог("СуммаПлатежа") <> 0 Тогда
				Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
					СтрокаПлатеж.Коэф = СтрокаПлатеж.СуммаПлатежа/ТаблицаПлатежей.Итог("СуммаПлатежа");
				КонецЦикла;	
			КонецЕсли;
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(1, "Коэф");
		КонецЕсли; 
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ЗаполнитьПоЗаказуУпр(СтрокаПлатеж);
			СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов *  СтрокаПлатеж.Коэф;
			СтрокаПлатеж.СуммаПлатежа 		 = СтрокаПлатеж.СуммаПлатежа 	    *  СтрокаПлатеж.Коэф;
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
			Если НЕ СтрокаПлатеж.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = 0;
			Иначе	
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = СтрокаПлатеж.СуммаНДС * НалоговыйУчет.ПолучитьКоэффициентПропорциональногоНДС(Организация, Дата);
			КонецЕсли;
			
		КонецЦикла;    

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли СпособЗаполнения = "По взаиморасчетам" Тогда
		
		// Данный вид заполнения, для бухгалтерского учета невозможен.
        Если НЕ ОтражатьВБухгалтерскомУчете Тогда
    		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
				УправлениеДенежнымиСредствами.ЗаполнитьПоВзаиморасчетамУпр(ВалютаДокумента,КурсДокумента,КратностьДокумента,СтрокаПлатеж,1);
        		УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
				
				Если НЕ СтрокаПлатеж.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
					СтрокаПлатеж.СуммаНДСПропорциональноКредит = 0;
				Иначе	
					СтрокаПлатеж.СуммаНДСПропорциональноКредит = СтрокаПлатеж.СуммаНДС * НалоговыйУчет.ПолучитьКоэффициентПропорциональногоНДС(Организация, Дата);
				КонецЕсли;
				
    		КонецЦикла; 
        КонецЕсли; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли СпособЗаполнения = "По взаиморасчетам с подотчетным лицом" Тогда
   		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж);
   		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли СпособЗаполнения = "По розничной выручке" Тогда
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ЗаполнитьПоРозничнойВыручкеУпр(СтрокаПлатеж);
   		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли СпособЗаполнения = "По сумме документа" Тогда
		
		// Сумму вознаграждения вычтем из первой строки
		фСуммаВознаграждения = ЛОЖЬ;
   		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ЗаполнитьПоСуммеДокументаУпр(СтрокаПлатеж,фСуммаВознаграждения);
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
			Если НЕ СтрокаПлатеж.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = 0;
			Иначе	
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = СтрокаПлатеж.СуммаНДС * НалоговыйУчет.ПолучитьКоэффициентПропорциональногоНДС(Организация, Дата);
			КонецЕсли;
			
   		КонецЦикла; 

		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");

	КонецЕсли;
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	Оплачено=Истина;
	ОтражатьВУправленческомУчете=Истина;
	
	Если ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником И
		(НЕ ВалютаВзаиморасчетовРаботника=ВалютаДокумента) Тогда
		
		ОтражатьВБухгалтерскомУчете=Ложь;
		
	Иначе
		
		ОтражатьВБухгалтерскомУчете=Истина;
		
	КонецЕсли;
	
#Если Клиент Тогда
	ЗаполнитьРеквизитыПечати();
#КонецЕсли

	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");

	ЗаполнитьРеквизитыПоУмолчаниюУпр();
	
	Для каждого СтрокаПлатеж Из РасшифровкаПлатежа Цикл
		УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж,ВидОперации);
	КонецЦикла; 
	
	УстановитьНазначениеДенежныхСредств();	
	
	НомерОрдера = БИАС.УстановитьНомерПриходныйОрдера(Ссылка);

	Если ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда
		ВыводитьНаПечатьСуммуНДС = Истина;
	Иначе
		ВыводитьНаПечатьСуммуНДС = Ложь;
	КонецЕсли;
	
	Для каждого СтрокаПлатеж Из РасшифровкаПлатежа Цикл
		ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, Ложь);	
	КонецЦикла;
	
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
    
	ЕстьРасчетыСКонтрагентами = УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам     = УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);

	мТекущаяСхемаНалогообложения = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация); 
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами Тогда
		КурсДокумента      = РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		КратностьДокумента = РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

	Иначе
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                         , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                          , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       			, "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                       			, "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                     , "ВедениеУчетаПоПроектам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	СтруктураШапкиДокумента.Вставить("КурсДокумента"		, КурсДокумента);
	СтруктураШапкиДокумента.Вставить("КратностьДокумента"	, КратностьДокумента);
	
	СтруктураШапкиДокумента.Вставить("ДатаОплаты", Дата);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);

	СтруктураВидыУчета=Новый Структура;
	СтруктураВидыУчета.Вставить("ОтражатьВБухгалтерскомУчете",  ОтражатьВБухгалтерскомУчете);
	СтруктураВидыУчета.Вставить("ОтражатьВУправленческомУчете", ОтражатьВУправленческомУчете);
		
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураВидыУчета, Отказ, Заголовок);
	
	ТаблицаПлатежейУпр=УправлениеДенежнымиСредствами.ПолучитьТаблицуПлатежейУпр(Дата,ВалютаДокумента,Ссылка, "ПриходныйКассовыйОрдер");
	
	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Режим, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);
	КонецЕсли;

	// для оптимизации записи движений (8/9 класс)
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
КонецПроцедуры // ОбработкаПроведения

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерОрдера = "";
	
	ДокументОснование = Неопределено

КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПКО, ПКОДо2009, ПКОвБланк, ПКОвБланкА4",
			"Приходный кассовый ордер", "Приходный кассовый ордер, старая версия", "Приходный кассовый ордер (печать в бланк, формат А5, ориентация «альбомная»)", "Приходный кассовый ордер (печать в бланк, формат А4, ориентация «портрет»)");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура УстановитьНазначениеДенежныхСредств() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
		НазначениеДенежныхСредств = Справочники.НазначенияНаличныхДенежныхСредств.Командировка
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда
        НазначениеДенежныхСредств = Справочники.НазначенияНаличныхДенежныхСредств.ПокупкаТоваров
	Иначе
        НазначениеДенежныхСредств = Справочники.НазначенияНаличныхДенежныхСредств.Прочее	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	ЕстьАналитикаПоОбособленнымПодразделениям = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);

	мУчетДенежныхСредствПоОбособленнымПодразделениям = Ложь;
	Если мУчетнаяПолитикаБУ.Количество() > 0 Тогда	
		мУчетДенежныхСредствПоОбособленнымПодразделениям = ЕстьАналитикаПоОбособленнымПодразделениям И мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет документ на основании расходного кассового ордера\
//
Процедура ЗаполнитьПоРКО()

	//Если ДокументОснование.ПоОбособленномуПодразделению Тогда
	//	
	//	ПоОбособленномуПодразделению = Истина;
	//	ОбособленноеПодразделениеОрганизации = ДокументОснование.ОбособленноеПодразделениеОрганизации;
	//	
	//КонецЕсли;
	
	Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику Тогда

		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОснование.ВалютаДокумента, ДокументОснование.Дата);
		КурсОснования      = СтруктураКурсаОснования.Курс;
		КратностьОснования = СтруктураКурсаОснования.Кратность;

		ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком;
		Контрагент  = ДокументОснование.Контрагент;

		Для Каждого СтрокаОснование ИЗ ДокументОснование.РасшифровкаПлатежа Цикл

			СтрокаПлатеж = РасшифровкаПлатежа.Добавить();

			СтрокаПлатеж.ДоговорКонтрагента      = СтрокаОснование.ДоговорКонтрагента;
			СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
			СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
			СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

			СтрокаПлатеж.СуммаПлатежа = СтрокаОснование.СуммаПлатежа;

			СтрокаПлатеж.Сделка = СтрокаОснование.Сделка;
			Если СтрокаОснование.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
				СтрокаПлатеж.ДокументРасчетовСКонтрагентом = ДокументОснование;
			КонецЕсли;

			СтрокаПлатеж.СтавкаНДС = СтрокаОснование.СтавкаНДС;
            СтрокаПлатеж.ЗаТару 				        = СтрокаОснование.ЗаТару;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтрокаОснование.СчетУчетаРасчетовПоАвансам;
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтрокаОснование.СчетУчетаРасчетовСКонтрагентом;
			СтрокаПлатеж.СчетУчетаНДС    				= СтрокаОснование.СчетУчетаНДС;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СтрокаОснование.СчетУчетаНДСПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СтрокаОснование.НалоговоеНазначение;
			СтрокаПлатеж.СтавкаНДС		  				= СтрокаОснование.СтавкаНДС;
			СтрокаПлатеж.Амортизируется 				= СтрокаОснование.Амортизируется;
			
		КонецЦикла;

		#Если Клиент Тогда
		УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета,РасшифровкаПлатежа);
		#КонецЕсли

		Для Индекс = 0 По ДокументОснование.РасшифровкаПлатежа.Количество()-1 Цикл

			СтрокаПлатеж    = РасшифровкаПлатежа[Индекс];
			СтрокаОснование = ДокументОснование.РасшифровкаПлатежа[Индекс];

			Если (ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента))
			   И СтрокаПлатеж.ДоговорКонтрагента=СтрокаОснование.ДоговорКонтрагента Тогда // Остался договор из основания

				СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаОснование.СуммаПлатежа, 
				ДокументОснование.ВалютаДокумента, 
				СтрокаОснование.ДоговорКонтрагента.ВалютаВзаиморасчетов,
				КурсОснования, СтрокаОснование.КурсВзаиморасчетов, 
				КратностьОснования, СтрокаОснование.КратностьВзаиморасчетов);

				СтрокаПлатеж.СуммаПлатежа     = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, 
				СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,
				ВалютаДокумента,
				СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента, 
				СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

			Иначе

				Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда

					СтрокаПлатеж.СуммаВзаиморасчетов=СтрокаПлатеж.СуммаПлатежа;
					СтрокаПлатеж.КурсВзаиморасчетов=1;
					СтрокаПлатеж.КратностьВзаиморасчетов=1;

				Иначе

					СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, 
					ВалютаДокумента, 
					СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,
					КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов, 
					КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);

				КонецЕсли;

			КонецЕсли;

			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
			Если НЕ СтрокаПлатеж.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = 0;
			Иначе	
				СтрокаПлатеж.СуммаНДСПропорциональноКредит = СтрокаПлатеж.СуммаНДС * НалоговыйУчет.ПолучитьКоэффициентПропорциональногоНДС(Организация, Дата);
			КонецЕсли;
			
		КонецЦикла;

		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");

	ИначеЕсли ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю Тогда
		
		// Отказываем
		Возврат;
		
	ИначеЕсли ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику Тогда
		
		СтрокаПлатеж      = РасшифровкаПлатежа.Добавить();
		
		ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником;
		
		Контрагент                       = ДокументОснование.Контрагент;
		РасчетныйДокумент	             = ДокументОснование;
		ВалютаВзаиморасчетовРаботника = ДокументОснование.ВалютаВзаиморасчетовРаботника;
		СтруктураКурса                   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовРаботника, ТекущаяДата());
		СтрокаПлатеж.КурсВзаиморасчетов               = СтруктураКурса.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов          = СтруктураКурса.Кратность;
		
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПодотчетником;
		
		ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж);
		
	ИначеЕсли ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее Тогда
		
		ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее;
		
		// Дальше заполняем по умолчанию
		Возврат;
		
	ИначеЕсли  ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
		
		ВидОперации=Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке;
		// Дальше заполняем по умолчанию
		Возврат;
		
	ИначеЕсли  ДокументОснование.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ Тогда
		
		ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка;
		// Дальше заполняем по умолчанию
		Возврат;
			
	Иначе
		
		ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее;
		// Дальше заполняем по умолчанию
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоПКОУпр()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	Если ЕстьРасчетыСКонтрагентами Тогда
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	КонецЕсли; 
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата,Ссылка.Организация, Ложь);

мСтруктураПараметровДенежныхСредств = Новый Структура;
мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Наличные);
