
// 
Процедура ПолучитьДанныеПоЗвонкуДоЗаполнения(ДанныеИзБазы, UID, CDR, ПропустившиеЗвонок) Экспорт
	
	ПараметрыОчереди = ОпределитьОчередь(ДанныеИзБазы, UID);
	ПустаяДата = Дата("00010101");                                                                                      
	// МИКО_ПТВ 14-02-2017
	CDR.Вставить("AgentQueue_Ссылка", Неопределено);
	CDR.Вставить("IdQueue", 		  "");
	CDR.Вставить("AgentQueue",		  "");
	
	Если ПараметрыОчереди.Количество() > 0 Тогда
		Если ПараметрыОчереди.Свойство("NameIdQueue") Тогда
			CDR.IdQueue = ПараметрыОчереди.NameIdQueue;
		Иначе
			CDR.IdQueue = "";	
		КонецЕсли; 
		
		Если ПараметрыОчереди.Свойство("AgentQueue") Тогда
			CDR.AgentQueue = ПараметрыОчереди.AgentQueue;
		Иначе
			CDR.AgentQueue = "";	
		КонецЕсли; 
		
		Если ПараметрыОчереди.Свойство("AgentQueue_Ссылка") Тогда
			CDR.AgentQueue_Ссылка = ПараметрыОчереди.AgentQueue_Ссылка;
		Иначе
			CDR.AgentQueue_Ссылка = Неопределено;	
		КонецЕсли; 
	КонецЕсли; 					  
	// МИКО_ПТВ 14-02-2017 (конец)
	
КонецПроцедуры


Процедура ПолучитьДанныеПоЗвонкуПослеЗаполнения(ДанныеИзБазы, UID, CDR, ПропустившиеЗвонок) Экспорт

	

КонецПроцедуры


Функция ОпределитьОчередь(ДанныеИзБазы, UID)
	
	ПараметрыОчереди = Новый Структура;
	
	
	// МИКО_ПТВ 15-02-2017
	// Обработка звонка, если он поступил на очередь
	ТабCDR = ДанныеИзБазы.ТабCDR;
	NameIdQueue = "";

	Отбор = Новый Структура();
	Отбор.Вставить("UID", UID);
	ВыборкаCDR = ТабCDR.НайтиСтроки(Отбор);
	КоличествоВыборкаCDR = ВыборкаCDR.Количество();
	Если КоличествоВыборкаCDR > 0 Тогда
		Индекс = 0; 
		Пока Индекс < КоличествоВыборкаCDR Цикл
			Если Найти(ВыборкаCDR[Индекс].lastdata, "CALLFLOW") > 0 
				И Найти(ВыборкаCDR[Индекс].lastdata, "QUEUE") > 0 
				И NameIdQueue = "" Тогда
									
				// получаю Агента очереди и добавляю его в структуру CDR
				dstchannel = СтрЗаменить(ВыборкаCDR[Индекс].dstchannel,"-","/");
				dstchannel = СтрЗаменить(dstchannel,"@","/");

				AgentQueue = СтрПолучитьСтроку(СтрЗаменить(dstchannel,"/",Символы.ПС),2);
				ПараметрыОчереди.Вставить("AgentQueue", AgentQueue);
				
				// по номеру агента определяем наименование агента очереди
			    МассивНомеров = Новый Массив();
			    МассивНомеров.Добавить(Число(AgentQueue));
			    ТаблицаКонтактов = МИКО_стОбработкаКонтактнойИнформации.ОпределитьКонтактПоНомеруТелефона(МассивНомеров);
			    Если НЕ ТаблицаКонтактов = Неопределено И ТаблицаКонтактов.Количество()>0 Тогда
			    	AgentQueue_Ссылка = ТаблицаКонтактов[0].Объект;
				КонецЕсли;
				ПараметрыОчереди.Вставить("AgentQueue_Ссылка", AgentQueue_Ссылка);
				
				// Заполняю в структуру CDR название первой очереди, куда попал вызов
				IdQueue = СтрПолучитьСтроку(СтрЗаменить(ВыборкаCDR[Индекс].lastdata,",",Символы.ПС),1);			
				NameIdQueue = МИКО_стОбщегоНазначенияСерверПовторный.НазваниеОчередиПоId(IdQueue, NameIdQueue);
				ПараметрыОчереди.Вставить("NameIdQueue", NameIdQueue);
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	// МИКО_ПТВ 15-02-2017 (конец)
	
	Возврат ПараметрыОчереди;

КонецФункции // ОпределитьОчередь()
