Перем мУдалятьДвижения;

// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;

//Хранит таблицу, использующуюся при проведении документа
Перем ТаблицаПлатежейУпр;
Перем мТекущаяСхемаНалогообложения;

//Определение периода движений документа
Перем ДатаДвижений;

Перем РасчетыВозврат;

Перем мСтруктураПараметровДенежныхСредств;

// Форматирует сумму прописью документа
//
// Параметры:
//  СуммаДок - число - реквизит, который надо представить прописью 
//  СуммаБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Отформатированную строку
//
Функция ФорматироватьСуммуПрописи(СуммаДок,СуммаБезКопеек)

	Результат     = СуммаДок;
	ЦелаяЧасть    = Цел(СуммаДок);
	ФорматСтрока  = "Л=uk_UA; ДП=Ложь";
	ПарамПредмета = ВалютаДокумента.ПараметрыПрописиНаУкраинском;
	
	Если (Результат - ЦелаяЧасть) = 0 Тогда
		Если СуммаБезКопеек Тогда
			Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
			Результат = Лев(Результат,Найти(Результат,"0")-1)+"=";
		Иначе
			Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ФорматироватьСуммуПрописи()

// Форматирует сумму  документа
//
// Параметры:
//  СуммаДок - число - реквизит, который надо отформатировать
//  СуммаБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Отформатированную строку
//
Функция ФорматироватьСумму(СуммаДок,СуммаБезКопеек)
	
	Результат  = СуммаДок;
	ЦелаяЧасть = Цел(СуммаДок);
	
	Если (Результат - ЦелаяЧасть) = 0 Тогда
		Если СуммаБезКопеек Тогда
			Результат = Формат(Результат,"ЧДЦ=2; ЧРД='='; ЧГ=0");
			Результат = Лев(Результат,Найти(Результат,"="));
		Иначе
			Результат = Формат(Результат,"ЧДЦ=2; ЧРД=','; ЧГ=0");
		КонецЕсли;
	Иначе
		Результат = Формат(Результат,"ЧДЦ=2; ЧРД=','; ЧГ=0");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСумму()

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) Экспорт
	
	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверкаКурсовВалют()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Формирует печатную форму 
// платежного поручения
//
// Параметры:
//  ТабДок - табличный документ
//
Функция ПечатьПлатежногоПоручения(Вариант2009) Экспорт

	Если Организация.Пустая() Тогда
		Сообщить("Не указана организация.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;

	Если Контрагент.Пустая() И Не ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		Сообщить("Не указан контрагент.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	Если СчетОрганизации.Пустая() Тогда
		Сообщить("Не указан расчетный счет.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
    Если СчетОрганизации.ВалютаДенежныхСредств <> мВалютаРегламентированногоУчета Тогда
		Сообщить("Для документа в валюте предусмотрена другая печатная форма.", СтатусСообщения.Важное);
		Возврат Неопределено;	
	КонецЕсли;

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручение_ПлатежноеПоручение";
	
	Если Вариант2009 Тогда
		Макет = ПолучитьОбщийМакет("ПлатежноеПоручение2009");
	Иначе
		Макет = ПолучитьОбщийМакет("ПлатежноеПоручение");
	КонецЕсли;
	
	КодЯзыкаПечать = "uk";
	
	Обл   = Макет.ПолучитьОбласть("Шапка");
	
	СуммаБезКопеек  = СчетОрганизации.СуммаБезКопеек;
	
	БанкОрганизации = СчетОрганизации.Банк;
	БанкКонтрагента = СчетКонтрагента.Банк;
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	
	Обл.Параметры.НомерПП					= НомерПоручения;
	
	ЧислоДокумента                          = Формат(Дата,"ДФ='дд';Л=uk_UA");
	ДатаДокумента                           = Формат(Дата,"ДФ='дд ММММ ггггр.';Л=uk_UA");
	ДатаДокументаБезЧисла                   = Прав(ДатаДокумента, СтрДлина(ДатаДокумента) - 2);
	Обл.Параметры.ДатаДокумента          	= """" + ЧислоДокумента + """" + ДатаДокументаБезЧисла;
	
	Обл.Параметры.СуммаПлатежа             	= ФорматироватьСумму(СуммаДокумента,СуммаБезКопеек);
	Обл.Параметры.СуммаПрописью          	= ФорматироватьСуммуПрописи(СуммаДокумента,СуммаБезКопеек);

	Обл.Параметры.Плательщик              = ?(ПустаяСтрока(ТекстПлательщика),Организация.НаименованиеПолное,СокрЛП(ТекстПлательщика));
	Обл.Параметры.КодПоЕДРПОУ 			  = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	Обл.Параметры.БанкПлательщика         = БанкОрганизации;
  	Обл.Параметры.НомерСчетаПлательщика   = СчетОрганизации.НомерСчета;
    Обл.Параметры.КодБанкаПлательщика     = БанкОрганизации.Код;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		Обл.Параметры.Получатель              = ?(ПустаяСтрока(ТекстПолучателя),Контрагент.НаименованиеПолное,СокрЛП(ТекстПолучателя));
		Обл.Параметры.ПолучательЕДРПОУ        = Контрагент.КодПоЕДРПОУ;
	Иначе
		Обл.Параметры.Получатель              = ?(ПустаяСтрока(ТекстПолучателя),Организация.НаименованиеПолное,СокрЛП(ТекстПолучателя));
		Обл.Параметры.ПолучательЕДРПОУ        = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	КонецЕсли;
	
    Обл.Параметры.БанкПолучателя          = БанкКонтрагента;
	Обл.Параметры.КодБанкаПолучателя      = БанкКонтрагента.Код;
	Обл.Параметры.НомерСчетаПолучателя    = СчетКонтрагента.НомерСчета;

	Обл.Параметры.НазначениеПлатежа       = СокрЛП(НазначениеПлатежа);
	
	КолВо = 2;
	Если Не ВвестиЧисло(КолВо, "Введите число экземпляров", 2) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	Для НомерЭкземпляра = 1 по КолВо Цикл
		Обл.Параметры.НомерЭкземпляра = НомерЭкземпляра;
	    ТабДокумент.Вывести(Обл);
		Если НЕ ТабДокумент.ПроверитьВывод(Обл) Тогда
		    ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;	

	Возврат ТабДокумент;

КонецФункции // ПечатьПлатежногоПоручения()

// Формирует печатную форму платежного поручения
//
Функция ПечатьПлатежногоПорученияВВалюте() Экспорт

	Если Организация.Пустая() Тогда
		Сообщить("Не указана организация.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;

	Если Контрагент.Пустая() И Не ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		Сообщить("Не указан контрагент.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	Если СчетОрганизации.Пустая() Тогда
		Сообщить("Не указан расчетный счет.", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручение_ПлатежноеПоручениеВВалюте";
	
	Макет = ПолучитьОбщийМакет("ПлатежноеПоручениеВВалюте");
	Обл   = Макет.ПолучитьОбласть("Шапка");
	
	СуммаБезКопеек  = СчетОрганизации.СуммаБезКопеек;
	
	БанкОрганизации = СчетОрганизации.Банк;
	БанкКонтрагента = СчетКонтрагента.Банк;
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
	
	Обл.Параметры.НомерПП		          = НомерПоручения;
	Обл.Параметры.ДатаДокумента           = Дата;
	
	Обл.Параметры.БанкПлательщика 		  = БанкОрганизации;
	Обл.Параметры.АдресБанкаПлательщика   = БанкОрганизации.Адрес;
	
	Обл.Параметры.Плательщик              = ?(ПустаяСтрока(ТекстПлательщика),Организация.НаименованиеПолное,СокрЛП(ТекстПлательщика));
	Обл.Параметры.АдресПлательщика        =	УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Организация, "Юридический");
	Обл.Параметры.РезидентПлательщик      =	Истина;
	Обл.Параметры.НомерСчетаПлательщика   = СчетОрганизации.НомерСчета;
		
	Обл.Параметры.СуммаПлатежа            = ФорматироватьСумму(СуммаДокумента,СуммаБезКопеек);
	Обл.Параметры.СуммаПрописью           = ФорматироватьСуммуПрописи(СуммаДокумента,СуммаБезКопеек);
	Обл.Параметры.КодВалюты		          = СчетОрганизации.ВалютаДенежныхСредств.Код;

	Если НЕ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		Обл.Параметры.Получатель              = ?(ПустаяСтрока(ТекстПолучателя),Контрагент.НаименованиеПолное,СокрЛП(ТекстПолучателя));
		Обл.Параметры.АдресПолучателя	      =	УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент, "Юридический");
		Обл.Параметры.РезидентПолучатель      =	НЕ Контрагент.НеЯвляетсяРезидентом;
	Иначе
		Обл.Параметры.Получатель              = ?(ПустаяСтрока(ТекстПолучателя),Организация.НаименованиеПолное,СокрЛП(ТекстПолучателя));
		Обл.Параметры.АдресПолучателя	      =	УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Организация, "Юридический");
		Обл.Параметры.РезидентПолучатель      =	Истина;
	КонецЕсли;
	Обл.Параметры.НомерСчетаПолучателя    = СчетКонтрагента.НомерСчета;
	
	Обл.Параметры.БанкПолучателя		  = БанкКонтрагента;
	Обл.Параметры.АдресБанкаПолучателя    = БанкКонтрагента.Адрес;
	
	Обл.Параметры.НазначениеПлатежа       = СокрЛП(НазначениеПлатежа);
	Обл.Параметры.КодПоЕДРПОУ 			  = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	
	КолВо = 2;
	Если Не ВвестиЧисло(КолВо, "Введите число экземпляров", 2) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	Для НомерЭкземпляра = 1 по КолВо Цикл
		Обл.Параметры.НомерЭкземпляра = НомерЭкземпляра;
		ТабДокумент.Вывести(Обл);
		Если НомерЭкземпляра/2 = Окр(НомерЭкземпляра/2) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;	
    
	Возврат ТабДокумент;

КонецФункции // ПечатьПлатежногоПоручения()

//Формирует отчет по зарплате
Функция ПечатьОтчетаПоЗарплате() Экспорт
	
	Если Организация.Пустая() Тогда
		Сообщить(НСтр("ru='Не указана организация.';uk='Не зазначена організація.'"), СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;

	Если Контрагент.Пустая() И Не ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		Сообщить(НСтр("ru='Не указан контрагент.';uk='Не зазначений контрагент.'"), СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	Если СчетОрганизации.Пустая() Тогда
		Сообщить(НСтр("ru='Не указан расчетный счет.';uk='Не зазначений розрахунковий рахунок.'"), СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = СформироватьЗапросДляПечати();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручениеИсходящее_ПечатьОтчетаПоЗарплате";
	
	Макет = Документы.ПлатежноеПоручениеИсходящее.ПолучитьМакет("ОтчетПоЗарплате");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация.ПолноеНаименование();
	Область.Параметры.СчетОрганизации = СчетОрганизации.ПолноеНаименование();
	Область.Параметры.НомерППИ =" № " +  НомерПоручения;

	Область.Параметры.Дата = Формат(Дата, "ДЛФ=Д");
	
		ТекстПлатежнаяВедомость = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ведомость
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.ВыплатаЗаработнойПлаты
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ПлатежныеВедомости = Запрос.Выполнить().Выгрузить();
	
	Количество =ПлатежныеВедомости.Количество();
	Если Количество= 1 Тогда
		ТекстПлатежнаяВедомость = НСтр("ru='Согласно платежной ведомости ';uk='Згідно розрахункової відомості '", КодЯзыкаПечать);
	Иначе
		ТекстПлатежнаяВедомость = НСтр("ru='Согласно платежным ведомостям ';uk='Згідно розрахунковим відомостям '", КодЯзыкаПечать);
	КонецЕсли;
	
	индекс = 1;
	Для Каждого Ведомость ИЗ ПлатежныеВедомости Цикл
		
		ТекстПлатежнаяВедомость = ТекстПлатежнаяВедомость + " № "+ ОбщегоНазначения.ПолучитьНомерНаПечать(Ведомость.Ведомость) + НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать) + Формат(Ведомость.Ведомость.Дата, "ДФ=dd.MM.yyyy");
		Если Индекс < Количество Тогда
			ТекстПлатежнаяВедомость = ТекстПлатежнаяВедомость + ", ";
		Иначе
			ТекстПлатежнаяВедомость = ТекстПлатежнаяВедомость + ". ";
		КонецЕсли;
		
		индекс = индекс + 1;
	КонецЦикла;
	
	Область.Параметры.ТекстПлатежнаяВедомость = ТекстПлатежнаяВедомость;
	
	ТабДок.Вывести(Область);
	//// Шапка
	ШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	ШапкаДокумента.Параметры.Контрагент = Контрагент.ПолноеНаименование();
	ТабДок.Вывести(ШапкаДокумента);
	
	// ВыплатаЗаработнойПлаты
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	ОбластьВыплатаЗаработнойПлаты = Макет.ПолучитьОбласть("ВыплатаЗаработнойПлаты");

	НомерСтроки = 0;
	Пока Выборка.Следующий() Цикл	
	
		НомерСтроки = НомерСтроки+1;
		ОбластьВыплатаЗаработнойПлаты.Параметры.Заполнить(Выборка);
		ОбластьВыплатаЗаработнойПлаты.Параметры.Сумма = Формат(Выборка.Сумма,"ЧДЦ=2; ЧРД=.");
		ОбластьВыплатаЗаработнойПлаты.Параметры.НомерСтроки = НомерСтроки;
	
		ТабДок.Вывести(ОбластьВыплатаЗаработнойПлаты);
	КонецЦикла;

	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.СуммаИтого = Строка(СуммаДокумента) + " грн.";
	ТабДок.Вывести(Подвал);
	
	
	//ОтветсвенныеЛица
	ОбластьОтветственныеЛица = Макет.ПолучитьОбласть("ОтветственныеЛица");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.УстановитьПараметр("Руководитель", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ФИООтветственногоЛица.ФизЛицо	КАК ФизЛицо, 
	|	ФИООтветственногоЛица.Фамилия	КАК Фамилия,
	|	ФИООтветственногоЛица.Имя		КАК Имя,
	|	ФИООтветственногоЛица.Отчество КАК Отчество
	|
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&МоментВремени,) КАК ФИООтветственногоЛица
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&МоментВремени) КАК ОтветственныеЛицаОрганизаций
	|ПО
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо = ФИООтветственногоЛица.ФизЛицо	
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
	|";
	
	
	ТекстГлавныйБухгалтер = СтрЗаменить(ТекстЗапроса, "&ОтветственноеЛицо", "&ГлавныйБухгалтер");
	Запрос.Текст = ТекстГлавныйБухгалтер;
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ФИОБухгалтера = Выборка;
	КонецЕсли;
	
	ТекстРуководитель = СтрЗаменить(ТекстЗапроса, "&ОтветственноеЛицо", "&Руководитель");
	Запрос.Текст = ТекстРуководитель;
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ФИОРуководителя = Выборка;
	КонецЕсли;

	Если ФИОБухгалтера <> Неопределено Тогда
		Если ЗначениеЗаполнено(ФИОБухгалтера) Тогда
			ОбластьОтветственныеЛица.Параметры.ФИОБухгалтера = ФИОБухгалтера.Фамилия + " " + ФИОБухгалтера.Имя + " " + ФИОБухгалтера.Отчество;
		Иначе
			ОбластьОтветственныеЛица.Параметры.ФИОБухгалтера  = ФИОБухгалтера.ФизЛицо.Наименование;
		КонецЕсли;		
	КонецЕсли;
	

	Если ФИОРуководителя <> Неопределено Тогда
		Если ЗначениеЗаполнено(ФИОРуководителя) Тогда
			ОбластьОтветственныеЛица.Параметры.ФИОРуководителя = ФИОРуководителя.Фамилия + " " + ФИОРуководителя.Имя + " " + ФИОРуководителя.Отчество;
		Иначе
			ОбластьОтветственныеЛица.Параметры.ФИОРуководителя = ФИОРуководителя.ФизЛицо.Наименование;
		КонецЕсли;
	КонецЕсли;
	
				
	ТабДок.Вывести(ОбластьОтветственныеЛица);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	Возврат ТабДок;
КонецФункции

Функция СформироватьЗапросДляПечати() Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА (ФИОФизЛиц.Фамилия ЕСТЬ NULL)
	|		ТОГДА Ведомость.ФизЛицо.Наименование
	|	ИНАЧЕ
	|		 ФИОФизЛиц.Фамилия+ "" "" + ФИОФизЛиц.Имя +"" "" +  ФИОФизЛиц.Отчество				
	|	КОНЕЦ КАК ФИО,
	|	Ведомость.ФизЛицо.КодПоДРФО			КАК КодПоДРФО,
	|	Ведомость.НомерКарточки						КАК НомерКарточки,
	|	ВЫРАЗИТЬ(Ведомость.Сумма КАК ЧИСЛО(10,2))	КАК Сумма
	|
	|	ИЗ
	|		Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата) КАК ФИОФизЛиц
	|			ПО ФИОФизЛиц.ФизЛицо = Ведомость.ФизЛицо
	|	ГДЕ
	|		Ведомость.Ссылка В 
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ППИ.Ведомость КАК Ведомость
	|						ИЗ
	|							Документ.ПлатежноеПоручениеИсходящее.ВыплатаЗаработнойПлаты КАК ППИ
	|						ГДЕ	ППИ.Ссылка В (&Ссылка)
	|						)
	|		И Ведомость.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Выплачено)
	|		И Ведомость.Банк = &Контрагент
	|		И Ведомость.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)	
	|	УПОРЯДОЧИТЬ ПО
	|		Сумма
	|";
	
	Возврат Запрос;
КонецФункции

Процедура НапечататьОтчетПоЗарплате(ПечДокумент)
	
	Если ПечДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаПечати = ПолучитьФорму("ПечатьВедомости");
	ФормаПечати.ПечатныйДокумент = ПечДокумент;
	ФормаПечати.ОбъектПечати = Ссылка;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ВставитьОбласть(ПечДокумент.Область());
	
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ОтображатьЗаголовки = Ложь;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ОтображатьСетку     = Ложь;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.Защита              = Ложь;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ТолькоПросмотр      = Истина;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ИмяПараметровПечати = ПечДокумент.ИмяПараметровПечати;
	ФормаПечати.ЭлементыФормы.ПолеТабличногоДокумента.ПовторятьПриПечатиСтроки = ПечДокумент.ПовторятьПриПечатиСтроки;
	
	ФормаПечати.Открыть();
	
КонецПроцедуры

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПлатежноеПоручение" ИЛИ ИмяМакета = "ПлатежноеПоручениеДо2009" тогда	
		Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			Если ИмяМакета = "ПлатежноеПоручение" тогда
				ТабДокумент = ПечатьПлатежногоПоручения(Истина);
			Иначе
				ТабДокумент = ПечатьПлатежногоПоручения(Ложь);
			КонецЕсли;
		Иначе
			ТабДокумент = ПечатьПлатежногоПорученияВВалюте();	
		КонецЕсли;	
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	
	ИначеЕсли ИмяМакета = "ПеречислениеЗП" Тогда
		ТабДокумент = ПечатьОтчетаПоЗарплате();
		НапечататьОтчетПоЗарплате(ТабДокумент);
	КонецЕсли;
		
КонецПроцедуры // Печать

#КонецЕсли

Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина) Экспорт
	
	Если НЕ (ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами) Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
			
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
			
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				
			КонецЕсли;
			
		Иначе
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
				
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется                 = СчетаУчета.Амортизируется;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует номер платежного поручения в пределах расчетного счета
//
Процедура УстановитьНомерПоручения() Экспорт
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		СтруктураПараметровБлокировка = Новый Структура("ТипТаблицы, ИмяТаблицы", "Справочник", "БанковскиеСчета");
		
		ЗначенияБлокировки = Новый Структура;
		ЗначенияБлокировки.Вставить("Ссылка",      СчетОрганизации);
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировка, ЗначенияБлокировки, , Ложь, "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетОрганизации", СчетОрганизации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерПоручения КАК НомерПоручения
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
	|
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	//самого себя не учитываем
	|	И ПлатежноеПоручение.Ссылка <> &Ссылка
	|	И ПлатежноеПоручение.СчетОрганизации = &СчетОрганизации
	|	И ПлатежноеПоручение.Дата >= &ДатаНачалаГода
	|	И ПлатежноеПоручение.Дата <= &ДатаКонцаГода";

	СписокПлатежек = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	 
	ТаблицаЗначений.Колонки.Добавить("Номер"); 
	ТаблицаЗначений.Колонки.Добавить("Длина"); 

	Пока СписокПлатежек.Следующий() Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить(); 
		НоваяСтрока.Номер = СписокПлатежек.НомерПоручения; 
		НоваяСтрока.Длина = СтрДлина(СписокПлатежек.НомерПоручения); 
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
	
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Попытка
			НомерПоручения = Формат(Число(ТаблицаЗначений[0].Номер) + 1, "ЧГ=0");
		Исключение
			НомерПоручения = 1;	
		КонецПопытки;
	Иначе
		НомерПоручения = 1;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП Тогда
		Возврат Новый Структура("ПлатежноеПоручение,ПлатежноеПоручениеДо2009, ПеречислениеЗП","Платежное поручение", "Платежное поручение, старая версия", "Ведомость перечисления зарплаты");	
	Иначе
		Возврат Новый Структура("ПлатежноеПоручение,ПлатежноеПоручениеДо2009","Платежное поручение", "Платежное поручение, старая версия");
	КонецЕсли;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок)

	Если ОтражатьВУправленческомУчете И (НЕ Оплачено) И (Режим = РежимПроведенияДокумента.Оперативный)
		И (НЕ ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет) Тогда

		ЕстьРазрешение=УправлениеДенежнымиСредствами.ЕстьРазрешениеПроводитьБезЗаявки();
	
		УправлениеДенежнымиСредствами.ПроверитьОстаткиПоЗаявке(Дата,Отказ,Заголовок,
				СчетОрганизации,СуммаДокумента,ТаблицаПлатежейУпр, ЕстьРазрешение);
				
		Отказ=Отказ И НЕ ЕстьРазрешение;
		
		// Проверяем остаток доступных денежных средств
		СвободныйОстаток = УправлениеДенежнымиСредствами.ПолучитьСвободныйОстатокДС(СчетОрганизации,Дата,ТаблицаПлатежейУпр.ВыгрузитьКолонку("ДокументПланированияПлатежа"));
		Если СвободныйОстаток < СуммаДокумента Тогда
			
			Сообщить(Заголовок+"
			|Сумма документа превышает возможный к использованию остаток денежных средств
			|по "+СчетОрганизации.Наименование+".
			|Возможный к использованию остаток: "+Формат(СвободныйОстаток,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента+"
			|Сумма документа = "+Формат(СуммаДокумента,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента);
			
			Если НЕ УправлениеДенежнымиСредствами.ЕстьРазрешениеПревышатьСвободныйОстатокДС() Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		

	КонецЕсли;

	Если (ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам) И ОтражатьВУправленческомУчете Тогда

		Если Не Отказ Тогда
			УправлениеДенежнымиСредствами.КонтрольОстатковПоТЧ(Дата, ТаблицаПлатежейУпр, Отказ, Заголовок,РасчетыВозврат);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, Платеж.ДоговорКонтрагента, 
			Платеж.ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП Тогда
		
		//Проверка на соответствие суммы по ведомостям сумме документа
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	СУММА(ЗарплатаКВыплате.Сумма) КАК СуммаВыплачено
		|ИЗ Документ.ПлатежноеПоручениеИсходящее.ВыплатаЗаработнойПлаты КАК ПлатежноеПоручениеИсходящее
		|	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ( 
		|		ВЫБРАТЬ
		|           Основной.Ссылка,
		|           Основной.СчетУчета,
		|           Основной.Сотрудник,
		|			СУММА(Основной.Сумма) КАК Сумма
		|       ИЗ Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты КАК Основной
		|       СГРУППИРОВАТЬ ПО
		|           Основной.Ссылка,
		|           Основной.СчетУчета,
		|           Основной.Сотрудник
		|		) КАК ЗарплатаКВыплате
		|		ПО ПлатежноеПоручениеИсходящее.Ведомость = ЗарплатаКВыплате.Ссылка
		|		И ПлатежноеПоручениеИсходящее.СчетУчета = ЗарплатаКВыплате.СчетУчета
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК ЗарплатаКВыплатеРаботники
		|		ПО ЗарплатаКВыплатеРаботники.Ссылка = ЗарплатаКВыплате.Ссылка
		|		И ЗарплатаКВыплатеРаботники.Сотрудник = ЗарплатаКВыплате.Сотрудник
		|ГДЕ  ПлатежноеПоручениеИсходящее.Ссылка = &Ссылка
		|И  ЗарплатаКВыплатеРаботники.Банк = &Контрагент
		|И  ЗарплатаКВыплатеРаботники.СпособВыплаты = &ЧерезБанк
		|";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ЧерезБанк",Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если НЕ (Результат.Следующий() И Результат.СуммаВыплачено=СуммаДокумента) Тогда
			Сообщить("Не совпадает сумма документа и суммы по ведомостям на выплату заработной платы через данный банк.");
			Отказ=Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
		
		Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ Тогда
			
			//Проверка на соответствие суммы по ведомостям сумме документа
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	СУММА(ЗарплатаКВыплате.Налог) КАК СуммаВыплачено
			|ИЗ
			|	Документ.ПлатежноеПоручениеИсходящее.ПеречислениеНалогов КАК ПлатежноеПоручениеИсходящее
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК ЗарплатаКВыплате
			|		ПО ПлатежноеПоручениеИсходящее.Ведомость = ЗарплатаКВыплате.Ссылка
			|ГДЕ  ПлатежноеПоручениеИсходящее.Ссылка = &Ссылка
			|";
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Результат=Запрос.Выполнить().Выбрать();
			
			Если НЕ (Результат.Следующий() И Результат.СуммаВыплачено=СуммаДокумента) Тогда
				Сообщить("Не совпадает сумма документа и суммы по ведомостям на перечисление НДФЛ.");
				Отказ=Истина;
			КонецЕсли;
			
		ИначеЕсли СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению 
			ИЛИ СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию
			ИЛИ СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюНаСлучайБезработицы
			ИЛИ СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев
			Тогда
			
			//Проверка на соответствие суммы по ведомостям сумме документа
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Запрос.УстановитьПараметр("СписокВедомостей",ПеречислениеНалогов.Выгрузить().ВыгрузитьКолонку("Ведомость"));
			Запрос.Текст="
			|ВЫБРАТЬ
			|	ПлатежноеПоручениеИсходящее.НомерСтроки КАК НомерСтроки,
			|	ПлатежноеПоручениеИсходящее.Сумма КАК СуммаВыплачено,
			|	ЗарплатаКВыплате.Результат КАК СуммаПоВедомости
			|ИЗ Документ.ПлатежноеПоручениеИсходящее.ПеречислениеНалогов КАК ПлатежноеПоручениеИсходящее
			
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
			|	ВЫБРАТЬ
			|		Взносы.Ссылка						КАК Ведомость,
			|		Взносы.Налог						КАК Налог,
			|		Взносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
			|		СУММА(Взносы.Результат)				КАК Результат
			|	ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Взносы 
			|	ГДЕ Взносы.Ссылка в (&СписокВедомостей)
			|	СГРУППИРОВАТЬ ПО 
			|		Взносы.Ссылка,
			|		Взносы.Налог,
			|		Взносы.СтатьяНалоговойДекларации
			|	
			|	ОБЪЕДИНИТЬ ВСЕ 
			|	ВЫБРАТЬ
			|		Взносы.Ссылка						КАК Ведомость,
			|		Взносы.Налог						КАК Налог,
			|		Взносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
			|		СУММА(Взносы.Результат)				КАК Результат
			|	ИЗ Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Взносы 
			|	ГДЕ Взносы.Ссылка в (&СписокВедомостей)
			|	СГРУППИРОВАТЬ ПО 
			|		Взносы.Ссылка,
			|		Взносы.Налог,
			|		Взносы.СтатьяНалоговойДекларации
			|) КАК ЗарплатаКВыплате
			|ПО		ПлатежноеПоручениеИсходящее.Ведомость = ЗарплатаКВыплате.Ведомость
			|	И	(ПлатежноеПоручениеИсходящее.СубконтоДт1 = ЗарплатаКВыплате.СтатьяНалоговойДекларации
			|	ИЛИ	ПлатежноеПоручениеИсходящее.СубконтоДт2 = ЗарплатаКВыплате.СтатьяНалоговойДекларации
			|	ИЛИ	ПлатежноеПоручениеИсходящее.СубконтоДт3 = ЗарплатаКВыплате.СтатьяНалоговойДекларации)
			|	И	(ПлатежноеПоручениеИсходящее.СубконтоДт1 = ЗарплатаКВыплате.Налог
			|	ИЛИ	ПлатежноеПоручениеИсходящее.СубконтоДт2 = ЗарплатаКВыплате.Налог
			|	ИЛИ	ПлатежноеПоручениеИсходящее.СубконтоДт3 = ЗарплатаКВыплате.Налог)
			|ГДЕ  ПлатежноеПоручениеИсходящее.Ссылка = &Ссылка
			|";
			
			Результат=Запрос.Выполнить().Выбрать();
			Пока Результат.Следующий() Цикл 
				Сум = Результат.СуммаПоВедомости;
				Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0); // "случайная" копейка
				Если Результат.СуммаВыплачено <> Сум Тогда
					Сообщить("Не совпадает сумма документа и суммы по ведомостям на перечисление взносов в строке номер "+Результат.НомерСтроки);
					Отказ=Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если  ЕстьРасчетыСКонтрагентами 
		И НЕ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами		
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС (неподтвержденный)!");
						
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС н/к (н/о)!");
						
					КонецЕсли;
				КонецЕсли;

				Если Платеж.НалоговоеНазначение.Пустая() Тогда
						
					Отказ = истина;
						
					Если Отказ Тогда
						
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указано Налоговое назначение!");
							
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЦикла; 	
		
	КонецЕсли; 
	
	Если  ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю
		И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если   Платеж.ВозвратАвансаДо01042011НУ И НЕ ЗначениеЗаполнено(Платеж.СтатьяПоВозвратуАвансаДо2011НУ) Тогда
				
				СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для договора ""¤1¤"" не указана статья по возврату аванса до 01.04.2011!'; uk = 'Для договору ""¤1¤"" не зазначена стаття по поверненню аванса до 01.04.2011!'"), Строка(Платеж.ДоговорКонтрагента));
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;				
	
КонецПроцедуры //ПроверитьЗаполнениеДокументаРегл()

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Режим, Заголовок)
	
	// Проверка шапки 
	
	// Сформируем структуру обязательных полей
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	
	// Общие обязательные поля
	СтруктураОбязательныхПолей.Вставить("СчетОрганизации","Не указан банковский счет организации!");
	СтруктураОбязательныхПолей.Вставить("СуммаДокумента");
	Если Оплачено Тогда
		СтруктураОбязательныхПолей.Вставить("ДатаОплаты","Не указана дата оплаты документа банком!");
	КонецЕсли; 
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам
	 ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
		СтруктураОбязательныхПолей.Вставить("Контрагент");
	КонецЕсли;		
	
	Если ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		СтруктураОбязательныхПолей.Вставить("СчетКонтрагента","Не указан банковский счет, на который производится перевод!");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
		СтруктураОбязательныхПолей.Вставить("ФизЛицо","Не указано подотчетное лицо");
		СтруктураОбязательныхПолей.Вставить("ВалютаВзаиморасчетовРаботника","Не указана валюта взаиморасчетов с подотчетным лицом");
	КонецЕсли;
	
	// Регл. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетБанк",       "Не указан счет учета денежных средств");
		
		Если СчетБанк.Валютный Тогда
			СтруктураОбязательныхПолей.Вставить("ВалютаДокумента","Не указана валюта документа.");
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
			
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
			
		КонецЕсли;
		
		Если ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
			СтруктураОбязательныхПолей.Вставить("СчетКонтрагента","Не указан банковский счет, на который производится перевод!");
		КонецЕсли;
		
		Если (ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств)
			И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда

			Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетУчетаРасчетовСКонтрагентом) = "Затраты"
			   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда
				СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПриПрочемСписании", "Не указано налоговое назначение!");
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли; 
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверка ТЧ
	СтруктураОбязательныхПолейТЧ = Новый Структура();
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолейТЧ.Вставить("СуммаВзаиморасчетов");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорКонтрагента");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕСли;
	КонецЕСли;
	
	УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "РасшифровкаПлатежа", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента И
		 НЕ (ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога ИЛИ
		     ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП ИЛИ
			 ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты)
			 Тогда
		Сообщить(Заголовок+" 
		|не совпадают сумма документа и ее расшифровка.");
		
		Отказ=Истина;
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			//Проверим на возможность проведения в БУ и НУ
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(Платеж.ДоговорКонтрагента, ВалютаДокумента,

												 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
												 Ложь, Отказ, Заголовок, "", Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		КонецЦикла;
	КонецЕСли;	
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверитьЗаполнениеДокументаУпр(Отказ, Режим, Заголовок);
	КонецЕСли;	
		
	Если СтруктураШапкиДокумента.Оплачено И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕСли;	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок, СтруктураКурсыВалют, СтруктураШапкиДокумента)
	ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураКурсыВалют, СтруктураШапкиДокумента);
	
	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента);
	КонецЕсли; 
	
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, РежимПроведения,Отказ,Заголовок);
КонецПроцедуры

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ (Оплачено И ОтражатьВУправленческомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Приход;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю Тогда
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику Тогда
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	Иначе
		ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, "РасшифровкаПлатежа", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, РежимПроведения, Отказ, Заголовок)
	
	// Бухгалтерские проводки документа
	Если Не СтруктураШапкиДокумента.Оплачено Тогда
		Возврат;
	Конецесли;
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
    
	ПроводкиБУ = Движения.Хозрасчетный;
	
	РасчетыВВалюте = Ложь;
	Если СчетОрганизации.ВалютаДенежныхСредств <> мВалютаРегламентированногоУчета Тогда
		КассаВВалюте = Истина;
	КонецЕсли;
	
	ВидСчетаОрг = СчетОрганизации.ВидСчета;
	ВалютаСчета = СчетОрганизации.ВалютаДенежныхСредств;
	
	СчетКт		= СтруктураШапкиДокумента.СчетБанк;
	
	РасчетыВВалюте = Ложь;
	МоментДокумента = Новый МоментВремени(ДатаДвижений, Ссылка);
	Если СчетБанк.Валютный Тогда
		РасчетыВВалюте = Истина;
		УправлениеДенежнымиСредствами.ПроверитьОстатокДенежныхСредств(СтруктураШапкиДокумента.СуммаДокумента, СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ВалютаДокумента, МоментДокумента, СтруктураШапкиДокумента.СчетБанк,СтруктураШапкиДокумента.СчетОрганизации, Заголовок);
	Иначе
		УправлениеДенежнымиСредствами.ПроверитьОстатокДенежныхСредств(СтруктураШапкиДокумента.СуммаДокумента, СтруктураШапкиДокумента.Организация, , МоментДокумента, СтруктураШапкиДокумента.СчетБанк,СтруктураШапкиДокумента.СчетОрганизации, Заголовок);
	КонецЕсли;
	
	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		
		//Дополнение структуры шапки документа (для использования глобальных процедур)
		СтруктураШапкиДокумента.Вставить("КоррСчет"			,СчетКт);
		
		//Вызов универсальной процедуры подготовки реестра платежей по данным документа. 		
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
		СодержаниеПроводки = "";
		
		Если ЕстьРасчетыСКонтрагентами Тогда
			Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами Тогда
				СодержаниеПроводки = "Расчеты с контрагентом";
				РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
			КонецЕсли; 
			БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Истина,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей); 	  
		Иначе //расчеты по кредитам
			СодержаниеПроводки = "Расчеты по кредитам и займам";
			БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,Ложь,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей);
		КонецЕсли; 
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП Тогда
		
		СпособОплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
		ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.Выплачено;
		ПроведениеРасчетов.ВыполнитьДвиженияПоЗарплате( Ссылка, Движения, ПроводкиБУ, СчетБанк, СпособОплаты, ВыплаченностьЗарплаты, СчетОрганизации,,Контрагент );
		
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств
		ИЛИ   ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Тогда
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период      = ДатаДвижений;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		
		Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
			Проводка.Содержание  = "Перечисление налогов";
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств Тогда	
			Проводка.Содержание  = "Прочее списание денежных средств";
		ИначеЕсли Проводка.СчетДт.Валютный Тогда
			Проводка.Содержание = "Продажа валюты";
		Иначе
			Проводка.Содержание = "Покупка валюты";
		КонецЕсли;		
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.Контрагент);
		Иначе	
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоДт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоДт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоДт3);
		КонецЕсли;	
		                                                                                         
		Проводка.СчетКт      = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
		Если РасчетыВВалюте Тогда
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
			ДанныеОВалютеДок.Курс,      1, 
			ДанныеОВалютеДок.Кратность, 1);
		Иначе
			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетУчетаРасчетовСКонтрагентом) = "Затраты" Тогда
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.НалоговоеНазначениеДт = НалоговоеНазначениеПриПрочемСписании;
				Если НЕ НалоговоеНазначениеПриПрочемСписании = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
			Если СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ Тогда 
			  ДвиженияПоВзаиморасчетыПоНДФЛ();
		  	КонецЕсли;
			
			Для каждого ТекущаяСтрока Из ПеречислениеНалогов Цикл
				
				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период      = ДатаДвижений;
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "Перечисление налогов";
				
				Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ТекущаяСтрока.СубконтоДт1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ТекущаяСтрока.СубконтоДт2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ТекущаяСтрока.СубконтоДт3);
				
				Проводка.СчетКт      = СчетКт;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
				
				Проводка.Сумма = ТекущаяСтрока.Сумма;
				
				// только для расчета ЗП						
				Если Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению 
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюНаСлучайБезработицы
					ИЛИ Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев
					Тогда
					
                    мСтатьяНалоговойДекларации = "";
					Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт1; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт2; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт3; 
					КонецЕсли;
                    мНалог = "";
					Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт1; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт2; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт3; 
					КонецЕсли;
					ДвиженияПоВзаиморасчетыПоВзносамВФонды(ТекущаяСтрока.Ведомость, мСтатьяНалоговойДекларации, мНалог)
					
				КонецЕсли; 	
				
			КонецЦикла; 
			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период      = ДатаДвижений;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = "Перевод средств на другой счет организации";
		
		Проводка.СчетДт      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СчетКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
		
		Проводка.СчетКт      = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
		
		Если РасчетыВВалюте Тогда
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
			ДанныеОВалютеДок.Курс,      1, 
			ДанныеОВалютеДок.Кратность, 1);
		Иначе
			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
		
		СтруктураШапкиДокумента.Вставить("КоррСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период      = ДатаДвижений;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание = "Выдача средств подотчетнику";
		
		Если РасчетыВВалюте Тогда
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте;
		Иначе                          
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;
		КонецЕсли;
		Проводка.СубконтоДт.РаботникиОрганизаций = СтруктураШапкиДокумента.ФизЛицо;
		
		Проводка.СчетКт      = СчетКт;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
		
		Если РасчетыВВалюте Тогда
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;
			
			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
			ДанныеОВалютеДок.Курс,      1, 
			ДанныеОВалютеДок.Кратность, 1);
		Иначе
			Проводка.Сумма = СтруктураШапкиДокумента.СуммаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	Если   ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда

		Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			
			Если НЕ СтрокаРасшифровки.ВозвратАвансаДо01042011НУ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПриобретение = (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ВХОДЯЩ") > 0) ИЛИ (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ПРИХОД") > 0);			
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			СуммаСторноДоходовЗатрат = - СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011;
				
			Если ЭтоПриобретение Тогда
				Проводка.СчетДт    = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
				Проводка.СчетКт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно расходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно витрат при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
					
			Иначе	
				Проводка.СчетКт    = ПланыСчетов.Хозрасчетный.ДругиеДоходыОтОбычнойДеятельности;
				Проводка.СчетДт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно доходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно доходів при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц

	Если СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
		Если    ЕстьРасчетыСКонтрагентами 
			или ЕстьРасчетыПоКредитам  
			или ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
			
			РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
			
			ТаблицаПеречислениеНалогов = ПеречислениеНалогов.Выгрузить();
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуТаблица(ЭтотОбъект,СтруктураШапкиДокумента,ТаблицаПеречислениеНалогов,Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП 
			или ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуПрочее(ЭтотОбъект,СтруктураШапкиДокумента,Отказ);	
			
		КонецЕсли;
	КонецЕсли;	
	
	Если (ЕстьРасчетыСКонтрагентами и не ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами)
	   И СтруктураШапкиДокумента.ЕстьНДС Тогда
		РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
		НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
	КонецЕсли;         		
	
КонецПроцедуры

Процедура	ДвиженияПоВзаиморасчетыПоВзносамВФонды(Ведомость, СтатьяНалоговойДекларации, Налог)
	
	// все проверки уже сделаны, осталось только провести
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("СтатьяНалоговойДекларации", СтатьяНалоговойДекларации);
	Запрос.УстановитьПараметр("Налог", Налог);
	
	Запрос.Текст =
	"ВЫБРАТЬ                                          
	|	Основной.Ссылка.Организация		КАК Организация,
	|	Основной.Ссылка.Дата			КАК Период,
	|	Основной.ПериодВзаиморасчетов	КАК ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало	КАК ПериодДействия,
	|	СУММА(Основной.База)			КАК База,
	|	СУММА(Основной.БазаВзноса)		КАК БазаВзноса,
	|	СУММА(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Основной
	|ГДЕ	Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0 ИЛИ Основной.БазаВзноса <> 0 ИЛИ Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.Ссылка,
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ                                          
	|	Основной.Ссылка.Организация,
	|	Основной.Ссылка.Дата,
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало,
	|	Сумма(Основной.База)			КАК База,
	|	Сумма(Основной.БазаВзноса)		КАК БазаВзноса,
	|	Сумма(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Основной   
	|ГДЕ	Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0	ИЛИ	Основной.БазаВзноса <> 0	ИЛИ	Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.Ссылка,
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.БазовыйПериодНачало
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВзаиморасчетыПоВзносамВФонды.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Налог			= Налог;
		Движение.СтатьяНалоговойДекларации	= СтатьяНалоговойДекларации;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоВзаиморасчетыПоВзносамВФонды()

Процедура	ДвиженияПоВзаиморасчетыПоНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	НаименованиеДокумента = Ссылка.Метаданные().Имя;
	
	Запрос.Текст = "
	|ВЫБРАТЬ                                          
	|	Основной.Ссылка.Организация		КАК Организация,
	|	Основной.Сотрудник,
	|	Основной.ДоходНДФЛ,
	|	Основной.ВидСтавки,
	|	Основной.ПериодВзаиморасчетов,
	|	Основной.Льгота,
	|	Основной.КоличествоЛьгот,
	|	Основной.Налог,
	|	Основной.НалогУпр,
	|	Основной.НалоговыйПериод	КАК НалоговыйПериод,
	|	Основной.Доход
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + НаименованиеДокумента + ".ПеречислениеНалогов  КАК НалогиПлатежки
	|ПО НалогиПлатежки.Ссылка = &Ссылка
	|	И НалогиПлатежки.Ведомость = Основной.Ссылка
	|
	|ГДЕ	Основной.Налог <> 0
	|";
	
	КодОперацииВыплата = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение.Период      	= ДатаДвижений;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоЗарплатеРегл()

Процедура ЗаполнитьРасшифровкуПлатежа()
	
	ТаблицаКопия = ПеречислениеНалогов.Выгрузить(,"Сумма,СтатьяДвиженияДенежныхСредств, Проект, ДокументПланированияПлатежа, СтатьяДекларацииПоЕдиномуНалогу");
	ТаблицаКопия.Свернуть("СтатьяДвиженияДенежныхСредств, Проект, ДокументПланированияПлатежа, СтатьяДекларацииПоЕдиномуНалогу","Сумма");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("Сумма"),"СуммаПлатежа");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("СтатьяДвиженияДенежныхСредств"),"СтатьяДвиженияДенежныхСредств");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("Проект"),"Проект");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("ДокументПланированияПлатежа"),"ДокументПланированияПлатежа");
	РасшифровкаПлатежа.ЗагрузитьКолонку(ТаблицаКопия.ВыгрузитьКолонку("СтатьяДекларацииПоЕдиномуНалогу"),"СтатьяДекларацииПоЕдиномуНалогу");
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОснованиюРегл(Основание,СтрокаБанки = Неопределено)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций")	Тогда
		
		Если Основание.ВидВыплаты = Справочники.ВидыВыплат.Очередная
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.ОчереднаяПогашениеДолгов
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.Аванс
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.АвансПредварительныйРасчет
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.Депоненты
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.Дивиденды
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.Отпуск
			ИЛИ НЕ Основание.ВидВыплаты.Предопределенный
			Тогда
			ВидЗаполнения = "ПеречислениеЗарплаты";
			
		ИначеЕсли Основание.ВидВыплаты = Справочники.ВидыВыплат.НДФЛКонтрагентам
			Тогда
			ВидЗаполнения = "ПеречислениеНДФЛ";
			
		ИначеЕсли Основание.ВидВыплаты = Справочники.ВидыВыплат.ОчереднаяВзносы
			ИЛИ Основание.ВидВыплаты = Справочники.ВидыВыплат.ОчереднаяПогашениеДолговВзносы
			Тогда
			ВидЗаполнения = "ПеречислениеВзносов";
			
		КонецЕсли;
		
		Если ВидЗаполнения = "ПеречислениеЗарплаты" Тогда
			// Зарплата
			ВидОперации        = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП;
			ВалютаДокумента    = мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			Организация        = Основание.Организация;
			ДокументОснование  = Основание;
			
			Если Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ВалютаДокумента Тогда
				СчетОрганизации = Организация.ОсновнойБанковскийСчет;
			КонецЕсли;
			
			
			// Определим сумму выплаченной заработной платы
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Основание);
			
			ТекстЗапроса = "
			|ВЫБРАТЬ Различные                         
			|	РаботникиОрганизации.Банк
			|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
			|
			|ГДЕ 	РаботникиОрганизации.Ссылка = &Ссылка
			|	И	РаботникиОрганизации.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Выплачено)
			|	И	РаботникиОрганизации.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
			|";
			Запрос.Текст = ТекстЗапроса;
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("По текущей ведомости нет сумм к выплате через банк!")
				
			Иначе	
				Если СтрокаБанки = Неопределено Тогда
					тбБанки = РезультатЗапроса.Выгрузить();
					тбБанки.Свернуть("Банк");
					
					СтрокаБанки = тбБанки.ВыбратьСтроку(НСтр("ru='Выберите банк.';uk='Виберіть банк.'"));
				КонецЕсли;	
				Если СтрокаБанки <> Неопределено Тогда
					Контрагент = СтрокаБанки.Банк;
					СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
					
					ВыборкаБанк = РезультатЗапроса.Выбрать(); 
					Если ВыборкаБанк.НайтиСледующий(СтрокаБанки.Банк,"Банк") Тогда
						
						Запрос=Новый Запрос;
						Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
						Запрос.УстановитьПараметр("Ссылка", Основание);
						Запрос.УстановитьПараметр("Регистратор", Ссылка);
						Запрос.УстановитьПараметр("Банк", СтрокаБанки.Банк);
						
						ТекстЗапроса = "                    
						|ВЫБРАТЬ                          
						|	ПараметрыОплаты.СчетУчета		КАК СчетУчета,
						|	СУММА(ПараметрыОплаты.Сумма)	КАК Сумма
						|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты	КАК ПараметрыОплаты
						|                          
						|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК РанееВыплаченныеСуммы
						|ПО	ПараметрыОплаты.Ссылка = РанееВыплаченныеСуммы.Ведомость
						|И	ПараметрыОплаты.Сотрудник = РанееВыплаченныеСуммы.Сотрудник
						|И	(РанееВыплаченныеСуммы.Регистратор <> &Регистратор)
						|
						|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
						|ПО	ПараметрыОплаты.Ссылка = РаботникиОрганизации.Ссылка
						|И	ПараметрыОплаты.Сотрудник = РаботникиОрганизации.Сотрудник
						|
						|ГДЕ ПараметрыОплаты.Ссылка = &Ссылка
						|	И РанееВыплаченныеСуммы.Сотрудник ЕСТЬ NULL 
						|	И РаботникиОрганизации.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Выплачено)
						|	И РаботникиОрганизации.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
						|	И РаботникиОрганизации.Банк = &Банк
						|
						|СГРУППИРОВАТЬ ПО
						|	ПараметрыОплаты.СчетУчета
						|";
						
						Запрос.Текст = ТекстЗапроса;
						Если Запрос.Выполнить().Пустой() Тогда
							ОбщегоНазначения.СообщитьОбОшибке("Через данный банк выплаты уже проводились! " );
						Конецесли;
						Выборка = Запрос.Выполнить().Выбрать(); 
						
						Пока Выборка.Следующий() Цикл
							
							СтрокаВедомость = ВыплатаЗаработнойПлаты.Добавить();
							СтрокаВедомость.Ведомость		= Основание;
							СтрокаВедомость.СчетУчета		= Выборка.СчетУчета;
							СтрокаВедомость.СуммаПлатежа	= Выборка.Сумма;
							
							СуммаДокумента = СуммаДокумента + Выборка.Сумма;
							
						КонецЦикла;
						
						СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
						СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			
		ИначеЕсли ВидЗаполнения = "ПеречислениеНДФЛ" Тогда
			
			// НДФЛ
			ВидОперации        = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога;
			ВалютаДокумента    = мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			Организация        = Основание.Организация;
			ДокументОснование  = Основание;
			
			Если Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ВалютаДокумента Тогда
				СчетОрганизации = Организация.ОсновнойБанковскийСчет;
			КонецЕсли;
			
			Запрос = Новый Запрос;    
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("парамВедомости", Основание);
			//	ВТНалоги
			Если Истина Тогда
				//	Описание:
				//      осноная часть запроса, тут получим даные для проведения
				// 
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.Ссылка						КАК Ссылка,
				|		Основной.Ссылка.Организация			КАК Организация,
				|		СУММА( Основной.Налог )			КАК Результат
				|ПОМЕСТИТЬ ВТНалоги	
				|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
				|	ГДЕ Основной.Ссылка в (&парамВедомости)
				|	СГРУППИРОВАТЬ ПО
				|		Основной.Ссылка
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТНалоги = "ВТНалоги";
			КонецЕсли;
			
			// определим парметры платежки
			ТекстЗапроса = "	       
			|ВЫБРАТЬ 
			|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
			|			ТОГДА Параметры.СчетУчета	
			|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
			|	КОНЕЦ	                                КАК СчетУчета,
			|	Начисления.Результат					КАК Сумма,
			|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
			|			ТОГДА Параметры.Контрагент	
			|			ИНАЧЕ ПараметрыСтрогие.Контрагент	
			|	КОНЕЦ	                                КАК Контрагент,
			|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
			|			ТОГДА Параметры.СчетКонтрагента	
			|			ИНАЧЕ ПараметрыСтрогие.СчетКонтрагента	
			|	КОНЕЦ	                                КАК СчетКонтрагента
			|ИЗ ВТНалоги КАК Начисления
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ  (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК ПараметрыСтрогие
			|ПО		ПараметрыСтрогие.Организация = Начисления.Организация
			|	И	ПараметрыСтрогие.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка)
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК Параметры
			|ПО		Параметры.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|	И	Параметры.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка)
			|
			|";
			Запрос.Текст = ТекстЗапроса;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Контрагент		= Выборка.Контрагент;
				СчетКонтрагента = Выборка.СчетКонтрагента;
				СуммаДокумента	= Выборка.Сумма;
				СчетУчетаРасчетовСКонтрагентом	= Выборка.СчетУчета;
				
				СтрокаВедомость = ПеречислениеНалогов.Добавить();
				СтрокаВедомость.Ведомость	= Основание;
				СтрокаВедомость.Сумма		= Выборка.Сумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;			
	
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	Если ЕстьРасчетыСКонтрагентами Тогда
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	КонецЕсли; 

	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	
	#Если Клиент Тогда
    Дата = РабочаяДата;
	#КонецЕсли
	
	ДокументОснование = Основание;

	СпособЗаполнения = "Не заполнять";
	ВалютаДокумента  = мВалютаРегламентированногоУчета;
	КурсДокумента      = 1;
	КратностьДокумента = 1;

	Если ДоговорКонтрагента.Внешнеэкономический Тогда
		ВалютаДокумента  = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда

	 	// Установка операции
		ВидОперации  = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
		
		// Заполнение реквизитов шапки документа
		Если ЗначениеЗаполнено(Контрагент.ОсновнойБанковскийСчет) Тогда
			СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;

		Если ЗначениеЗаполнено(Основание.СтруктурнаяЕдиница) Тогда
			СчетОрганизации = Основание.СтруктурнаяЕдиница;
		Иначе
			Если ВалютаДокумента = Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств Тогда
				СчетОрганизации  = Организация.ОсновнойБанковскийСчет;
			КонецЕсли;				

		КонецЕсли;

		Если НЕ СчетОрганизации.Пустая() Тогда
			ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ВалютаДокумента = мВалютаРегламентированногоУчета;
		КонецЕсли;

		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента           = СтруктураКурсаДокумента.Курс;
		КратностьДокумента      = СтруктураКурсаДокумента.Кратность;	
		
		// Подготовка таблицы платежей
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		// Заполонение общих параметров,для всех строк таблицы платежей
		ДоговорКонтрагента      	= Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов= МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
        Если ОтражатьВБухгалтерскомУчете Тогда
    		// Заполним счету бух.учета
     		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Основание.Организация, 
     		                                                Основание.Контрагент, Основание.ДоговорКонтрагента);
    		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетРасчетов, "СчетУчетаРасчетовСКонтрагентом"); 
    		ТаблицаПлатежей.ЗаполнитьЗначения(СчетаУчета.СчетАвансов, "СчетУчетаРасчетовПоАвансам") ;
        КонецЕсли;    
		
		// Определение сделки
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"))
			И (ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Сделка=Основание;
			Иначе
				Сделка=Основание.ДокументОснование;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			Сделка=Основание;
		Иначе
			Сделка=Неопределено;
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");

		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования           = СтруктураКурсаОснования.Курс;
		КратностьОснования      = СтруктураКурсаОснования.Кратность;
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");
        
		// Определение способа расчета сумм платежей. Не всегда документ заполняется исключительно по основани.
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") И Основание.Проведен  Тогда
			СпособЗаполнения = "По заказу";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДопРасходов")) 
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"))
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеНМА"))
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"))
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")) Тогда

	 	// Установка операции
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
		КонецЕсли;
		
		// Заполнение реквизитов шапки документа
		
		Если ВалютаДокумента = Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств Тогда
			СчетОрганизации  = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;

		Если ЗначениеЗаполнено(СчетОрганизации) И ЗначениеЗаполнено(Контрагент.ОсновнойБанковскийСчет) И Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=СчетОрганизации.ВалютаДенежныхСредств Тогда
			СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;

		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;	

		// Подготовка таблицы платежей
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		СуммаДокументаОснования = Ценообразование.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
		СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Если Основание.УдержатьКомиссионноеВознаграждение Тогда
				СуммаКоррПлатежа= СуммаДокументаОснования.Итог("СуммаПлатежа") - Основание.СуммаВознаграждения;
				НоваяКолонкаСумм = ОбщегоНазначения.РаспределитьПропорционально(СуммаКоррПлатежа,СуммаДокументаОснования.ВыгрузитьКолонку("СуммаПлатежа"));
				Если не НоваяКолонкаСумм = Неопределено Тогда
					СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаСумм,"СуммаПлатежа");
				КонецЕсли; 
					
				СуммаКоррНДС	= СуммаДокументаОснования.Итог("СуммаНДС") - Основание.Товары.Итог("СуммаНДСВознаграждения");
				НоваяКолонкаНДС = ОбщегоНазначения.РаспределитьПропорционально(СуммаКоррНДС,СуммаДокументаОснования.ВыгрузитьКолонку("СуммаНДС"));
				Если не НоваяКолонкаНДС = Неопределено Тогда
					СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаНДС,"СуммаНДС");
				КонецЕсли; 
			КонецЕсли; 
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДопРасходов") тогда
			Если Не(Основание.Сумма=0 и Основание.СуммаНДС=0)  тогда
				Если СуммаДокументаОснования.Количество()=0 тогда
					СтрокаТаблицыСумм = СуммаДокументаОснования.Добавить();
				Иначе
					СтрокаТаблицыСумм = СуммаДокументаОснования[0];
				КонецЕсли;
				СтрокаТаблицыСумм.СуммаПлатежа	= СтрокаТаблицыСумм.СуммаПлатежа + Основание.Сумма;
				СтрокаТаблицыСумм.СуммаНДС		= СтрокаТаблицыСумм.СуммаНДС + Основание.СуммаНДС;
				Если не Основание.СуммаВключаетНДС Тогда
					СтрокаТаблицыСумм.СуммаПлатежа = СтрокаТаблицыСумм.СуммаПлатежа+Основание.СуммаНДС;
				КонецЕсли; 
			КонецЕсли;
			СуммаДокументаОснования.ЗаполнитьЗначения(Основание.СтавкаНДС,"СтавкаНДС");
		КонецЕсли;
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		// Заполонение общих параметров,для всех строк таблицы платежей
		ДоговорКонтрагента      	= Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов= МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
        МетаданныеДокументаОснования = Основание.Метаданные();
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Проект", МетаданныеДокументаОснования) Тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.Проект, "Проект");			
		КонецЕсли;
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом, "СчетУчетаРасчетовСКонтрагентом") ;
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансамВыданным, "СчетУчетаРасчетовПоАвансам") ;
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом, "СчетУчетаРасчетовСКонтрагентом") ;
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам, "СчетУчетаРасчетовПоАвансам") ;
		КонецЕсли;
		
		Сделка = Основание.Сделка;
		
		Если ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			ДокументРасчетовСКонтрагентом = Основание;
		КонецЕсли;
		
		Если Основание.Проведен Тогда
			СпособЗаполнения = "По взаиморасчетам";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;

		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");
		ТаблицаПлатежей.ЗаполнитьЗначения(ДокументРасчетовСКонтрагентом,"ДокументРасчетовСКонтрагентом");
		
		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования           = СтруктураКурсаОснования.Курс;
		КратностьОснования      = СтруктураКурсаОснования.Кратность;
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");
		
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
 		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
        
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			
		ВидОперации  = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
			
		Контрагент   = Основание.Контрагент;
		ДоговорКонтрагента 			= Основание.ДоговорКонтрагента;
		ВидРасчетовПоДоговору   	= БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеВидаРасчетовПоПараметрамДоговора(ДоговорКонтрагента,мВалютаРегламентированногоУчета);
		Если ВидРасчетовПоДоговору	= Перечисления.ВидыРасчетовПоДоговорам.РасчетыВИностраннойВалюте тогда
			ВалютаДокумента = Основание.ВалютаДокумента;
		КонецЕсли;
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсДокумента           = СтруктураКурсаДокумента.Курс;
		КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		СуммаДокументаОснования = Новый ТаблицаЗначений();
		СуммаДокументаОснования.Колонки.Добавить("СуммаПлатежа",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
		СуммаДокументаОснования.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
		СуммаДокументаОснования.Колонки.Добавить("СуммаНДС",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
		СтрокаТаблицыСумм = СуммаДокументаОснования.Добавить();
			
		СтрокаТаблицыСумм.СтавкаНДС	= Основание.СтавкаНДСВознаграждения;
		СтрокаТаблицыСумм.СуммаНДС	= Основание.Товары.Итог("СуммаНДСВознаграждения");
		СтрокаТаблицыСумм.СуммаПлатежа	= ?(Основание.СуммаВключаетНДС, Основание.СуммаВознаграждения, Основание.СуммаВознаграждения+СтрокаТаблицыСумм.СуммаНДС);
		
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,"КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность,"КратностьВзаиморасчетов");
		
		// Определение сделки
		// Попутно, определение способа расчета сумм платежей. Не всегда документ заполняется исключительно по основанию.
		Сделка = Основание.СделкаПоПриобретению;
		Если Основание.Проведен Тогда
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(Сделка,"Сделка");
		
		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования           = СтруктураКурсаОснования.Курс;
		КратностьОснования      = СтруктураКурсаОснования.Кратность;
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"),"СуммаВзаиморасчетов");
        
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
		КонецЦикла; 
		
		СчетУчетаРасчетовСКонтрагентом 	= Основание.СчетУчетаРасчетовЗаПосредническиеУслуги;
		СчетУчетаРасчетовПоАвансам		= Основание.СчетУчетаРасчетовПоАвансамВыданным;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций") Тогда
		Если Основание.ВидВыплаты = Справочники.ВидыВыплат.ОчереднаяВзносы ИЛИ
			Основание.ВидВыплаты = Справочники.ВидыВыплат.ОчереднаяПогашениеДолговВзносы Тогда
			ОбщегоНазначения.СообщитьИнформацию("Для перечисления налогов и взносов воспользуйтесь документом ""Формирование платежных документов по взносам в фонды"" ! ");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДокументПоОснованиюРегл(Основание);
	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаПокупкуПродажуВалюты")	Тогда
		
		ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты;
								
		Если Основание.ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
			ВалютаДокумента=мВалютаРегламентированногоУчета;
			
			СчетОрганизации = Основание.СчетГривневый;
			Контрагент = Основание.Банк;
			СчетКонтрагента = Основание.СчетБанка;
			СуммаДокумента = Основание.СуммаГривневая + Основание.СуммаГривневая*Основание.Комиссионные/100;
			СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПродажаВалюты Тогда
			ВалютаДокумента = Основание.Валюта;
						
			СчетОрганизации = Основание.СчетВалютный;
			Контрагент = Основание.Банк;
			СчетКонтрагента = Основание.СчетБанка;
			СуммаДокумента = Основание.СуммаВалютная;
			СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
	
		КонецЕсли;	
		
		СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		СтрокаПлатеж.СуммаВзаиморасчетов = СуммаДокумента;
		СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетУчетаРасчетовСКонтрагентом;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда

		СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
		
		ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику;
		ФизЛицо                       = Основание.ФизЛицо;
		РасчетныйДокументРаботника    = Основание;
		ВалютаВзаиморасчетовРаботника = Основание.ВалютаДокумента;
		
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовРаботника, ТекущаяДата());
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		СпособЗаполнения = "По взаиморасчетам с подотчетным лицом";
		
	КонецЕсли;
	
	ЗаполнитьДокументПоОснованиюУпр(Основание);
    
	Если СпособЗаполнения = "По заказу" Тогда

		// В заказе есть несколько ставок НДС. Для пересчета сумму остатка по заказу, в соотв. со значениеми по 
		// ставкам НДС, добавим новую колонку в таблицу платежей.
		// В заказе есть несколько ставок НДС. Для пересчета сумму остатка по заказу, в соотв. со значениеми по 
		// ставкам НДС, добавим новую колонку в таблицу платежей.
		ОписаниеТиповЧ = Новый ОписаниеТипов("Число");
		ТаблицаПлатежей.Колонки.Добавить("Коэф",ОписаниеТиповЧ);
		
		Если ТаблицаПлатежей.Количество()>1 Тогда
			Если ТаблицаПлатежей.Итог("СуммаПлатежа") <> 0 Тогда
				Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
					СтрокаПлатеж.Коэф = СтрокаПлатеж.СуммаПлатежа/ТаблицаПлатежей.Итог("СуммаПлатежа");
				КонецЦикла;	
			КонецЕсли;
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(1, "Коэф");
		КонецЕсли; 
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ЗаполнитьПоЗаказуУпр(СтрокаПлатеж);
			СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов *  СтрокаПлатеж.Коэф;
			СтрокаПлатеж.СуммаПлатежа 		 = СтрокаПлатеж.СуммаПлатежа 	    *  СтрокаПлатеж.Коэф;
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
		КонецЦикла;	

		// Загрузка таблицы платежей в текущий документ 
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];
		
	ИначеЕсли СпособЗаполнения = "По взаиморасчетам" Тогда
		
		// Данный вид заполнения, для бухгалтерского учета невозможен.
        Если НЕ ОтражатьВБухгалтерскомУчете Тогда
			Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
				УправлениеДенежнымиСредствами.ЗаполнитьПоВзаиморасчетамУпр(ВалютаДокумента,КурсДокумента,КратностьДокумента,СтрокаПлатеж,-1);
				СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
				УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			КонецЦикла;	
		КонецЕсли;

		// Загрузка таблицы платежей в текущий документ 
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];
		
	ИначеЕсли СпособЗаполнения = "По взаиморасчетам с подотчетным лицом" Тогда
		
		ПроверкаКурсовВалют(СтрокаПлатеж);
		ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж);
		
	ИначеЕсли СпособЗаполнения = "По сумме документа" Тогда

		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			
		// Если основание - отчет комитенту и комиссионное вознаграждение удерживается, то надо вычесть вознаграждение
			ОснованиеСуммаДокумента = Основание.СуммаДокумента;
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				Если Основание.УдержатьКомиссионноеВознаграждение = Истина Тогда	
					ОснованиеСуммаДокумента = Основание.СуммаДокумента - Основание.СуммаВознаграждения;
				КонецЕсли;	
			КонецЕсли;

			СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
			КурсОснования           = СтруктураКурсаОснования.Курс;
			КратностьОснования      = СтруктураКурсаОснования.Кратность;

            СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
                                               КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, Основание.ВалютаДокумента, ВалютаДокумента, КурсОснования,
			                 КурсДокумента, КратностьОснования, КратностьДокумента);
                             
			СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;

			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
		КонецЦикла;	
		
		// Загрузка таблицы платежей в текущий документ 
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж = РасшифровкаПлатежа[0];

	Иначе
        Если  НЕ(ТаблицаПлатежей=Неопределено) Тогда
    		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		КонецЕсли; 
		Если РасшифровкаПлатежа.Количество() > 0 Тогда
			СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		КонецЕсли;

	КонецЕсли;

	ОтражатьВУправленческомУчете = Истина;
	ДокументОснование  = Основание.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) или ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
		СчетБанк = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
	Иначе
		СчетБанк = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВИностраннойВалюте;
	КонецЕсли;
	
	//УстановитьНомерПоручения();
	
	ЕстьРасчетыСКонтрагентами = УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам     = УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	Ответственный      = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
 	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                         , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                          , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       			, "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                       			, "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                     , "ВедениеУчетаПоПроектам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	РасчетыВозврат=УправлениеДенежнымиСредствами.НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(ВидОперации);
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
		
		КурсДокумента      = РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		КратностьДокумента = РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

	Иначе	
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("КурсДокумента", КурсДокумента);
	СтруктураШапкиДокумента.Вставить("КратностьДокумента", КратностьДокумента);

	ДатаДвижений=?(Оплачено,УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Дата,ДатаОплаты),Дата);
	СтруктураШапкиДокумента.Вставить("ДатаОплаты",ДатаДвижений);
	
	СтруктураШапкиДокумента.Вставить("ОтраженоВОперУчете",ОтражатьВУправленческомУчете);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
 	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
 	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
 	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
 	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	ТаблицаПлатежейУпр = УправлениеДенежнымиСредствами.ПолучитьТаблицуПлатежейУпр(Дата, ВалютаДокумента, Ссылка, "ПлатежноеПоручениеИсходящее");
	
	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ,Режим,Заголовок);
	
	СтруктураКурсыВалют = СформироватьСтруктуруКурсыВалютУпр();
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураКурсыВалют, СтруктураШапкиДокумента);
	КонецЕсли; 
	
 	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога Тогда
		ЗаполнитьРасшифровкуПлатежа();
	КонецЕсли;

	НомерПечать=ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
	 Если  РасшифровкаПлатежа.Количество() = 0 Тогда
	 	НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СуммаПлатежа = СуммаДокумента;
	 КонецЕсли;
	
	СтруктураДействий = Новый Структура("ПроверитьНомер, УстановитьДоговор");
	УправлениеДенежнымиСредствами.ВыполнитьДействияПередЗаписьюПлатежногоДокумента(ЭтотОбъект, СтруктураДействий, Отказ, РежимЗаписи, РежимПроведения);
	
	//Если НЕ ЗначениеЗаполнено(НомерПоручения) ИЛИ ЭтоНовый() Тогда
	//	УстановитьНомерПоручения();
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// для нового документа стоит очистить номер поручения
	НомерПоручения = "";
	
	ДокументОснование = Неопределено

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура выполняет заполнение суммы документа,
// по регистру "СуммыЗаказов".
//
// Параметры:
//  ДокументОснование  - документ ссылка (Заказ покупателя, Заказ поставщику).
//  ВалютаДокумента    - валюта документа (валюта регламентированного учета организаций)
//  КурсВзаиморасчетов - курс взаиморасчетов по договору
//  КратностьВзаиморасчетов - кратность взаиморасчетов по договору
//
Процедура ЗаполнитьПоЗаказуУпр(СтрокаПлатеж)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", СтрокаПлатеж.Сделка);
	
	Запрос.Текст ="ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.Сделка Как Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(, Сделка = &Заказ) КАК РасчетыСКонтрагентамиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Сделка = Выборка.Сделка;
		Если Выборка.Сумма < 0 Тогда
			СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.Сумма*(-1);
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма*(-1),
			СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, 
			ВалютаДокумента,
			СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
			СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
			
			СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказуУпр()

// Заполняет сумму документа и сумму взаиморасчетов на основании остатка
// по заявке в регистре "ЗаявкиНаРасходованиеСредств"
//
Процедура ЗаполнитьПоЗаявкеППУпр() Экспорт
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов заявки
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаПлатежа,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Контрагент КАК Контрагент,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента.Владелец.ОсновнойБанковскийСчет КАК СчетКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.Сделка КАК Сделка,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДокументРасчетовСКонтрагентом,
	|	ЗаявкиНаРасходованиеСредствОстатки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаРасходованиеСредствОстатки.Проект КАК Проект,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.ВалютаВзаиморасчетовПодотчетника КАК ВалютаВзаиморасчетовРаботника,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.РасчетныйДокумент КАК РасчетныйДокументРаботника,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Ссылка КАК ЗаявкаНаРасходование,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Получатель КАК Получатель
	|	
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(, ЗаявкаНаРасходование = &ДокументЗаявка) КАК ЗаявкиНаРасходованиеСредствОстатки";
	
	Запрос.УстановитьПараметр("ДокументЗаявка",ДокументОснование);
	
	СтавкаНДС=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяСтавкаНДС");
	
	РезультатЗапроса=Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			
			СтрокаПлатеж   = РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			Контрагент=Выборка.Контрагент;
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
			
			СтрокаПлатеж   = РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
			
			Если ВалютаДокумента = Выборка.ВалютаВзаиморасчетовРаботника Тогда
				СтрокаПлатеж.КурсВзаиморасчетов      = КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = КратностьДокумента;
			Иначе
				СтруктураКурсВзаиморасчетов=МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетовРаботника,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
			ФизЛицо                       = Выборка.Получатель;
			РасчетныйДокументРаботника    = Выборка.РасчетныйДокументРаботника;
			ВалютаВзаиморасчетовРаботника = Выборка.ВалютаВзаиморасчетовРаботника;
						
		Иначе
			
			Контрагент = Выборка.Контрагент;
			
			Если ЗначениеЗаполнено(Контрагент) Тогда
				СчетКонтрагента = Выборка.СчетКонтрагента;
			КонецЕсли;
						
			СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			
			Если ВалютаДокумента = Выборка.ВалютаВзаиморасчетов Тогда
				СтрокаПлатеж.КурсВзаиморасчетов      = КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = КратностьДокумента;
			Иначе
				
				СтруктураКурсВзаиморасчетов=МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетов,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;	
			
			СтрокаПлатеж.СтавкаНДС=СтавкаНДС;
			СтрокаПлатеж.Сделка=Выборка.Сделка;
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом	 = Выборка.ДокументРасчетовСКонтрагентом;
			СтрокаПлатеж.ДоговорКонтрагента=Выборка.ДоговорКонтрагента;
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
		КонецЕсли;
		
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=Выборка.СтатьяДвиженияДенежныхСредств;
		СтрокаПлатеж.Проект=Выборка.Проект;
		СтрокаПлатеж.ДокументПланированияПлатежа=Выборка.ЗаявкаНаРасходование;
		СтрокаПлатеж.СуммаПлатежаПлан=СтрокаПлатеж.СуммаПлатежа;
		СтрокаПлатеж.КурсВзаиморасчетовПлан=СтрокаПлатеж.КурсВзаиморасчетов;
		
	КонецЦикла;
	
	СуммаДокумента=РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗаполнитьПоЗаявкеППУпр()

// Процедура выполняет заполнение суммы документа и суммы взаиморасчетов по регистру расчетов с подотчетными лицами
//
Процедура ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр(СтрокаПлатеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",          Организация);
	Запрос.УстановитьПараметр("ФизЛицо",              ФизЛицо);
	Запрос.УстановитьПараметр("РасчетныйДокумент",    РасчетныйДокументРаботника);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетовРаботника);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаДолга
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
	|			,
	|			Организация = &Организация
	|				И ФизЛицо = &ФизЛицо
	|				И РасчетныйДокумент = &РасчетныйДокумент
	|				И Валюта = &ВалютаВзаиморасчетов) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаВзаиморасчетовОстаток < 0";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтрокаПлатеж.СуммаВзаиморасчетов = - Выборка.СуммаДолга;
		
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			СтрокаПлатеж.СуммаВзаиморасчетов, 
		    ВалютаВзаиморасчетовРаботника, ВалютаДокумента,
		    СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		    СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;							
									
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицомУпр()

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураКурсыВалют, СтруктураШапкиДокумента)
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
                                              
	мСтруктураПараметровДенежныхСредств.Вставить("РасчетыВозврат",            РасчетыВозврат);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыПоКредитам",     ЕстьРасчетыПоКредитам);
	мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКасса",       СчетОрганизации);
	мСтруктураПараметровДенежныхСредств.Вставить("ДатаДвижений",              ДатаДвижений);
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКассаПолучатель", СчетКонтрагента);
		мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредствПолучатель",  Перечисления.ВидыДенежныхСредств.Безналичные);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
		мСтруктураПараметровДенежныхСредств.Вставить("ФизЛицо",                    ФизЛицо);
		мСтруктураПараметровДенежныхСредств.Вставить("РасчетныйДокументРаботника", РасчетныйДокументРаботника);
	КонецЕсли;
	
	УправлениеДенежнымиСредствами.ПровестиСписаниеДенежныхСредствУпр(
			СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ЗаполнитьДокументПоОснованиюУпр(Основание)

	Если НЕ (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств")) Тогда
		Возврат;
	КонецЕсли;

	Если Основание.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные Тогда
		Сообщить("Заявка оформлена на расходование наличных денежных средств.");
		Возврат;
	КонецЕсли;

	ВидОперацииЗаявка = Основание.ВидОперации;

	УправлениеДенежнымиСредствами.ОпределитьОперациюПоОснованиюУпр(ВидОперации,ВидОперацииЗаявка);

	Организация = Основание.Организация;
    ВалютаДокумента = Основание.ВалютаДокумента;

	Если ЗначениеЗаполнено(Основание.БанковскийСчетКасса) Тогда
		СчетОрганизации = Основание.БанковскийСчетКасса;
	ИначеЕсли Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ВалютаДокумента Тогда
		СчетОрганизации= Организация.ОсновнойБанковскийСчет;
	КонецЕсли;

	Подразделение     = Основание.ЦФО;
	ДокументОснование = Основание.Ссылка;
	
	Если ВалютаДокумента.Пустая() Тогда
		ВалютаДокумента = мВалютаРегламентированногоУчета;
	КонецЕсли;

	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	КурсДокумента      = СтруктураКурсаДокумента.Курс;
	КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	
	ЗаполнитьПоЗаявкеППУпр();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЧастичнаяОплата Тогда
		Сообщить("По документу "+ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект))+" уже прошла частичная оплата.
		|Перед отменой проведения документа необходимо отменить проведение платежных ордеров.");
		Отказ=Истина;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция СформироватьСтруктуруКурсыВалютУпр()

	СтруктураГруппаВалют = Новый Структура;
	СтруктураГруппаВалют.Вставить("ВалютаУпрУчета",  глЗначениеПеременной("ВалютаУправленческогоУчета").Код);
	СтруктураГруппаВалют.Вставить("ВалютаДокумента", ВалютаДокумента.Код);

	СтруктураКурсыВалют = УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,?(ДатаОплаты = '00010101', Дата, КонецДня(ДатаОплаты)));

	Возврат СтруктураКурсыВалют;

КонецФункции


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мСтруктураПараметровДенежныхСредств = Новый Структура;
мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Безналичные);