#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru='Документ можно распечатать только после его записи';uk='Документ можна роздрукувати тільки після його запису'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выполняет движения по регистрам.
//
Процедура ДвиженияПоРегистрам(ТаблицаПоАвансамПоставщикам, ТаблицаПоПерерасчетуОС, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ДвиженияПоЗатратамПоТоварам(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПересчетПропорциональногоНДСПоВзаиморасчетам(ТаблицаПоАвансамПоставщикам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	//ДвиженияПоОС(ТаблицаПоПерерасчету, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ФормированиеДокументаУстановкаКоэффициентаПропорциональногоОтнесенияНДСНаКредит(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// технологическая операция по регистру учета пропорционального НДС по ОС
	ЗакрытиеРегистраСтоимостьПриобретенияОСПропорциональноОблагаемыхНДС(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоЗатратамПоТоварам(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ПересчетКредитаПоТоварам Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаКорректировкиБУ = 0 И СуммаКорректировкиНУ = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = Движения.Хозрасчетный.Добавить();

	Проводка.Период      = Дата;

	Проводка.Организация = СтруктураШапкиДокумента.Организация;
	Проводка.Содержание  = НСтр("ru='Корректировка пропорц. НДС по товарам/услугам';uk='Коригування пропорц. ПДВ по товарам/послугам'",Локализация.КодЯзыкаИнформационнойБазы());

	Проводка.СчетДт      = СтруктураШапкиДокумента.СчетДт;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоДт1, Истина);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоДт2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоДт3);

	Проводка.СчетКт      = СтруктураШапкиДокумента.СчетНДС;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1, СтруктураШапкиДокумента.СубконтоКт1, Истина);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2, СтруктураШапкиДокумента.СубконтоКт2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3, СтруктураШапкиДокумента.СубконтоКт3);

	Проводка.Сумма       = СуммаКорректировкиБУ;
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
		Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			Проводка.СуммаНУДт = СуммаКорректировкиНУ;	
		КонецЕсли;
	КонецЕсли;
	
	// сразу отнесем на фин. рез
	Проводка = Движения.Хозрасчетный.Добавить();

	Проводка.Период      = Дата;

	Проводка.Организация = СтруктураШапкиДокумента.Организация;
	Проводка.Содержание  = НСтр("ru='Отнесение на фин. результат результата пересчета пропорц. НДС по товарам/услугам';uk='Віднесення на фін. результат перерахунку пропорц. ПДВ по товарам/послугам'",Локализация.КодЯзыкаИнформационнойБазы());

	Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РезультатОперационнойДеятельности;
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
		Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			Проводка.СуммаНУДт = СуммаКорректировкиНУ;	
		КонецЕсли;
	КонецЕсли;
	
	Проводка.СчетКт      = СтруктураШапкиДокумента.СчетДт;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1, СтруктураШапкиДокумента.СубконтоДт1, Истина);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2, СтруктураШапкиДокумента.СубконтоДт2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3, СтруктураШапкиДокумента.СубконтоДт3);

	Проводка.Сумма       = СуммаКорректировкиБУ;
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
		Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
			Проводка.СуммаНУКт = СуммаКорректировкиНУ;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчетПропорциональногоНДСПоВзаиморасчетам(ТаблицаПоАвансамПоставщикам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ПересчетКредитаПоТоварам = Ложь Тогда
		Возврат;
	КонецЕсли;

	Если Месяц(Дата) <> 12 Тогда
		Возврат;
	КонецЕсли;
	
	///////////////////////////////////////////////////////
	// сфорируем движения по регистру Приобретение налоговый учет по договорам с простым налоговым учетом (чтобы правильно закрылись поставки следующего года)
	НаборДвижений = Движения.ПриобретенияНалоговыйУчет;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаПоАвансамПоставщикамКопия = ТаблицаПоАвансамПоставщикам.Скопировать();
	
	// оставим строки по которым есть сумма корректировки и договора - с простым налоговым учетом
	Инд = 0;
	Пока ТаблицаПоАвансамПоставщикамКопия.Количество() > Инд Цикл
	
		Строка = ТаблицаПоАвансамПоставщикамКопия[Инд];
		Если Строка.СуммаНДСПропорционально = 0 Тогда
			ТаблицаПоАвансамПоставщикамКопия.Удалить(Строка);
		ИначеЕсли Строка.СложныйНалоговыйУчет = Истина Тогда
			ТаблицаПоАвансамПоставщикамКопия.Удалить(Строка);
		Иначе
			Инд = Инд + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	// записывать в регистр будем только сумму корректировки пропорционального НДС
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансамПоставщикамКопия, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;

	
	///////////////////////////////////////////////////////
	// теперь сформируем движения по регистру Ожидаемого и подтвержденного НДС по договрам со сложным налоговым учетом (чтобы правильно закрылись поставки следующего года)
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаПоАвансамПоставщикамКопия = ТаблицаПоАвансамПоставщикам.Скопировать();
	
	// оставим строки по которым есть сумма корректировки и договора - с простым налоговым учетом
	Инд = 0;
	Пока ТаблицаПоАвансамПоставщикамКопия.Количество() > Инд Цикл
	
		Строка = ТаблицаПоАвансамПоставщикамКопия[Инд];
		Если Строка.СуммаНДСПропорционально = 0 Тогда
			ТаблицаПоАвансамПоставщикамКопия.Удалить(Строка);
		ИначеЕсли Строка.СложныйНалоговыйУчет = Ложь Тогда
			ТаблицаПоАвансамПоставщикамКопия.Удалить(Строка);
		Иначе
			Инд = Инд + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	// записывать в регистр будем только сумму корректировки пропорционального НДС
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансамПоставщикамКопия, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.КорректировкаРегламентная, "КодОперации");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.Записать();
			
	КонецЕсли;
	
	////////////////////////////////////////////////////////
	// теперь получим таблицу для корректировок счета 6441(простой учет)/6442(сложный учет)
	Для каждого Строка Из ТаблицаПоАвансамПоставщикам Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();

		Проводка.Период      = Дата;

		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = НСтр("ru='Корректировка пропорц. НДС по предоплатам за товары/услуги';uk='Коригування пропорц. ПДВ по передоплатам за товари/послуги'",Локализация.КодЯзыкаИнформационнойБазы());

		Проводка.СчетДт      = СтруктураШапкиДокумента.СчетНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтруктураШапкиДокумента.СубконтоКт1, Истина);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтруктураШапкиДокумента.СубконтоКт1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтруктураШапкиДокумента.СубконтоКт1);

		Проводка.СчетКт      = Строка.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты",        				Строка.Контрагент, Истина);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Договоры",           				Строка.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"ДокументыРасчетовСКонтрагентами", Строка.Сделка);

		Проводка.Сумма          = Строка.СуммаНДСПропорционально * ?(Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком, -1, 1);
		
	КонецЦикла;
	
	// теперь сформируем автоматические движения, аналогичные движения по авансам, но только по остаткам отгрузок, которые переходят на новый год.
	// Это необходимо для корректного закрытия регистров последующей оплатой в новом году (актуально только для простого налогового учета)
	
	// заполним таблицу с "авансами" отгрузок поставщикам 
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ПропорциональныйНДС", Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПриобретенияНалоговыйУчетОстатки.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком)
	               |				ИЛИ ПриобретенияНалоговыйУчетОстатки.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоВозврат,
	               |	ВЫБОР
	               |		КОГДА ПриобретенияНалоговыйУчетОстатки.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком)
	               |				ИЛИ ПриобретенияНалоговыйУчетОстатки.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоОплата,
	               |	ПриобретенияНалоговыйУчетОстатки.СуммаНДСОстаток КАК СуммаНДС,
	               |	ПриобретенияНалоговыйУчетОстатки.СуммаНДСПропорциональноОстаток КАК СуммаНДСПропорционально,
	               |	ПриобретенияНалоговыйУчетОстатки.СтавкаНДС,
	               |	ПриобретенияНалоговыйУчетОстатки.Сделка,
	               |	ПриобретенияНалоговыйУчетОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	ПриобретенияНалоговыйУчетОстатки.ДоговорКонтрагента
	               |ПОМЕСТИТЬ ПростойУчет
	               |ИЗ
	               |	РегистрНакопления.ПриобретенияНалоговыйУчет.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И ВидДеятельностиНДС = &ПропорциональныйНДС
	               |				И (НЕ Амортизируется)) КАК ПриобретенияНалоговыйУчетОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПростойУчет.Контрагент,
	               |	ПростойУчет.ДоговорКонтрагента,
	               |	ПростойУчет.Сделка,
	               |	ПростойУчет.ЭтоВозврат,
	               |	ПростойУчет.СтавкаНДС,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПростойУчет.ЭтоОплата = ЛОЖЬ
	               |				ТОГДА ПростойУчет.СуммаНДС
	               |			ИНАЧЕ -ПростойУчет.СуммаНДС
	               |		КОНЕЦ) КАК СуммаНДС,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПростойУчет.ЭтоОплата = ЛОЖЬ
	               |				ТОГДА ПростойУчет.СуммаНДСПропорционально
	               |			ИНАЧЕ -ПростойУчет.СуммаНДСПропорционально
	               |		КОНЕЦ) КАК СуммаНДСПропорционально
	               |ПОМЕСТИТЬ АвансыПростойУчет
	               |ИЗ
	               |	ПростойУчет КАК ПростойУчет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПростойУчет.Контрагент,
	               |	ПростойУчет.ДоговорКонтрагента,
	               |	ПростойУчет.Сделка,
	               |	ПростойУчет.ЭтоВозврат,
	               |	ПростойУчет.СтавкаНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АвансыПростойУчет.Контрагент,
	               |	АвансыПростойУчет.ДоговорКонтрагента,
	               |	АвансыПростойУчет.Сделка,
	               |	ВЫБОР
	               |		КОГДА АвансыПростойУчет.ЭтоВозврат = ИСТИНА
	               |			ТОГДА Истина
	               |		ИНАЧЕ Ложь
	               |	КОНЕЦ КАК ЭтоВозврат,
	               |	АвансыПростойУчет.СтавкаНДС,
	               |	АвансыПростойУчет.СуммаНДС КАК НДСПоставки,
	               |	АвансыПростойУчет.СуммаНДСПропорционально КАК НДСПропорциональноКредитДоПерерасчета,
				   |	&ПропорциональныйНДС КАК ВидДеятельностиНДС,
				   |	Истина КАК ДляХозяйственнойДеятельности
	               |ИЗ
	               |	АвансыПростойУчет КАК АвансыПростойУчет
	               |ГДЕ
	               |	  АвансыПростойУчет.СуммаНДС > 0
	               |	И АвансыПростойУчет.СуммаНДСПропорционально <> 0
	               |";
	
	ТаблицаАвансовыхОтгрузок = Запрос.Выполнить().Выгрузить();
	ТаблицаАвансовыхОтгрузок.Колонки.Добавить("Событие");
	ТаблицаАвансовыхОтгрузок.Колонки.Добавить("СуммаНДСПропорционально");
	
	Для каждого Строка Из ТаблицаАвансовыхОтгрузок Цикл
	
		Строка.Событие = ?(Строка.ЭтоВозврат = Ложь,
						   Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика,
						   Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
						   
		Строка.СуммаНДСПропорционально = Окр(Строка.НДСПоставки * СтруктураШапкиДокумента.Коэффициент / 100, 2) - Строка.НДСПропорциональноКредитДоПерерасчета;
	
	КонецЦикла;
	
	// оставим строки по которым есть сумма корректировки
	Инд = 0;
	Пока ТаблицаАвансовыхОтгрузок.Количество() > Инд Цикл
	
		Строка = ТаблицаАвансовыхОтгрузок[Инд];
		Если Строка.СуммаНДСПропорционально = 0 Тогда
			ТаблицаАвансовыхОтгрузок.Удалить(Строка);
		Иначе
			Инд = Инд + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	НаборДвижений = Движения.ПриобретенияНалоговыйУчет;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаАвансовыхОтгрузок, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ПриобретенияНалоговыйУчет.ВыполнитьПриход();
		Движения.ПриобретенияНалоговыйУчет.Записать();
			
	КонецЕсли;
				   
	
КонецПроцедуры

//Процедура ДвиженияПоОС(ТаблицаПоПерерасчету, СтруктураШапкиДокумента, Отказ, Заголовок)
//	
//
//КонецПроцедуры

Процедура ФормированиеДокументаУстановкаКоэффициентаПропорциональногоОтнесенияНДСНаКредит(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ФормироватьДокументУстановкиКоэффициентаНаСледующийГод = Ложь
		ИЛИ Месяц(Дата) <> 12 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("Период", НачалоГода(ДобавитьМесяц(СтруктураШапкиДокумента.Дата, 12)));
	
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Регистратор,
	               |	КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Регистратор.Коэффициент КАК Коэффициент,
	               |	КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Регистратор.СуммаОблагаемыхОпераций КАК СуммаОблагаемыхОпераций,
	               |	КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Регистратор.СуммаВсехОпераций КАК СуммаВсехОпераций,
				   //	если движение сделал не документ установки коэффициента, а унивирсальный - мы это определим по отсутствию реквизита
				   |	ЕстьNULL(КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Регистратор.ПоДаннымПрошлогоГода, НЕОПРЕДЕЛЕНО) КАК ПоДаннымПрошлогоГода
	               |ИЗ
	               |	РегистрСведений.КоэффициентыПропорциональногоОтнесенияНДСНаКредит КАК КоэффициентыПропорциональногоОтнесенияНДСНаКредит
	               |ГДЕ
	               |	КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Организация = &Организация
	               |	И КоэффициентыПропорциональногоОтнесенияНДСНаКредит.Период = &Период";
				                                    
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// если запись в регистр сделал не правильный документ - не будем его переоформлять
		Если Выборка.ПоДаннымПрошлогоГода = Неопределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = 'Невозможно установить коэффициент пропорционального НДС на следующий год!
                           |Запись в регистр сформирована не документом ""Установка коэффициента пропорционального отнесения НДС на кредит""'"),,Заголовок);
						   
			Возврат;			  	 
		
		КонецЕсли;
		
		// проверим, нужно ли переоформлять этот документ
		Если    Выборка.ПоДаннымПрошлогоГода = Истина 
			И  Выборка.Коэффициент 				= СтруктураШапкиДокумента.Коэффициент/100
			И  Выборка.СуммаОблагаемыхОпераций 	= СтруктураШапкиДокумента.СуммаОблагаемыхОпераций
			И  Выборка.СуммаВсехОпераций		= СтруктураШапкиДокумента.СуммаВсехОпераций Тогда
		
			возврат;	
		
		КонецЕсли;
		
		Док = Выборка.Регистратор.ПолучитьОбъект();
		
	Иначе
		
		Док = Документы.УстановкаКоэффициентаПропорциональногоОтнесенияНДСНаКредит.СоздатьДокумент();
		
	КонецЕсли;
				   
	Док.Дата 		= НачалоГода(ДобавитьМесяц(СтруктураШапкиДокумента.Дата, 12));
	Док.Организация = СтруктураШапкиДокумента.Организация;
	Док.Ответственный = СтруктураШапкиДокумента.Ответственный;
	Док.Комментарий = Локализация.СтрШаблон1(НСтр("ru = 'Сформирован автоматически документом ¤1¤'"), СтруктураШапкиДокумента.Ссылка);
	Док.МесяцРасчета = 12;
	Док.ПоДаннымПрошлогоГода = Истина;
	Док.СуммаОблагаемыхОпераций = СтруктураШапкиДокумента.СуммаОблагаемыхОпераций;
	Док.СуммаВсехОпераций = СтруктураШапкиДокумента.СуммаВсехОпераций;
	Док.Коэффициент = СтруктураШапкиДокумента.Коэффициент / 100;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1(НСтр("ru = 'Невозможно установить коэффициент пропорционального НДС на следующий год! 
		| ошибка: ¤1¤'"), ОписаниеОшибки()),,Заголовок);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗакрытиеРегистраСтоимостьПриобретенияОСПропорциональноОблагаемыхНДС(СтруктураШапкиДокумента, Отказ, Заголовок)

	// закроем остатки в регистре, по ОС, которые эксплуатируются более 36 месяцев
	
	НаборДвижений = Движения.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ДатаНачалаИспользования", НачалоМесяца(ДобавитьМесяц(Дата, - 36)));
	
    Запрос.Текст = "ВЫБРАТЬ
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.НеоборотныйАктив,
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.ДатаНачалаИспользования,
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.ДатаФормированияКредита,
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.БазаНДСОстаток КАК БазаНДС,
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.СуммаНДСОстаток  КАК СуммаНДС,
                   |	СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки.СуммаНДСПропорциональноКредитОстаток  КАК СуммаНДСПропорциональноКредит
                   |ИЗ
                   |	РегистрНакопления.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС.Остатки(&Период, ДатаНачалаИспользования <= &ДатаНачалаИспользования) КАК СтоимостьПриобретенияОСПропорциональноОблагаемыхНДСОстатки";
		
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		Движения.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС.ВыполнитьРасход();
		Движения.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС.Записать();
			
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов, влияющих на проведение, не заполнен или
// заполнен некорректно, то устанавливается флаг отказа в проведении.
//
// Параметры:
//  ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	СтруктураОбязательныхПолей.Вставить("СчетДт");
	СтруктураОбязательныхПолей.Вставить("СчетНДС");
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
			
		//проверим указание субконто для заполнения декларации по прибыли
		Если ЗначениеЗаполнено(СчетДт) Тогда
			
			ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
			Для НомСубконто = 1 По 3 Цикл
				Если СчетДт.ВидыСубконто.Количество()<НомСубконто Тогда
					Прервать;
				КонецЕсли;
				
				ВидСубконто = СчетДт.ВидыСубконто[НомСубконто-1].ВидСубконто;
				Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
					ЕстьСубконтоСтатьяЗатратДоходов = Истина;
					Прервать;
				КонецЕсли;

			КонецЦикла;
			
			Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
				СтруктураОбязательныхПолей.Вставить("СубконтоДт" + НомСубконто, НСТР("ru='Не заполнено значение субконто: ';uk='Не заповнене значення субконто: '") + ВидСубконто); 	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	// не допускаем наличия нескольких документов в одном периоде
	ПроверитьЧтоДокументВПериодеОдин(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЧтоДокументВПериодеОдин(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПерерасчетПропорциональногоНДСпоТоварамИОС.Ссылка
	               |ИЗ
	               |	Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС КАК ПерерасчетПропорциональногоНДСпоТоварамИОС
	               |ГДЕ
	               |	ПерерасчетПропорциональногоНДСпоТоварамИОС.Дата МЕЖДУ &НачПериода И  &КонПериода
	               |	И ПерерасчетПропорциональногоНДСпоТоварамИОС.Проведен
	               |	И ПерерасчетПропорциональногоНДСпоТоварамИОС.Организация = &Организация
	               |	И НЕ ПерерасчетПропорциональногоНДСпоТоварамИОС.Ссылка = &Ссылка";
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='В данном периоде по данной организации уже имеется проведенный документ ""Перерасчет пропорционального НДС по товарам и ОС""!';uk='У поточному періоді по даній організації вже існує інший проведенй документ ""Перерахунок пропорційного ПДВ за товарами та ОЗ""'"), Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьТаблицуПоАвансамПоставщикам(РезультатЗапросаПоАвансамПоставщикам, СтруктураШапкиДокумента)
	
	ТаблицаПоАвансамПоставщикам = РезультатЗапросаПоАвансамПоставщикам.Выгрузить();

	ТаблицаПоАвансамПоставщикам.Колонки.Добавить("ДляХозяйственнойДеятельности");
	ТаблицаПоАвансамПоставщикам.ЗаполнитьЗначения(Истина, "ДляХозяйственнойДеятельности");
	
	ТаблицаПоАвансамПоставщикам.Колонки.Добавить("ВидДеятельностиНДС");
	ТаблицаПоАвансамПоставщикам.ЗаполнитьЗначения(Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая, "ВидДеятельностиНДС");
	
	ТаблицаПоАвансамПоставщикам.Колонки.Добавить("Событие");
	ТаблицаПоАвансамПоставщикам.Колонки.Добавить("СобытиеНДС");
	
	ТаблицаПоАвансамПоставщикам.Колонки.Добавить("СуммаНДСПропорционально");
	
	Для каждого Строка Из ТаблицаПоАвансамПоставщикам Цикл
		
		Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
			Строка.Событие    = Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику;
			Строка.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление;
		Иначе
			Строка.Событие = Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком;
			Строка.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат;
		КонецЕсли;	
		
		Строка.СуммаНДСПропорционально = Строка.НДСПропорциональноКредит - Строка.НДСПропорциональноКредитДоПерерасчета;
	
	КонецЦикла;
	
	Возврат ТаблицаПоАвансамПоставщикам;
	
КонецФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиАвансыПоставщикам(ТаблицаПоАвансамПоставщикам, СтруктураШапкиДокумента, Отказ, Заголовок)
		
	Если СтруктураШапкиДокумента.ПересчетКредитаПоТоварам = Ложь Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти = "АвансыПоставщикам";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ДоговорКонтрагента, РасчетыВозврат, СтавкаНДС, СчетУчетаНДС");
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "АвансыПоставщикам", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Функция ПодготовитьТаблицуПоПерерасчетуОС(РезультатЗапросаПоПерерасчету, СтруктураШапкиДокумента)

	ТаблицаПоПерерасчету = РезультатЗапросаПоПерерасчету.Выгрузить();

	Возврат ТаблицаПоПерерасчету;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПроверитьЗаполнениеТабличнойЧастиПоПерерасчетуОС(ТаблицаПоПерерасчету, СтруктураШапкиДокумента, Отказ, Заголовок)

	// проверим построчно
	ПодходящийПериодИспользования1 = НачалоМесяца(ДобавитьМесяц(Дата, -11));
	ПодходящийПериодИспользования2 = НачалоМесяца(ДобавитьМесяц(Дата, -23));
	ПодходящийПериодИспользования3 = НачалоМесяца(ДобавитьМесяц(Дата, -35));
	
	СтрокаСообщенияПериод = НСтр("ru='     Допустимые значения: ';uk='    Допустимі значення: '")
							 + Формат(ПодходящийПериодИспользования1, "ДФ=MM.yyyy") + ", "
							 + Формат(ПодходящийПериодИспользования2, "ДФ=MM.yyyy") + ", "
							 + Формат(ПодходящийПериодИспользования3, "ДФ=MM.yyyy") + ".";
	
	Для каждого Строка Из ТаблицаПоПерерасчету Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ДатаНачалаИспользования) Тогда

			СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1(НСтр("ru='В строке номер ""¤1¤"" табличной части ""Перерасчет"": ';uk='У рядку номер ""¤1¤"" табличної частини ""Перерахунок"": '"), СокрЛП(Строка.НомерСтроки));
			
			СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Начало использования""!';uk='Не заповнене значення реквізиту ""Початок використання""!'");
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			
			
		Иначе
			// пересчет проводится за 12,24,36 месяцев использования	
			Если     НачалоМесяца(Строка.ДатаНачалаИспользования) <> ПодходящийПериодИспользования1
				И НЕ НачалоМесяца(Строка.ДатаНачалаИспользования) <> ПодходящийПериодИспользования2
				И НЕ НачалоМесяца(Строка.ДатаНачалаИспользования) <> ПодходящийПериодИспользования3 Тогда
				
				СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1(НСтр("ru='В строке номер ""¤1¤"" табличной части ""Перерасчет"": ';uk='У рядку номер ""¤1¤"" табличної частини ""Перерахунок"": '"), СокрЛП(Строка.НомерСтроки));
				
				СтрокаСообщения = НСтр("ru='Указано некорректное значение реквизита ""Начало использования""!';uk='Зазначене некоректне значення реквізиту ""Початок використання""!'")
								  + Символы.ПС
								  + СтрокаСообщенияПериод;
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	УчетнаяПолитикаНеЗадана = Ложь;
	СообщатьОбОшибке = Истина;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , мУчетнаяПолитикаНУ.ЕстьНДС);
		
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, Режим)
 	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "АвансыПоставщикам".
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Вставить("Контрагент", 					"Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента", 			"ДоговорКонтрагента");
	СтруктураПолей.Вставить("СложныйНалоговыйУчет", 		"ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("Сделка", 						"Сделка");
	СтруктураПолей.Вставить("РасчетыВозврат", 				"РасчетыВозврат");
	СтруктураПолей.Вставить("СтавкаНДС", 					"СтавкаНДС");
	СтруктураПолей.Вставить("НДСПропорциональноКредитДоПерерасчета", "НДСПропорциональноКредитДоПерерасчета");
	СтруктураПолей.Вставить("НДСПропорциональноКредит", 	"НДСПропорциональноКредит");
	СтруктураПолей.Вставить("СчетУчетаНДС", 				"СчетУчетаНДС");
	
	РезультатЗапросаПоАвансамПоставщикам 	= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "АвансыПоставщикам", СтруктураПолей, СтруктураПростыхПолей);
	ТаблицаПоАвансамПоставщикам 		  	= ПодготовитьТаблицуПоАвансамПоставщикам(РезультатЗапросаПоАвансамПоставщикам, СтруктураШапкиДокумента);
	ПроверитьЗаполнениеТабличнойЧастиАвансыПоставщикам(ТаблицаПоАвансамПоставщикам, СтруктураШапкиДокумента, Отказ, Заголовок);
		
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "ПараметрыПерерасчетаОС".
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Вставить("СуммаВсехОпераций", 			"СуммаВсехОпераций");
	СтруктураПолей.Вставить("СуммаОблагаемыхОпераций", 		"СуммаОблагаемыхОпераций");
	СтруктураПолей.Вставить("Коэффициент", 					"Коэффициент");
	СтруктураПолей.Вставить("СуммаПоставки", 				"СуммаПоставки");
	СтруктураПолей.Вставить("НДСПоставки", 					"НДСПоставки");
	СтруктураПолей.Вставить("НДСПропорциональноКредитДоПерерасчета", "НДСПропорциональноКредитДоПерерасчета");
	СтруктураПолей.Вставить("НДСПропорциональноКредит", 	"НДСПропорциональноКредит");
	СтруктураПолей.Вставить("СуммаКорректировкиНДС", 		"СуммаКорректировкиНДС");
	СтруктураПолей.Вставить("НеоборотныйАктив", 			"НеоборотныйАктив");
	СтруктураПолей.Вставить("ДатаНачалаИспользования", 		"ДатаНачалаИспользования");
	СтруктураПолей.Вставить("ДатаФормированияКредита", 		"ДатаФормированияКредита");
	СтруктураПолей.Вставить("СуммаКорректировкиБУ", 		"СуммаКорректировкиБУ");
	СтруктураПолей.Вставить("СуммаКорректировкиНУ", 		"СуммаКорректировкиНУ");
	
	РезультатЗапросаПоПерерасчетуОС = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПараметрыПерерасчетаОС", СтруктураПолей, СтруктураПростыхПолей);
	ТаблицаПоПерерасчетуОС 		  = ПодготовитьТаблицуПоПерерасчетуОС(РезультатЗапросаПоПерерасчетуОС, СтруктураШапкиДокумента);
	ПроверитьЗаполнениеТабличнойЧастиПоПерерасчетуОС(ТаблицаПоПерерасчетуОС, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(ТаблицаПоАвансамПоставщикам, ТаблицаПоПерерасчетуОС, СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	Дата = КонецМесяца(Дата);
//КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)

	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения