#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "Организация", Организация);
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		ОтчетПоДокументу = Ложь;
		
	КонецЕсли;
	
	Если ОтчетПоДокументу Тогда
		
		МоментДокумента = Документ.МоментВремени();
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", МоментДокумента);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", МоментДокумента);
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("СубконтоОС" , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйСубконто.Значение КАК ОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|ГДЕ
		|	ХозрасчетныйСубконто.Вид = &СубконтоОС
		|	И ХозрасчетныйСубконто.Регистратор = &Регистратор";
		СписокОС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОС");
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС = Неопределено Тогда
			
			ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Добавить("ОсновноеСредство");	
			
		КонецЕсли;
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Истина;
			ОтборПоОС.ВидСравнения  = ВидСравнения.ВСписке;         
			ОтборПоОС.Значение.ЗагрузитьЗначения(СписокОС);
			
		КонецЕсли;
		
	Иначе
		
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата"   , ОбщийОтчет.ДатаНач);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата"   , КонецДня(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачГраница", ОбщийОтчет.ДатаНач);
		
		Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", Неопределено);
			
		Иначе
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", КонецДня(ОбщийОтчет.ДатаКон));
			
		КонецЕсли;
	
	КонецЕсли; 
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
	Если ОтчетПоДокументу Тогда
		// Очищается отбор	
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Ложь;
			ОтборПоОС.ВидСравнения  = ВидСравнения.Равно;         
			ОтборПоОС.Значение      = Справочники.ОсновныеСредства.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	Текст =
	"ВЫБРАТЬ Разрешенные
	|	ПервоначальныеСведения.ОсновноеСредство                           КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.ОсновноеСредство)            КАК ОсновноеСредствоПредставление,
	|	ПервоначальныеСведения.Организация                                КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.Организация)                 КАК ОрганизацияПредставление,
	|	ПервоначальныеСведения.ИнвентарныйНомер                           КАК ИнвентарныйНомер,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                    КАК ПервоначальнаяСтоимость,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета                              КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетУчета)               КАК СчетУчетаПредставление,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации              КАК СчетНачисленияАмортизации,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации)	КАК СчетНачисленияАмортизацииПредставление,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                КАК СпособНачисления,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.СпособНачисленияАмортизации) КАК СпособНачисленияПредставление,
	|	МестонахождениеОС.МОЛ                                             КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.МОЛ)                              КАК МОЛПредставление,
	|	МестонахождениеОС.Местонахождение                                 КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.Местонахождение)                  КАК ПодразделениеПредставление,
	|	ВводВЭксплуатацию.ДатаСостояния                                   КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор                                     КАК ДокументВводаВЭксплуатацию,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатацию.Регистратор)                      КАК ДокументВводаВЭксплуатациюПредставление,
	|	СнятиеСУчета.ДатаСостояния                                        КАК ДатаСнятияСУчета,
	|	СнятиеСУчета.Регистратор                                          КАК ДокументСнятияСучета,
	|	ПРЕДСТАВЛЕНИЕ(СнятиеСУчета.Регистратор)                           КАК ДокументСнятияСучетаПредставление,
	|	Стоимость.СуммаНачальныйОстатокДт                                 КАК СтоимостьНачальныйОстаток,
	|	Стоимость.СуммаКонечныйОстатокДт                                  КАК СтоимостьКонечныйОстаток,
	|	Стоимость.СуммаОборотДт                                           КАК СтоимостьОборотДт,
	|	Стоимость.СуммаОборотКт                                           КАК СтоимостьОборотКт,
	|	Амортизация.СуммаНачальныйОстатокКт                               КАК АмортизацияНачальныйОстаток,
	|	Амортизация.СуммаКонечныйОстатокКт                                КАК АмортизацияКонечныйОстаток,
	|	Амортизация.СуммаОборотДт                                         КАК АмортизацияОборотДт,
	|	Амортизация.СуммаОборотКт                                         КАК АмортизацияОборотКт,
	|	ЕСТЬNULL(Стоимость.СуммаКонечныйОстатокДт, 0) 
	|		- ЕСТЬNULL(Амортизация.СуммаКонечныйОстатокКт, 0)             КАК ОстаточнаяСтоимость,
	|	Выработка.КоличествоОборот                                        КАК ВыработкаОборот,
	|	ПараметрыАмортизации.СрокПолезногоИспользования                   КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизации.ОбъемПродукцииРабот                          КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации    КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации            КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации  КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                      КАК ЛиквидационнаяСтоимость,
	|	ВЫБОР
	|		КОГДА СнятиеСУчета.ДатаСостояния ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                             КАК СнятоСУчета
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*                                             КАК ОсновноеСредство,
	|	Организация.*                                                  КАК Организация,
	|	ИнвентарныйНомер,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	СпособНачисления,
	|	МОЛ.*                                                          КАК МОЛ,
	|	Подразделение.*                                                КАК Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ДокументСнятияСучета,
	|	ГрафикиАмортизации.ГрафикАмортизации.*                         КАК ГрафикАмортизации,
	|	НаправленияАмортизации.СпособыОтраженияРасходовПоАмортизации.* КАК СпособОтраженияРасходовПоАмортизации,
	|	НачислениеАмортизации.НачислятьАмортизацию                     КАК НачислятьАмортизацию,
	|	ПервоначальныеСведения.ПараметрВыработки.*                     КАК ПараметрВыработки,
	|	СнятоСУчета}
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|	                &КонГраница, Организация = &Организация 
	|	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПервоначальныеСведения
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НачислениеАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НачислениеАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = НачислениеАмортизации.Организация}
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПараметрыАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ПараметрыАмортизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			                   &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Стоимость
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Стоимость.Субконто1
	|			И ПервоначальныеСведения.Организация = Стоимость.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		                       &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Амортизация
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Амортизация.Субконто1
	|			И ПервоначальныеСведения.Организация = Амортизация.Организация
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК МестонахождениеОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = МестонахождениеОС.Организация}
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.ВыработкаОС.Обороты(&НачГраница, &КонГраница, ,
	|			                  {ОсновноеСредство.* КАК ОсновноеСредство}) КАК Выработка
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Выработка.ОсновноеСредство
	|			И ПервоначальныеСведения.ПараметрВыработки = Выработка.ПараметрВыработки
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ВводВЭксплуатацию.Организация
	|			И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК СнятиеСУчета
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СнятиеСУчета.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = СнятиеСУчета.Организация
	|			И (СнятиеСУчета.Состояние = &СостояниеСнятоСУчета)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница,
	|			                Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ГрафикиАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ГрафикиАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ГрафикиАмортизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НаправленияАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НаправленияАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = НаправленияАмортизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаБухгалтерскогоУчетаОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = СчетаБухгалтерскогоУчетаОС.Организация}
	|{ГДЕ
	|	ПервоначальныеСведения.ОсновноеСредство.*                        КАК ОсновноеСредство,
	|	ПервоначальныеСведения.Организация.*                             КАК Организация,
	|	ПервоначальныеСведения.ИнвентарныйНомер                          КАК ИнвентарныйНомер,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета.*                           КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации.*           КАК СчетНачисленияАмортизации,
	|	МестонахождениеОС.МОЛ.*                                          КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.*                              КАК Подразделение,
	|	ВводВЭксплуатацию.ДатаСостояния                                  КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор.*                                  КАК ДокументВводаВЭксплуатацию,
	|	СнятиеСУчета.ДатаСостояния                                       КАК ДатаСнятияСУчета,
	|	СнятиеСУчета.Регистратор.*                                       КАК ДокументСнятияСучета,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                   КАК ПервоначальнаяСтоимость,
	|	Стоимость.СуммаНачальныйОстатокДт                                КАК СтоимостьНачальныйОстаток,
	|	Стоимость.СуммаКонечныйОстатокДт                                 КАК СтоимостьКонечныйОстаток,
	|	Стоимость.СуммаОборотДт                                          КАК СтоимостьОборотДт,
	|	Стоимость.СуммаОборотКт                                          КАК СтоимостьОборотКт,
	|	Амортизация.СуммаНачальныйОстатокДт                              КАК АмортизацияНачальныйОстаток,
	|	Амортизация.СуммаКонечныйОстатокКт                               КАК АмортизацияКонечныйОстаток,
	|	Амортизация.СуммаОборотДт                                        КАК АмортизацияОборотДт,
	|	Амортизация.СуммаОборотКт                                        КАК АмортизацияОборотКт,
	|	ЕСТЬNULL(Стоимость.СуммаКонечныйОстатокДт, 0) 
	|		- ЕСТЬNULL(Амортизация.СуммаКонечныйОстатокКт, 0)            КАК ОстаточнаяСтоимость,
	|	Выработка.КоличествоОборот                                       КАК ВыработкаОборот,
	|	ГрафикиАмортизации.ГрафикАмортизации.*                           КАК ГрафикАмортизации,
	|	НаправленияАмортизации.СпособыОтраженияРасходовПоАмортизации.*   КАК СпособОтраженияРасходовПоАмортизации,
	|	НачислениеАмортизации.НачислятьАмортизацию                       КАК НачислятьАмортизацию,
	|	ПараметрыАмортизации.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизации.ОбъемПродукцииРабот                         КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации               КАК СпособНачисления,
	|	ПервоначальныеСведения.ПараметрВыработки.*                       КАК ПараметрВыработки,
	|	ВЫБОР
	|			КОГДА СнятиеСУчета.ДатаСостояния ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ                                                        КАК СнятоСУчета}
	|
	|// Снятые с учета внутри периода не выводим
	|	ГДЕ ((СнятиеСУчета.ДатаСостояния Есть NULL) ИЛИ (СнятиеСУчета.ДатаСостояния >= &ДатаНач))
	|
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	ИнвентарныйНомер,
	|	ПервоначальнаяСтоимость,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	МОЛ,
	|	Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ДокументСнятияСучета,
	|	СнятоСУчета}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборотДт),
	|	СУММА(АмортизацияОборотКт),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ВыработкаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Организация
	|{ИТОГИ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	МОЛ,
	|	Подразделение,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации КАК СпособНачисления,
	|	СнятоСУчета}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "Организация", 	"Организация");
	СтруктураПредставлениеПолей.Вставить( "Подразделение", 	"Подразделение");
	СтруктураПредставлениеПолей.Вставить( "МОЛ", 			"МОЛ");
	
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство", "Основное средство");
	СтруктураПредставлениеПолей.Вставить( "СнятоСУчета"     , "ОС снято с учета");
	СтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер", "Инв. номер");
	
	СтруктураПредставлениеПолей.Вставить( "СпособНачисления"                    , "Способ начисления амортизации");
	СтруктураПредставлениеПолей.Вставить( "ПараметрВыработки"                   , "Параметр выработки");
	СтруктураПредставлениеПолей.Вставить( "НачислятьАмортизацию"                , "Начислять амортизацию");
	СтруктураПредставлениеПолей.Вставить( "СчетУчета"                           , "Счет учета");
	СтруктураПредставлениеПолей.Вставить( "СчетНачисленияАмортизации"           , "Счет нач. амортизации");
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию"              , "Дата ввода в эксплуатацию");
	СтруктураПредставлениеПолей.Вставить( "ДокументВводаВЭксплуатацию"          , "Док. ввода в эксплуатацию");
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета"                    , "Дата снятия с учета");
	СтруктураПредставлениеПолей.Вставить( "ДокументСнятияСучета"                , "Док. снятия с учета");
	СтруктураПредставлениеПолей.Вставить( "ГрафикАмортизации"                   , "График амортизации");
	СтруктураПредставлениеПолей.Вставить( "СпособОтраженияРасходовПоАмортизации", "Сп. отраж. расх. по амортизации");
	
	СтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость"          ,   "Первоначальная стоимость");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", "Стоимость для амортизации");
	СтруктураПредставлениеПолей.Вставить( "ЛиквидационнаяСтоимость"          , "Ликвид. стоимость");
	
	СтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования"               , "Срок полезного использования");
	СтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", "Срок исп. для амортизации");
	
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток", "Стоимость на начало периода");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт"        , "Увеличение стоимости");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт"        , "Уменьшение стоимости");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток" ,  "Стоимость на конец периода");
	СтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость"      , "Остаточная стоимость");
	
	СтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация на начало периода");
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборотДт"        , "Погашение амортизации");
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборотКт"        , "Амортизация за период");
	СтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток" , "Амортизация на конец периода");
	
	СтруктураПредставлениеПолей.Вставить( "ВыработкаОборот"                            , "Выработка тек. периода");
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРабот"                        , "Объем продукции/работ");
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем прод./раб. для амортизации");
	
	
	ПостроительОтчета.Текст     = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость"          , "Первоначальная стоимость" , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьДляВычисленияАмортизации", "Стоимость для амортизации", Ложь  , "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ЛиквидационнаяСтоимость"          , "Ликвид. стоимость"        , Ложь  , "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СрокПолезногоИспользования"               , "Срок полезного использования", Ложь, "ЧЦ=15");
	ОбщийОтчет.ЗаполнитьПоказатели( "СрокИспользованияДляВычисленияАмортизации", "Срок исп. для амортизации"   , Ложь, "ЧЦ=15");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток", "Стоимость на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт"        , "Увеличение стоимости"       , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",         "Уменьшение стоимости"       , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",  "Стоимость на конец периода" , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОстаточнаяСтоимость",       "Остаточная стоимость"       , Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияНачальныйОстаток", "Амортизация на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборотДт",         "Погашение амортизации",         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборотКт",         "Амортизация за период",         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияКонечныйОстаток",  "Амортизация на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ВыработкаОборот"                            , "Выработка тек. периода"          , Ложь, "ЧЦ=15; ЧДЦ=3");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОбъемПродукцииРабот"                        , "Объем продукции/работ"           , Ложь, "ЧЦ=15; ЧДЦ=3");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем прод./раб. для амортизации", Ложь, "ЧЦ=15; ЧДЦ=3");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("ОсновноеСредство");
	МассивОтбора.Добавить("СнятоСУчета");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ПостроительОтчета.Параметры.Вставить( "СостояниеСнятоСУчета" , Перечисления.СостоянияОС.СнятоСУчета);
	ПостроительОтчета.Параметры.Вставить( "СубконтоОС"           ,	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "СтоимостьОС";
ОбщийОтчет.мНазваниеОтчета      = "Ведомость по амортизации ОС";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 0;

#КонецЕсли
