// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДанныеРасшифровкиОбъект;
	
	Отчет.ВыполняетсяРасшифровка = Истина;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Отчет");
	ИмяФормыРасшифровки = РеквизитОбъект.Метаданные().ПолноеИмя() + ".Форма.ФормаРасшифровки";
	
	СтандартнаяОбработка = Ложь;
	Если Параметры.Расшифровка <> Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(Параметры.АдресСхемыКомпоновкиДанных);
		АдресСхемыИсполненногоОтчета = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыИсполненногоОтчета);
		Отчет.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
		ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(Параметры.Расшифровка.Данные);
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровкиОбъект, ИсточникДоступныхНастроек);
		ПрименяемыеНастройки = ОбработкаРасшифровки.ПрименитьНастройки(Параметры.Расшифровка.Идентификатор, Параметры.Расшифровка.ПрименяемыеНастройки);
		Если ТипЗнч(ПрименяемыеНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПрименяемыеНастройки);
		ИначеЕсли ТипЗнч(ПрименяемыеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ДанныеРасшифровкиОбъект.Настройки);
			Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПрименяемыеНастройки);
		КонецЕсли;
		
		ВыполнитьНаСервере(СхемаКомпоновкиДанных);
	КонецЕсли;
	
	// Получим системную информацию.
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере(СхемаКомпоновкиДанных_)
	Перем ДанныеРасшифровкиОбъект;
	
	Результат.Очистить();
	
	СхемаКомпоновкиДанных = СхемаКомпоновкиДанных_;
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыИсполненногоОтчета);
	КонецЕсли;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Отчет.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровкиОбъект);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровкиОбъект);
	
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаОтчета.УстановитьДокумент(Результат);
	ПроцессорВыводаРезультатаОтчета.НачатьВывод();
	ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета.ЗакончитьВывод();
	
	АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Перем ВыбранноеДействие, ПараметрыВыбранногоДействия;
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресДанныхРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыИсполненногоОтчета));
	ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыбранноеДействие, ПараметрыВыбранногоДействия);
	Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
	ИначеЕсли ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		Если ВерсияПлатформы = "8.3" Тогда
		
			Если НЕ ИспользоватьРежимМодальности Тогда
				Попытка
					Выполнить("ПоказатьЗначение(,ПараметрыВыбранногоДействия)");
				Исключение
					Возврат;
				КонецПопытки;
			Иначе	
				ОткрытьЗначение(ПараметрыВыбранногоДействия);
			КонецЕсли; 
				
		ИначеЕсли ВерсияПлатформы = "8.2" Тогда
			
			ОткрытьЗначение(ПараметрыВыбранногоДействия);
			
		КонецЕсли;
		
	Иначе
		ОткрытьФорму(ИмяФормыРасшифровки, Новый Структура("Расшифровка,АдресСхемыКомпоновкиДанных", Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(АдресДанныхРасшифровки, Расшифровка, ПараметрыВыбранногоДействия), АдресСхемыИсполненногоОтчета), , Истина);
	КонецЕсли;
КонецПроцедуры


// #КонецОбласти
