Перем мОснование;

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|   и Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;		
		мОснование             = Основание;
		
		КодыОрганизации = РегистрыСведений.КодыОрганизации.ПолучитьПоследнее(,Новый Структура("Организация",Основание));
		
		ИНН                    = КодыОрганизации.ИНН;
		КодПоЕДРПОУ            = КодыОрганизации.КодПоЕДРПОУ;
		НомерСвидетельства     = КодыОрганизации.НомерСвидетельства;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Перем мСсылкаНового;
	
	// при обмене данными ничего не проверяем
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим основной вид деятельности контрагента
	Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
		ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
	КонецЕсли; 
	
	НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);

	// установим головного контрагента если он не заполнен
	Если Не ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
			Если ЭтоНовый() Тогда
				ГоловнойКонтрагент = мСсылкаНового;
			Иначе
				ГоловнойКонтрагент = Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		СвернутьНП();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Регион) И ТорговыеТочки.Количество() = 0 Тогда
		
		НоваяСтрока = ТорговыеТочки.Добавить();
		
		НоваяСтрока.Регион = Регион;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда

			Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Контрагент ¤1¤ не может быть выбран головным, "
					"так как для него уже был назначен головной контрагент ¤2¤!", СокрЛП(ГоловнойКонтрагент), СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)));
				Отказ = Истина;
				Возврат;
			Иначе

				// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
				// в качестве головного у другого контрагента.
				ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
				Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда

					СообщениеОНевозможностиЗаписи = Локализация.СтрШаблон1("Контрагент ¤1¤ не может иметь головного контрагента!"
						"Этот контрагент уже установлен головным для: ", СокрЛП(ЭтотОбъект));
					Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
						СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
					КонецЦикла;

					ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
					Отказ = Истина;
					Возврат;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
		
		Если ЗначениеЗаполнено(мОснование) Тогда
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Контрагент = Ссылка;
			ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
			ЗаписьРегистра.Объект     = мОснование;
			НаборЗаписей.Записать(Ложь);
			мОснование = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СвернутьНП()
	//НужноУдалить = Новый  Массив;
	//Для Каждого Стр Из НоваяПочта Цикл
	//	ОбщегоНазначения.ПоправитьТелефон(Стр.Телефон);
	//	Если НЕ ЗначениеЗаполнено(Стр.Получатель) Тогда
	//		Стр.Получатель = "";
	//	Иначе
	//		Если НЕ ЗначениеЗаполнено(Стр.Получатель.Код) Тогда
	//			Стр.Получатель = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если НЕ ЗначениеЗаполнено(Стр.Телефон) Тогда
	//		НужноУдалить.Добавить(Стр);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для Каждого стр Из НужноУдалить Цикл
	//	НоваяПочта.Удалить(Стр);
	//КонецЦикла;
	
	//НоваяПочта.Свернуть("Город,Отделение,Телефон,Получатель");
	НоваяПочта.Свернуть("Город,Отделение");
КонецПроцедуры

Функция ДоговораКонтрагента()Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец
	               |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец",Ссылка);

	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез;
КонецФункции

функция ЭтоДропер() Экспорт
	Возврат Родитель.Код = "000000231" ИЛИ Родитель.Код = "000004369" ИЛИ Код = "000000364";	
Конецфункции

функция СсылкаНаРезерв() Экспорт 
	
	Если Не ЗначениеЗаполнено(ДатаПоследнегоВизитаНаСайте) Тогда
		Текст = "За цим посиланням ви можете відслідковувати готовність ваших замовлень." +  Символы.ПС + "Інформація оновлюється автоматично ." + Символы.ПС + Символы.ПС + Символы.ПС;
		Объект = Новый COMОбъект("htmlfile");
	    Объект.ParentWindow.ClipboardData.SetData("Text", Текст +  "https://cvetkovtm.com/assets/shop/sync/reserves/invoice_"+ Код +".html")
	Иначе 
		Текст = "За цим посиланням ви можете відслідковувати готовність ваших замовлень." +  Символы.ПС + "Інформація оновлюється автоматично ." + Символы.ПС + Символы.ПС + Символы.ПС;
		Объект = Новый COMОбъект("htmlfile");
	    Объект.ParentWindow.ClipboardData.SetData("Text", Текст +  "https://cvetkovtm.com/assets/shop/sync/reserves/invoice_"+ Код +".html");
		
		ЛС = "https://cvetkovtm.com/ua/profil/istoriya-pokupok/?phone=";
	КонецЕсли;

КонецФункции

функция ОткрытьРезерв() Экспорт 
	
	ЗапуститьПриложение("https://cvetkovtm.com/assets/shop/sync/reserves/invoice_"+ Код +".pdf");	
	
КонецФункции

функция ЭтоОптовик() Экспорт
	Попытка 	
		Возврат Родитель.Код = "000001993" ИЛИ Родитель.Родитель.Код = "000001993" ИЛИ Родитель.Родитель.Родитель.Код = "000001993";	
	Исключение 
		Возврат Ложь;
	КонецПопытки;
Конецфункции 


функция ЭтоМаркетплейс() Экспорт
	Попытка 	
		Возврат Родитель.Код = "000004272";	
	Исключение 
		Возврат Ложь;
	КонецПопытки;
Конецфункции 

Функция ЭтоМаруся() Экспорт  
	Возврат Код = "000000364";
КонецФункции



