
// Заполнить начальными значениями в пустой ИБ
//
// Параметры
//  Нет
//
Процедура ЗаполнитьОбъектВПустойИБ() Экспорт

	Макет     = ПолучитьМакет("НачальныеЗначения");
	ОбластьГрупп = Макет.ПолучитьОбласть("Группы");
    ВысотаТаб = ОбластьГрупп.ВысотаТаблицы;
    ЗаполняемыйСправочник = Справочники.ОснованияЛьготногоСтажа;
		
	Для К = 1 По ВысотаТаб Цикл
    	СтрокаНаименование = ОбластьГрупп.Область(К, 2).Текст; 
        НайденнаяСсылка = ЗаполняемыйСправочник.НайтиПоНаименованию(СтрокаНаименование);
		Если НайденнаяСсылка = ЗаполняемыйСправочник.ПустаяСсылка() Тогда
			НоваяГруппа = ЗаполняемыйСправочник.СоздатьГруппу();
			НоваяГруппа.Наименование = СтрокаНаименование;
			НоваяГруппа.Записать();

            ОбластьЭлементов = Макет.ПолучитьОбласть(ОбластьГрупп.Область(К, 3).Текст);
			ВысотаЭлементов = ОбластьЭлементов.ВысотаТаблицы;

			Для К2 = 1 По ВысотаЭлементов Цикл
    			СтрокаНаименование = ОбластьЭлементов.Область(К2, 2).Текст;
				СтрокаКодПФ = ОбластьЭлементов.Область(К2, 3).Текст;
        		НайденнаяСсылка = ЗаполняемыйСправочник.НайтиПоНаименованию(СтрокаНаименование);
				Если НайденнаяСсылка = ЗаполняемыйСправочник.ПустаяСсылка() Тогда
					НоваяЗапись = ЗаполняемыйСправочник.СоздатьЭлемент();
					НоваяЗапись.Родитель = НоваяГруппа.Ссылка;
					НоваяЗапись.Наименование = СтрокаНаименование;
					НоваяЗапись.КодПФ = СтрокаКодПФ;
					НоваяЗапись.Записать();
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;	
    КонецЦикла;	

КонецПроцедуры // ЗаполнитьОбъектВПустойИБ()
