////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)

	Если ЭтоНовый() или ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// Получение старых значений
	НалоговоеНазначениеСтарый  = Ссылка.НалоговоеНазначение;
	// Проверка изменений, если старое значение было заполнено
	ИзмененНалоговоеНазначение = (НалоговоеНазначение <> НалоговоеНазначениеСтарый) И ЗначениеЗаполнено(НалоговоеНазначениеСтарый);
	
	Если ИзмененНалоговоеНазначение Тогда
		
		Если ПолныеПрава.ОбъектыСтроительства_БылиДвиженияПоРегистрам(Ссылка) Тогда
			
			Сообщение = Локализация.СтрШаблон1("	Нельзя изменять ""Налоговое назначение"",потому что были движения по регистру бухгалтерии ""Хозрасчетный""."
"	Текущее значение <¤1¤> изменяется на старое <¤2¤>.", НалоговоеНазначение, НалоговоеНазначениеСтарый);
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			НалоговоеНазначение = НалоговоеНазначениеСтарый
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Заголовок = Локализация.СтрШаблон1("Запись элемента справочника ""¤1¤"" Наим: <¤2¤> код: <¤3¤>:", Метаданные().Представление(), Наименование, Код);
				
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
КонецПроцедуры
