// Строки, хранят реквизиты имеющие смысл только для бухгалтерского и налогового учетов
// соответственно в случае если документ не отражается в каком-то виде учета,
// делаются невидимыми.
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

Перем мУдалятьДвижения;

Перем мСтруктураШапкиДокумента;         // (Общ) Результат запроса по шапке документа

Перем мВалютаРегламентированногоУчета Экспорт;
Перем мВалютаУправленческогоУчета Экспорт;

Перем КурсЗачетаАвансаРегл;

Перем мСтруктураПараметровДляПолученияДоговора Экспорт;
Перем мСтруктураПараметровВзаиморасчетов Экспорт;

 #Если Клиент Тогда 
	 
// Функция формирует табличный документ с печатной формой акта об
// обказании услуг
//
// Возвращаемое значение:
//  Табличный документ - печатная форма акта
//
Функция ПечатьАктаОбОказанииУслуг(НазваниеДокумента)

	ЗапросШапка = Новый Запрос;
	ЗапросШапка.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ДоговорКонтрагента,
	|	ДоговорКонтрагента.Дата  		КАК ДоговорДата,
	|	ДоговорКонтрагента.Номер 		КАК ДоговорНомер,
	//|	ДоговорКонтрагента.Наименование КАК ДоговорНаименованиеДляПечати,
	|	ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ДоговорВедениеВзаиморасчетов,
	|	ДоговорКонтрагента.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,	
	|	ДоговорКонтрагента.ВыводитьИнформациюОСделкеПриПечатиДокументов КАК ПечататьСделку,	
	|	Сделка,	
	|	ВЫРАЗИТЬ(МестоСоставленияДокумента КАК СТРОКА(1000)) КАК МестоСоставленияДокумента,
	|	ПредставительОрганизации КАК ПредставительПоставщика,
	|   ПредставительКонтрагента КАК ПредставительПокупателя,
	
	|	Контрагент  КАК Покупатель,
	|	Контрагент.ЮрФизЛицо КАК ПокупательЮрФизЛицо,
	|	Организация КАК Поставщик,
	|	Организация,
	|	СуммаДокумента,
	|	ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ТекущийДокумент";
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	Шапка.Следующий();

	ЗапросУслуги = Новый Запрос;
	ЗапросУслуги.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросУслуги.Текст = "
	|ВЫБРАТЬ
	|	НомерСтроки  КАК НомерСтрокиТЧ,
	|	Номенклатура КАК Номенклатура,
	|	Содержание   КАК Товар,
	|	Количество,
	|	Номенклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	Цена,
	|	Сумма,
	|	СтавкаНДС,
	|	СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработке
	|
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиТЧ
	|";
	ТаблицаУслуги = ЗапросУслуги.Выполнить().Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияУслугПоПереработке_Акт";
	Макет       = ПолучитьМакет("Акт");
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,,КодЯзыкаПечать);
	РуководителиОрганизации = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Шапка.Дата);
	РуководителиКонтрагента = ОбщегоНазначения.ОтветственныеЛицаКонтрагента(Шапка.Покупатель, Шапка.Дата);
	
	// шапка акта "УТВЕРЖДАЮ"
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДолжностьРуководителяПоставщика = РуководителиОрганизации.РуководительДолжность;
	ОбластьМакета.Параметры.ПредставлениеПоставщика 		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РуководительПоставщика 			=  РуководителиОрганизации.Руководитель;
	ОбластьМакета.Параметры.ДолжностьРуководителяПокупателя = ?(ПустаяСтрока(РуководителиКонтрагента.РуководительДолжность) И Шапка.ПокупательЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо, "Директор", РуководителиКонтрагента.РуководительДолжность); 
	
	ОбластьМакета.Параметры.ПредставлениеПокупателя 		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РуководительПокупателя 			= РуководителиКонтрагента.РуководительПредставление;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Акт оказания услуг по переработке';uk='Акт надання послуг з переробки'",КодЯзыкаПечать) + Символы.ПС,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ДанныеПредставителя = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация,Шапка.ПредставительПоставщика, Шапка.Дата);
	ДолжностьПредставителя = СокрЛП(ДанныеПредставителя.Должность);
	
	ДолжностьФИОПредставителя = ?(ЗначениеЗаполнено(ДолжностьПредставителя),ДолжностьПредставителя + " ","") + 
								?(ДанныеПредставителя.Фамилия = Неопределено,"",ДанныеПредставителя.Фамилия + " ") + 
								?(ДанныеПредставителя.Имя = Неопределено,"",ДанныеПредставителя.Имя + " ") +
								?(ДанныеПредставителя.Отчество = Неопределено,"",ДанныеПредставителя.Отчество);

	// Начинаем формировать собственно текст акта
	ОбластьМакета = Макет.ПолучитьОбласть("ТекстАктаНачало");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	ОбластьМакета.Параметры.ПредставительПоставщика = ДолжностьФИОПредставителя;
	ОбластьМакета.Параметры.ПредставительПокупателя = Шапка.ПредставительПокупателя;
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика 		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	ОбластьМакета.Параметры.ПредставлениеПокупателя 		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,");
	ТабДокумент.Вывести(ОбластьМакета);

	// выводим сведения о договоре и сделке
	СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";	
	Если Шапка.ПечататьСделку = Истина Тогда
		СписокДополнительныхПараметров = СписокДополнительныхПараметров + "Сделка,";
	КонецЕсли;
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров, КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
	Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;		

 	// Заканчиваем формировать текст акта
	ОбластьМакета = Макет.ПолучитьОбласть("ТекстАктаКонец");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести табличную часть
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Суффикс = "";
	Если Шапка.УчитыватьНДС Тогда
		Если Шапка.СуммаВключаетНДС Тогда
			Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
		Иначе	
			Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
		КонецЕсли;
		Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
	КонецЕсли;
	ОбластьМакета.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
	ОбластьМакета.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");

	НомерСтроки = 0;

	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслуги Цикл	

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;


		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;

	Если ТаблицаУслуги <> Неопределено Тогда

		СуммаВсего  = ТаблицаУслуги.Итог("Сумма");
		ВсегоНДС 	= ТаблицаУслуги.Итог("СуммаНДС");

	Иначе

		СуммаВсего  = 0;
		ВсегоНДС 	= 0;

	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(СуммаВсего);
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести ИтогоНДС
	Если Шапка.УчитыватьНДС Тогда
		// НДС
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(ВсегоНДС,,"''");
		ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
		ТабДокумент.Вывести(ОбластьМакета);
		
		// всего с НДС (если сумма не включает НДС)
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаВсего + ВсегоНДС);
			ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Всього із ПДВ:'",КодЯзыкаПечать);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЕсли;

	// Выводим Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");	
	СуммаКПрописиСНДС 	= СуммаВсего + ?(Шапка.СуммаВключаетНДС, 	   0, ВсегоНДС);
	СуммаКПрописиБезНДС = СуммаВсего - ?(Шапка.СуммаВключаетНДС, ВсегоНДС, 		 0);
	Если Шапка.УчитыватьНДС Тогда
		ОбластьМакета.Параметры.СуммаПрописью  = НСтр("ru='Общая стоимость работ (услуг) составила без НДС ';uk='Загальна вартість робіт (послуг) склала без ПДВ '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописиБезНДС, Шапка.ВалютаДокумента,КодЯзыкаПечать) +
												 НСтр("ru=', НДС ';uk=', ПДВ '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(ВсегоНДС, Шапка.ВалютаДокумента,КодЯзыкаПечать) +
												 НСтр("ru=', общая стоимость работ (услуг) с НДС ';uk=', загальна вартість робіт (послуг) із ПДВ '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописиСНДС, Шапка.ВалютаДокумента,КодЯзыкаПечать) +
												 ".";
 	Иначе
		ОбластьМакета.Параметры.СуммаПрописью  = НСтр("ru='Общая стоимость работ (услуг) составила ';uk='Загальна вартість робіт (послуг) склала '",КодЯзыкаПечать)	+ ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописиБезНДС, Шапка.ВалютаДокумента,КодЯзыкаПечать) + ".";
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	Если ЗначениеЗаполнено(Шапка.МестоСоставленияДокумента) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("МестоСоставления");
		ОбластьМакета.Параметры.МестоСоставления = СокрЛП(Шапка.МестоСоставленияДокумента);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли; 

	// выводим подписи
								
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	ОбластьМакета.Параметры.ПредставительПоставщика = ДолжностьФИОПредставителя;
	ОбластьМакета.Параметры.ПредставительПокупателя = Шапка.ПредставительПокупателя;
	
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,/,КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,/,НомерСчета,Банк,МФО,/,ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,/,КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,/,НомерСчета,Банк,МФО,/,ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьАктаОбОказанииУслуг()

// Функция формирует табличный документ с печатной формой отчета о
// продукции, произведенной из давальческого сырья и переданной давальцу
//
// Возвращаемое значение:
//  Табличный документ - печатная форма отчета
//
Функция ПечатьОтчета(ТабЧасть, НазваниеДокумента)

	ЗапросШапка = Новый Запрос;
	ЗапросШапка.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ДоговорКонтрагента,
	|	ДоговорКонтрагента.Дата  		КАК ДоговорДата,
	|	ДоговорКонтрагента.Номер 		КАК ДоговорНомер,
	|	ДоговорКонтрагента.Наименование КАК ДоговорНаименованиеДляПечати,
	|	ВЫРАЗИТЬ(МестоСоставленияДокумента КАК СТРОКА(1000)) КАК МестоСоставленияДокумента,
	|	ПредставительОрганизации КАК ПредставительПоставщика,
	|   ПредставительКонтрагента КАК ПредставительПокупателя,
	
	|	Контрагент  КАК Покупатель,
	|	Контрагент.ЮрФизЛицо КАК ПокупательЮрФизЛицо,
	|	Организация КАК Поставщик,
	|	Организация,
	|	СуммаДокумента,
	|	ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ТекущийДокумент";
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	Шапка.Следующий();

	ЗапросПродукция = Новый Запрос;
	ЗапросПродукция.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	ЗапросПродукция.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура КАК Номенклатура,
	|	Номенклатура КАК Товар,
	|	Количество,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия,
	|   Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения";
	Если ТабЧасть = "Услуги" Тогда
		ЗапросПродукция.Текст = ЗапросПродукция.Текст + "
		|	,
		|	Цена,
		|	СуммаНДС,
		|	Сумма";
	КонецЕсли;
	ЗапросПродукция.Текст = ЗапросПродукция.Текст + "
	
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке." + ТабЧасть + " КАК РеализацияУслугПоПереработке
	|
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ТекущийДокумент
	|";
	ТаблицаПродукция = ЗапросПродукция.Выполнить().Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияУслугПоПереработке_Отчет_о_" + ТабЧасть;
	Макет       = ПолучитьМакет("Накладная");
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	НазваниеДокумента    = "Отчет о " + ?(ТабЧасть = "Услуги", "продукции, произведенной из сырья заказчика", "переработанном сырье ");
	НазваниеДокументаУкр = "Звіт про " + ?(ТабЧасть = "Услуги", "продукцію, що вироблена з сировини замовника", "перероблену сировину ");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='"+НазваниеДокумента+"';uk='"+НазваниеДокументаУкр+"'",КодЯзыкаПечать),КодЯзыкаПечать);	
	ТабДокумент.Вывести(ОбластьМакета);
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,,КодЯзыкаПечать);
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);	
	ОбластьМакета.Параметры.РеквизитыПоставщика =     ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
    ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
 	ОбластьМакета.Параметры.ПредставлениеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПокупателя		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,"Телефоны,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим дополнительно информацию о договоре и сделке
	СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	// Вывести табличную часть
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы" + ТабЧасть);
	Если ТабЧасть = "Услуги" Тогда
		Суффикс = "";
		Если Шапка.УчитыватьНДС Тогда
			Если Шапка.СуммаВключаетНДС Тогда
				Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
			Иначе	
				Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
			КонецЕсли;
			Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
		КонецЕсли;
		ОбластьМакета.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
		ОбластьМакета.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка" + ТабЧасть);
	НомерСтроки = 0;

	Для Каждого СтрокаТабличнойЧасти Из ТаблицаПродукция Цикл	

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтроки.Параметры.Товар = СокрЛП(СтрокаТабличнойЧасти.Номенклатура) 
		                                         + ФормированиеПечатныхФорм.ПредставлениеСерий(СтрокаТабличнойЧасти);


		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;

	Сумма    = 0;
	Если ТабЧасть = "Услуги" Тогда
		Если ТаблицаПродукция <> Неопределено Тогда
			Сумма    = ТаблицаПродукция.Итог("Сумма");
			СуммаНДС = ТаблицаПродукция.Итог("СуммаНДС");
		КонецЕсли;

		// Вывести Итого
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);
		ТабДокумент.Вывести(ОбластьМакета);

		// Вывести ИтогоНДС
		Если Шапка.УчитыватьНДС Тогда
			// НДС
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаНДС,,"''");
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
			ТабДокумент.Вывести(ОбластьМакета);
			
			// всего с НДС (если сумма не включает НДС)
			Если НЕ Шапка.СуммаВключаетНДС Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
				ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(Сумма + СуммаНДС);
				ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Всього із ПДВ:'",КодЯзыкаПечать);
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;
			
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ТаблицаПродукция.Количество() + "," +
												 НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента)
												 +".";
												 
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
		 										 + ?(НЕ Шапка.УчитыватьНДС, "", Символы.ПС + НСтр("ru='В т.ч. НДС: ';uk='У т.ч. ПДВ: '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаНДС, Шапка.ВалютаДокумента, КодЯзыкаПечать));

		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	Если ТабЧасть = "МатериалыЗаказчика" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМатериалы");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Шапка.МестоСоставленияДокумента) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("МестоСоставления");
		ОбластьМакета.Параметры.МестоСоставления = СокрЛП(Шапка.МестоСоставленияДокумента);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли; 
	
	ДанныеПредставителя = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация,Шапка.ПредставительПоставщика, Шапка.Дата);
	ДолжностьПредставителя = СокрЛП(ДанныеПредставителя.Должность);
	
	ДолжностьФИОПредставителя = ?(ЗначениеЗаполнено(ДолжностьПредставителя),ДолжностьПредставителя + " ","") + 
								?(ДанныеПредставителя.Фамилия = Неопределено,"",ДанныеПредставителя.Фамилия + " ") + 
								?(ДанныеПредставителя.Имя = Неопределено,"",ДанныеПредставителя.Имя + " ") +
								?(ДанныеПредставителя.Отчество = Неопределено,"",ДанныеПредставителя.Отчество);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи" + ТабЧасть);
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	ОбластьМакета.Параметры.Ответственный = ДолжностьФИОПредставителя;
	ОбластьМакета.Параметры.Получил = Шапка.ПредставительПокупателя;
	
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;

КонецФункции // ПечатьОтчетаОпродукции()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	НазваниеДокумента = "";
	Если ИмяМакета = "Акт" Тогда
		
		ТабДокумент = ПечатьАктаОбОказанииУслуг(НазваниеДокумента);
		
	ИначеЕсли ИмяМакета = "Продукция" Тогда
		
		ТабДокумент = ПечатьОтчета("Услуги", НазваниеДокумента);
		
	ИначеЕсли ИмяМакета = "Материалы" Тогда
		
		ТабДокумент = ПечатьОтчета("МатериалыЗаказчика", НазваниеДокумента);
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НазваниеДокумента), Ссылка);
	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Акт, Продукция, Материалы", "Акт об оказании услуг", "Отчет о продукции", "Отчет о материалах");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета = "СчетУчетаРасчетовСКонтрагентом, НадписьСчетУчетаРасчетовСКонтрагентом,
								|СчетУчетаРасчетовПоАвансам, НадписьСчетУчетаРасчетовПоАвансам,
								|Услуги.СчетУчетаБУ, Услуги.СчетДоходовБУ, Услуги.СчетРасходовБУ,
								|Услуги.СубконтоБУ";

	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()
							
// Функция проверяет правильность заполнения реквизитов документа
// Также формирует запрос по шапке документа, результат которого
// сохраняется в переменной мСтруктураШапкиДокумента
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок, СтруктураШапкиДокумента) Экспорт

	РеквизитыШапки = "Организация, Контрагент, ДоговорКонтрагента, ВалютаДокумента, КурсВзаиморасчетов, КратностьВзаиморасчетов";
	
	СтруктураОбязательныхПолей = Новый Структура("Организация, ВалютаДокумента, Контрагент, ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Сделка");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");

		Если СтруктураШапкиДокумента.УчитыватьНДС И СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
			Если СтруктураШапкиДокумента.СложныйНалоговыйУчет = Ложь Тогда
				СтруктураОбязательныхПолей.Вставить("СчетУчетаНДСПодтвержденный");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);

КонецПроцедуры // 

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, 
	                                              Отказ, Заголовок)

	ИмяТабличнойЧасти = "Услуги";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Номенклатура, Количество, Сумма, Содержание");

	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СхемаРеализации");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
		КонецЕсли;	
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// построчная проверка
	ПроверитьТабЧастьУслугиПоСтрочно(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		// Схемы реализации должны быть заполнены правильно
		СтруктураПараметровПроверки = Новый Структура;
		СтруктураПараметровПроверки.Вставить("СчетДоходовБУ",  "СчетДоходов");
		СтруктураПараметровПроверки.Вставить("СчетРасходовБУ",  "СчетСебестоимости");
		
		БухгалтерскийУчет.ПроверитьСхемыРеализацииТабличнойЧастиНаЗаполненость(ЭтотОбъект, "Услуги", , ТаблицаПоУслугам, 
															 СтруктураПараметровПроверки,
															 СтруктураШапкиДокумента,
															 Отказ, Заголовок);	
	КонецЕсли;
	
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Процедура ПроверитьЗаполнениеТабличнойЧастиМатериалы(ТаблицаПоМатериалам, СтруктураШапкиДокумента, 
	                                              Отказ, Заголовок)

	ИмяТабличнойЧасти = "МатериалыЗаказчика";
	СтруктураОбязательныхПолей = 
	Новый Структура("Номенклатура, Количество");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "МатериалыЗаказчика", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "МатериалыЗаказчика", ТаблицаПоМатериалам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "МатериалыЗаказчика", ТаблицаПоМатериалам, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "МатериалыЗаказчика", ТаблицаПоМатериалам, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПроверитьТабЧастьУслугиПоСтрочно(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Продукция (услуги по переработке)"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете
			И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			   
			НехозВНД_НП  = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
		
			Если СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = НехозВНД_НП Тогда 
				СтрокаСообщения = НСтр("ru = 'Указано некорректное налоговое назначение доходов! Вид налоговой деятельности при реализации не может быть ""Не хозяйственной деятельностью"".'; uk = 'Вказано некоректне податкове призначення доходів! Вид податкової діяльності при реалізації не може бути ""Не господарською діяльністю"".'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		
		КонецЕсли;	
		
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			Если СтрокаТЧ.Услуга Тогда
				Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.ПодразделениеОрганизации) Тогда
					СтрокаСообщения = "Для услуг должно быть заполнено значение реквизита шапки ""Подразделение организации""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли; 
				Если СтрокаТЧ.СуммаПлановая = 0 Тогда
				    СтрокаСообщения = "Для услуг должно быть указана Сумма (плановая)!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
			Если СтрокаТЧ.Услуга Тогда
				Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Подразделение) Тогда
					СтрокаСообщения = "Для услуг должно быть заполнено значение реквизита шапки ""Подразделение""!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли; 
				Если СтрокаТЧ.СуммаПлановаяУпр = 0 Тогда
				    СтрокаСообщения = "Для услуг должно быть указана Сумма упр. (плановая)!";
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
	
	НехозВНД_НДС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность;
	НехозВНД_НП  = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
	
	// Для определения вида деятельности НДС
	ДопПараметрыОпределенияВДНДС = Новый Структура("БартерИЭкспорт");
	Если  (СтруктураШапкиДокумента.ВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета) 
	    И (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный) Тогда
		// Бартер и экспорт
		ДопПараметрыОпределенияВДНДС.БартерИЭкспорт = Истина;
	Иначе
		ДопПараметрыОпределенияВДНДС.БартерИЭкспорт = Ложь;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл

		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1(НСтр("ru='В строке номер ""¤1¤"" табличной части ""Услуги"": ';uk='У рядку номер ""¤1¤"" табличної частини ""Послуги"": '"), СокрЛП(СтрокаТЧ.НомерСтроки));
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда   
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат) Тогда
				СтрокаСообщения = НСтр("ru = 'Не заполнено значение реквизита ""Налоговое назначение (доходов и затрат) ""!'; uk = 'Не заповнене значення реквізиту ""Податкове призначення (доходів та витрат)""!'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			ИначеЕсли СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = НехозВНД_НП Тогда 
				СтрокаСообщения = НСтр("ru = 'Указано некорректное налоговое назначение доходов! Вид налоговой деятельности при реализации не может быть ""Не хозяйственной деятельностью"".'; uk = 'Вказано некоректне податкове призначення доходів! Вид податкової діяльності при реалізації не може бути ""Не господарською діяльністю"".'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
		
		Если  СтруктураШапкиДокумента.ЕстьНДС Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
				
				СтрокаСообщения = НСтр("ru = 'Не заполнено значение реквизита ""Налоговое назначение (НДС)""!'; uk = 'Не заповнене значення реквізиту ""Податкове призначення (НДС)""!'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			ИначеЕсли СтрокаТЧ.НалоговоеНазначение = НехозВНД_НДС Тогда	
				
				СтрокаСообщения = НСтр("ru = 'Указано некорректное налоговое назначение (НДС)!  Вид налоговой деятельности при реализации не может быть ""Не хозяйственной деятельностью"".'; uk = 'Вказано некоректне податкове призначення (ПДВ)! Вид податкової діяльності при реалізації не може бути ""Не господарською діяльністю"".'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			ИначеЕсли СтрокаТЧ.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая Тогда
				
				СтрокаСообщения = НСтр("ru = 'Указано некорректное налоговое назначение (НДС)!  Вид деятельности НДС при реализации услуг по переработке не может быть ""Пропорционально облагаемая"".'; uk = 'Вказано некоректне податкове призначення (ПДВ)! Вид діяльності ПДВ при реалізації послуг з переробки не може бути ""Пропорційно оподатковувана"".'");
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			Иначе
				
				Если НЕ СтрокаТЧ.СтавкаНДС.Пустая()
					И НЕ СтрокаТЧ.ВидДеятельностиНДС = УчетНДС.ПолучитьВидДеятельностиНДС(СтрокаТЧ.СтавкаНДС, ДопПараметрыОпределенияВДНДС) Тогда
					
					Если СтруктураШапкиДокумента.УчитыватьНДС Тогда
						СтрокаСообщения = НСтр("ru = 'Указано некорректное налоговое назначение (НДС)! Оно  не соответствует ставке НДС, указанной в строке.'; uk = 'Вказано некоректне податкове призначення (ПДВ)! Воно не відповідає ставці ПДВ, вказаній в рядку.'");
					Иначе	
						СтрокаСообщения = НСтр("ru='Указано некорректное налоговое назначение! Вид деятельности НДС должен быть ""Необлагаемая""';uk='Вказано некоректне податкове призначення! Вид діяльності ПДВ повинен бути ""Неоподатковувана""'");
					КонецЕсли;
					
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
 		
	КонецЦикла;
	
КонецПроцедуры 	

Процедура ЗаполнитьСчетаБУВСтроке(СтрокаТЧ, ИмяТЧ, СчетаУчета, ЗаполнятьБУ)	

	Если ЗаполнятьБУ = Истина Тогда

		Если ИмяТЧ = "Услуги" Тогда
			СтрокаТЧ.СхемаРеализации  = СчетаУчета.СхемаРеализации;
			СтрокаТЧ.СчетУчетаБУ 	  = ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья;
		Иначе
			СтрокаТЧ.СчетУчетаБУ 	  = СчетаУчета.СчетУчетаДавСырья;
		КонецЕсли;
		
		
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		СтрокаТЧ.СхемаРеализации  = Справочники.СхемыРеализации.ПустаяСсылка();
		Если ИмяТЧ = "Услуги" Тогда
			СтрокаТЧ.СхемаРеализации	= Справочники.СхемыРеализации.ПустаяСсылка();
			СтрокаТЧ.СчетУчетаБУ 	  	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Иначе
			СтрокаТЧ.СчетУчетаБУ 	  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУВСтрокеУслуг

Процедура ЗаполнитьСчетаНУВСтроке(СтрокаТЧ, ИмяТЧ, СчетаУчета, ЗаполнятьНУ)

	Если ЗаполнятьНУ = Истина Тогда
		Если ИмяТЧ = "Услуги" Тогда
			СтрокаТЧ.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = СчетаУчета.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		Если ИмяТЧ = "Услуги" Тогда
			СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
			СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат  = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУВСтрокеУслуг

Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТЧ, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	СчетаУчета     = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура);
	
	ЗаполнитьСчетаБУВСтроке(СтрокаТЧ, ИмяТЧ, СчетаУчета, ЗаполнятьБУ);
	ЗаполнитьСчетаНУВСтроке(СтрокаТЧ, ИмяТЧ, СчетаУчета, ЗаполнятьНУ);
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧастиУслуги()

Процедура ЗаполнитьСчетаУчетаВТабЧасти(ИмяТЧ, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Для каждого СтрокаТЧ Из Услуги Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТЧ, ЗаполнятьБУ, ЗаполнятьНУ)
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧастиУслуги()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТоваров = РезультатЗапросаПоУслугам.Выгрузить();
	
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - 
		                          ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

	КонецЦикла;
	
	// Вызываем отдельные процедуры подготовки для регл. и упр. учета
	ПодготовитьТаблицуУслугРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления);	
	ПодготовитьТаблицуУслугУпр(ТаблицаТоваров, СтруктураШапкиДокумента);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуУслуг()

Процедура ПодготовитьТаблицуУслугРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления)

	Если НЕ УчитыватьНДС Тогда
		// для регламентного учета считаем НДС
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС");
		ТаблицаТоваров.ЗаполнитьЗначения(0                            , "НДС");
	КонецЕсли;

	НалоговыйУчет.ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, Ложь);
	
КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()	

Процедура ПодготовитьТаблицуУслугУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	// Надо добавить нужные при проведении колонки.
	ТаблицаТоваров.Колонки.Добавить("ЦенаВВалютеЗаказа"   , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТоваров.Колонки.Добавить("СуммаВзаиморасчетов" , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаТоваров.Колонки.Добавить("Стоимость"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр"            , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СтоимостьБезСкидок"  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"              , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("НДСУпрБезСкидок" 	 , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	ТаблицаТоваров.Колонки.Добавить("НДСПлановыйУпр"              , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаПлановаяУпрБезНДС"      , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	
	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		// Счиатем, что реализация выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;

		СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
		
		Если СтрокаТаблицы.ПроцентСкидкиНаценки <> 0 Тогда

			СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
			
			СтрокаТаблицы.НДСУпрБезСкидок = УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СтоимостьБезСкидок, УчитыватьНДС, СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
			
			Если УчитыватьНДС И СуммаВключаетНДС Тогда
				СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.СтоимостьБезСкидок - УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СтоимостьБезСкидок, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
			КонецЕсли;
			
			
		
			СтрокаТаблицы.СтоимостьБезСкидок = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СтоимостьБезСкидок, ВалютаДокумента, 
			                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
			                                 СтруктураШапкиДокумента.КурсДокумента, 
											 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                                 СтруктураШапкиДокумента.КратностьДокумента, 
											 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);										 
			СтрокаТаблицы.НДСУпрБезСкидок = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДСУпрБезСкидок, ВалютаДокумента, 
			                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
			                                 СтруктураШапкиДокумента.КурсДокумента, 
											 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                                 СтруктураШапкиДокумента.КратностьДокумента, 
											 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
											 
		КонецЕсли;	
		
		СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
		
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВзаиморасчетов, ВалютаДокумента, 
													СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
													СтруктураШапкиДокумента.КурсДокумента, 
													СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
													СтруктураШапкиДокумента.КратностьДокумента, 
													СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
													
		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВзаиморасчетов, ВалютаДокумента,
									                СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
													СтруктураШапкиДокумента.КурсДокумента, КурсВзаиморасчетов,
													СтруктураШапкиДокумента.КратностьДокумента, 
													КратностьВзаиморасчетов);


		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаБезНДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		СтрокаТаблицы.НДСУпр     = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
		Если СтрокаТаблицы.ПроцентСкидкиНаценки = 0 Тогда
			СтрокаТаблицы.СтоимостьБезСкидок = СтрокаТаблицы.Стоимость;	
			СтрокаТаблицы.НДСУпрБезСкидок = СтрокаТаблицы.НДСУпр;
		КонецЕсли;	
		
		СтрокаТаблицы.НДСПлановыйУпр 		 = УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СуммаПлановаяУпр, УчитыватьНДС, Истина, УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
		СтрокаТаблицы.СуммаПлановаяУпрБезНДС = СтрокаТаблицы.СуммаПлановаяУпр - СтрокаТаблицы.НДСПлановыйУпр;

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуУслугУпр()

Функция ПодготовитьТаблицуМатериалов(РезультатЗапросаПоМатериалам, СтруктураШапкиДокумента)

	ТаблицаМатериалов = РезультатЗапросаПоМатериалам.Выгрузить();

	ТаблицаМатериалов.Колонки.Добавить("ДокументОприходования");
	ТаблицаМатериалов.Колонки.Добавить("Регистратор");
	ТаблицаМатериалов.Колонки.Добавить("Склад");
	ТаблицаМатериалов.Колонки.Добавить("Контрагент");
	ТаблицаМатериалов.Колонки.Добавить("Организация");
	ТаблицаМатериалов.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаМатериалов.Колонки.Добавить("ОтражениеВНУ");
	ТаблицаМатериалов.Колонки.Добавить("Валюта");
	ТаблицаМатериалов.Колонки.Добавить("ВходящийНДС");
	ТаблицаМатериалов.Колонки.Добавить("КоэффОплаты");

	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияБУ");
	ТаблицаМатериалов.Колонки.Добавить("КорСчетСписанияНУ");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияБУ3");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияНУ1");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияНУ2");
	ТаблицаМатериалов.Колонки.Добавить("КорСубконтоСписанияНУ3");
	
	КоэффОплаты      = 1;
	ТаблицаМатериалов.ЗаполнитьЗначения(КоэффОплаты,   "КоэффОплаты");
	ТаблицаМатериалов.ЗаполнитьЗначения(ЭтотОбъект,    "Регистратор");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент,         "Контрагент");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаМатериалов.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,        "Организация");
	ТаблицаМатериалов.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.ПустаяСсылка(),    "КорСчетСписанияБУ");
	Возврат ТаблицаМатериалов;

КонецФункции // ПодготовитьТаблицуТоваров()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  ТаблицаУслуг              - таблица значений по скидкам,
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСкидок(ТаблицаПоУслугам, СтруктураШапкиДокумента)

	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Номенклатура");
	ТаблицаДвижений.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаДвижений.Колонки.Добавить("УсловиеСкидки");
	ТаблицаДвижений.Колонки.Добавить("ЗначениеУсловияСкидки");
	ТаблицаДвижений.Колонки.Добавить("СуммаСкидки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаДвижений.Колонки.Добавить("НДССкидки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
    
	Для каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		СуммаБезСкидки = СтрокаТаблицы.СтоимостьБезСкидок;
		НДСБезСкидки 	= СтрокаТаблицы.НДСУпрБезСкидок;

		СуммаСоСкидками = СуммаБезСкидки;
		НДССоСкидками 	= НДСБезСкидки;
		СкидкиЕсть = Ложь;
		Если СтрокаТаблицы.ПроцентСкидкиНаценки <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Номенклатура = СтрокаТаблицы.Номенклатура;
			СтрокаДвижений.УсловиеСкидки = Перечисления.УсловияСкидкиНаценки.РучнаяСкидка;
			СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.ПроцентСкидкиНаценки;
			СтрокаДвижений.СуммаСкидки = Окр((СуммаБезСкидки/100) * СтрокаТаблицы.ПроцентСкидкиНаценки,2);
			СуммаСоСкидками = СуммаСоСкидками - СтрокаДвижений.СуммаСкидки;
			
			// НДС скидки
			СтрокаДвижений.НДССкидки = Окр((НДСБезСкидки/100) * СтрокаТаблицы.ПроцентСкидкиНаценки,2);
			НДССоСкидками = НДССоСкидками - СтрокаДвижений.НДССкидки;
			
			СкидкиЕсть = Истина;
		КонецЕсли;
		
		//СуммаСоСкидкамиРеально = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВал, ВалютаДокумента, 
		//СуммаСоСкидкамиРеально = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаВзаиморасчетов, ВалютаДокумента, 
		//								 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		//								 СтруктураШапкиДокумента.КурсДокумента, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		//								 СтруктураШапкиДокумента.КратностьДокумента, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		СуммаСоСкидкамиРеально = СтрокаТаблицы.Стоимость;

		Разница = СуммаСоСкидкамиРеально - СуммаСоСкидками;

		НДССоСкидкамиРеально = СтрокаТаблицы.НДСУпр;
		РазницаНДС = НДССоСкидкамиРеально - НДССоСкидками;
		
		Если(Разница <> 0 ИЛИ РазницаНДС <> 0) И СкидкиЕсть Тогда
			СтрокаДвижений.СуммаСкидки = СтрокаДвижений.СуммаСкидки - Разница;
			СтрокаДвижений.НДССкидки 	= СтрокаДвижений.НДССкидки - РазницаНДС;
		КонецЕсли;
		
	КонецЦикла;

	Возврат ТаблицаДвижений;
КонецФункции // ПодготовитьТаблицуСкидок()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА
//

Функция ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ)
	
	ТаблицаПоВторомуСобытиюНал = НалоговыйУчет.СоздатьСтруктуруТаблицыНалоговыхСумм();

	Если Не СтруктураШапкиДокумента.ЕстьНДС Тогда
		// Если не нужно отражать в налоговом учете, тогда не отражаем и в подсистеме учета НДС
		Возврат ТаблицаПоВторомуСобытиюНал;
	КонецЕсли;
	
	//Отразим Продажи в регистре ПродажиНалоговыйУчет
	НаборДвижений = Движения.ПродажиНалоговыйУчет;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС", "СуммаСНДСВал, СуммаНДСВал");
	
	ТаблицаКопия.Колонки.СуммаСНДСВал.Имя = "СуммаВзаиморасчетов";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя  = "СуммаНДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента,
																	СтруктураШапкиДокумента.Ссылка, 
																	СтруктураШапкиДокумента.Сделка),
									  "Сделка");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияПродажиНалоговыйУчет.РеализацияПокупателю, "Событие");
	
	Если СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// очистим налоговые реквизиты
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), 			"СтавкаНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(0, 												"СуммаНДС");
		
	Иначе		
		
		Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
			// взаиморасчеты по договору по расчетным документам - необходимо заполнить в регистре реквизит РасчетныйДокумент
			НалоговыйУчет.ЗаполнитьДокументыРасчета(ТаблицаДвижений, ДокументыРасчетовСКонтрагентом.Выгрузить(), "Реализация");
		КонецЕсли;			
		
	КонецЕсли;	
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		Движения.ПродажиНалоговыйУчет.ВыполнитьПриход();
		Движения.ПродажиНалоговыйУчет.Записать();
			
	КонецЕсли;
		
	// ОжидаемыйИПодтвержденныйНДСПродаж
	Если НЕ СтруктураШапкиДокумента.СложныйНалоговыйУчет Тогда
		
		// Движения формируются по данным расчета "первого события" 
	   НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаУпрощенныйНалоговыйУчет(ЭтотОбъект, ТаблицаПоВторомуСобытиюНал);
	
	Иначе
		
		// движения формируются по методу "по отгрузке"
		
		НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
		// УСЛУГИ
		ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
			
		ТаблицаКопия.Свернуть("СтавкаНДС","СуммаБезНДСВал,СуммаНДСВал");
		ТаблицаКопия.Колонки.СуммаБезНДСВал.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСВал   .Имя = "СуммаНДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента,
																		СтруктураШапкиДокумента.Ссылка, 
																		СтруктураШапкиДокумента.Сделка),
											  "Сделка");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
			
			
		Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
			Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьПриход();
			Движения.ОжидаемыйИПодтвержденныйНДСПродаж.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаПоВторомуСобытиюНал;

КонецФункции

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоСкидкам,
							  ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							  Отказ, Заголовок)

	ТаблицаПродукции = Новый ТаблицаЗначений;
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента,
	                           ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоСкидкам,
							   ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							   Отказ, Заголовок, ТаблицаПродукции);

	Если НЕ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам,
		                                             Отказ, Заголовок, СтруктураШапкиДокумента);
	КонецЕсли;
	
	ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПродукции,  Отказ, Заголовок);

	ТаблицаПоВторомуСобытиюНал = ДвиженияПоРегистрамНалоговогоУчета(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ);
	
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоУслугам, ТаблицаПоМатериалам, 
							  ТаблицаПоВторомуСобытиюНал, 
							  Отказ, Заголовок);							  
							  
							  
	Если ОтражатьВУправленческомУчете Тогда
	
		// Проводить по партиям сразу нужно если установлен параметр
		// учетной политики СписыватьПартииПриПроведенииДокументов
		ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;
			
		Если ПроводитьПоПартиям Тогда
				
			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
				
			// Зарегистрируем в последовательности
			Если ТаблицаПродукции.Количество() > 0 Тогда
			
				ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
				ЗаписьРегистрации.Период      = Дата;
				ЗаписьРегистрации.Регистратор = Ссылка;
			
			КонецЕсли;
				
		Иначе
				
			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
				УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
			КонецЕсли;
				
		КонецЕсли;
	
	КонецЕсли;							  
							  
КонецПроцедуры // ДвиженияПоРегистрамРегл()

// Формирует движения по регистру "Взаиморасчеты с контрагентами по документам расчетов",
// если по договору ведется учет в разрезе документов
//
Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		Возврат;
	КонецЕсли;

	ВидДвижения = ВидДвиженияНакопления.Приход;
	ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;

	УправлениеВзаиморасчетами.ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаПоВзаиморасчетам, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

// По результату запроса по шапке документа формируем движения по регистрам для целей упр. учета.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоСкидкам,
							  ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							  Отказ, Заголовок, ТаблицаПродукции)
							  
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеВзаиморасчетами.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
												  мСтруктураПараметровВзаиморасчетов, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
												  ВидДвиженияНакопления.Приход, Отказ, Заголовок);
    // УСЛУГИ И ПРОДУКЦИЯ ПО РЕГИСТРУ Продажи.

	НаборДвижений = Движения.Продажи;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	КопияТаблицы = ТаблицаПоУслугам.Скопировать();
	КопияТаблицы.ЗагрузитьКолонку(КопияТаблицы.ВыгрузитьКолонку("НДСУпр"), "НДС");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
		
		УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицы,ТаблицаДвижений, Проект, Дата, "Продажи");
		
	Иначе
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицы, ТаблицаДвижений);
		
	КонецЕсли;
	
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента,	"ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,, Истина),"ЗаказПокупателя");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,				"ДокументПродажи");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,		"Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация,        	"Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент,         	"Контрагент");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.Продажи.ВыполнитьДвижения();
	КонецЕсли;
	
	// ПО РЕГИСТРУ ПредоставленныеСкидки.
	НаборДвижений = Движения.ПредоставленныеСкидки;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоСкидкам, ТаблицаДвижений);

	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументСкидки");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ПолучательСкидки");

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ПредоставленныеСкидки.ВыполнитьДвижения();
	КонецЕсли;
	
	// разделим ТаблицаПоУслугам на таблицу продукции и услуг
	ТаблицаУслуги = ТаблицаПоУслугам.СкопироватьКолонки();
	ТаблицаПродукции = ТаблицаПоУслугам.СкопироватьКолонки();
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаПоУслугам Цикл
		Если СтрокаТабличнойЧасти.Услуга Тогда
			НоваяСтрока = ТаблицаУслуги.Добавить();
		Иначе	
			НоваяСтрока = ТаблицаПродукции.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
	КонецЦикла; 
	
	// УСЛУГИ ПО РЕГИСТРУ ПродажиСебестоимость (продукция по регистру ПродажиСебестоимость пройдет при списании партий)
	НаборДвижений = Движения.ПродажиСебестоимость;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ТаблицаУслуги.Колонки.Стоимость.Имя 				= "СтоимостьКопия";
	ТаблицаУслуги.Колонки.СуммаПлановаяУпрБезНДС.Имя = "Стоимость";
	
	ТаблицаУслуги.Колонки.НДС.Имя = "НДСРегл";
	ТаблицаУслуги.Колонки.НДСПлановыйУпр.Имя = "НДС";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУслуги, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,, Истина), "ЗаказПокупателя");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка       	, "ДокументОприходования");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение	, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Дата         	, "Период");

  	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		НаборДвижений.ВыполнитьДвижения();
		НаборДвижений.Записать(Ложь); // при списании партий продукции по регистру ПродажиСебестоимость еще будут движения
	КонецЕсли;
	
	ТаблицаУслуги.Колонки.Стоимость.Имя              = "СуммаПлановаяУпрБезНДС";
	ТаблицаУслуги.Колонки.СтоимостьКопия.Имя         = "Стоимость";
	
	ТаблицаУслуги.Колонки.НДС.Имя = "НДСПлановыйУпр";
	ТаблицаУслуги.Колонки.НДСРегл.Имя = "НДС";
	
	
	// УСЛУГИ ПО РЕГИСТРУ ВыпускПродукцииУслуг (выпуск продукции отражен документами ОПзС)
	
	НаборДвижений = Движения.ВыпускПродукцииУслуг;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаУслуги.Колонки.СуммаПлановаяУпрБезНДС.Имя = "ПлановаяСтоимость";
	ТаблицаУслуги.Колонки.НДСПлановыйУпр.Имя = "ПлановыйНДС";
	ТаблицаУслуги.Колонки.Номенклатура.Имя = "Продукция";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУслуги, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,, Истина), "Заказ");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка       , "ДокументВыпуска");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииФиксВнешниеУслуги,"КодОперации");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ВыпускПродукцииУслуг.ДобавитьДвижение();
	КонецЕсли;
	
	ТаблицаУслуги.Колонки.ПлановаяСтоимость.Имя = "СуммаПлановаяУпрБезНДС";
	ТаблицаУслуги.Колонки.ПлановыйНДС.Имя = "НДСПлановыйУпр";
	ТаблицаУслуги.Колонки.Продукция.Имя = "Номенклатура";
	
	// спишем из НЗП плановую стоимость и НДС услуг
	
	НаборДвижений = Движения.НезавершенноеПроизводство;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ТаблицаУслуги.Колонки.Стоимость.Имя 			 = "СтоимостьКопия";
	ТаблицаУслуги.Колонки.СуммаПлановаяУпрБезНДС.Имя = "Стоимость";
	
	ТаблицаУслуги.Колонки.НДС.Имя 				= "НДСРегл";
	ТаблицаУслуги.Колонки.НДСПлановыйУпр.Имя 	= "НДС";
	
	ТаблицаУслуги.Колонки.Номенклатура.Имя 		= "Продукция";
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаУслуги, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Дата         , "Период");
	
  	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.НезавершенноеПроизводство.ВыполнитьРасход();
	КонецЕсли;
	
	ТаблицаУслуги.Колонки.Стоимость.Имя              = "СуммаПлановаяУпрБезНДС";
	ТаблицаУслуги.Колонки.СтоимостьКопия.Имя         = "Стоимость";
	
	ТаблицаУслуги.Колонки.НДС.Имя 		= "НДСПлановыйУпр";
	ТаблицаУслуги.Колонки.НДСРегл.Имя 	= "НДС";
	
	ТаблицаУслуги.Колонки.Продукция.Имя = "Номенклатура";
	
	// Если в реквизите Сделка указан внешний заказ покупателя, то проводится 
	// по регистру ЗаказыПокупателей (продукция и услуги)
	Если ЗначениеЗаполнено(Сделка) 
	   И ТипЗнч(Сделка) <> Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			
		НаборДвижений = Движения.ЗаказыПокупателей;
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаДвижений);
		
		// Недостающие поля
		ТаблицаДвижений.ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента,, Истина), "ЗаказПокупателя");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
			
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку, "СтатусПартии");
			
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольПревышенияОбъемаЗаказа(ЭтотОбъект, СтруктураШапкиДокумента, "Услуги", Отказ, Заголовок);
		КонецЕсли;
			
		Если Не Отказ Тогда
			Движения.ЗаказыПокупателей.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;  
	
	// МАТЕРИАЛЫ ПО РЕГИСТРУ ТоварыПолученные
	НаборДвижений = Движения.ТоварыПолученные;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ТаблицаПоМатериалам.Колонки.Сумма.Имя 				= "СуммаВзаиморасчетов";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМатериалам, ТаблицаДвижений);
	ТаблицаПоМатериалам.Колонки.СуммаВзаиморасчетов.Имя = "Сумма";
	
	// недостающие поля
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Дата               				, "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Сделка             				, "Сделка");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента 				, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(Организация												, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент												, "Контрагент");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку	, "СтатусПолучения");
	
  	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ТоварыПолученные.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам)
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку, "ДопустимыйСтатус1");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение               , "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете, "ОтражатьВУправленческомУчете");
	
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВедениеУчетаПоПроектам,   "ВедениеУчетаПоПроектам");
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И ЗначениеЗаполнено(Проект) Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Проект,"Проект");
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПродукции, Отказ, Заголовок) Экспорт
											
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ПРОДУКЦИЯ ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродукции, ТаблицаДвижений);

	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд + 1;
		Строка.НомерСтрокиДокумента = Инд;
	КонецЦикла;

	// Если резервирование под заказ - заказ партии
	ТаблицаДвижений.ЗаполнитьЗначения(Сделка, "ЗаказПартии");

	// Заказ, на который списывается
	ТаблицаДвижений.ЗаполнитьЗначения(Сделка, "ЗаказСписания");

	ТаблицаДвижений.ЗаполнитьЗначения(Дата  , "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.Реализация       , "КодОперацииПартииТоваров");
	
	ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПродукции);
											
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоМатериалам,
	                              ТаблицаПоВторомуСобытиюНал,
								  Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыДокумента = новый структура("ТаблицаПоУслугам",ТаблицаПоУслугам);
	
	//Возможны корректировки таблиц при расчетах в валюте
	//Возможны корректировки сумм при расчетах в валюте
	Если  СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда  
			
		ВсегоКЗачету = СуммаДокумента;
			
		ТаблицаСделок = ДокументыРасчетовСКонтрагентом.Выгрузить(,"ДокументРасчетовСКонтрагентом,Сумма,ДатаОплаты,ВозвратнаяТара");
		ТаблицаСделок.Свернуть("ДокументРасчетовСКонтрагентом,ДатаОплаты,ВозвратнаяТара", "Сумма");
		ТаблицаСделок.Сортировать("ДатаОплаты");
		   
		Для каждого СтрокаПредоплаты Из ТаблицаСделок Цикл
			
			Если СтрокаПредоплаты.ВозвратнаяТара Тогда
				Продолжить;
			КонецЕсли;
				
			СуммаПредоплаты   = СтрокаПредоплаты.Сумма;
			РасчетныйДокумент = СтрокаПредоплаты.ДокументРасчетовСКонтрагентом;
			
			//Если СуммаПредоплаты > ВсегоКЗачету Тогда
			//
			//	Сообщить(Локализация.СтрШаблон1("Сумма предоплаты по документу ¤1¤, указанная на закладке ""Предоплата"" (¤2¤),
			//								   |    превышает возможную сумму предоплаты на ¤3¤ (¤4¤) (с учетом предыдущих документов предоплаты)",
			//								   СтрокаПредоплаты.ДокументРасчетовСКонтрагентом,
			//								   СуммаПредоплаты,
			//								   Мин(СуммаПредоплаты,СуммаПредоплаты - ВсегоКЗачету),
			//								   ВалютаДокумента));
			//
			//КонецЕсли;
				
			Если ВсегоКЗачету > 0 Тогда
				
				// зачтем аванс в размере указанной суммы на закладке предоплата
				ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок, 
																		   ,,, ,, РасчетныйДокумент, Мин(ВсегоКЗачету,СуммаПредоплаты));	
			КонецЕсли;
																	   
			ВсегоКЗачету = ВсегоКЗачету - ТаблицаАвансов.Итог("СуммаВал");
				
		КонецЦикла;
			
		КурсЗачетаАвансаРегл = Неопределено;
		
			
	Иначе
		
		// обычный зачет аванса и корректировка сумм при расчетах в валюте
		ТаблицаАвансов = УправлениеВзаиморасчетами.ЗачетАванса(ЭтотОбъект, СтруктураШапкиДокумента , мВалютаРегламентированногоУчета, ТаблицыДокумента , Отказ, Заголовок);	 
		КурсЗачетаАвансаРегл = ?(ТаблицаАвансов.Итог("СуммаВал") = 0, Неопределено, ТаблицаАвансов.Итог("Сумма") / ТаблицаАвансов.Итог("СуммаВал"));
		
	КонецЕсли;
	
	МассивРасчетныхДокументов = Неопределено;
	Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		МассивРасчетныхДокументов = ДокументыРасчетовСКонтрагентом.ВыгрузитьКолонку("ДокументРасчетовСКонтрагентом");
		УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивРасчетныхДокументов);
	КонецЕсли;
	
	// Формирование движений регистров
	ДвиженияПоТабличнойЧастиУслугиРегл(СтруктураШапкиДокумента, ТаблицаПоУслугам, Заголовок, Отказ,РежимПроведения);
	
	ПроводкиПоНДС(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоВторомуСобытиюНал, МассивРасчетныхДокументов, Заголовок, Отказ, РежимПроведения);
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоМатериалам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, Ложь, , , Отказ);
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц
	
КонецПроцедуры

Процедура ПроводкиПоНДС(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоВторомуСобытиюНал, МассивРасчетныхДокументов, Заголовок, Отказ, РежимПроведения)
	
	Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		// Учет НДС не ведется
		Возврат;
	КОнецЕсли;

	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();                                                                                                                                
	ТаблицаКопия.Свернуть("СтавкаНДС, СчетДоходовБУ, СубконтоДоходовБУ1, СубконтоДоходовБУ2, СубконтоДоходовБУ3, НоменклатурнаяГруппа, НалоговоеНазначениеДоходовИЗатрат","ПроводкиСуммаНДСРегл,ПроводкиСуммаНДСВал,ПроводкиСуммаНДСКурсНБУ");
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКопия Цикл
		
		Если    СтрокаТаблицы.ПроводкиСуммаНДСРегл <> 0 
			ИЛИ СтрокаТаблицы.ПроводкиСуммаНДСВал  <> 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			Проводка.Содержание                 = "НДС: налоговые обязательства: отгрузка";
			Проводка.НомерЖурнала               = "";

			Проводка.СчетДт                     = СтрокаТаблицы.СчетДоходовБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.СубконтоДоходовБУ1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.СубконтоДоходовБУ2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.СубконтоДоходовБУ3);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТаблицы.НоменклатурнаяГруппа);

			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУДт = СтрокаТаблицы.ПроводкиСуммаНДСРегл;
				
			КонецЕсли;
			
			Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"   , СтруктураШапкиДокумента.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка));
			
			НалоговыйУчет.РазбитьПроводкуПоНДСНаПервоеВтороеСобытие(ТаблицаПоВторомуСобытиюНал, ПроводкиБУ, Проводка, 
													  "Кт", СтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный, 
													  СтруктураШапкиДокумента.ДоговорКонтрагента, 
													  НалоговыйУчет.ОпределитьСделкуНалоговыйУчет(СтруктураШапкиДокумента, Ссылка, Сделка), МассивРасчетныхДокументов,
													  Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Реализация,
													  СтрокаТаблицы.СтавкаНДС,
													  ,,,СтрокаТаблицы.ПроводкиСуммаНДСВал, СтрокаТаблицы.ПроводкиСуммаНДСКурсНБУ, КурсЗачетаАвансаРегл);
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Процедура формирует движения регистров по табличной части Услуги
//
Процедура ДвиженияПоТабличнойЧастиУслугиРегл(СтруктураШапкиДокумента, ТаблицаПоУслугам, Заголовок, Отказ, РежимПроведения)

	Если ТаблицаПоУслугам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПроводкиБУ  = Движения.Хозрасчетный;
	
	Для каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл

		// Выручка
		Если СтрокаТаблицы.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период          = Дата;
		Проводка.Активность      = Истина;
		Проводка.Организация     = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма           = СтрокаТаблицы.ПроводкиСуммаСНДСРегл;
		Проводка.Содержание      = "Оказание услуг";
		Проводка.НомерЖурнала    = "";

		Проводка.СчетДт          = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры"   , СтруктураШапкиДокумента.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,  "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(СтруктураШапкиДокумента, Ссылка,Сделка));
		
		Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
		Проводка.ВалютнаяСуммаДт = СтрокаТаблицы.ПроводкиСуммаСНДСВал;
		
		Проводка.СчетКт         = СтрокаТаблицы.СчетДоходовБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.СубконтоДоходовБУ1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.СубконтоДоходовБУ2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.СубконтоДоходовБУ3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы", СтрокаТаблицы.НоменклатурнаяГруппа);
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Проводка.НалоговоеНазначениеКт  = СтрокаТаблицы.НалоговоеНазначениеДоходовИЗатрат;
		    Проводка.СуммаНУКт 				= НалоговыйУчет.УчестьСуммуАвансаДо01042011(СтруктураШапкиДокумента, СтрокаТаблицы.ПроводкиСуммаБезНДСРегл) + СтрокаТаблицы.ПроводкиСуммаНДСРегл;
			
		КонецЕсли;

	КонецЦикла;
	
	ДвиженияРегистровВыпускаПродукцииУслугРегл(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ);
	
КонецПроцедуры // ДвиженияПоТабличнойЧастиУслуги()

Процедура ДвиженияРегистровВыпускаПродукцииУслугРегл(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ)

	
	НаборДвижений = Движения.ВыпускПродукцииУслугБухгалтерскийУчет;
	ТаблицаДвиженийВыпуск = НаборДвижений.ВыгрузитьКолонки();
	
	ПроводкиБУ  = Движения.Хозрасчетный;
	
	Для каждого СтрокаУслуги Из ТаблицаПоУслугам Цикл

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период       = СтруктураШапкиДокумента.Дата;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма        = СтрокаУслуги.СуммаПлановая;
		Проводка.Содержание   = "Затраты от реализации услуг перераб.дав.сырья в план.ценах";
		Проводка.НомерЖурнала = "";

		Проводка.СчетКт      = СтрокаУслуги.СчетУчетаБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаУслуги.Номенклатура);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции", СтрокаУслуги.НоменклатурнаяПозиция);
		Проводка.КоличествоКт = СтрокаУслуги.Количество;
		
		
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы", СтрокаУслуги.НоменклатурнаяГруппа);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Подразделения", СтруктураШапкиДокумента.ПодразделениеОрганизации);
		
		Проводка.СчетДт = СтрокаУслуги.СчетРасходовБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаУслуги.СубконтоРасходовБУ1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаУслуги.СубконтоРасходовБУ2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаУслуги.СубконтоРасходовБУ3);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаУслуги.НоменклатурнаяГруппа);
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Если СтруктураШапкиДокумента.НеОтноситьСебестоимостьЗапасовНаРасходыПоНУ Тогда
				Проводка.НалоговоеНазначениеДт  = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность;
				Проводка.СуммаНУДт 				= 0;
			Иначе	
				Проводка.НалоговоеНазначениеДт  = СтрокаУслуги.НалоговоеНазначениеДоходовИЗатрат;
			    Проводка.СуммаНУДт 				= Проводка.Сумма;
			КонецЕсли;
			
			Проводка.СуммаНУКт 				= Проводка.Сумма;
			
		КонецЕсли;
		
		Проводка.НалоговоеНазначениеКт  = СтрокаУслуги.НалоговоеНазначение;
		
		Если СтрокаУслуги.Услуга Тогда
			
			// Отражения выпуска услуги по плановым ценам в регистре накопления ВыпускПродукцииУслугБухгалтерскийУчет
			
			СтрокаДвижения = ТаблицаДвиженийВыпуск.Добавить();
			СтрокаДвижения.Организация           = СтруктураШапкиДокумента.Организация;
			СтрокаДвижения.Продукция             = СтрокаУслуги.Номенклатура;
			СтрокаДвижения.СчетЗатрат            = СтрокаУслуги.СчетУчетаБУ;
			СтрокаДвижения.Подразделение         = СтруктураШапкиДокумента.ПодразделениеОрганизации;
			СтрокаДвижения.НоменклатурнаяГруппа  = СтрокаУслуги.НоменклатурнаяГруппа;
			СтрокаДвижения.СчетСписания          = Проводка.СчетДт;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 0 Тогда
				СтрокаДвижения.СубконтоСписания1 = Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[0].ВидСубконто];
			КонецЕсли; 
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 1 Тогда
				СтрокаДвижения.СубконтоСписания2 = Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[1].ВидСубконто];
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 2 Тогда
				СтрокаДвижения.СубконтоСписания3 = Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[2].ВидСубконто];
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 3 Тогда
				СтрокаДвижения.СубконтоСписания4 = Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[3].ВидСубконто];
			КонецЕсли;
			
			СтрокаДвижения.Количество = СтрокаУслуги.Количество;
			СтрокаДвижения.ПлановаяСтоимость = СтрокаУслуги.СуммаПлановая;
			
		КонецЕсли; 
		
	КонецЦикла;	
			
	НаборДвижений.мПериод            = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвиженийВыпуск;

	Если Не Отказ Тогда
		Движения.ВыпускПродукцииУслугБухгалтерскийУчет.ДобавитьДвижение();
	КонецЕсли;
	
КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Прежде всего, проверим заполнение реквизита Организация в шапке документа
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	// Теперь позовем общую процедуру проверки
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	// Организация не заполнена, получать учетную политику нет смысла
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Нал");
		
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , УчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитикаНУ.ЕстьНДС);
	
	УчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Бух");
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АвторасчетНДС Тогда
		// соответствие для хранения погрешностей округлений
		ПогрешностиОкругления = Новый Соответствие();
		// пересчет сумм НДС с учетом ошибок округления
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Услуги, ЭтотОбъект, ПогрешностиОкругления, "Услуги");
	КонецЕсли;

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Услуги");

	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	
	Если НЕ УчетнаяПолитика.ЕстьНалогНаПрибыль Тогда
		
		Для каждого СтрокаТЧ  Из Услуги Цикл
		    СтрокаТЧ.НалоговоеНазначениеДоходовИЗатрат = Неопределено;
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если ЕстьАвансДо01042011 Тогда
		Если НеОтноситьСебестоимостьЗапасовНаРасходыПоНУ Тогда
			СуммаВДВРПоАвансуДо01042011	= СуммаДокумента;
		КонецЕсли;
	Иначе	
		НеОтноситьСебестоимостьЗапасовНаРасходыПоНУ = Ложь;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

// Процедура - обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Перем ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
 	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                      , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                       , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                                , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                                , "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"						, "СложныйНалоговыйУчет");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"              , "ВидОперации"                                , "СделкаВидОперации");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВестиПартионныйУчетПоСкладам"               , "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ОбособленныйУчетТоваровПоЗаказамПокупателей", "ОбособленныйУчетТоваровПоЗаказамПокупателей");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентом"		, "ВестиПоДокументамРасчетовСКонтрагентом");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВестиПоДокументамРасчетовСКонтрагентомРегл"	, "ВестиПоДокументамРасчетовСКонтрагентомРегл");
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "ВалютаДокумента"                            , "ВалютаЗаказа");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КурсВзаиморасчетов"                         , "КурсВзаиморасчетовЗаказа");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КратностьВзаиморасчетов"                    , "КратностьВзаиморасчетовЗаказа");
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"                  , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета"              , "КурсВалютыУправленческогоУчета");
	
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",     "ВедениеУчетаПоПроектам",                       "ВедениеУчетаПоПроектам");

	// Для контроля остатков по взаиморасчетам
	УправлениеВзаиморасчетами.ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке, РежимПроведения);
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Если надо пересчитывать цену в валюту заказа. то в структуре должна быть заполнена валюта заказа.
	ВалютаЗаказа = Неопределено;
	НужнаЦенаЗаказа = Ложь;
	Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа", ВалютаЗаказа) Тогда
		НужнаЦенаЗаказа = Истина;
		Если ВалютаЗаказа = мВалютаРегламентированногоУчета Тогда
			КурсЗаказа      = 1;
			КратностьЗаказа = 1;
		Иначе //ВалютаЗаказа = ВалютаВзаиморасчетов
			КурсЗаказа      = СтруктураШапкиДокумента.КурсВзаиморасчетовЗаказа;
			КратностьЗаказа = СтруктураШапкиДокумента.КратностьВзаиморасчетовЗаказа;
		КонецЕсли;
		СтруктураШапкиДокумента.Вставить("КурсЗаказа"     , КурсЗаказа);
		СтруктураШапкиДокумента.Вставить("КратностьЗаказа", КратностьЗаказа);
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("НужнаЦенаЗаказа", НужнаЦенаЗаказа);
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	ПроверитьЗаполнениеШапки(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	// Подготовим таблицу услуг для проведения.
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"        		, "Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"			, "СерияНоменклатуры");
	СтруктураПолей.Вставить("Качество"					, "Качество");
	СтруктураПолей.Вставить("Услуга"		   	        , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"               		, "Номенклатура.Набор");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"  		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Количество"          		, "Количество");
	СтруктураПолей.Вставить("Сумма"               		, "Сумма");
	СтруктураПолей.Вставить("СуммаПлановая"       		, "СуммаПлановая");
	СтруктураПолей.Вставить("СуммаПлановаяУпр"    		, "СуммаПлановаяУпр");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"		, "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("Цена"                		, "Цена");
	СтруктураПолей.Вставить("СтавкаНДС"           		, "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                 		, "СуммаНДС");
	СтруктураПолей.Вставить("НомерСтроки"         		, "НомерСтроки");
	СтруктураПолей.Вставить("СхемаРеализации"     		, "СхемаРеализации");
	СтруктураПолей.Вставить("СчетДоходовБУ"       		, "СхемаРеализации.СчетДоходов");
	СтруктураПолей.Вставить("СубконтоДоходовБУ1"  		, "СхемаРеализации.СубконтоДоходов1");
	СтруктураПолей.Вставить("СубконтоДоходовБУ2"  		, "СхемаРеализации.СубконтоДоходов2");
	СтруктураПолей.Вставить("СубконтоДоходовБУ3"  		, "СхемаРеализации.СубконтоДоходов3");
	СтруктураПолей.Вставить("СчетРасходовБУ"      		, "СхемаРеализации.СчетСебестоимости");
	СтруктураПолей.Вставить("СубконтоРасходовБУ1" 		, "СхемаРеализации.СубконтоСебестоимости1");
	СтруктураПолей.Вставить("СубконтоРасходовБУ2" 		, "СхемаРеализации.СубконтоСебестоимости2");
	СтруктураПолей.Вставить("СубконтоРасходовБУ3" 		, "СхемаРеализации.СубконтоСебестоимости3");
	СтруктураПолей.Вставить("СчетУчетаБУ"         		, "СчетУчетаБУ");
	
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"		, "Номенклатура.НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("ВидНалоговойДеятельности", "НалоговоеНазначение.ВидНалоговойДеятельности");
	СтруктураПолей.Вставить("НалоговоеНазначение", 		"НалоговоеНазначение");
	СтруктураПолей.Вставить("ВидДеятельностиНДС" , 		"НалоговоеНазначение.ВидДеятельностиНДС");
	СтруктураПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат", "НалоговоеНазначениеДоходовИЗатрат");
	СтруктураПолей.Вставить("СчетУчетаНДС"    	, 		"Ссылка.СчетУчетаНДС");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"		, "НоменклатурнаяПозиция");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам 
	   И Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураПростыхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	КонецЕсли;
		
	РезультатЗапросаПоУслугам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей, СтруктураПростыхПолей);
	
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		//Проверим на возможность проведения в БУ и НУ
		УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,
			                                 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете,
											 мВалютаРегламентированногоУчета, Ложь, Отказ, Заголовок);
	КонецЕсли;
	
	// Подготовим таблицу материалам для проведения.
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("НомерСтроки" 				, "НомерСтроки");
	СтруктураПолей.Вставить("Номенклатура"				, "Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"			, "СерияНоменклатуры");
	СтруктураПолей.Вставить("Качество"					, "Качество");
	СтруктураПолей.Вставить("Услуга"              		, "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"               		, "Номенклатура.Набор");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"  		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Количество"  				, "Количество");
	СтруктураПолей.Вставить("Сумма"						, "Сумма");
	СтруктураПолей.Вставить("СчетУчетаБУ" 				, "СчетУчетаБУ");
	

	РезультатЗапросаПоМатериалам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "МатериалыЗаказчика", СтруктураПолей, СтруктураПростыхПолей);
	
	ПогрешностиОкругления = Новый Соответствие();
	ТаблицаПоУслугам 	= ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления);
	ТаблицаПоМатериалам = ПодготовитьТаблицуМатериалов(РезультатЗапросаПоМатериалам, СтруктураШапкиДокумента);

	ПроводитьПоВзаиморасчетам = Истина;
	мСтруктураПараметровВзаиморасчетов.Вставить("ПроводитьПоВзаиморасчетам", ПроводитьПоВзаиморасчетам);

	СтруктураПодготовленныхТаблиц = Новый Структура("Услуги", ТаблицаПоУслугам);
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблиц);
	УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                ЭтотОбъект, мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента, 
	                                                Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиМатериалы(ТаблицаПоМатериалам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоСкидкам = ПодготовитьТаблицуСкидок(ТаблицаПоУслугам, СтруктураШапкиДокумента);
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоМатериалам, ТаблицаПоСкидкам,
							ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
							Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", Неопределено);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
			Если Основание.МатериалыЗаказчика.Количество() = 0  Тогда
				Сообщить(Локализация.СтрШаблон1("Требование накладная №¤1¤ не отражает перемещение давальческого сырья в производство", основание.Номер));
				Отказ = Истина;
			КонецЕсли;
			
			
			// Заполним реквизиты шапки по документу основанию.
			Организация     = Основание.Организация;
			Контрагент               = Основание.Контрагент;
			
			Для Каждого СтрокаОснование Из Основание.МатериалыЗаказчика Цикл
				
				Строка = МатериалыЗаказчика.Добавить();	
				Строка.Номенклатура  =  СтрокаОснование.Номенклатура;
				Строка.СчетУчетаБУ   =  СтрокаОснование.Счет;
				Строка.Количество	 =  СтрокаОснование.Количество;
				
			КонецЦикла;
			
		КонецЕсли; 		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
			
			// Заполним реквизиты шапки по документу основанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);  
			
			Для Каждого СтрокаОснование Из Основание.Продукция Цикл
				
				
				СчетаУчета     = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаОснование.Номенклатура, Основание.Склад);
				Строка = Услуги.Добавить();	
				Строка.Номенклатура  =  СтрокаОснование.Номенклатура;
				Строка.Количество	 =  СтрокаОснование.Количество;
				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(Строка, ЭтотОбъект, "Реализация");
				ТипЦенПлановойСебестоимости   = Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
				ВалютаРеглментированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
				
				// Заполнение цены зависит от розничности операции.
				ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(Строка, ЭтотОбъект, мВалютаРегламентированногоУчета); 
				Строка.Спецификация     = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(Строка.Номенклатура,, Дата);
				
				// Рассчитываем реквизиты табличной части.
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Строка, ЭтотОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, ЭтотОбъект);
				
				ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Строка, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете); 
								
				Строка.ПлановаяСтоимость =
				Ценообразование.ПолучитьЦенуНоменклатуры(Строка.Номенклатура, ,
				ТипЦенПлановойСебестоимости, Дата, ,
				ВалютаРеглментированногоУчета, 1);
				ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(Строка);  
				
				
			КонецЦикла;
			
		КонецЕсли;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			// Заполним реквизиты из стандартного набора по документу основанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);  
			
			Если Не Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
				#Если Клиент Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Данный документ можно вводить только на основании заказа покупателя на переработку дав. сырья");
				#КонецЕсли
				Возврат;
			КонецЕсли; 			
			
			Сделка = Основание;
			
			Если Основание.Проведен Тогда
				// Заполнение продукции
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РегЗаказы.Номенклатура КАК Номенклатура,
				|	РегЗаказы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	РегЗаказы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
				|	РегЗаказы.Цена КАК Цена,
				|	СУММА(РегЗаказы.КоличествоОстаток) КАК КолОстаток
				|ИЗ
				|	РегистрНакопления.ЗаказыПокупателей.Остатки(&КонДата, ЗаказПокупателя = &Заказ) КАК РегЗаказы     
				|   СГРУППИРОВАТЬ ПО
				|	РегЗаказы.Номенклатура,
				|	РегЗаказы.ХарактеристикаНоменклатуры,
				|	РегЗаказы.ПроцентСкидкиНаценки,
				|	РегЗаказы.Цена";
				Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
				Запрос.УстановитьПараметр("Заказ",   Основание);
				
				ТабОстатков = Запрос.Выполнить().Выгрузить();  			
				Для Каждого Выборка Из ТабОстатков Цикл
					
					НоваяСтрока = Услуги.Добавить();
					НоваяСтрока.Номенклатура 			   	= Выборка.Номенклатура;
					НоваяСтрока.Содержание                  = НоваяСтрока.Номенклатура.НаименованиеПолное;  
					НоваяСтрока.ХарактеристикаНоменклатуры 	= Выборка.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество   				= Выборка.КолОстаток;
					НоваяСтрока.Цена 						= Выборка.Цена;
					НоваяСтрока.ПроцентСкидкиНаценки        = Выборка.ПроцентСкидкиНаценки;
					НоваяСтрока.Спецификация                = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, Дата);
					НоваяСтрока.СтавкаНДС                   = Выборка.Номенклатура.СтавкаНДС;
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);		
					
					УправлениеПроизводством.РассчитатьПлановуюСебестоимостьВСтрокеТабЧастиПроизводство(НоваяСтрока, ЭтотОбъект, мВалютаРегламентированногоУчета, Ложь, Истина, мВалютаУправленческогоУчета);
					ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(НоваяСтрока, Истина);  				
					
					ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете);
					
				КонецЦикла;	
				
				//заполнение материалов
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ДатаКон",     ТекущаяДата());
				Запрос.УстановитьПараметр("Сделка",      Основание);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СУММА(ТоварыПолученныеОстатки.КоличествоОстаток) КАК Количество,
				|	ТоварыПолученныеОстатки.Номенклатура,
				|	ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры,
				|	ТоварыПолученныеОстатки.СерияНоменклатуры,
				|	СУММА(ТоварыПолученныеОстатки.СуммаВзаиморасчетовОстаток) КАК Сумма
				|ИЗ
				|	РегистрНакопления.ТоварыПолученные.Остатки(&ДатаКон, Сделка = &Сделка ) КАК ТоварыПолученныеОстатки
				|СГРУППИРОВАТЬ ПО
				|	ТоварыПолученныеОстатки.Номенклатура,
				|	ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры,
				|	ТоварыПолученныеОстатки.СерияНоменклатуры";
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					СтрокаТабличнойЧасти = МатериалыЗаказчика.Добавить();
					СтрокаТабличнойЧасти.Номенклатура 				= Выборка.Номенклатура;
					СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
					СтрокаТабличнойЧасти.СерияНоменклатуры 			= Выборка.СерияНоменклатуры;
					СтрокаТабличнойЧасти.Качество 					= Справочники.Качество.Новый;
					СтрокаТабличнойЧасти.Количество   				= Выборка.Количество;
					СтрокаТабличнойЧасти.Сумма 	     				= Выборка.Сумма;
					СтрокаТабличнойЧасти.Цена                       = ?(СтрокаТабличнойЧасти.Количество = 0, 0, Выборка.Сумма/СтрокаТабличнойЧасти.Количество);
					
					Если ОтражатьВБухгалтерскомУчете Тогда
						СтрокаТабличнойЧасти.СчетУчетаБУ            = ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве;
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЕсли; 			
		КонецЕсли; 		
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
			УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
		КонецЕсли;
		
	#КонецЕсли 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУправленческогоУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Услуги"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Реализация");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Ложь);

мСтруктураПараметровДляПолученияДоговора = Новый Структура();

СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);

мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
