#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Поступление) КАК Поступление,
	|	СУММА(ВложенныйЗапрос.Продано) КАК Продано,
	|	СУММА(ВложенныйЗапрос.Остаток) КАК Остаток,
	|	СУММА(ВложенныйЗапрос.Списано) КАК Списано,
	|	СУММА(ВложенныйЗапрос.Оприходовано) КАК Оприходовано,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Оприходовано, 0) - ЕСТЬNULL(ВложенныйЗапрос.Списано, 0)) КАК Результат
	|{ВЫБРАТЬ
	|	Номенклатура.*,
	|	Поступление,
	|	Продано,
	|	Остаток,
	|	Списано,
	|	Оприходовано,
	|	ХарактеристикаНоменклатуры.*,
	|	Склад.*,
	|	Результат}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ПоступлениеТоваровУслугТовары.Количество КАК Поступление,
	|		NULL КАК Продано,
	|		NULL КАК Остаток,
	|		NULL КАК Списано,
	|		NULL КАК Оприходовано,
	|		ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ПоступлениеТоваровУслугТовары.Ссылка.СкладОрдер КАК Склад
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Номенклатура,
	|		NULL,
	|		РеализацияТоваровУслугТовары.Количество,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
	|		РеализацияТоваровУслугТовары.Ссылка.Склад
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|		И РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Номенклатура,
	|		NULL,
	|		NULL,
	|		ТоварыНаСкладахОстатки.КоличествоОстаток,
	|		NULL,
	|		NULL,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ТоварыНаСкладахОстатки.Склад
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&КонДата, ) КАК ТоварыНаСкладахОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписаниеТоваровТовары.Номенклатура,
	|		NULL,
	|		NULL,
	|		NULL,
	|		СписаниеТоваровТовары.Количество,
	|		NULL,
	|		СписаниеТоваровТовары.ХарактеристикаНоменклатуры,
	|		СписаниеТоваровТовары.Ссылка.Склад
	|	ИЗ
	|		Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	|	ГДЕ
	|		СписаниеТоваровТовары.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(СписаниеТоваровТовары.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОприходованиеТоваровТовары.Номенклатура,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		ОприходованиеТоваровТовары.Количество,
	|		ОприходованиеТоваровТовары.ХарактеристикаНоменклатуры,
	|		ОприходованиеТоваровТовары.Ссылка.Склад
	|	ИЗ
	|		Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	|	ГДЕ
	|		ОприходованиеТоваровТовары.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(ОприходованиеТоваровТовары.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|		NULL,
	|		-ВозвратТоваровОтПокупателяТовары.Количество,
	|		NULL,
	|		NULL,
	|		NULL,
	|		ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	|		ВозвратТоваровОтПокупателяТовары.Ссылка.СкладОрдер
	|	ИЗ
	|		Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|	ГДЕ
	|		ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен
	|		И НАЧАЛОПЕРИОДА(ВозвратТоваровОтПокупателяТовары.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КомплектацияНоменклатуры.Номенклатура,
	|		КомплектацияНоменклатуры.Количество,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		КомплектацияНоменклатуры.ХарактеристикаНоменклатуры,
	|		КомплектацияНоменклатуры.Склад
	|	ИЗ
	|		Документ.КомплектацияНоменклатуры КАК КомплектацияНоменклатуры
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(КомплектацияНоменклатуры.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|		И КомплектацияНоменклатуры.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
	|		ОтчетПроизводстваЗаСменуПродукция.Количество,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры,
	|		ОтчетПроизводстваЗаСменуПродукция.Ссылка.Склад
	|	ИЗ
	|		Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачДата И &КонДата
	|		И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Номенклатура.*,
	|	ВложенныйЗапрос.Поступление,
	|	ВложенныйЗапрос.Продано,
	|	ВложенныйЗапрос.Остаток,
	|	ВложенныйЗапрос.Списано,
	|	ВложенныйЗапрос.Оприходовано,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.*,
	|	ВложенныйЗапрос.Склад.*,
	|	(ВложенныйЗапрос.Поступление - ВложенныйЗапрос.Продано + ВложенныйЗапрос.Оприходовано - ВложенныйЗапрос.Списано - ВложенныйЗапрос.Остаток) КАК Результат}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Склад
	|{УПОРЯДОЧИТЬ ПО
	|	Номенклатура.*,
	|	Поступление,
	|	Продано,
	|	Остаток,
	|	Списано,
	|	Оприходовано,
	|	ХарактеристикаНоменклатуры.*,
	|	Склад.*,
	|	Результат}
	|ИТОГИ ПО
	|	ОБЩИЕ,
	|	Склад,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|{ИТОГИ ПО
	|	Номенклатура.*,
	|	Поступление,
	|	Продано,
	|	Остаток,
	|	Списано,
	|	Оприходовано,
	|	ХарактеристикаНоменклатуры.*,
	|	Склад.*,
	|	Результат}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		//
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПродажи", "Сумма продажи");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаБазовая", "Сумма базовая");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель("Поступление","Поступление", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	УниверсальныйОтчет.ДобавитьПоказатель("Продано","Продано", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	УниверсальныйОтчет.ДобавитьПоказатель("Оприходовано","Оприходовано", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	УниверсальныйОтчет.ДобавитьПоказатель("Остаток","Остаток", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	УниверсальныйОтчет.ДобавитьПоказатель("Списано","Списано", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	УниверсальныйОтчет.ДобавитьПоказатель("Результат","Результат", Истина, "ЧЦ=10; ЧДЦ=0", "Остаток", "Остаток");
	

	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("ХарактеристикаНоменклатуры");

	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит значение используемого режима ввода периода.
	// Тип: Число.
	// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
	// Значение по умолчанию: 0
	// Пример:
	// УниверсальныйОтчет.мРежимВводаПериода = 0;
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НачДата",УниверсальныйОтчет.ДатаНач);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КонДата",УниверсальныйОтчет.ДатаКон);
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Ложь;
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
