Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета =  "НМА.СрокПолезногоИспользованияБУ,
								|НМА.СрокПолезногоИспользованияНУ,
								|НМА.ОбъемПродукцииРаботДляВычисленияАмортизацииБУ,
								|НМА.СпособНачисленияАмортизацииБУ,
								|НМА.ЛиквидационнаяСтоимостьБУ";
								
	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()               

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента,Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("Организация");
	КонецЕсли;	

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "НМА".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиНМА(ТаблицаПоНМА, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("НематериальныйАктив");

	Если ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СпособНачисленияАмортизацииУУ");
	КонецЕсли;	
		
	Если ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СпособНачисленияАмортизацииБУ");
	КонецЕсли;	
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "НМА", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА)
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаДок = СтруктураШапкиДокумента.Дата;

	ПервоначальныеСведенияУУ = Движения.ПервоначальныеСведенияНМА;
	
	Для Каждого СтрокаТЧ из ТаблицаПоНМА Цикл
		
		СтрокаДвижений = ПервоначальныеСведенияУУ.Добавить();
		
		СтрокаДвижений.Период           							= ДатаДок;
		СтрокаДвижений.НематериальныйАктив 							= СтрокаТЧ.НематериальныйАктив;
		СтрокаДвижений.СрокПолезногоИспользования                  	= СтрокаТЧ.СрокПолезногоИспользованияУУ;
		СтрокаДвижений.ОбъемПродукцииРаботДляВычисленияАмортизации 	= СтрокаТЧ.ОбъемПродукцииРаботДляВычисленияАмортизацииУУ;
		СтрокаДвижений.ЛиквидационнаяСтоимость                     	= СтрокаТЧ.ЛиквидационнаяСтоимостьУУ;
		СтрокаДвижений.СпособНачисленияАмортизации 					= СтрокаТЧ.СпособНачисленияАмортизацииУУ;
		СтрокаДвижений.ПервоначальнаяСтоимость 						= СтрокаТЧ.ПервоначальнаяСтоимостьУУ;
		СтрокаДвижений.НачислятьАмортизацию 						= СтрокаТЧ.НачислятьАмортизациюУУ;
		
	КонецЦикла;

КонецПроцедуры // ДвиженияПоРегистрамУпр

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА)
	
	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаДок = СтруктураШапкиДокумента.Дата;

	ПервоначальныеСведенияБУ = Движения.ПервоначальныеСведенияНМАБухгалтерскийУчет;
	ПервоначальныеСведенияНУ = Движения.ПервоначальныеСведенияНМАНалоговыйУчет;
	
	Для Каждого СтрокаТЧ из ТаблицаПоНМА Цикл
		
		СтрокаДвижений = ПервоначальныеСведенияБУ.Добавить();
		
		СтрокаДвижений.Период           							= ДатаДок;
		СтрокаДвижений.НематериальныйАктив 							= СтрокаТЧ.НематериальныйАктив;
		СтрокаДвижений.Организация      							= СтруктураШапкиДокумента.Организация;
		
		СтрокаДвижений.СрокПолезногоИспользования                  	= СтрокаТЧ.СрокПолезногоИспользованияБУ;
		СтрокаДвижений.ОбъемПродукцииРаботДляВычисленияАмортизации 	= СтрокаТЧ.ОбъемПродукцииРаботДляВычисленияАмортизацииБУ;
		СтрокаДвижений.ЛиквидационнаяСтоимость                     	= СтрокаТЧ.ЛиквидационнаяСтоимостьБУ;
		СтрокаДвижений.СпособНачисленияАмортизации 					= СтрокаТЧ.СпособНачисленияАмортизацииБУ;
		СтрокаДвижений.ПервоначальнаяСтоимость 						= СтрокаТЧ.ПервоначальнаяСтоимостьБУ;
		СтрокаДвижений.НачислятьАмортизацию 						= СтрокаТЧ.НачислятьАмортизациюБУ;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.СрокПолезногоИспользованияНУ) Тогда
			СтрокаДвижений = ПервоначальныеСведенияНУ.Добавить();
			
			СтрокаДвижений.Период           							= ДатаДок;
			СтрокаДвижений.НематериальныйАктив 							= СтрокаТЧ.НематериальныйАктив;
			СтрокаДвижений.Организация      							= СтруктураШапкиДокумента.Организация;
			
			СтрокаДвижений.СрокПолезногоИспользования                  	= СтрокаТЧ.СрокПолезногоИспользованияНУ;
			СтрокаДвижений.ПервоначальнаяСтоимостьНУ 					= СтрокаТЧ.ПервоначальнаяСтоимостьНУ;
			СтрокаДвижений.НачислятьАмортизацию 						= СтрокаТЧ.НачислятьАмортизациюНУ;
			СтрокаДвижений.НалоговоеНазначение 							= СтрокаТЧ.НалоговоеНазначение;
			СтрокаДвижений.НалоговаяГруппаОС 							= СтрокаТЧ.НалоговаяГруппаОС;
		КонецЕсли;	
		
	КонецЦикла;

	
КонецПроцедуры // ДвиженияПоРегистрамРегл

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоНМА);

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА);
	

КонецПроцедуры // ДвиженияПоРегистрам

Процедура ДополнитьСтруктуруПолейТабличнойЧастиНМАУпр(СтруктураШапкиДокумента, СтруктураПолей)
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияУУ"                 , "СрокПолезногоИспользованияУУ");
	СтруктураПолей.Вставить("ОбъемПродукцииРаботДляВычисленияАмортизацииУУ", "ОбъемПродукцииРаботДляВычисленияАмортизацииУУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьУУ"                    , "ЛиквидационнаяСтоимостьУУ");
	СтруктураПолей.Вставить("СпособНачисленияАмортизацииУУ" 				, "СпособНачисленияАмортизацииУУ");
	
КонецПроцедуры

Процедура ДополнитьСтруктуруПолейТабличнойЧастиНМАРегл(СтруктураШапкиДокумента, СтруктураПолей)
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияБУ"                 , "СрокПолезногоИспользованияБУ");
	СтруктураПолей.Вставить("СрокПолезногоИспользованияНУ"                 , "СрокПолезногоИспользованияНУ");
	СтруктураПолей.Вставить("ОбъемПродукцииРаботДляВычисленияАмортизацииБУ", "ОбъемПродукцииРаботДляВычисленияАмортизацииБУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьБУ"                    , "ЛиквидационнаяСтоимостьБУ");
	СтруктураПолей.Вставить("СпособНачисленияАмортизацииБУ" 				, "СпособНачисленияАмортизацииБУ");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Заголовок = "";

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Сформируем структуру табличной части
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("НематериальныйАктив" , "НематериальныйАктив");

	Если ОтражатьВУправленческомУчете Тогда
		ДополнитьСтруктуруПолейТабличнойЧастиНМАУпр(СтруктураШапкиДокумента,СтруктураПолей);
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		ДополнитьСтруктуруПолейТабличнойЧастиНМАРегл(СтруктураШапкиДокумента,СтруктураПолей);
	КонецЕсли;

	РезультатЗапросаПоНМА = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НМА", СтруктураПолей);
	ТаблицаПоНМА          = РезультатЗапросаПоНМА.Выгрузить();

	ДополнитьТабличнуюЧастьСведениямиОбПервоначальныхСведенияхНМА(МоментВремени(), Организация, ТаблицаПоНМА);
	
	ПроверитьЗаполнениеТабличнойЧастиНМА(ТаблицаПоНМА, Отказ, Заголовок);
 	
	//проверка, нет ли списанных НМА в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанностьНМА(Дата, Организация, ТаблицаПоНМА, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(НМА, "НематериальныйАктив", "Нематериальный актив", Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоНМА);
	КонецЕсли;

КонецПроцедуры

// Процедура дополняет табличную часть колонками
// ПервоначальнаяСтоимостьУУ, ПервоначальнаяСтоимостьБУ 
// для НачислятьАмортизациюУУ, НачислятьАмортизациюБУ нематериальных активов. 
//
// Параметры
//  ДатаДока                     – Тип: Дата, МоментВремени, Граница – Дата, на которую получать результаты
//                 
//  ТекОрганизация               – Тип: СправочникСсылка.Организации – Организация
//                 
//  ТаблицаПоНМА                  – Тип: ТаблицаЗначений – Таблица, в которую необходимо добавить колонки
//
Процедура ДополнитьТабличнуюЧастьСведениямиОбПервоначальныхСведенияхНМА(ДатаДока, ТекОрганизация, ТаблицаПоНМА) Экспорт
	
	ТаблицаПоНМА.Колонки.Добавить("ПервоначальнаяСтоимостьУУ", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаПоНМА.Колонки.Добавить("ПервоначальнаяСтоимостьБУ", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаПоНМА.Колонки.Добавить("ПервоначальнаяСтоимостьНУ", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаПоНМА.Колонки.Добавить("НачислятьАмортизациюУУ", 	Новый ОписаниеТипов("Булево"));
	ТаблицаПоНМА.Колонки.Добавить("НачислятьАмортизациюБУ", 	Новый ОписаниеТипов("Булево"));
	ТаблицаПоНМА.Колонки.Добавить("НачислятьАмортизациюНУ", 	Новый ОписаниеТипов("Булево"));
	
	ТаблицаПоНМА.Колонки.Добавить("НалоговоеНазначение", 		Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаПоНМА.Колонки.Добавить("НалоговаяГруппаОС", 			Новый ОписаниеТипов("СправочникСсылка.НалоговыеГруппыОсновныхСредств"));
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация",     ТекОрганизация);
	Запрос.УстановитьПараметр("Период",          ДатаДока);
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаПоНМА);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
   	|	НематериальныйАктив
	|ПОМЕСТИТЬ НематериальныеАктивы
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НематериальныеАктивы.НематериальныйАктив КАК НематериальныйАктив,
	|	ПервоначальныеСведенияУУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьУУ,
	|	ПервоначальныеСведенияБУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьБУ,
	|	ПервоначальныеСведенияНУ.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияУУ.НачислятьАмортизацию КАК НачислятьАмортизациюУУ,
	|	ПервоначальныеСведенияБУ.НачислятьАмортизацию КАК НачислятьАмортизациюБУ,
	|	ПервоначальныеСведенияНУ.НачислятьАмортизацию КАК НачислятьАмортизациюНУ,
	|	ПервоначальныеСведенияНУ.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ПервоначальныеСведенияНУ.НалоговаяГруппаОС КАК НалоговаяГруппаОС
	|ИЗ
	|	НематериальныеАктивы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(&Период, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы)) КАК ПервоначальныеСведенияБУ
	|		ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияБУ.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(&Период, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы)) КАК ПервоначальныеСведенияНУ
	|		ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияНУ.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(&Период, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы)) КАК ПервоначальныеСведенияУУ
	|		ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияУУ.НематериальныйАктив
	|";
	
	ТаблицаСведенийНМА  = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		ТекНМА=  СтрокаТЧ.НематериальныйАктив;
		СтрокаСведений = ТаблицаСведенийНМА.Найти(ТекНМА, "НематериальныйАктив");	
		
		Если СтрокаСведений <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаСведений);
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры // ДополнитьТабличнуюЧастьСведениямиОбПервоначальныхСведенияхНМА()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
