// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;
Перем ЕстьРасчетыПоПлатежнымКартам Экспорт;

// Хранит таблицу, использующуюся при проведении документа
Перем ТаблицаПлатежейУпр;

Перем мУдалятьДвижения;

//Определение периода движений документа
Перем ДатаДвижений;

Перем мСтруктураПараметровДенежныхСредств;

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) Экспорт

	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);

	Если Не СтрокаПлатеж = Неопределено Тогда
		
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);

	КонецЕсли;

КонецПроцедуры // ПроверкаКурсовВалют()

// Возвращает данные необходимые для проводок документа с видом операции постепление средств от ФСС
//
// Вовращаемое значение:
//  таблица с полями ВидРасчета, Сумма, СтатьяРасчетовСФСС
// 
Функция СформироватьЗапросДляПроводокЗаявки() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр( "ССылка" , Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СтатьяРасчетовСФСС,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сумма КАК Результат
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыПоНачислениямЗаСчетФСС
	               |		ПО ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка = ВзаиморасчетыПоНачислениямЗаСчетФСС.Регистратор
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Возврат Результат;	
КонецФункции


// Формирует движения по регистрам
////  Отказ                     - флаг отказа в проведении,
////  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
////  Режим 					  - режим проведения документа
//
Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента);
	
	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента);
	КонецЕсли; 
	
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента,РежимПроведения, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
        ДвиженияЗаявки(Отказ);
    КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента,РежимПроведения, Отказ, Заголовок)

	// Бухгалтерские проводки документа
	Если Не СтруктураШапкиДокумента.Оплачено Тогда
		Возврат;
	Конецесли;
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;

	ВидСчетаОрг = СтруктураШапкиДокумента.СчетОрганизации.ВидСчета;
	ВалютаСчета = СтруктураШапкиДокумента.СчетОрганизации.ВалютаДенежныхСредств;
	ПроводкиБУ  = Движения.Хозрасчетный;

	РасчетыВВалюте = Ложь;
	
	СчетДт = СтруктураШапкиДокумента.СчетБанк;

	Если СчетДт.Валютный Тогда
		РасчетыВВалюте = Истина;
	КонецЕсли;
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда

		СтруктураШапкиДокумента.Вставить("КоррСчет", СчетДт);
		
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
		
		Если ЕстьРасчетыПоПлатежнымКартам И СтруктураШапкиДокумента.СуммаУслуг > 0 Тогда
		
			СтрокаУслуг = РеестрПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУслуг, РеестрПлатежей[0]);
			
			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			СуммаУслугРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаУслуг, ВалютаДокумента,
														мВалютаРегламентированногоУчета, 
														ДанныеОВалютеДок.Курс,
														1, 
														ДанныеОВалютеДок.Кратность,
														1);

														
			СтрокаУслуг.ГривневаяСумма       = СуммаУслугРегл;
			СтрокаУслуг.СуммаВзаиморасчетов  = СтруктураШапкиДокумента.СуммаУслуг;
			
			СтрокаУслуг.КоррСчет      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			СтрокаУслуг.КоррСубконто1 = СубконтоКт1;
			СтрокаУслуг.КоррСубконто2 = СубконтоКт2;
			СтрокаУслуг.КоррСубконто3 = СубконтоКт3;
			
			РеестрПлатежей.Колонки.Добавить("НалоговоеНазначение");
		    СтрокаУслуг.НалоговоеНазначение = НалоговоеНазначениеПлатежныеКартыУслуги;
			
		КонецЕсли;
	
		СодержаниеПроводки = "";
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами тогда
			СодержаниеПроводки = "Расчеты с контрагентом";
			РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
		ИначеЕсли ЕстьРасчетыПоПлатежнымКартам тогда
			СодержаниеПроводки = "Расчеты по платежным картам и банковским кредитам";
			РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
			КолонкаКонтрагент = Новый Массив;
			Для Инд = 0 По 1 Цикл
				КолонкаКонтрагент.Добавить(СтруктураШапкиДокумента.Контрагент);
			КонецЦикла;
			РеестрПлатежей.ЗагрузитьКолонку(КолонкаКонтрагент,"Контрагент");			
		ИначеЕсли ЕстьРасчетыПоКредитам Тогда
		    СодержаниеПроводки = "Расчеты по кредитам и займам";
		КонецЕсли; 

		Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,ЕстьРасчетыСКонтрагентами,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей)=Ложь тогда
			Возврат;
		КонецЕсли;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств 
		  или ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период     = ДатаДвижений;
		Проводка.СчетДт     = СчетДт;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			Проводка.Содержание = "Прочее поступление денежных средств";
		ИначеЕсли Проводка.СчетДт.Валютный Тогда
			Проводка.Содержание = "Поступление приобретенной валюты";
		Иначе
			Проводка.Содержание = "Поступление средств от продажи валюты";
		КонецЕсли;	
		Проводка.Организация = СтруктураШапкиДокумента.Организация;

		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);

		Проводка.СчетКт = СчетУчетаРасчетовСКонтрагентом;
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоКт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоКт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоКт3);
		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.Контрагент);
		КонецЕсли;	
		
		Если РасчетыВВалюте Тогда

			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
														 ДанныеОВалютеДок.Курс,      1, 
														 ДанныеОВалютеДок.Кратность, 1);
		Иначе
			Проводка.Сумма = СуммаДокумента;
		КонецЕсли;
		                                                                                       
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначениеПриПрочемПоступлении;
			
			Если НЕ НалоговоеНазначениеПриПрочемПоступлении = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
		Объект = Ссылка.ПолучитьОбъект();
		ВыборкаДляПроводок = Объект.СформироватьЗапросДляПроводокЗаявки().Выбрать();
		Пока ВыборкаДляПроводок.Следующий() Цикл
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = Организация;
			Проводка.Содержание = "Поступление денежных средств от ФСС";
			
			Проводка.СчетДт      = СчетДт;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СчетОрганизации);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			
			Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом;
			
			Если Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Справочники.Налоги.Соцстрах);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			ИначеЕсли Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Справочники.Налоги.СоцстрахНесчФОТ);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			Иначе
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			КонецЕсли;	
			
			Проводка.Сумма = ВыборкаДляПроводок.Результат;
		КонецЦикла;
		
	КонецЕсли;
	
	Если   ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда

		Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			
			Если НЕ СтрокаРасшифровки.ВозвратАвансаДо01042011НУ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПриобретение = (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ВХОДЯЩ") > 0) ИЛИ (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ПРИХОД") > 0);			
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			СуммаСторноДоходовЗатрат = - СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011;
				
			Если ЭтоПриобретение Тогда
				Проводка.СчетДт    = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
				Проводка.СчетКт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно расходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно витрат при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
					
			Иначе	
				Проводка.СчетКт    = ПланыСчетов.Хозрасчетный.ДругиеДоходыОтОбычнойДеятельности;
				Проводка.СчетДт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru = '(НУ) Сторно доходов при возврате аванса до 01.04.2011'; uk = '(ПО) Сторно доходів при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если (ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам) и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
		ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств) и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуПрочее(ЭтотОбъект,СтруктураШапкиДокумента,Отказ);	
		ИначеЕсли ЕстьРасчетыПоПлатежнымКартам И СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			ДвиженияПоЕдиномуНалогуКарты(СтруктураШапкиДокумента,Отказ);
		КонецЕсли;	
		
		Если (ЕстьРасчетыСКонтрагентами и не ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами)
		   И СтруктураШапкиДокумента.ЕстьНДС Тогда
		
			РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
				
		КонецЕсли; 
		
	КонецЕсли; 
				
КонецПроцедуры

Процедура ДвиженияПоЕдиномуНалогуКарты(СтруктураШапкиДокумента,Отказ)

	РеестрПлатежейПоЕдиномуНалогу = Новый ТаблицаЗначений;
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("ГривневаяСумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтатьяДекларацииПоЕдиномуНалогу");
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));		
	
	Строка = РеестрПлатежейПоЕдиномуНалогу.Добавить();
	Строка.ГривневаяСумма = СуммаДокумента;
	Строка.СтатьяДекларацииПоЕдиномуНалогу = СтатьяДекларацииПоЕдиномуНалогу;
	
	Строка = РеестрПлатежейПоЕдиномуНалогу.Добавить();
	Строка.ГривневаяСумма = СуммаУслуг;
	Строка.СтатьяДекларацииПоЕдиномуНалогу = СтатьяДекларацииПоЕдиномуНалогуОплатаУслугБанка;
	
	НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежейПоЕдиномуНалогу,Отказ);

КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыПоКредитам",     ЕстьРасчетыПоКредитам);
	мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКасса",       СчетОрганизации);
	мСтруктураПараметровДенежныхСредств.Вставить("ДатаДвижений",              ДатаДвижений);
	
	УправлениеДенежнымиСредствами.ПровестиПоступлениеДенежныхСредствУпр(
		СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок);
	
	// Движение по регистру затрат
	Если Оплачено
		И ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам Тогда
		
		ТаблицаЗатрат = Новый ТаблицаЗначений;
		ТаблицаЗатрат.Колонки.Добавить("Подразделение");
		ТаблицаЗатрат.Колонки.Добавить("СтатьяЗатрат");
		ТаблицаЗатрат.Колонки.Добавить("НоменклатурнаяГруппа");
		ТаблицаЗатрат.Колонки.Добавить("СуммаУпр");
		
		// Заполним таблицу затрат
		СтрокаЗатрат = ТаблицаЗатрат.Добавить();

		СтрокаЗатрат.Подразделение 			= СтруктураШапкиДокумента.Подразделение;
		СтрокаЗатрат.СтатьяЗатрат 			= СтруктураШапкиДокумента.СтатьяЗатрат;
		СтрокаЗатрат.НоменклатурнаяГруппа 	= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
		
		СтрокаКурсыВалют=ТаблицаПлатежейУпр[0];
		СтрокаЗатрат.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаУслуг, ВалютаДокумента,
														глЗначениеПеременной("ВалютаУправленческогоУчета"), 
														СтрокаКурсыВалют.КурсДокумента,
														СтрокаКурсыВалют.КурсУпрУчета, 
														СтрокаКурсыВалют.КратностьДокумента,
														СтрокаКурсыВалют.КратностьУпрУчета);
														
		СтруктДопПараметры = Новый Структура;
		СтруктДопПараметры.Вставить("КодОперацииНЗП", Перечисления.КодыОперацийНезавершенноеПроизводство.УслугиКонтрагентаНаПроизводство);
		
		// движения по затратам
		УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ЭтотОбъект, ТаблицаЗатрат, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, СтруктДопПараметры);
		
	КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Если НЕ (Оплачено И ОтражатьВУправленческомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	Иначе
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, "РасшифровкаПлатежа", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Режим, Заголовок)
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		Сообщить(Заголовок+" 
		|не совпадают сумма документа и ее расшифровка.");
		
		Отказ=Истина;
		
	КонецЕсли;
	
	// Сформируем структуру обязательных полей
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей.Вставить("СчетОрганизации","Не указан банковский счет организации!");
	СтруктураОбязательныхПолей.Вставить("СуммаДокумента");
	Если Оплачено Тогда
		СтруктураОбязательныхПолей.Вставить("ДатаОплаты","Не указана дата оплаты документа банком!");
	КонецЕсли; 
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда
		СтруктураОбязательныхПолей.Вставить("Контрагент");
	КонецЕсли;		
	// Регл. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетБанк",       "Не указан счет учета денежных средств");
		
		Если СчетБанк.Валютный Тогда
			СтруктураОбязательныхПолей.Вставить("ВалютаДокумента","Не указана валюта документа.");
		КонецЕсли;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
		КонецЕсли;

		Если ЕстьРасчетыПоПлатежнымКартам И СуммаУслуг > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом","Не указан счет учета.");
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
		   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда
		
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПриПрочемПоступлении", "Не указано налоговое назначение!");
			
		КонецЕсли;
		
		Если ЕстьРасчетыПоПлатежнымКартам 
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль 
		   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда
		   
        	СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПлатежныеКартыУслуги", "Не указано налоговое назначение!");
			
		КонецЕсли;
			
	КонецЕсли;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Проверка ТЧ (общая)
	СтруктураОбязательныхПолейТЧ = Новый Структура();
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолейТЧ.Вставить("СуммаВзаиморасчетов");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорКонтрагента");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕСли;
	ИначеЕсли ЕстьРасчетыПоПлатежнымКартам И ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей = Новый Структура("СчетУчетаРасчетовСКонтрагентом");
	КонецЕСли;
	
	УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "РасшифровкаПлатежа", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
	
	Если    СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			//Проверим на возможность проведения в БУ и НУ
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(Платеж.ДоговорКонтрагента, ВалютаДокумента,
												 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
												 Ложь, Отказ, Заголовок, "", Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		КонецЦикла;
	КонецЕСли;	
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента,Отказ, Режим, Заголовок);
	КонецЕСли;	
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕСли;	

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, Отказ, Режим, Заголовок)

	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		ПроверитьЗаполнениеТЧУпр(Отказ, Заголовок);
		Если Не Отказ Тогда
			УправлениеДенежнымиСредствами.КонтрольОстатковПоТЧ(Дата, ТаблицаПлатежейУпр, Отказ, Заголовок,,Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧУпр(Отказ, Заголовок)

	Для Каждого Платеж Из РасшифровкаПлатежа Цикл

		ПроверитьЗначение(Платеж.ДоговорКонтрагента,Отказ, Заголовок,"Договор");
		ПроверитьЗначение(Платеж.СуммаВзаиморасчетов,Отказ, Заголовок,"Сумма взаиморасчетов");
		
		Если Не Отказ Тогда
			
			// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
			Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Заказ покупателя","Заказ поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);
				
				Если Отказ Тогда
				
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по заказам""! 
					|Заполните поле """+ТекстСделка+"""!");
					
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя","Счет покупателю","Счет поставщику");
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);

				Если Отказ Тогда
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" установлен способ ведения взаиморасчетов ""по счетам""! 
					|Заполните поле """+ТекстСделка+"""!");
				КонецЕсли;
						
			КонецЕсли;

			Если ЗначениеЗаполнено(Организация) 
				И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТЧ

Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда

		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, Платеж.ДоговорКонтрагента, 
													  Платеж.ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЦикла;

	КонецЕсли;
    
	Если ЕстьРасчетыСКонтрагентами
		И НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС (неподтвержденный)!");
						
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указан Счет учета НДС н/о (н/к)!");
						
					КонецЕсли;
				КонецЕсли;

                Если Платеж.НалоговоеНазначение.Пустая() Тогда
						
                    Отказ = истина;
						
                    Если Отказ Тогда
						
                        Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+" не указано Налоговое назначение!");
							
                    КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЦикла; 	
		
	КонецЕсли;
	
	Если  ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком
		И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если   Платеж.ВозвратАвансаДо01042011НУ И НЕ ЗначениеЗаполнено(Платеж.СтатьяПоВозвратуАвансаДо2011НУ) Тогда
				
				СтрокаСообщения = Локализация.СтрШаблон1(НСтр("ru = 'Для договора ""¤1¤"" не указана статья по возврату аванса до 01.04.2011!'; uk = 'Для договору ""¤1¤"" зазначена стаття по поверненню аванса до 01.04.2011!'"), Строка(Платеж.ДоговорКонтрагента));
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;				
    
КонецПроцедуры //ПроверитьЗаполнениеДокументаРегл()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	Если ЕстьРасчетыСКонтрагентами Тогда
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	КонецЕсли; 
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеРасчетВФСС") Тогда
		УправлениеДенежнымиСредствами.ЗаполнитьПриходПоОснованию(ЭтотОбъект, Основание, УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный"));
	КонецЕсли;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеРасчетВФСС") Тогда
	    ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС;
		Организация = Основание.Организация;
	    Если ЗначениеЗаполнено(Организация) Тогда
			СчетОрганизации = Организация.БанковскийСчетДляРасчетовСФСС;
		Иначе
			СчетОрганизации = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;

		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ЗаявлениеРасчет = Основание;
		
		Дата378 = ПроведениеРасчетов.ВариантыАлгоритмовРасчетаЗарплаты().ДатаВводаСчета378;
		Если ОбщегоНазначения.ПолучитьРабочуюДату() < Дата378 Тогда
			Если НЕ Основание.ЗаСчетФССОтНС Тогда
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию;
			Иначе
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев;
			КонецЕсли;
		Иначе
			СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами;
		КонецЕсли;	

		СуммаДокумента = Основание.ВсегоПоДокументу;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
 	// Сформируем структуру реквизитов шапки документа
 	СтруктураШапкиДокумента		= ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                      , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                       , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       			, "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                       			, "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                     , "ВедениеУчетаПоПроектам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "ВалютаУправленческогоУчета"             	, "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "КурсВалютыУправленческогоУчета"         	, "КурсВалютыУправленческогоУчета");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
		
		КурсДокумента      = РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		КратностьДокумента = РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

	Иначе	
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
 	СтруктураШапкиДокумента.Вставить("КурсДокумента"		, КурсДокумента);
	СтруктураШапкиДокумента.Вставить("КратностьДокумента"	, КратностьДокумента);
	
	ДатаДвижений=?(Оплачено,УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Дата,ДатаОплаты),Дата);
	СтруктураШапкиДокумента.Вставить("ДатаОплаты",ДатаДвижений);
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	ЕстьРасчетыПоПлатежнымКартам=(ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам);
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	ТаблицаПлатежейУпр = УправлениеДенежнымиСредствами.ПолучитьТаблицуПлатежейУпр(ДатаДвижений,ВалютаДокумента,Ссылка, "ПлатежноеПоручениеВходящее");
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
 		ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ,Режим,Заголовок);
	КонецЕсли;
	// Движения по документу

	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	СтруктураДействий = Новый Структура("УстановитьДоговор");
	УправлениеДенежнымиСредствами.ВыполнитьДействияПередЗаписьюПлатежногоДокумента(ЭтотОбъект, СтруктураДействий, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда
		Для каждого Платеж из РасшифровкаПлатежа Цикл
			Платеж.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЦикла
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина) Экспорт
	
	Если НЕ (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком тогда
            
            Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
				
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется 	 			= СчетаУчета.Амортизируется;
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();				
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;						
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();			
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
			
			Дата378 = ПроведениеРасчетов.ВариантыАлгоритмовРасчетаЗарплаты().ДатаВводаСчета378;
			Если Дата < Дата378 Тогда
				Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) Тогда
					СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию;
				КонецЕсли;
			Иначе
				Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) Тогда
					СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами;
				КонецЕсли;
			КонецЕсли;	
		Иначе
		
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
			
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
			
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет значение, необходимое при проведении
Процедура ПроверитьЗначение(Значение, Отказ, Заголовок, ИмяРеквизита)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда 
		
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита """+ИмяРеквизита+"""",Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗначение()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЧастичнаяОплата Тогда
		Сообщить("По документу "+ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект))+" уже прошла частичная оплата.
		|Перед отменой проведения документа необходимо отменить проведение платежных ордеров.");
		Отказ=Истина;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ДвиженияЗаявки(Отказ)
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		// Движения по документу
		Если Не Отказ Тогда
			ДвиженияПоРегистрамНакопленияЗаявки(ВыборкаПоШапкеДокумента,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать РАЗРЕШЕННЫЕ
	|	Дата,
	|	Организация,
	|	Ответственный,
	|	Контрагент,
	|	СчетОрганизации,
	|	СчетКонтрагента,
	| 	Ссылка
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросДляПроведения()
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр( "ССылка" , Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Организация,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.ПериодВзаиморасчетов,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СтатьяРасчетовСФСС,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сотрудник,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СчетУчета,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сумма,
				   |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СуммаУпр,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Документ
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа 
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыПоНачислениямЗаСчетФСС
	               |		ПО ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка = ВзаиморасчетыПоНачислениямЗаСчетФСС.Регистратор
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
		   
	Возврат Запрос.Выполнить();		
КонецФункции

Процедура ДвиженияПоРегистрамНакопленияЗаявки(ВыборкаПоШапкеДокумента, Отказ)
	РезультатЗапросаПоДокументам = СформироватьЗапросДляПроведения();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		//движения по РН ВзаиморасчетыПоНачислениямЗаСчетФСС
		Движение = Движения.ВзаиморасчетыПоНачислениямЗаСчетФСС.Добавить();
	
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
	
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.СтатьяРасчетовСФСС     = ВыборкаПоДокументам.СтатьяРасчетовСФСС;
		Движение.Сотрудник              = ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.Сумма					= ВыборкаПоДокументам.Сумма; 
		Движение.СуммаУпр				= ВыборкаПоДокументам.СуммаУпр;
	
		//Реквизиты
		Движение.Документ 				= ВыборкаПоДокументам.Документ;
		Движение.КодОперации			= Перечисления.КодыОперацийРасчетыСФСС.Получено;

		//движения по РН ВзаиморасчетыСРаботникамиОрганизаций
        Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		
		// Свойства
		Движение.Период					= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения   			= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.Сотрудник				= ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов	= ВыборкаПоДокументам.Сумма;
		Движение.СуммаВзаиморасчетовУпр = ВыборкаПоДокументам.СуммаУпр;
		
		//Реквизиты
		Движение.КодОперации			= Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления;
	КонецЦикла
	
		
КонецПроцедуры

Процедура РассчитатьСуммуЗаявок() Экспорт
	Сумма = 0;
	
	РезультатЗапросаПоДокументам = ПолучитьЗапросДляРасчетаСумм();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
		
	Пока ВыборкаПоДокументам.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПоДокументам.Сумма) Тогда
	   		Сумма = Сумма + ВыборкаПоДокументам.Сумма;
		КонецЕсли;	
	КонецЦикла;
		
	СуммаДокумента = Сумма;
	
КонецПроцедуры
	
Функция ПолучитьЗапросДляРасчетаСумм()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ЕстьNULL(ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.ВсегоПоДокументу,0) КАК Сумма 
	                |ИЗ
	                |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	                |ГДЕ
	                |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить();				
					
Конецфункции	                           	

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мСтруктураПараметровДенежныхСредств = Новый Структура;
мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Безналичные);
