
#Если Клиент Тогда

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры


Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	// Данный отчет является настройкой базового отчета (реквизит ОбщийОтчет).
	// Базовый отчет настраивается стд. методом - с использованием процедуры Настроить()
	
	// Параметры, которые задают настройку отчета
	Параметры = Новый Структура;
	

	// Таблица описания видов объектов контактной информации для возможности вывода в отчет
	ТаблицаВидовОбъектовКИ = Новый ТаблицаЗначений;
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("Представление");// представление поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ВидОбъекта");   // вид объекта-владельца контактной информации
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("СтрокаТипОбъекта");   // тип объекта-владельца контактной информации
	
	НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
	НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.ФизЛицо";
	НоваяСтрока.Представление = "Работник";
	НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	НоваяСтрока.СтрокаТипОбъекта = "Справочник.ФизическиеЛица";
	

	Текст = "";
	СтруктураПредставлениеПолей = Новый Структура();
	СоответствиеНазначений = Новый Соответствие();
	СтруктураПараметры = Новый Структура();

	УправлениеОтчетами.ДобавитьВТекстПостроителяКонтактнуюИнформацию(ТаблицаВидовОбъектовКИ, Текст, СтруктураПредставлениеПолей, СоответствиеНазначений, СтруктураПараметры);
	
	АдресФактНаименование = Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица.Наименование;
	ЮрАдресФизЛицаНаименование = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица.Наименование;
	АдресФакт = "";
	ЮрАдресФизЛица = "";
	Для Инд = 1 По СтруктураПредставлениеПолей.Количество() Цикл
		
		Если СтруктураПредставлениеПолей["КИ_"+Инд] = АдресФактНаименование Тогда
			АдресФакт = ", " + "КИ_"+Инд;
			Если ЮрАдресФизЛица <> "" Тогда
				// все что хотели получили
				Прервать;
			КонецЕсли;			
		ИначеЕсли СтруктураПредставлениеПолей["КИ_"+Инд] = ЮрАдресФизЛицаНаименование Тогда
			ЮрАдресФизЛица = ", " + "КИ_"+Инд;
			Если АдресФакт <> "" Тогда
				// все что хотели получили
				Прервать;
			КонецЕсли;				
		КонецЕсли;
		
	КонецЦикла; 
	Параметры.Вставить("ГруппировкиСтрок", Новый Структура("Организация,ВУ_Военкомат,ВУ_ОтношениеКВоинскомуУчету"));
	
	Параметры.Вставить("ВыбранныеПоля", Новый Структура("ФИОПолное, ВУ_ОтношениеКВоинскомуУчету, ВУ_Годность, ДатаРождения, ПД_ДокументВид, ПД_ДокументСерия, ПД_ДокументНомер, ПД_ДокументДатаВыдачи, ПД_ДокументКемВыдан" + АдресФакт + ЮрАдресФизЛица));
	
	ТаблицаОтбора = Новый ТаблицаЗначений;
	
	ТаблицаОтбора.Колонки.Добавить("Имя");
	ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
	ТаблицаОтбора.Колонки.Добавить("Значение");
	ТаблицаОтбора.Колонки.Добавить("ЗначениеС");
	ТаблицаОтбора.Колонки.Добавить("ЗначениеПО");

	СтрокаОтбора = ТаблицаОтбора.Добавить();
	СтрокаОтбора.Имя = "Состояние";
	СтрокаОтбора.ВидСравнения = ВидСравнения.НеРавно;
	СтрокаОтбора.Значение = "Уволен";
	СтрокаОтбора.ЗначениеС 	= Null;
	СтрокаОтбора.ЗначениеПо	= Null;	
	
	СтрокаОтбора = ТаблицаОтбора.Добавить();
	СтрокаОтбора.Имя = "Пол";
	СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
	СтрокаОтбора.Значение	= Перечисления.ПолФизическихЛиц.Мужской;
	СтрокаОтбора.ЗначениеС 	= Null;
	СтрокаОтбора.ЗначениеПо	= Null;
	
	СтрокаОтбора = ТаблицаОтбора.Добавить();
	СтрокаОтбора.Имя = "Возраст";
	СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
	СтрокаОтбора.Значение = 17;
	СтрокаОтбора.ЗначениеС 	= Null;
	СтрокаОтбора.ЗначениеПо	= Null;
	
	
	Параметры.Вставить("Отбор", ТаблицаОтбора);
			
	Параметры.Вставить("НазваниеОтчета", "Список первоначальной постановки на воинский учет");
	
	Параметры.Вставить("Порядок", Новый Структура("ФИОПолное"));
	
	// Настройка отчета в соответствии с переданными параметрами
	ОбщийОтчет.Настроить(Параметры);
	
КонецПроцедуры

Процедура ОбработкаРасшифровки(Расшифровка, Элемент, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Используется стандартная обработка
	
КонецПроцедуры

//ЗаполнитьНачальныеНастройки();

#КонецЕсли

