// #Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ВыполняетсяРасшифровка Тогда
	
		СтандартнаяОбработка = Ложь;
	
		СхемаКомпоновкиДанных 	= ПолучитьИзВременногоХранилища(АдресСКД);
		
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
		// Помещаем в переменную данные о расшифровке данных.
		ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
		ДанныеРасшифровкиОтчета.Настройки = Настройки;

		// Формируем макет, с помощью компоновщика макета.
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

		// Передаем в макет компоновки схему, настройки и данные расшифровки.
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		// Выполним компоновку с помощью процессора компоновки.
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
		
		// Очищаем поле табличного документа.
		ДокументРезультат.Очистить();

		// Выводим результат в табличный документ.
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ДокументРезультат.ФиксацияСверху = 0;
		
		СохранитьПользовательскиеНастройкиВХранилище(ЭтотОбъект.ТекОтчет,ЭтотОбъект.ТекВариант, КомпоновщикНастроек.ПользовательскиеНастройки);
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура СохранитьПользовательскиеНастройкиВХранилище(ИмяОтчета, ИмяВарианта, Настройки)

	КлючНастройки = "Отчет."+ ИмяОтчета+"/"+ИмяВарианта;
	
	ХранилищеПользовательскихНастроекОтчетов.Сохранить(КлючНастройки,,Настройки);
	
КонецПроцедуры // СохранитьПользовательскиеНастройкиВХранилище()

// #КонецОбласти