Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт;
Перем мСтрокаРеквизитыУпрУчета Экспорт;
Перем мСтрокаРеквизитыНалУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета = "Организация, НадписьОрганизация";
	мСтрокаРеквизитыНалУчета = "";
	мСтрокаРеквизитыУпрУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, Режим)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		ПорядокЗакрытияПодразделений = Движения.ПорядокЗакрытияПодразделений;
	Иначе
		ПорядокЗакрытияПодразделений = Движения.ПорядокЗакрытияПодразделенийОрганизаций;
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Подразделение,
		|	ВЫБОР КОГДА ПорядокЗакрытия.НомерПередела ЕСТЬ NULL ТОГДА
		|		0
		|	ИНАЧЕ
		|		ПорядокЗакрытия.НомерПередела
		|	КОНЕЦ КАК НомерПередела
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ
		|			УстановкаПорядкаЗакрытие.Подразделение КАК Подразделение,
		|			УстановкаПорядкаЗакрытие.НомерСтроки КАК НомерПередела
		|		ИЗ
		|			Документ.УстановкаПорядкаЗакрытияПодразделений.ПорядокЗакрытия КАК УстановкаПорядкаЗакрытие
		|		ГДЕ
		|          	УстановкаПорядкаЗакрытие.Ссылка = &Ссылка
		|		) КАК ПорядокЗакрытия
		|	ПО
		|		Подразделения.Ссылка = ПорядокЗакрытия.Подразделение
		|ГДЕ
		|	Не Подразделения.ПометкаУдаления
		|";
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Подразделение,
		|	ВЫБОР КОГДА ПорядокЗакрытия.НомерПередела ЕСТЬ NULL ТОГДА
		|		0
		|	ИНАЧЕ
		|		ПорядокЗакрытия.НомерПередела
		|	КОНЕЦ КАК НомерПередела
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК Подразделения
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ
		|			УстановкаПорядкаЗакрытие.Подразделение КАК Подразделение,
		|			УстановкаПорядкаЗакрытие.НомерСтроки КАК НомерПередела
		|		ИЗ
		|			Документ.УстановкаПорядкаЗакрытияПодразделений.ПорядокЗакрытия КАК УстановкаПорядкаЗакрытие
		|		ГДЕ
		|          	УстановкаПорядкаЗакрытие.Ссылка = &Ссылка
		|		) КАК ПорядокЗакрытия
		|	ПО
		|		Подразделения.Ссылка = ПорядокЗакрытия.Подразделение
		|ГДЕ
		|	Не Подразделения.ПометкаУдаления
		|	И Подразделения.Владелец = &Организация
		|";
	КонецЕсли;
	

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого Строка Из РезультатЗапроса Цикл

		НоваяСтрока = ПорядокЗакрытияПодразделений.Добавить();

		НоваяСтрока.Период        = НачалоМесяца(Дата);
		НоваяСтрока.Подразделение = Строка.Подразделение;
		НоваяСтрока.НомерПередела = Строка.НомерПередела;
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			НоваяСтрока.Организация = Организация;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВУправленческомУчете Тогда
		Организация = Неопределено;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
