Перем мУдалятьДвижения;
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



// Производит автозаполнение табличной части РКО
//

Процедура ЗаполнитьПлатежи(Все = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если НЕ Все Тогда
		СписокВедомостей = ДокументыНачисления.ВыгрузитьКолонку("ДокументНачисления");
		Запрос.УстановитьПараметр("СписокВедомостей", СписокВедомостей);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("пустаяСтатьяНалоговойдекларации", Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка());
	
	//	ВТНалоги
	Если Истина Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|ВЫБРАТЬ
		|	Налоги.ДокументНачисления			КАК ДокументНачисления,
		|	Налоги.Организация					КАК Организация,
		|	Налоги.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
		|	Налоги.Налог						КАК Налог,
		|	СУММА(Налоги.Сумма)					КАК Сумма
		|ПОМЕСТИТЬ ВТНалоги	
		|ИЗ (
		|	ВЫБРАТЬ
		|		Взносы.Ссылка						КАК ДокументНачисления,
		|		Взносы.Ссылка.Организация			КАК Организация,
		|		Взносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
		|		Взносы.Налог						КАК Налог,
		|		Взносы.Результат					КАК Сумма
		|	ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Взносы
		|	ГДЕ		Взносы.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|		И	Взносы.Ссылка.Организация = &Организация
		|		И	Взносы.Ссылка.Проведен
		|		И   Взносы.Результат <> 0 
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Взносы.Ссылка						КАК ДокументНачисления,
		|		Взносы.Ссылка.Организация			КАК Организация,
		|		Взносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
		|		Взносы.Налог						КАК Налог,
		|		Взносы.Результат					КАК Сумма
		|	ИЗ Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Взносы
		|	ГДЕ		Взносы.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|		И	Взносы.Ссылка.Организация = &Организация
		|		И	Взносы.Ссылка.Проведен
		|		И   Взносы.Результат <> 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		НДФЛ.Ссылка						КАК ДокументНачисления,
		|		НДФЛ.Ссылка.Организация			КАК Организация,
		|		""""								КАК СтатьяНалоговойДекларации,
		|		""""								КАК Налог,
		|		НДФЛ.Налог				КАК Сумма
		|	ИЗ Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК НДФЛ
		|	ГДЕ		НДФЛ.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|		И	НДФЛ.Ссылка.Организация = &Организация
		|		И	НДФЛ.Ссылка.Проведен
		|		И   НДФЛ.Налог <> 0
		|	) КАК Налоги
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ДокументНачисления,
		|	Налоги.Организация,
		|	Налоги.СтатьяНалоговойДекларации,
		|	Налоги.Налог
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТНалоги = "ВТНалоги";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Начисления.ДокументНачисления			КАК ДокументНачисления,
	|	Начисления.Организация					КАК Организация,
	|	Начисления.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|	Начисления.Налог						КАК Налог,
	|	Начисления.Сумма						КАК Сумма,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетУчета	
	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
	|	КОНЕЦ	                                КАК СчетУчета,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.Контрагент	
	|			ИНАЧЕ ПараметрыСтрогие.Контрагент	
	|	КОНЕЦ	                                КАК Контрагент,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетКонтрагента	
	|			ИНАЧЕ ПараметрыСтрогие.СчетКонтрагента	
	|	КОНЕЦ	                                КАК СчетКонтрагента
	|
	|ИЗ ВТНалоги КАК Начисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеПлатежныхДокументовПоВзносамВФонды.ДокументыНачисления КАК ФормированиеПлатежей
	|ПО ФормированиеПлатежей.ДокументНачисления = Начисления.ДокументНачисления
	|И ФормированиеПлатежей.Ссылка <> &Ссылка
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ  (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК ПараметрыСтрогие
	|ПО		Начисления.Организация = ПараметрыСтрогие.Организация
	|	И	Начисления.СтатьяНалоговойдекларации = ПараметрыСтрогие.СтатьяНалоговойдекларации
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК Параметры
	|ПО		Начисления.Организация = Параметры.Организация
	|    И	(Параметры.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка) И Начисления.Налог = """"
	|    ИЛИ	Начисления.СтатьяНалоговойдекларации.Родитель = Параметры.СтатьяНалоговойдекларации)
	|
	|ГДЕ	ФормированиеПлатежей.Ссылка ЕСТЬ NULL
	|И		Начисления.ДокументНачисления.ПериодРегистрации = &ПериодРегистрации
	|"+?(Все,"","И Начисления.ДокументНачисления в (&СписокВедомостей)")+"
	|
	|ИТОГИ Сумма(Сумма)
	|ПО
	|	СчетУчета, Контрагент, СчетКонтрагента
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	// 0. Очистить табличные части перед началом заполнения
	Если Все Тогда
		// очистить все табличные части
		Платежки.Очистить();
		Налоги.Очистить();
		ДокументыНачисления.Очистить();
		
	Иначе
		// почистить данные по конретной ведомости
		Платежки.Очистить();
		Налоги.Очистить();
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// 1. Заполняем табличную часть ДокументыНачисления
	////Если Все Тогда
	////	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДокументНачисления");
	////	Пока Выборка.Следующий() Цикл
	////		
	////		НоваяСтрока = ДокументыНачисления.Добавить();
	////		НоваяСтрока.ДокументНачисления = Выборка.ДокументНачисления;
	////		
	////	КонецЦикла;
	////КонецЕсли;
	
	// 2. Заполняем табличные части Платежки и Налоги 
	ВыборкаПоСчетуУчета =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСчетуУчета.Следующий() Цикл
		ВыборкаПоКонтрагент =  ВыборкаПоСчетуУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагент.Следующий() Цикл
			ВыборкаПоСчетКонтрагента = ВыборкаПоКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСчетКонтрагента.Следующий() Цикл
				
				СтрПлатежки = Платежки.Добавить();
				СтрПлатежки.Отметка 		= Истина;
				СтрПлатежки.СчетУчета 		= ВыборкаПоСчетКонтрагента.СчетУчета;
				СтрПлатежки.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
				СтрПлатежки.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
				ИтогСум = 0;
				
				ВыборкаПоНалогам =  ВыборкаПоСчетКонтрагента.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоНалогам.Следующий() Цикл
					
					СтрНалоги = Налоги.Добавить();
					СтрНалоги.СчетУчета 				= ВыборкаПоНалогам.СчетУчета;
					Сум     		= ВыборкаПоНалогам.Сумма;
					Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0); // "случайная" копейка
					ИтогСум = ИтогСум + Сум;
					СтрНалоги.Сумма     				= Сум;
					СтрНалоги.Налог						= ВыборкаПоНалогам.Налог;
					СтрНалоги.СтатьяНалоговойДекларации	= ВыборкаПоНалогам.СтатьяНалоговойДекларации;
					СтрНалоги.ДокументНачисления		= ВыборкаПоНалогам.ДокументНачисления;
					СтрНалоги.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
					СтрНалоги.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
					
					Если Все Тогда
						Если  ДокументыНачисления.Найти( ВыборкаПоНалогам.ДокументНачисления, "ДокументНачисления" ) = Неопределено Тогда
							
							НоваяСтрока = ДокументыНачисления.Добавить();
							НоваяСтрока.ДокументНачисления = ВыборкаПоНалогам.ДокументНачисления;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				СтрПлатежки.Сумма  = ИтогСум;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура Автозаполнение() Экспорт
	
	Если ДокументыНачисления.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыНачисления[0].ДокументНачисления) = Тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций") Тогда
			АвтозаполнениеНачислениеЗП();
		ИначеЕсли ТипЗнч(ДокументыНачисления[0].ДокументНачисления) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций") Тогда
			АвтозаполнениеВедомость();
		КонецЕсли;
	Иначе
		Платежки.Очистить();
		Налоги.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура АвтозаполнениеНачислениеЗП() Экспорт
		
	ТекстЗапрос = "
	|ВЫБРАТЬ 
	|	СУММА(Сумма)	КАК Сумма,
	|   СчетУчета,
	|   Налог,
	|   СтатьяНалоговойДекларации,
	|   МАКСИМУМ(Платежка)	КАК Платежка,
	|   Отметка,
	|   Контрагент,
	|   СчетКонтрагента
	|
	|
	|
	|
	|ИЗ
	|(
	|ВЫБРАТЬ 
	|	Параметры.СчетУчета						КАК СчетУчета,
	|	Начисления.Налог						КАК Налог,
	|	Начисления.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|	Начисления.Результат					КАК Сумма,";
	Если ДокументыНачисления.Количество()=1 Тогда
		ТекстЗапрос =	ТекстЗапрос + "
		|	ЕСТЬNULL(ПлатежноеПоручение.Ссылка, &ПустоеПлатежноеПоручение) КАК Платежка,
		|	НЕ ЕСТЬNULL(ПлатежноеПоручение.Проведен, ЛОЖЬ) КАК Отметка,";
	Иначе
		ТекстЗапрос =	ТекстЗапрос + "
		|	&ПустоеПлатежноеПоручение 			КАК Платежка,
		|	ЛОЖЬ 								КАК Отметка,";
	КонецЕсли;
	ТекстЗапрос =	ТекстЗапрос + "
	|	Параметры.Контрагент					КАК Контрагент,
	|	Параметры.СчетКонтрагента				КАК СчетКонтрагента
	|ИЗ (        
	|	ВЫБРАТЬ 
	|		тчВзносы.Ссылка						КАК Ссылка,
	|		тчВзносы.Ссылка.Организация			КАК Организация,
	|		тчВзносы.Налог						КАК Налог,
	|		тчВзносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|		СУММА( тчВзносы.Результат )			КАК Результат
	|   ИЗ	Документ.НачислениеЗарплатыРаботникамОрганизаций.Взносы КАК тчВзносы
    |	ГДЕ тчВзносы.Ссылка В (&Ссылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчВзносы.Ссылка,
	|		тчВзносы.Налог,
	|		тчВзносы.СтатьяНалоговойдекларации
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ 
	|		тчВзносы.Ссылка						КАК Ссылка,
	|		тчВзносы.Ссылка.Организация			КАК Организация,
	|		тчВзносы.Налог						КАК Налог,
	|		тчВзносы.СтатьяНалоговойдекларации	КАК СтатьяНалоговойдекларации,
	|		СУММА( тчВзносы.Результат )		КАК Результат
	|   ИЗ	Документ.НачислениеЗарплатыРаботникамОрганизаций.ВзносыФОТ КАК тчВзносы
    |	ГДЕ тчВзносы.Ссылка В (&Ссылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчВзносы.Ссылка,
	|		тчВзносы.Налог,
	|		тчВзносы.СтатьяНалоговойДекларации
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ 
	|		тчНДФЛ.Ссылка						КАК Ссылка,
	|		тчНДФЛ.Ссылка.Организация			КАК Организация,
	|		""""								КАК Налог,
	|		""""								КАК СтатьяНалоговойдекларации,
	|		СУММА( тчНДФЛ.Налог )			КАК Результат
	|   ИЗ	Документ.НачислениеЗарплатыРаботникамОрганизаций.НДФЛ КАК тчНДФЛ
	|	ГДЕ тчНДФЛ.Ссылка В (&Ссылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчНДФЛ.Ссылка
	|) КАК Начисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Параметры
	|ПО Начисления.Организация = Параметры.Организация
	|И (Начисления.СтатьяНалоговойдекларации.Родитель = Параметры.СтатьяНалоговойдекларации
	|   ИЛИ Начисления.СтатьяНалоговойдекларации = """" И Параметры.СтатьяНалоговойдекларации = &пустаяСтатьяНалоговойдекларации)
	|";
	Если ДокументыНачисления.Количество()=1 Тогда
		ТекстЗапрос =	ТекстЗапрос + "
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
		|ПО
		|	Параметры.СчетУчета	= ПлатежноеПоручение.СчетУчетаРасчетовСКонтрагентом
		|	И	Начисления.Ссылка		= ПлатежноеПоручение.ДокументОснование
		|";
	КонецЕсли;
	ТекстЗапрос =	ТекстЗапрос + "
	//|ИТОГИ СУММА(Сумма) ПО
	//|	СчетУчета
	|
	|) КАК Осн
	|
	|СГРУППИРОВАТЬ ПО
	|   СчетУчета,
	|   Налог,
	|   СтатьяНалоговойДекларации,
//	|   Платежка,
	|   Отметка,
	|   Контрагент,
	|   СчетКонтрагента
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	СчетУчета
    |
	|
	|";
	
	Запрос = Новый Запрос(ТекстЗапрос);
	ДокументыСсылка = Новый Массив;
	Для Каждого	Строка Из ДокументыНачисления Цикл
		ДокументыСсылка.Добавить(Строка.ДокументНачисления);	
	КонецЦикла;
	Запрос.УстановитьПараметр("Ссылка", ДокументыСсылка);
	Запрос.УстановитьПараметр("ПустоеПлатежноеПоручение", Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка());
	Запрос.УстановитьПараметр("пустаяСтатьяНалоговойдекларации", Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка());
	
	ВыборкаПоСчетуУчета =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Платежки.Очистить();
	Налоги.Очистить();
	Пока ВыборкаПоСчетуУчета.Следующий() Цикл
		
		СтрПлатежки = Платежки.Добавить();
		СтрПлатежки.СчетУчета 		= ВыборкаПоСчетуУчета.СчетУчета;
		ИтогСум = 0;
		
		ВыборкаПоНалогам =  ВыборкаПоСчетуУчета.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаПоНалогам.Следующий() Цикл
			СтрПлатежки.Контрагент		= ВыборкаПоНалогам.Контрагент;
			СтрПлатежки.СчетКонтрагента = ВыборкаПоНалогам.СчетКонтрагента;
			СтрПлатежки.Платежка		= ВыборкаПоНалогам.Платежка;
			СтрПлатежки.Отметка			= ВыборкаПоНалогам.Отметка;
			
			СтрНалоги = Налоги.Добавить();
			СтрНалоги.СчетУчета 				= ВыборкаПоНалогам.СчетУчета;
			Сум     		= ВыборкаПоНалогам.Сумма;
			Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0); // "случайная" копейка
			ИтогСум = ИтогСум + Сум;
			СтрНалоги.Сумма     				= Сум;
			СтрНалоги.Налог						= ВыборкаПоНалогам.Налог;
			СтрНалоги.СтатьяНалоговойДекларации	= ВыборкаПоНалогам.СтатьяНалоговойДекларации;
		КонецЦикла;
		СтрПлатежки.Сумма  = ИтогСум;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АвтозаполнениеВедомость() Экспорт
		
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Сумма)	КАК Сумма,
	|   СчетУчета,
	|   Налог,
	|   СтатьяНалоговойДекларации,
	|   МАКСИМУМ(Платежка)	КАК Платежка,
	|   Отметка,
	|   ДокументНачисления,
	|   Контрагент,
	|   СчетКонтрагента
	|
	|
	|
	|
	|ИЗ
	|(
	|ВЫБРАТЬ 
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетУчета	
	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
	|	КОНЕЦ						КАК СчетУчета,
	|	Начисления.Ссылка						КАК ДокументНачисления,
	|	Начисления.Налог						КАК Налог,
	|	Начисления.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|	Начисления.Результат					КАК Сумма,";
	Если ДокументыНачисления.Количество()=1 Тогда
		ТекстЗапрос =	ТекстЗапрос + "
		|	ЕСТЬNULL(ПлатежноеПоручение.Ссылка, &ПустоеПлатежноеПоручение) КАК Платежка,
		|	НЕ ЕСТЬNULL(ПлатежноеПоручение.Проведен, ЛОЖЬ) КАК Отметка,";
	Иначе
		ТекстЗапрос =	ТекстЗапрос + "
		|	&ПустоеПлатежноеПоручение 			КАК Платежка,
		|	ЛОЖЬ 								КАК Отметка,";
	КонецЕсли;
	ТекстЗапрос =	ТекстЗапрос + "
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.Контрагент	
	|			ИНАЧЕ ПараметрыСтрогие.Контрагент	
	|	КОНЕЦ	                                КАК Контрагент,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетКонтрагента	
	|			ИНАЧЕ ПараметрыСтрогие.СчетКонтрагента	
	|	КОНЕЦ	                                КАК СчетКонтрагента
	|ИЗ (        
	|	ВЫБРАТЬ 
	|		тчВзносы.Ссылка						КАК Ссылка,
	|		тчВзносы.Ссылка.Организация			КАК Организация,
	|		тчВзносы.Налог						КАК Налог,
	|		тчВзносы.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|		СУММА( тчВзносы.Результат )			КАК Результат
	|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК тчВзносы
	|	ГДЕ тчВзносы.Ссылка В (&Ссылка)
	|       И тчВзносы.Результат <>0
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчВзносы.Ссылка,
	|		тчВзносы.Налог,
	|		тчВзносы.СтатьяНалоговойдекларации
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ 
	|		тчВзносы.Ссылка						КАК Ссылка,
	|		тчВзносы.Ссылка.Организация			КАК Организация,
	|		тчВзносы.Налог						КАК Налог,
	|		тчВзносы.СтатьяНалоговойдекларации	КАК СтатьяНалоговойдекларации,
	|		СУММА( тчВзносы.Результат )		КАК Результат
	|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК тчВзносы
	|	ГДЕ тчВзносы.Ссылка В (&Ссылка)
	|       И тчВзносы.Результат <>0
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчВзносы.Ссылка,
	|		тчВзносы.Налог,
	|		тчВзносы.СтатьяНалоговойдекларации
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ 
	|		тчНДФЛ.Ссылка						КАК Ссылка,
	|		тчНДФЛ.Ссылка.Организация			КАК Организация,
	|		""""								КАК Налог,
	|		""""								КАК СтатьяНалоговойдекларации,
	|		СУММА( тчНДФЛ.Налог )			КАК Результат
	|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК тчНДФЛ
	|	ГДЕ тчНДФЛ.Ссылка В (&Ссылка)
	|       И тчНДФЛ.Налог <>0
	|
	|	СГРУППИРОВАТЬ ПО
	|		тчНДФЛ.Ссылка
	|) КАК Начисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ  (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК ПараметрыСтрогие
	|ПО		Начисления.Организация = ПараметрыСтрогие.Организация
	|	И	Начисления.СтатьяНалоговойдекларации = ПараметрыСтрогие.СтатьяНалоговойдекларации
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК Параметры
	|ПО		Начисления.Организация = Параметры.Организация
	|    И	(Параметры.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка) И Начисления.Налог = """"
	|    ИЛИ	Начисления.СтатьяНалоговойдекларации.Родитель = Параметры.СтатьяНалоговойдекларации)
	|
	|";
	Если ДокументыНачисления.Количество()=1 Тогда
		ТекстЗапрос =	ТекстЗапрос + "
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
		|ПО
		|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	 	|			ТОГДА Параметры.СчетУчета	
	 	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
	 	|	КОНЕЦ	                                = ПлатежноеПоручение.Ссылка.СчетУчетаРасчетовСКонтрагентом
	 	|	И	(ПлатежноеПоручение.СубконтоДт1 = ЗНАЧЕНИЕ(Справочник.налоги.ПустаяСсылка) И Начисления.Налог = """"
	 	|	ИЛИ	Начисления.Налог = ПлатежноеПоручение.СубконтоДт1
	 	|	И	Начисления.СтатьяНалоговойДекларации = ПлатежноеПоручение.СубконтоДт2)
		|	И	Начисления.Ссылка		= ПлатежноеПоручение.ДокументОснование
		|";
	КонецЕсли;
	ТекстЗапрос =	ТекстЗапрос + "
	//|ИТОГИ СУММА(Сумма) ПО
	//|	СчетУчета
	|
	|) КАК Осн
	|
	|СГРУППИРОВАТЬ ПО
	|   СчетУчета,
	|   Налог,
	|   СтатьяНалоговойДекларации,
	|   ДокументНачисления,
	|   Отметка,
	|   Контрагент,
	|   СчетКонтрагента
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	СчетУчета, Контрагент, СчетКонтрагента
	|";
	
	Запрос = Новый Запрос(ТекстЗапрос);    
	ДокументыСсылка = Новый Массив;
	Для Каждого	Строка Из ДокументыНачисления Цикл
		ДокументыСсылка.Добавить(Строка.ДокументНачисления);	
	КонецЦикла;
	Запрос.УстановитьПараметр("Ссылка", ДокументыСсылка);
	Запрос.УстановитьПараметр("ПустоеПлатежноеПоручение", Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка());
	Запрос.УстановитьПараметр("пустаяСтатьяНалоговойдекларации", Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Платежки.Очистить();
	Налоги.Очистить();

	
	ВыборкаПоСчетуУчета =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСчетуУчета.Следующий() Цикл
		ВыборкаПоКонтрагент =  ВыборкаПоСчетуУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагент.Следующий() Цикл
			ВыборкаПоСчетКонтрагента = ВыборкаПоКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСчетКонтрагента.Следующий() Цикл
				
				СтрПлатежки = Платежки.Добавить();
				СтрПлатежки.Отметка 		= Истина;
				СтрПлатежки.СчетУчета 		= ВыборкаПоСчетКонтрагента.СчетУчета;
				СтрПлатежки.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
				СтрПлатежки.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
				ИтогСум = 0;
				
				ВыборкаПоНалогам =  ВыборкаПоСчетКонтрагента.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоНалогам.Следующий() Цикл
					
					СтрНалоги = Налоги.Добавить();
					СтрНалоги.СчетУчета 				= ВыборкаПоНалогам.СчетУчета;
					Сум     		= ВыборкаПоНалогам.Сумма;
					Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0); // "случайная" копейка
					ИтогСум = ИтогСум + Сум;
					СтрНалоги.Сумма     				= Сум;
					СтрНалоги.Налог						= ВыборкаПоНалогам.Налог;
					СтрНалоги.СтатьяНалоговойДекларации	= ВыборкаПоНалогам.СтатьяНалоговойДекларации;
					СтрНалоги.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
					СтрНалоги.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
					СтрНалоги.ДокументНачисления		= ВыборкаПоНалогам.ДокументНачисления;
					
				КонецЦикла;
				СтрПлатежки.Сумма  = ИтогСум;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций") Тогда
		// проверка на то, что по ведомости налоги уже формировались
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ведомости.Ссылка	КАК ФормированиеПлатежек
	|ИЗ Документ.ФормированиеПлатежныхДокументовПоВзносамВФонды.ДокументыНачисления КАК Ведомости
	|ГДЕ	Ведомости.ДокументНачисления = &Основание
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьОбОшибке("По текущей ведомости сфомирован документ " + Выборка.ФормированиеПлатежек + " !");
		Возврат;	
	КонецЦикла;
	
	Организация = Основание.Организация;
	Ответственный = Основание.Ответственный;
	ПериодРегистрации = Основание.ПериодРегистрации;
	ДатаПлатежки = ТекущаяДата();
		// заполнение документв
		НоваяСтрока = ДокументыНачисления.Добавить();
		НоваяСтрока.ДокументНачисления = Основание;
		ЗаполнитьПлатежи(Ложь);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры
