// #Область СлужебныеПроцедурыИФункции
&НаКлиенте
Перем Компонент;

&НаСервере
// Восстановление настроек. Инициализация.
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетДокумента = ПолучитьОбщийМакет("МИКО_ЛицензионноеСоглашение");
	ЛицензионноеСоглашениеHTML = МакетДокумента.ПолучитьТекст();
		
	Попытка
		врМИКО_стСлужебный 	 = Вычислить("МИКО_стСлужебный");
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Отказ = Ложь;
		Возврат;
	КонецПопытки; 

    СведенияОПродукте 	  = мМИКО_Лицензирование.ПолучитьСведенияОПродукте("Модуль статистики");
	ИдентификаторПродукта = СведенияОПродукте.ИдентификаторТриальногоПродукта;	
	// Заполнение формы.
	АдресСервера 	= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера();
	ПортСервера  	= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера();
	ИмяПользователя = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПользовательСтатистики();
	Пароль			= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.Пароль();
	ИспользоватьЖурналСтатистикиВПанелиТелефонии = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьЖурналСтатистикиВПанелиТелефонии();
	//
	РесурсCDR 		   = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCDR();
	РесурсCEL 		   = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCEL();
	КлючЗащиты	       = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КлючЗащиты();
	ИспользоватьДопАТС = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьДопАТС();
	КоличествоХранимыхЦифрТелефона = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КоличествоХранимыхЦифрТелефона();
	
	ВнешниеНомера.Загрузить(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВнешниеНомера.ТаблицаЗначений.Выгрузить());
	ИменаФаксов.Загрузить(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИменаФаксов.ТаблицаЗначений.Выгрузить());
		
	ТипАТС = ?(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX(),1,0);
	
	// Получение информации по фоновым заданиям.
	// С регламентными заданиями может работать только администратор системы с полными правами.
	Если ИмяПользователя()<>"" И НЕ РольДоступна("ПолныеПрава") Тогда
		МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Выполнять настройку может только администратор системы с полными правами.");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	ПолучитьРегламентныеЗадания();
		
	// Получим системную информацию.
	СтруктураДанных = врМИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	Попытка
		Заголовок = "Версия модуля: "+врМИКО_стСлужебный.ВерсияМодуляСтатистики();
	Исключение
		Заголовок = "Не найден ключ защиты.";	
	КонецПопытки;
	ОтправилиМетрику = Ложь;
	Компонент 		 = Неопределено;
	ЮрЛицо 			 = Истина;
	Элементы.ДекорацияВерсия.Заголовок = Заголовок;
	
	ИспользоватьМодульСтатистики = МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики();	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()

	ЛицензионноеСоглашениеПринято = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ЛицензионноеСоглашениеПринято();
	Если НЕ ЛицензионноеСоглашениеПринято Тогда
	  	Элементы.КореньСтраниц.ТекущаяСтраница = Элементы.грЛицензионноеСоглашение;
	Иначе
	  	Элементы.КореньСтраниц.ТекущаяСтраница = Элементы.Основные;
	КонецЕсли;
	Элементы.ПринятьСоглашение.Видимость = НЕ ЛицензионноеСоглашениеПринято;
	Элементы.граШапкаФормы.Доступность = ЛицензионноеСоглашениеПринято;
	Для каждого ТекСтраница Из Элементы.КореньСтраниц.ПодчиненныеЭлементы Цикл
		Если ТекСтраница = Элементы.грЛицензионноеСоглашение Тогда
		 	Продолжить;
		КонецЕсли; 
		ТекСтраница.Доступность = ЛицензионноеСоглашениеПринято;
	КонецЦикла;

	Элементы.Дополнительно.Доступность  = ИспользоватьМодульСтатистики;
	Элементы.Основные.Доступность 		= ИспользоватьМодульСтатистики;

КонецПроцедуры
 

&НаКлиенте
// Обработка оповещения от прочих форм.
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	///
	// Регистрация лицензии	
	Если ИмяСобытия = "MIKO_ТекстЛицензии_stat" Тогда
		ОбовитьСтатусЛицензии(Параметр);
	ИначеЕсли ИмяСобытия = "MIKOLIC_INFO" Тогда	
		ПоказатьСообщение("Результат: " + Источник);
	ИначеЕсли ИмяСобытия = "MIKOLIC_Trial" Тогда	
		КлючЗащиты = Параметр;
		Оповестить("MIKO_ActivateCoupone_stat", КлючКупон, ЭтаФорма);
		КонтрольРегистрации = Истина;
		дСтатусРегистрацииКлюча = дСтатусРегистрацииКлюча+"Регистрационный номер """+Параметр+""" успешно получен." + Символы.ПС;
		КлючЗащитыПриИзменении(Неопределено);	
	ИначеЕсли ИмяСобытия = "MIKOLIC_Trial_Error" Тогда	
		// Ошибка получения временной лицензии.
		КонтрольРегистрации = Истина;
		дСтатусРегистрацииКлюча = дСтатусРегистрацииКлюча+"Ошибка при получении регистрационного номера клиента.";	
	ИначеЕсли ИмяСобытия = "MIKO_GetSetTrialLicense_stat" Тогда
		УстановкаПолучениеЛицензии(Параметр);
	ИначеЕсли ИмяСобытия = "MIKO_RefreshLicense_stat" Тогда
		ПолучитьТаблицуКлючейЗащиты();
	ИначеЕсли ИмяСобытия = "MIKO_ActivateCoupone_stat" Тогда
		ActivateCoupone(Параметр);
	ИначеЕсли "ВыборКаталога" = ИмяСобытия И "МИКО_СообщениеВТехническуюПоддержку" = Источник Тогда	
		СохранитьОтладочнуюИнформацию(Параметр);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка внешних событий компонента.
// 
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если "MIKO_Protection1C" <> Источник Тогда
		Возврат;
	КонецЕсли; 
	
	врСообщеине = дСтатусРегистрацииКлюча;
	Если Событие = "MIKOLIC_ERROR" Тогда
		Если Найти(Данные, "1003")>0 Тогда
			врСообщеине = врСообщеине + "[1003] Для активации купона """+КлючКупон+""" необходимо ввести данные о компании и получить регистрационный номер по ссылке ""Настроить модуль статистики"" -> ""Настройки лицензирования""." + Символы.ПС;	
			КонтрольРегистрации = Ложь;	
		ИначеЕсли Найти(Данные,"1058")>0  Тогда 	
			// ERR Данный e-mail адрес уже зарегистрирован в системе [1058]	
			врСообщеине = врСообщеине + "[1058] E-mail """+ЭлектронныйАдрес+""" уже зарегистрирован в системе." + Символы.ПС;		
		ИначеЕсли Найти(Данные,"1053")>0  Тогда 	
			врСообщеине = врСообщеине + "[1053] Введен не верный регистрационный номер """+КлючКупон+"""." + Символы.ПС;
			КонтрольРегистрации = Ложь;
		ИначеЕсли Найти(Данные,"1081")>0  Тогда 	
			врСообщеине = врСообщеине + "[1081] Введен не верный код купона """+КлючКупон+"""." + Символы.ПС;
			КонтрольРегистрации = Ложь;
			КлючКупон = "";		
		ИначеЕсли Найти(Данные, "1082")>0 Тогда 	
			врСообщеине = врСообщеине + "[1082] Купон """+КлючКупон+""" уже был активирован ранее." + Символы.ПС;  
			КлючКупон = "";	
		ИначеЕсли Найти(Данные, "1012")>0 Тогда
			// ERR Сервер лицензирования не вернул ответ [1011]
			врСообщеине = врСообщеине + "[1012] Сервер лицензирования не отклонил запрос." + Символы.ПС;	
		ИначеЕсли Найти(Данные, "1011")>0 Тогда
			// ERR Сервер лицензирования не вернул ответ [1011]
			врСообщеине = врСообщеине + "[1011] Сервер лицензирования не вернул ответ." + Символы.ПС;
			врСообщеине = врСообщеине + "Проверьте наличие доступа в интернет." + Символы.ПС;
		КонецЕсли; 
	ИначеЕсли Событие = "MIKOLIC_INFO" Тогда
		врСообщеине = врСообщеине + Данные + " """ + КлючКупон +  """ " +Символы.ПС;
	Иначе
		врСообщеине = врСообщеине + Данные +Символы.ПС;
	КонецЕсли;
	дСтатусРегистрацииКлюча = врСообщеине;
	
КонецПроцедуры

&НаКлиенте
// Изменение настройки использования модуля статистики.
// 
Процедура ИспользоватьМодульСтатистикиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Сохранение настроек модуля.
//
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Модифицированность = Ложь;
КонецПроцедуры
&НаСервере
Процедура СохранитьНаСервере()	
	// Сохраним настройки
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера(АдресСервера);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера(ПортСервера);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПользовательСтатистики(ИмяПользователя);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.Пароль(Пароль);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьЖурналСтатистикиВПанелиТелефонии(ИспользоватьЖурналСтатистикиВПанелиТелефонии);
	//
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCDR(РесурсCDR);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCEL(РесурсCEL);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КоличествоХранимыхЦифрТелефона(КоличествоХранимыхЦифрТелефона);
	// ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КлючЗащиты(КлючЗащиты);
	
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВнешниеНомера(ВнешниеНомера.Выгрузить());
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИменаФаксов(ИменаФаксов.Выгрузить());
	
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX(?(ТипАТС = 1, Истина, Ложь));
	
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьДопАТС(ИспользоватьДопАТС);
	
	Узел = ПланыОбмена.МИКО_стОбновлениеКИ.НайтиПоКоду("КИ");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Узел = ПланыОбмена.МИКО_стОбновлениеКИ.СоздатьУзел();
		Узел.Код = "КИ";
		Узел.Наименование = "Измененные объекты КИ";
		Узел.ДополнительныеСвойства.Вставить("ИзменениеНастроек", Истина);
	    Узел.Записать();
	КонецЕсли; 
	Узел = ПланыОбмена.МИКО_стОбновлениеКИ_Дополнительный.НайтиПоКоду("КИ");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Узел = ПланыОбмена.МИКО_стОбновлениеКИ_Дополнительный.СоздатьУзел();
		Узел.Код = "КИ";
		Узел.Наименование = "Измененные объекты КИ (Дополнительный)";
		Узел.ДополнительныеСвойства.Вставить("ИзменениеНастроек", Истина);
	    Узел.Записать();
	КонецЕсли; 
	
	Узел = ПланыОбмена.МИКО_стСопоставлениеСобытий.НайтиПоКоду("ДС");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Узел = ПланыОбмена.МИКО_стСопоставлениеСобытий.СоздатьУзел();
		Узел.Код = "ДС";
		Узел.Наименование = "Измененные документы событие";
		Узел.ДополнительныеСвойства.Вставить("ИзменениеНастроек", Истина);
	    Узел.Записать();
	КонецЕсли; 
	
	ЕстьПланОбменаCRM3 = Метаданные.ПланыОбмена.Найти("МИКО_стСозданиеТелефонныхЗвонковCRM3")<>Неопределено;
	Если ЕстьПланОбменаCRM3 Тогда
		Узел = ПланыОбмена.МИКО_стСозданиеТелефонныхЗвонковCRM3.НайтиПоКоду("ДЗ");
		Если НЕ ЗначениеЗаполнено(Узел) Тогда
			Узел = ПланыОбмена.МИКО_стСозданиеТелефонныхЗвонковCRM3.СоздатьУзел();
			Узел.Код = "ДЗ";
			Узел.Наименование = "Измененные документы записи истории звонков";
			Узел.ДополнительныеСвойства.Вставить("ИзменениеНастроек", Истина);
		    Узел.Записать();
		КонецЕсли;
	КонецЕсли;	
		
	ИспользоватьМодульСтатистики 	    = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьМодульСтатистики(ИспользоватьМодульСтатистики);
	Элементы.Дополнительно.Доступность  = ИспользоватьМодульСтатистики;
	Элементы.Основные.Доступность 		= ИспользоватьМодульСтатистики;
	
КонецПроцедуры

&НаКлиенте
// Очистка префиксов в КИ.
//
Процедура ПерезаполнитьТелефоннуюКнигу(Команда)
	ПерезаполнитьТелефоннуюКнигуНаСервере(КоличествоХранимыхЦифрТелефона);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ПерезаполнитьТелефоннуюКнигуНаСервере(КоличествоХранимыхЦифрТелефона)
	
	Попытка
		врМИКО_стОбработкаКонтактнойИнформации = Вычислить("МИКО_стОбработкаКонтактнойИнформации");
	Исключение
		Возврат;
	КонецПопытки; 
	врМИКО_стОбработкаКонтактнойИнформации.ОбработатьТелефоныВ_КИ_Справочников();
	врМИКО_стОбработкаКонтактнойИнформации.ПерезаполнитьТелефоннуюКнигу(КоличествоХранимыхЦифрТелефона);
	
КонецПроцедуры

&НаКлиенте
// Перезаполнение документов по данным регистров.
// 
Процедура ПерезаполнитьДокументыИстории(Команда)
	Если ТипАТС = 0 Тогда
		ПерезаполнитьДокументыИсторииНаСервере();
	ИначеЕсли ТипАТС = 1 Тогда
		ПерезаполнитьДокументыИсторииНаСервере_MyPBX();
	КонецЕсли;
	ПерезаполнитьДокументыИсторииНаСервере_Askozia();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаполнитьДокументыИсторииНаСервере()
	Попытка
		врМИКО_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	Исключение
		Возврат;
	КонецПопытки; 

	МассивАТС = врМИКО_стЗагрузкаИсторииЗвонков_v7.ОпределитьПараметрыАТС();
	Индекс = 0;
	Пока Индекс < МассивАТС.Количество() Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_стИсторияЗвонковCDR.UID
			|ИЗ
			|	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_стИсторияЗвонковCDR
			|ГДЕ
			|	МИКО_стИсторияЗвонковCDR.calldate > &calldate
			|	И МИКО_стИсторияЗвонковCDR.id_pbx = &id_pbx
			|
			|СГРУППИРОВАТЬ ПО
			|	МИКО_стИсторияЗвонковCDR.UID";
			
		Запрос.УстановитьПараметр("calldate", ДобавитьМесяц(ТекущаяДата(),-2));
		Запрос.УстановитьПараметр("id_pbx",   МассивАТС[Индекс].Получить("id_pbx"));

		РезультатЗапроса = Запрос.Выполнить();
		МассивUID = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("UID");
		ДанныеИзБазы = врМИКО_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCEL_CDR(МассивUID, МассивАТС[Индекс].Получить("id_pbx"));		

		// Итоговая таблица истории.
		Для каждого ТекущийUID Из МассивUID Цикл
			врМИКО_стЗагрузкаИсторииЗвонков_v7.ЗаполнитьОбработатьИсториюЗвонковПоUID(ТекущийUID, ДанныеИзБазы);	
		КонецЦикла; 
		
		Индекс = Индекс + 1;
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаполнитьДокументыИсторииНаСервере_MyPBX()
	Попытка
		врМИКО_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	Исключение
		Возврат;
	КонецПопытки; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стИсторияЗвонковCDR.uniqueid_pt1c
		|ИЗ
		|	РегистрСведений.МИКО_стMyPBX_Asteriskcdr КАК МИКО_стИсторияЗвонковCDR
		|ГДЕ
		|	МИКО_стИсторияЗвонковCDR.datetime > &calldate
		|
		|СГРУППИРОВАТЬ ПО
		|	МИКО_стИсторияЗвонковCDR.uniqueid_pt1c";
		
	Запрос.УстановитьПараметр("calldate", ДобавитьМесяц(ТекущаяДата(),-2));
	РезультатЗапроса = Запрос.Выполнить();
	МассивUID = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("uniqueid_pt1c");
	ДанныеИзБазы = врМИКО_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCDR_Autorecord_MyPBX(МассивUID, МассивUID);
	
	// Итоговая таблица истории.
	Для каждого ТекущийUID Из МассивUID Цикл
		врМИКО_стЗагрузкаИсторииЗвонков_v7.ЗаполнитьОбработатьИсториюЗвонковCDR_MyPBX(ТекущийUID, ДанныеИзБазы);	
	КонецЦикла; 	
	
КонецПроцедуры

// (Askozia)
&НаСервереБезКонтекста
Процедура ПерезаполнитьДокументыИсторииНаСервере_Askozia()
	Попытка
		врМИКО_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	Исключение
		Возврат;
	КонецПопытки; 

	МассивАТС = врМИКО_стЗагрузкаИсторииЗвонков_v7.ОпределитьПараметрыАТС();
	Индекс = 0;
	Пока Индекс < МассивАТС.Количество() Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_стИсторияЗвонковCDR.UID
			|ИЗ
			|	РегистрСведений.МИКО_стИсторияЗвонковAskozia КАК МИКО_стИсторияЗвонковCDR
			|ГДЕ
			|	МИКО_стИсторияЗвонковCDR.start > &calldate
			|	И МИКО_стИсторияЗвонковCDR.id_pbx = &id_pbx
			|
			|СГРУППИРОВАТЬ ПО
			|	МИКО_стИсторияЗвонковCDR.UID";
			                                                            
		Запрос.УстановитьПараметр("calldate", ДобавитьМесяц(ТекущаяДата(),-2));
		Запрос.УстановитьПараметр("id_pbx",   МассивАТС[Индекс].Получить("id_pbx"));

		РезультатЗапроса = Запрос.Выполнить();
		МассивUID = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("UID");
		ДанныеИзБазы = врМИКО_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCEL_CDR(МассивUID, МассивАТС[Индекс].Получить("id_pbx"));		

		// Итоговая таблица истории.
		врМИКО_стЗагрузкаИсторииЗвонков_v7.СформироватьДокументыИсторииAskozia(МассивUID, ДанныеИзБазы);
		
		Индекс = Индекс + 1;
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
// Разбор конфигурационного файла Askozia.
// 
Процедура ЗагрузитьИзФайлаНаСервере(Данные)
	ВремФайл = ПолучитьИмяВременногоФайла("xml");
	Попытка
		
		Если ЭтоАдресВременногоХранилища(Данные) Тогда
			ДД = ПолучитьИзВременногоХранилища(Данные);
		Иначе
			ДД = Данные;
		КонецЕсли; 
		
		Если ТипЗнч(ДД) = Тип("ДвоичныеДанные") Тогда
			ДД.Записать(ВремФайл);
			ЧтениеXML = Новый ЧтениеXML; ПостроительDOM = Новый ПостроительDOM; 
			ЧтениеXML.ОткрытьФайл(ВремФайл);
			ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		ИначеЕсли ТипЗнч(ДД) = Тип("ДокументDOM") ИЛИ ТипЗнч(ДД) = Тип("ДокументHTML") Тогда
			ДокументDOM = ДД;
		ИначеЕсли ТипЗнч(ДД) = Тип("Строка") Тогда
			ЧтениеHTML 	 	= Новый ЧтениеHTML;	
			ПостроительDOM 	= Новый ПостроительDOM; 
			ЧтениеHTML.УстановитьСтроку(ДД);
			ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);	
		Иначе 
			Возврат;
		КонецЕсли; 
	Исключение
		// Не вышло передать данные на сервер!
		МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не вышло передать данные на сервер!");
		Возврат;
	КонецПопытки;
	
	
	Тип = "provider";
	СписокЭлементовDOM = ДокументDOM.ПолучитьЭлементыПоИмени(Тип);
	Для Каждого ЭлементDOM Из СписокЭлементовDOM Цикл
		Если ЭлементDOM.РодительскийУзел.ИмяУзла <> "sip" Тогда
			Продолжить;
		КонецЕсли; 
		// имя учетной записи
		name	= ЭлементDOM.ПолучитьЭлементыПоИмени("name");
		Если name.Количество()=0 Тогда
			Продолжить;
		КонецЕсли; 
		name = name[0].ТекстовоеСодержимое;
		
		// идентификатор
		uniqid 	= ЭлементDOM.ПолучитьЭлементыПоИмени("uniqid");
		Если uniqid.Количество()=0 Тогда
			Продолжить;
		КонецЕсли; 
		uniqid = uniqid[0].ТекстовоеСодержимое;
		
		ЗагрузитьУчетнуюЗапись(name, uniqid, Тип);
	КонецЦикла;
	
	Тип = "fax";
	СписокЭлементовDOM = ДокументDOM.ПолучитьЭлементыПоИмени(Тип);
	Для Каждого ЭлементDOM Из СписокЭлементовDOM Цикл
		// имя учетной записи
		name	= ЭлементDOM.ПолучитьЭлементыПоИмени("callerid");
		Если name.Количество()=0 Тогда
			Продолжить;
		КонецЕсли; 
		name = name[0].ТекстовоеСодержимое;
		
		// идентификатор
		uniqid 	= ЭлементDOM.ПолучитьЭлементыПоИмени("uniqid");
		Если uniqid.Количество()=0 Тогда
			Продолжить;
		КонецЕсли; 
		uniqid = uniqid[0].ТекстовоеСодержимое;
		
		ЗагрузитьУчетнуюЗапись(name, uniqid, Тип);
	КонецЦикла;
			
КонецПроцедуры
&НаСервере
// Создаем учетные записи АТС.
// 
Процедура ЗагрузитьУчетнуюЗапись(Наименование, Идентификатор, Тип)

  	УчЗапись = Справочники.МИКО_стУчетныеЗаписиАТС.НайтиПоРеквизиту("Идентификатор", Идентификатор);
  	Если УчЗапись = Справочники.МИКО_стУчетныеЗаписиАТС.ПустаяСсылка() Тогда			
		УчЗапись = Справочники.МИКО_стУчетныеЗаписиАТС.СоздатьЭлемент();
		УчЗапись.Идентификатор = Идентификатор;
		УчЗапись.Наименование  = Наименование;
		Попытка
		  	УчЗапись.Записать();
		Исключение
			МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не вышло загрузить учетную запись ("+ Наименование +"), " + Идентификатор);
			Возврат;
		КонецПопытки; 
	КонецЕсли; 
	
	Если Тип = "fax" Тогда
	  	ИмяТаблицы = "ИменаФаксов";
	ИначеЕсли Тип = "provider" Тогда 	
	  	ИмяТаблицы = "ИменаТранков";
	Иначе 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стУчетныеЗаписиАТС.Ссылка
		|ИЗ
		|	Справочник.МИКО_стУчетныеЗаписиАТС КАК МИКО_стУчетныеЗаписиАТС
		|ГДЕ
		|	МИКО_стУчетныеЗаписиАТС.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	УчЗаписи = Запрос.Выполнить().Выгрузить();
	Если УчЗаписи.Количество()=0 Тогда
		СтрУчЗапись = ЭтаФорма[ИмяТаблицы].Добавить();
		СтрУчЗапись.Представление 	= Идентификатор;
		СтрУчЗапись.Значение 	  	= УчЗапись.Ссылка;
	КонецЕсли;
	
КонецПроцедуры	

///
// Настройка расписания заданий
///

&НаСервере 
// Получение регламентных заданий по подсистеме "ИсторияЗвонков"
// 
Процедура ПолучитьРегламентныеЗадания()
	Задания.Очистить();
	
	ВсеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для каждого Задание Из ВсеЗадания Цикл
		Имя = Задание.Метаданные.Имя;
		Если Имя = "МИКО_стСинхронизацияИсторииЗвонков" Тогда
			СинхронизацияИсторииЗвонков = Задание;
		ИначеЕсли Имя = "МИКО_стОбновитьКИВДокументахИстории" Тогда
			ОбновитьКИВДокументахИстории = Задание;	
		ИначеЕсли Имя = "МИКО_стСопоставлениеЗвонковССобытиями" Тогда
			ПерезаполнитьДокументыИстории = Задание;	
		Иначе
			Продолжить;
		КонецЕсли; 			
		Элементы[Имя].Заголовок = "" + Задание.Расписание;
		
		ПоляЗадания = Задания.Добавить();
		ПоляЗадания.УникальныйИдентификатор = Задание.УникальныйИдентификатор;
		ПоляЗадания.Имя 					= Имя;
		ПоляЗадания.Представление 			= Задание.Метаданные.Синоним;
		ПоляЗадания.Расписание 				= Задание.Расписание;
	КонецЦикла; 
КонецПроцедуры 

&НаКлиенте
// Обработка изменения расписания регламентного задания
//
Процедура ВыбратьРасписание(Расписание, ДопПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		// не изменили расписание, просто закрыли форму 
		Возврат;
	КонецЕсли; 
				
	Если Не ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		// это не верное оповещение
		Возврат;
	КонецЕсли; 
	
	СохранитьРасписаниеЗадания(ДопПараметры.УникальныйИдентификатор, Расписание);
КонецПроцедуры

// Сохранить расписание задания.
//
// Параметры:
//  УникальныйИдентификатор  - <тип - УникальныйИдентификатор> - идентификатор регламентного задания.
//  Расписание  - <РасписаниеРегламентногоЗадания> - новое значение расписания.
//
&НаСервере
Процедура СохранитьРасписаниеЗадания(УИД, Расписание)

	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УИД);
	Если Задание = Неопределено Тогда
		// передан не верный идентификатор
		Возврат;			
	КонецЕсли; 
	// правим расписание
	Задание.Расписание = Расписание;
	Задание.Записать();	

	ПолучитьРегламентныеЗадания();
КонецПроцедуры // СохранитьРасписаниеЗадания()

&НаКлиенте
// Обработка нажатия на гиперссылку регламентного задания.
// 
Процедура ИзменениеРасписанияНажатие(Элемент)
	
	ВсеЗадания = Задания.НайтиСтроки(Новый Структура("Имя", Элемент.Имя));
	Если ВсеЗадания.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 	
	
	// пробуем менять расписание
	УИД = ВсеЗадания[0].УникальныйИдентификатор; 
	Имя = ВсеЗадания[0].Имя;
	Расписание = ВсеЗадания[0].Расписание;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("УникальныйИдентификатор",УИД);	
	ДопПараметры.Вставить("Имя",Имя);
	
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);	
	
	Если ВерсияПлатформы = "8.3" Тогда
		
		Если НЕ ИспользоватьРежимМодальности Тогда
		
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ВыбратьРасписание"", ЭтаФорма, ДопПараметры)");
			Попытка	
				Выполнить("Диалог.Показать(ОписаниеОповещения)");
			Исключение
				Возврат;
			КонецПопытки; 
			
		Иначе	
			ЗначениеРасписания = Диалог.ОткрытьМодально();
			УстановитьРасписаниеНаСервере(УИД, Диалог.Расписание);
			ПолучитьРегламентныеЗадания();
		КонецЕсли; 
		
		
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		ЗначениеРасписания = Диалог.ОткрытьМодально();
		УстановитьРасписаниеНаСервере(УИД, Диалог.Расписание);
		ПолучитьРегламентныеЗадания();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
// Установка расписания для регламентного задания.
// 
Процедура УстановитьРасписаниеНаСервере(РеглЗаданиеУИД, Знач Расписание)

	РеглЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданиеУИД);
	РеглЗадание.Расписание = Расписание;
	РеглЗадание.Записать();
	
КонецПроцедуры // ()

&НаСервере 
// Получаем идентификаторы транка.
// 
Функция ПолучитьДанныеТранка(СсылкаНаТранк)
	врДанные = Новый Структура("Представление,did,accountcode,Значение,Идентификатор,Ссылка");	
    ЗаполнитьЗначенияСвойств(врДанные,СсылкаНаТранк);
	врДанные.Значение 	   = врДанные.Ссылка;
	врДанные.Представление = врДанные.Идентификатор;
	
	Возврат врДанные;
КонецФункции // ПолучитьДанныеТранка()

&НаКлиенте
// Описание учетных записей факсов.
// 
Процедура ИменаФаксовЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ИменаФаксов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьДанныеТранка(ВыбранноеЗначение));
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ИменаФаксовЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Активируем флаг "Модифицированность"
// 
Процедура ПриИзмененииНастроек(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Проверка доступа к АТС.
// 
Процедура Проверить(Команда)
	Попытка
		врМИКО_стСлужебный = Вычислить("МИКО_стСлужебный");
		врМИКО_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	Исключение
		Возврат;
	КонецПопытки; 
	
	Сохранить(Команда);
	Модифицированность = Ложь;
	
	Попытка
		врРезультатТеста = врМИКО_стЗагрузкаИсторииЗвонков_v7.ТестИнтерфейсовАТС();
		Элементы.ДекорацияВерсия.Заголовок = "Версия модуля: "+врМИКО_стСлужебный.ВерсияМодуляСтатистики() + ". Версия защищенного модуля: " + врМИКО_стЗагрузкаИсторииЗвонков_v7.ВерсияЗащищенногоМодуля();
	Исключение
		Элементы.ДекорацияВерсия.Заголовок = "Не найден ключ защиты.";
		Возврат;
	КонецПопытки;
	
	Если врРезультатТеста.Свойство("ЭтоMyPBX") Тогда
		ТипАТС = 1;
		ТипАТСПриИзменении(Неопределено);
	КонецЕсли; 
	
	Элементы.РезультатТеста.Заголовок = "Результат проверки: " + ?(врРезультатТеста.Количество()>0, "Успех", "Не вышло получить данные с АТС.");
	Элементы.РезультатТеста.Видимость = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, врРезультатТеста);
	Модифицированность = Истина;
	Если врРезультатТеста.Свойство("ТекстDOM") Тогда
		ЗагрузитьИзФайлаНаСервере(врРезультатТеста.ТекстDOM);
		ОбновитьИнтерфейс();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Получаем историю звонков с АТС.
// 
Процедура ПолучитьCDR(Команда)
	Если НЕ ИспользоватьМодульСтатистики Тогда Возврат;	КонецЕсли; 
	Попытка
		врМИКО_стСлужебный = Вычислить("МИКО_стСлужебный");
	Исключение
		Возврат;
	КонецПопытки; 
	врМИКО_стСлужебный.реглПолучитьПакетИсторииСAsterisk();
КонецПроцедуры

&НаКлиенте
// Обновление КИ в документах истории.
// 
Процедура СинхронизироватьКИ(Команда)
	Если НЕ ИспользоватьМодульСтатистики Тогда Возврат;	КонецЕсли; 
	Попытка
		врМИКО_стОбработкаКонтактнойИнформации = Вычислить("МИКО_стОбработкаКонтактнойИнформации");
	Исключение
		Возврат;
	КонецПопытки; 
	врМИКО_стОбработкаКонтактнойИнформации.ОбновитьКИВДокументахИстории();
	врМИКО_стОбработкаКонтактнойИнформации.ОбновитьКИВДокументахИстории12м();
КонецПроцедуры

&НаКлиенте
// Сопоставление документа "Событие" с документами истории.
// 
Процедура СинхронизироватьСобытия(Команда)
	Если НЕ ИспользоватьМодульСтатистики Тогда Возврат;	КонецЕсли; 
	Попытка
		врМИКО_стСлужебный = Вычислить("МИКО_стСлужебный");
	Исключение
		Возврат;
	КонецПопытки; 
	врМИКО_стСлужебный.реглСопоставитьДокументЗвонкаСсобытием();
КонецПроцедуры

///
// Регистрация лицензии
///

&НаКлиенте
// Обновляем информацию по ключу защиты.
// 
Процедура ОбовитьСтатусЛицензии(ИнформацияПоКлючамЗащиты)
	// Пример отображения статуса лицензии МИКО.	
	
	врСтатус=""; врТекстЛицензии="";
	// 	
	// Sentinel HASP.
	Если ЗначениеЗаполнено(ИнформацияПоКлючамЗащиты.HASP_РегистрационныйНомер) Тогда
		врТекстЛицензии = врТекстЛицензии + "*********************************************************************************************"+ Символы.ПС;
		врТекстЛицензии = врТекстЛицензии + " Sentinel HASP License"+ Символы.ПС;
		врТекстЛицензии = врТекстЛицензии + "*********************************************************"+ Символы.ПС;
		Если ИнформацияПоКлючамЗащиты.HASP_ОстатокДнейЛицензии<0 Тогда
			ДатаОкончания   = ТекущаяДата() + 60*60*24*ИнформацияПоКлючамЗащиты.HASP_ОстатокДнейЛицензии;
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.HASP_РегистрационныйНомер+"'." + Символы.ПС;
			врТекстЛицензии = врТекстЛицензии + "Срок действия лицензии истек "+Формат(ДатаОкончания, "ДЛФ=DD")+".";
		ИначеЕсли ИнформацияПоКлючамЗащиты.HASP_ОстатокДнейЛицензии=0 Тогда	
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.HASP_РегистрационныйНомер+"'.";
		Иначе
			ДатаОкончания = ТекущаяДата() + 60*60*24*ИнформацияПоКлючамЗащиты.HASP_ОстатокДнейЛицензии;
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.HASP_РегистрационныйНомер+"'." + Символы.ПС;
			врТекстЛицензии = врТекстЛицензии + "Действует до " + Формат(ДатаОкончания, "ДЛФ=DD")+".";
		КонецЕсли; 
		врТекстЛицензии = врТекстЛицензии + Символы.ПС + Символы.ПС;
		врСтатус = врТекстЛицензии; 
	КонецЕсли; 
	
	ПродуктНайденВКлюче = Ложь;
	// МИКО SaaS License.
	Если ЗначениеЗаполнено(ИнформацияПоКлючамЗащиты.РегистрационныйНомер) Тогда
		врТекстЛицензии = врТекстЛицензии + "*********************************************************************************************"+ Символы.ПС;
		врТекстЛицензии = врТекстЛицензии + " MIKO SaaS License"+ Символы.ПС;
		врТекстЛицензии = врТекстЛицензии + "*********************************************************"+ Символы.ПС;
		Если ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии<0 Тогда
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.РегистрационныйНомер+"'.";
			врСтатус=врТекстЛицензии + Символы.ПС;
			
			ДатаОкончания = ТекущаяДата() + 60*60*24*ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии;
			врТекстЛицензии=врСтатус + "Срок действия лицензии истек "+Формат(ДатаОкончания, "ДЛФ=DD")+".";
			врСтатус=врТекстЛицензии + Символы.ПС;
		ИначеЕсли Не ЗначениеЗаполнено(ИнформацияПоКлючамЗащиты.РегистрационныйНомер) Тогда
			врТекстЛицензии = врТекстЛицензии + "Лицензия не найдена или не активирована.";
			врСтатус=врТекстЛицензии + Символы.ПС;
		ИначеЕсли ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии=0 Тогда	
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.РегистрационныйНомер+"'.";
			врСтатус=врТекстЛицензии + Символы.ПС;
		Иначе
			ДатаОкончания = ТекущаяДата() + 60*60*24*ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии;
			врТекстЛицензии = врТекстЛицензии + "Регистрационный номер '"+ИнформацияПоКлючамЗащиты.РегистрационныйНомер+"'.";
			врСтатус= врТекстЛицензии + Символы.ПС;
			врСтатус=врСтатус+ "Действует до " + Формат(ДатаОкончания, "ДЛФ=DD")+"" + Символы.ПС;
		КонецЕсли; 		
		
		Если ИнформацияПоКлючамЗащиты.Свойство("ТипЛицензии") Тогда
			врСтатус=врСтатус +"Тип лицензии: "+ИнформацияПоКлючамЗащиты.ТипЛицензии+ Символы.ПС;
		КонецЕсли;
		врСтатус=врСтатус + Символы.ПС;
		
		ДополнительнаяИнформация = Новый Структура;
		ДоступныеФункции		 = Новый Соответствие;
		Если ИнформацияПоКлючамЗащиты.Свойство("ДополнительнаяИнформация", ДополнительнаяИнформация)
			 И ДополнительнаяИнформация.Количество()>0 Тогда
			врСтатус=врСтатус+"Организация: '"+ДополнительнаяИнформация.companyname+"'" + Символы.ПС;
		 	врСтатус=врСтатус+"ФИО контактного лица: '"+ДополнительнаяИнформация.contact+"'" + Символы.ПС;
		 	врСтатус=врСтатус+"Email: '"+ДополнительнаяИнформация.email+"'" + Символы.ПС;
		 	врСтатус=врСтатус+"Телефон: '"+ДополнительнаяИнформация.tel+"'" + Символы.ПС;
			врСтатус=врСтатус + Символы.ПС;
			ВидимостьВкладкиАктивация = Ложь;
		КонецЕсли; 		
		
		version=""; ИнформацияПоКлючамЗащиты.Свойство("version",version);
		Если ЗначениеЗаполнено(version) Тогда 
		// Новый формат оповещения.
			Продукты = Новый Массив;
			ДополнительнаяИнформация.Свойство("Продукты",Продукты);
			Если ТипЗнч(Продукты) = Тип("Массив") И Продукты.Количество()>0 Тогда
				Для каждого Продукт Из Продукты Цикл
					Если Продукт.id = ИдентификаторПродукта Тогда
						ПродуктНайденВКлюче = Истина;
					КонецЕсли; 
					врСтатус=врСтатус + "" + Продукт.name;
					Если ЗначениеЗаполнено(Продукт.expired) Тогда
						врПрефикс = ?(Продукт.expired < ТекущаяДата(), ". Срок действия истек ", ". Действует до ");
						врСтатус=врСтатус + врПрефикс + Формат(Продукт.expired, "ДЛФ=DD")+"";
					КонецЕсли; 
					врСтатус=врСтатус+Символы.ПС;
					
					Для каждого feature Из Продукт.feature Цикл
						врСтатус=врСтатус + Символы.Таб+"- "+feature.name+": Всего '"+feature.count+"', Используется '"+feature.captured+"'"+ Символы.ПС;
					КонецЦикла; 
					врСтатус=врСтатус + Символы.ПС;
				КонецЦикла; 
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ДополнительнаяИнформация) = Тип("Структура") Тогда	
			Продукты 			= Новый Массив;
			ДополнительнаяИнформация.Свойство("Продукты",		  Продукты);
			ДополнительнаяИнформация.Свойство("ДоступныеФункции", ДоступныеФункции);
			Если ТипЗнч(Продукты) = Тип("Массив") И Продукты.Количество()>0 Тогда
				врСтатус=врСтатус+"Продукты:" + Символы.ПС;
				Для каждого Продукт Из Продукты Цикл
					врСтатус=врСтатус + Символы.Таб + "- " + Продукт + Символы.ПС;
				КонецЦикла; 
				врСтатус=врСтатус + Символы.ПС;
			КонецЕсли; 
			
			ЗахваченныеЛицензии = Новый Соответствие;
			ДополнительнаяИнформация.Свойство("ЗахваченныеЛицензии",ЗахваченныеЛицензии);
			Если ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии>=0 И ДоступныеФункции <> Неопределено Тогда
				врСтатус=врСтатус+"Детали лицензии:" + Символы.ПС;
				Для каждого врФункция Из ДоступныеФункции Цикл
					врИспользуется = ?(ТипЗнч(ЗахваченныеЛицензии)=Тип("Соответствие"),ЗахваченныеЛицензии.Получить(врФункция.Ключ),0);
					врСтатус=врСтатус+ Символы.Таб + "- "+врФункция.Ключ+": Всего '"+врФункция.Значение+"', Используется '"+?(врИспользуется=Неопределено,0,врИспользуется)+"'" + Символы.ПС
				КонецЦикла; 	
			КонецЕсли; 	
		КонецЕсли; 
		
	КонецЕсли; 
	Элементы.грРегистрация.Видимость = (ПродуктНайденВКлюче = Ложь); 
	
	Если ЗначениеЗаполнено(врСтатус) Тогда
		СостояниеКлючаЗащиты = СокрЛП(врСтатус);
	Иначе	
	    СостояниеКлючаЗащиты = "Не найден ключ защиты на продукт ""Панель телефонии для 1С"".";
	КонецЕсли; 
КонецПроцедуры


&НаСервере
// Дополнительно // Видимость и доступность элементов формы.
// 
Процедура УстановитьВидимостьПоВидуЮрФизЛицо()
	Если ЮрЛицо = Истина Тогда
		Элементы.ИНН.Видимость = Истина;
		Элементы.НаименованиеКомпании.Видимость = Истина;
	Иначе	
		Элементы.ИНН.Видимость = Ложь;
		Элементы.НаименованиеКомпании.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
// Обновим отображение элементов на форме.
// 
Процедура ЮрЛицоПриИзменении(Элемент)
	УстановитьВидимостьПоВидуЮрФизЛицо();
КонецПроцедуры

&НаКлиенте
// Регистрация клиента в системе.
// 
Процедура Зарегистрировать(Команда)	
	дСтатусРегистрацииКлюча = "";
	врСообщение = "";
	ЭтоНовыйКлиент = (Элементы.грСтраницы.ТекущаяСтраница = Элементы.грРегистрация);
	
	Если НЕ КонтрольЗаполненияПолей(врСообщение) Тогда
		ПоказатьСообщение(врСообщение);
		Возврат;
	КонецЕсли; 
	
	Если ЭтоНовыйКлиент = Истина Тогда
		Данные = Новый Структура;
		Данные.Вставить("sLicenseKey", 	КлючЗащиты);
		Данные.Вставить("sContact", 	ФИОКонтактногоЛица);
		Данные.Вставить("sCompanyname", ?(ЗначениеЗаполнено(НаименованиеКомпании), НаименованиеКомпании, ФИОКонтактногоЛица));
		Данные.Вставить("sEmail", 		ЭлектронныйАдрес);
		Данные.Вставить("sTel", 		НомерТелефона);
		Данные.Вставить("sDescription", Комментарий);
		Данные.Вставить("INN",			ИНН);
		Данные.Вставить("ЮрЛицо",		ЮрЛицо);

		Оповестить("MIKO_GetSetTrialLicense_stat", Данные, ЭтаФорма);
	Иначе
		Оповестить("MIKO_GetSetTrialLicense_stat", КлючЗащиты, ЭтаФорма);
		КонтрольРегистрации = Истина;
		Оповестить("MIKO_ActivateCoupone_stat", КлючКупон, ЭтаФорма);
	КонецЕсли; 

КонецПроцедуры

// Проеряем заполнение
//
&НаКлиенте
Функция КонтрольЗаполненияПолей(врСообщение)
	врСообщение = "";
	ПоляКПроверке = Новый Соответствие;
	
	Если ЭтоНовыйКлиент = Истина Тогда
		Если ЮрЛицо = Истина Тогда
			ПоляКПроверке.Вставить("ИНН", 		 			"Введите ИНН юридического лица.");
			ПоляКПроверке.Вставить("НаименованиеКомпании", 	"Введите наименование ораганизации.");
			ПоляКПроверке.Вставить("ФИОКонтактногоЛица", 	"Введите ФИО контактного лица.");
			ПоляКПроверке.Вставить("НомерТелефона", 		"Укажите контактный номер телефона.");
			ПоляКПроверке.Вставить("ЭлектронныйАдрес", 		"Укажите адрес электронной почты.");
		Иначе	
			ПоляКПроверке.Вставить("ФИОКонтактногоЛица", 	"Введите ФИО контактного лица.");
			ПоляКПроверке.Вставить("НомерТелефона", 		"Укажите контактный номер телефона.");
			ПоляКПроверке.Вставить("ЭлектронныйАдрес", 		"Укажите адрес электронной почты.");
		КонецЕсли; 
	Иначе
		ПоляКПроверке.Вставить("КлючЗащиты", 			"Введите регистрационный номер клиента клиента.");
	КонецЕсли; 

	Для каждого ИмяПоля Из ПоляКПроверке Цикл
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[ИмяПоля.Ключ]) Тогда
		  	врСообщение = врСообщение + ИмяПоля.Значение + Символы.ПС;
		ИначеЕсли ИмяПоля.Ключ = "ЭлектронныйАдрес" Тогда 
			адрес = ЭтаФорма[ИмяПоля.Ключ];
			ВерныйФормат = Найти(адрес, "@")>1; 
			ВерныйФормат = МИН(ВерныйФормат, Найти(адрес, ".")>1);
			Если НЕ ВерныйФормат Тогда
		  		врСообщение = врСообщение + "Не вверный формат электронной почты """+адрес+"""." + Символы.ПС;
			КонецЕсли; 
		ИначеЕсли ИмяПоля.Ключ = "НомерТелефона" Тогда 
			Телефон = ЭтаФорма[ИмяПоля.Ключ];
			Если СтрДлина(Телефон) < 5 Тогда
		  		врСообщение = врСообщение + "Не вверный формат номера телефона """+Телефон+"""." + Символы.ПС;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат НЕ ЗначениеЗаполнено(врСообщение); 	
КонецФункции // КонтролльЗаполненияПолей()

&НаКлиенте
// Вывод пользователю информационного сообщения.
// 
Процедура ПоказатьСообщение(пТекст)
	Если НЕ ЗначениеЗаполнено(пТекст) Тогда
		Возврат;	
	КонецЕсли; 
	дСтатусРегистрацииКлюча = пТекст
КонецПроцедуры

&НаКлиенте
// Проверка корректности введенных данных.
// 
Процедура КлючКупонПриИзменении(Элемент)
	Если Найти(КлючКупон, "MIKOUPD-")<>1 Тогда
	 	КлючКупон = "";
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("""Введен не корректный код купона.""");
		Возврат;
	КонецЕсли; 
КонецПроцедуры

///
// Заполнение формы регистрации.

&НаКлиенте
// Обработка выбора органиции для заполнения формы регистрации.
// 
Процедура НаименованиеКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ПроверитьОрганизацию() Тогда
		СписокОрганизаций = ПолучитьСписокОрганизаций();
		
		Если ВерсияПлатформы = "8.3" Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ВыборОрганизации"", ЭтаФорма)");
			Попытка
				Выполнить("ПоказатьВыборИзСписка(ОповещениеОбработкиВыбора,СписокОрганизаций,Элемент)");
			Исключение
				Возврат;
			КонецПопытки; 
			
		ИначеЕсли ВерсияПлатформы = "8.2" Тогда
			ВыбратьИзСписка(СписокОрганизаций,Элемент);			
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
// Получаем список выбора организаций.
// 
Функция ПолучитьСписокОрганизаций()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	массОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокОрганизаций = Новый СписокЗначений; 
	СписокОрганизаций.ЗагрузитьЗначения(массОрганизации);
	Возврат СписокОрганизаций;
КонецФункции // ПолучитьСписокОрганизаций()
 
&НаКлиенте
// Обработчик выбора организации
// 
Процедура ВыборОрганизации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ВыполнитьЗаполнениеСервер(ВыбранноеЗначение.Значение);
КонецПроцедуры

&НаСервере
// Заполнение формы по данным организации.
// Параметры:
//   СсылкаНаОрганизацию - Ссылка на элемент справочника "Организации".
// 
Процедура ВыполнитьЗаполнениеСервер(СсылкаНаОрганизацию = Неопределено)
	ПараметрыОрганизации = Неопределено;
	Если НЕ ПроверитьОрганизацию(СсылкаНаОрганизацию, ПараметрыОрганизации) Тогда
		// не нашли организацию.
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура("ФИОКонтактногоЛица,НаименованиеКомпании,ИНН,НомерТелефона,ЭлектронныйАдрес,Комментарий");
	
	// Заполним основные сведения об организиции	
	ДанныеЗаполнения = Новый Структура("Наименование,НаименованиеПолное,ИНН");
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СсылкаНаОрганизацию);
	Данные.Вставить("НаименованиеКомпании", ?(ЗначениеЗаполнено(ДанныеЗаполнения.НаименованиеПолное),ДанныеЗаполнения.НаименованиеПолное,ДанныеЗаполнения.Наименование));
	Данные.Вставить("ИНН",			ДанныеЗаполнения.ИНН);
	
	Если ПараметрыОрганизации.ЕстьТаблицаКИ = Истина Тогда
		пТелефон = ПредопределенноеЗначение(("Перечисление.ТипыКонтактнойИнформации.Телефон"));
		пЭлАдрес = ПредопределенноеЗначение(("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		пАдрес 	 = ПредопределенноеЗначение(("Перечисление.ТипыКонтактнойИнформации.Адрес"));
		
		ИскомыеТипы = Новый Массив;
		ИскомыеТипы.Добавить(пТелефон);
		ИскомыеТипы.Добавить(пЭлАдрес);
		ИскомыеТипы.Добавить(пАдрес);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОрганизацииКонтактнаяИнформация.Тип,
			|	ОрганизацииКонтактнаяИнформация.Представление
			|ИЗ
			|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
			|ГДЕ
			|	ОрганизацииКонтактнаяИнформация.Тип В(&ИскомыеТипы)";
		
		Запрос.УстановитьПараметр("ИскомыеТипы", ИскомыеТипы);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Тип = пТелефон Тогда
				Данные.Вставить("НомерТелефона", 		Выборка.Представление);
			ИначеЕсли Выборка.Тип = пЭлАдрес Тогда	
				Данные.Вставить("ЭлектронныйАдрес",		Выборка.Представление);
			ИначеЕсли Выборка.Тип = пАдрес Тогда	
				Данные.Вставить("Комментарий",	Выборка.Представление);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	Данные.Вставить("ФИОКонтактногоЛица",		ИмяПользователя());
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Данные);
КонецПроцедуры // ВыполнитьЗаполнениеСервер()

&НаСервере
// Проверка / подготовка данных к заполнению.
//
Функция ПроверитьОрганизацию(СсылкаНаОрганизацию = Неопределено, ПараметрыОрганизации = Неопределено)
	ПараметрыОрганизации = Новый Структура;
	ПараметрыОрганизации.Вставить("СправочникСуществует", 			Ложь);
	ПараметрыОрганизации.Вставить("ЕстьТаблицаКИ", 					Ложь);
	                                            
	мОрганизации = Метаданные.Справочники.Найти("Организации");
	Если мОрганизации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	ПараметрыОрганизации.Вставить("СправочникСуществует", 	Истина);
	
	Если НЕ мОрганизации.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		ПараметрыОрганизации.Вставить("ЕстьТаблицаКИ", 		Истина);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОрганизацию) Тогда
	  	СсылкаНаОрганизацию = Справочники["Организации"].НайтиПоНаименованию("");
	КонецЕсли; 
	Возврат ЗначениеЗаполнено(СсылкаНаОрганизацию);
КонецФункции 

&НаКлиенте
// Отображение предупреждения о не заполненном рег. номере.
// 
Процедура грСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Элементы.ДекорацияПредупреждениеНетРегНомера.Видимость = НЕ ЗначениеЗаполнено(КлючЗащиты);
КонецПроцедуры

&НаКлиенте
// Установка регистрационного номера МИКО для профилей.
// 
Процедура КлючЗащитыПриИзменении(Элемент)
	КлючЗащиты = СокрЛП(КлючЗащиты);
	
	НеСохранятьРегНомер = Ложь;
	Если Найти(КлючЗащиты, "MIKOUPD")>0 Тогда
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("""Для активации купона """+КлючЗащиты+""" необходимо выполнить регистрацию продукукта. Активация купона выполняется на вкладке ""Применить купон"".""");
		НеСохранятьРегНомер = Истина;
		КлючКупон  = КлючЗащиты;
		КлючЗащиты = "";
	КонецЕсли; 

	Если ЗначениеЗаполнено(КлючЗащиты) И Найти(КлючЗащиты, "MIKO-")<>1 Тогда
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("""Введен не корректный регистрационный номер - """+КлючЗащиты+""".""");
		КлючЗащиты = "";
		НеСохранятьРегНомер = Истина;
	КонецЕсли; 
	
	// MIKO-XXX
	Оповестить("MIKO_GetSetTrialLicense_stat", КлючЗащиты, ЭтаФорма);
	Элементы.грРегистрация.Видимость = НЕ ЗначениеЗаполнено(КлючЗащиты); 
	///
	// Регистрация лицензии
	Оповестить("MIKO_RefreshLicense_stat", Неопределено, ЭтаФорма);
	СохранятьНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияЛицензирования(Команда)
	КлючЗащитыПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КореньСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.КореньСтраниц.ТекущаяСтраница = Элементы.СтраницаRegLic Тогда
		
		Если НЕ ЗначениеЗаполнено(АдресАрхиваКомпонента) Тогда
			АдресАрхиваКомпонента = ПолучитьАдресВК();
			// Пробуем подключить компоненту защиты.
			ПодключитьКомпоненту();
		КонецЕсли; 
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьАдресВК()

	АдресАрхиваКомпонента = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("МИКОст_КомпонентРегистрацииПродукта"), Новый УникальныйИдентификатор);
   	Возврат АдресАрхиваКомпонента;
	
КонецФункции // ПолучитьАдресВК()

&НаКлиенте
// Установка компонента защиты конфигурации.
// 
Процедура УстановитьКомпоненту()
	Если БылаПопыткаУстановки = Истина Тогда
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("'Не вышло установить компоненту!");
		Возврат;	
	КонецЕсли; 	
	
	// Инициализируем и подключим компоненту защиты для работы с лицензированием.
	Если ВерсияПлатформы = "8.3" Тогда
		Попытка
			Описание = Вычислить("Новый ОписаниеОповещения(""ОповещениеОбУстановкеКомпонента"", ЭтаФорма, Неопределено)");
			Выполнить("НачатьУстановкуВнешнейКомпоненты(Описание,АдресАрхиваКомпонента)");
		Исключение
			Комнонент = Неопределено;
		КонецПопытки;
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		Попытка
			УстановитьВнешнююКомпоненту(АдресАрхиваКомпонента);
		Исключение
			Комнонент = Неопределено;
		КонецПопытки;
		ПодключитьКомпоненту();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения об установке компонента
// 
Процедура ОповещениеОбУстановкеКомпонента(Парам) Экспорт
	
	ПодключитьКомпоненту();
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения об установке компонента
// 
Процедура ОповещениеОПодключенииКомпонента(Подключено, ИмяКомпонента) Экспорт
	Если Подключено = Истина Тогда
		_ИнициализироватьКомпонент();
	Иначе
		УстановитьКомпоненту();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Подключение компонента.
// 
Процедура ПодключитьКомпоненту() 
	
	Если ВерсияПлатформы = "8.3" Тогда
		Попытка  
			Описание = Вычислить("Новый ОписаниеОповещения(""ОповещениеОПодключенииКомпонента"", ЭтаФорма, ""MIKO_Protection1C"")");
			Выполнить("НачатьПодключениеВнешнейКомпоненты(Описание, АдресАрхиваКомпонента, ""MIKO_Protect"" ,ТипВнешнейКомпоненты.Native)");
		Исключение
			Компонент = Неопределено;
		КонецПопытки;
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		Результат = ПодключитьВнешнююКомпоненту(АдресАрхиваКомпонента,"MIKO_Protect",ТипВнешнейКомпоненты.Native);
		Если Результат = Ложь Тогда
			УстановитьКомпоненту();
			Возврат;
		КонецЕсли; 
		_ИнициализироватьКомпонент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
// Создание объекта компонента
// 
Процедура _ИнициализироватьКомпонент()

	Попытка
		Компонент = Новый ("AddIn.MIKO_Protect.MIKO_Registration1C");
		// Компонент = Новый ("AddIn.MIKO_Protect.MIKO_Protection1C");
	Исключение
		Компонент = Неопределено;
	КонецПопытки;
	
	Если Компонент <> Неопределено Тогда
		Оповестить("MIKO_GetSetTrialLicense_stat", КлючЗащиты, ЭтаФорма);
		
		Если ВыполненGetLicense = Ложь Тогда
			СостояниеКлючаЗащиты = "Получение информации по лицензированию..."; 
			Оповестить("MIKO_RefreshLicense_stat",Неопределено, ЭтаФорма);
			ВыполненGetLicense = Истина;
			ВыполнитьЗаполнениеСервер();
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
// Получение временной лицензии на 30 деней. 
//
Процедура GetTrialLicense(Данные)
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Попытка
		врМИКО_стСлужебный = Вычислить("МИКО_стСлужебный");
	Исключение
		Возврат;
	КонецПопытки; 
	
	// <reginfo>
	//|<param name = "Companyname" value = "МИКО ООО" / >
	//|<param name = "Contact" value = "Бекетов Николай" / >
	//|<param name = "Email" value = "nbek@mko.ru" / >
	//|<param name = "Telefone" value = "+79265244742" / >
	//|<param name = "INN" value = "773512312" / >
	//|<param name = "TypeOPF" value = "org" / >
	//|<param name = "Description" value = "Активация из 1С" / >
	//< / reginfo>
	врПараметры = Новый Структура("sLicenseKey,sContact,sCompanyname,sEmail,sTel,sDescription,ЮрЛицо,INN");
	ЗаполнитьЗначенияСвойств(врПараметры, Данные);

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Contact", 	врПараметры.sContact);
	СтруктураПараметров.Вставить("Companyname", врПараметры.sCompanyname);
	СтруктураПараметров.Вставить("Email", 		врПараметры.sEmail);
	СтруктураПараметров.Вставить("Telefone", 	врПараметры.sTel);
	СтруктураПараметров.Вставить("Description", врПараметры.sDescription);
	СтруктураПараметров.Вставить("TypeOPF", 	?(врПараметры.ЮрЛицо = Истина, "org", "ind"));
	СтруктураПараметров.Вставить("INN", 		врПараметры.INN);  		
	  	
	Данные = "<reginfo>";
	Для каждого ТекПараметр Из СтруктураПараметров Цикл
		Если ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
			Данные = Данные+Символы.ПС+"<param name="""+ТекПараметр.Ключ+""" value="""+ЭкранироватьСпецСимволыXML(ТекПараметр.Значение)+"""/>";
		КонецЕсли; 
	КонецЦикла; 
	Данные = Данные+Символы.ПС+"</reginfo>";
	Данные = врМИКО_стСлужебный.URLEncode(Данные);
	
	Результат = "";
	
	Если ВерсияПлатформы = "8.3" Тогда
		Попытка
			ОпОп = Вычислить("Новый ОписаниеОповещения(""ОповещениеОВыполненииМетода"", ЭтаФорма, ""GetTrialLicense"")");
			Компонент.BeginCallingGetTrialLicense(ОпОп, ИдентификаторПродукта, Данные, Результат);
		Исключение
		КонецПопытки; 	
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		Попытка
			Компонент.GetTrialLicense(ИдентификаторПродукта, Данные, Результат);
			ОтработанаУспешно = Истина;
		Исключение
			ОтработанаУспешно = Ложь;
		КонецПопытки; 
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Оповестить("MIKOLIC_Trial", Результат, "");
			GetSetTrialLicense(""+Результат);
		Иначе
			Оповестить("MIKOLIC_Trial_Error", Результат, "");
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры // GetTrialLicense()

&НаКлиенте
// Получение временной лицензии на 30 деней. 
//
Процедура УстановкаПолучениеЛицензии(Параметр)
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Если Компонент <> Неопределено Тогда
			
			Если ВерсияПлатформы = "8.3" Тогда
				Попытка
					Компонент.BeginSettingMikoLicense(, Параметр);
				Исключение
				КонецПопытки;
			ИначеЕсли ВерсияПлатформы = "8.2" Тогда
				Попытка
					Компонент.MikoLicense	= Параметр;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
	Иначе	
		GetTrialLicense(Параметр);		
	КонецЕсли;
КонецПроцедуры // GetTrialLicense()

&НаКлиенте 
// Получить информацию о ключах HASP доступных текущей панели.
// Параметры
//   Нет
// Возвращаемое значение
//   Неопределено - если не вышло соедениться с драйвером защиты или если компонент не инирциализирован.
//   ТаблицаКлючей- тип ТаблицаЗначений, колнки id (тип - строка),license_type (тип - строка),count_days (тип - число).
// 
Процедура ПолучитьТаблицуКлючейЗащиты()
	
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекстЛицензий = ""; Результат="";
	
	Если ВерсияПлатформы = "8.3" Тогда
		Попытка	
			ОпОп = Вычислить("Новый ОписаниеОповещения(""ОповещениеОВыполненииМетода"", ЭтаФорма, ""GetLicenseInfo"")"); 
			Компонент.BeginCallingGetLicenseInfo(ОпОп, Результат);
		Исключение
		КонецПопытки;
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		Попытка
			Компонент.GetLicenseInfo(Результат);
			ОбработатьGetLicenseInfo(Результат);
		Исключение
		КонецПопытки; 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения об установке компонента
// 
Процедура ОповещениеОВыполненииМетода(Результат, ПараметрыВызова, ИмяМетода) Экспорт
	
	ВГраница = ПараметрыВызова.ВГраница();
	Если ВГраница = -1 Тогда
	  	// ошибка
		Возврат;
	КонецЕсли; 

	РезультатРаботыКоманды = ПараметрыВызова[ВГраница];
	Если ИмяМетода = "GetLicenseInfo" Тогда
		ОбработатьGetLicenseInfo(РезультатРаботыКоманды);
		// Не обрабатываем дальше.
		Возврат;
	ИначеЕсли ИмяМетода = "GetTrialLicense" Тогда
		Если ЗначениеЗаполнено(Результат) Тогда
			Оповестить("MIKOLIC_Trial", РезультатРаботыКоманды, "");
			Оповестить("MIKO_GetSetTrialLicense_stat",РезультатРаботыКоманды, ЭтаФорма);
		Иначе
			Оповестить("MIKOLIC_Trial_Error", РезультатРаботыКоманды, "");
		КонецЕсли;
	ИначеЕсли ИмяМетода = "ActivateCoupone" Тогда
		Оповестить("MIKOLIC_Coupone", РезультатРаботыКоманды, "");
	ИначеЕсли ИмяМетода = "SendMetrika" Тогда
		// Не обрабатываем дальше.
		Возврат;	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
// Обработка ответа сервера лицензирования.
// 
Процедура ОбработатьGetLicenseInfo(Результат)
	ИнформацияПоКлючамЗащиты = ИнформацияПоКлючамЗащиты(Результат);
	ОбновитьТекстЛицензии(ИнформацияПоКлючамЗащиты);
	СведенияОЛицензировании = Новый Структура;
	
	Если ИнформацияПоКлючамЗащиты = Неопределено Тогда
		СведенияОЛицензировании.Вставить("ТипЛицензии",			"");
		СведенияОЛицензировании.Вставить("РегистрационныйНомер",	"");
	Иначе
		Если ЗначениеЗаполнено(ИнформацияПоКлючамЗащиты.РегистрационныйНомер) Тогда
			ТипЛицензии 		= ИнформацияПоКлючамЗащиты.ТипЛицензии;
			РегистрационныйНомер= ИнформацияПоКлючамЗащиты.РегистрационныйНомер;
		Иначе
			ТипЛицензии 		= ИнформацияПоКлючамЗащиты.HASP_ТипЛицензии;
			РегистрационныйНомер= ИнформацияПоКлючамЗащиты.HASP_РегистрационныйНомер;
		КонецЕсли;
		СведенияОЛицензировании.Вставить("ТипЛицензии",			 ТипЛицензии);
		СведенияОЛицензировании.Вставить("РегистрационныйНомер", РегистрационныйНомер);
	КонецЕсли; 
	
	Если ОтправилиМетрику = Ложь Тогда
		// SendMetrikaStat("", Компонент);
		ОтправилиМетрику = Истина;
	КонецЕсли; 
					
КонецПроцедуры
 
&НаКлиенте
// Активация купона.
// 
Процедура ActivateCoupone(sCoupone)
	Если НЕ ЗначениеЗаполнено(sCoupone) Тогда
	  	Возврат;
	КонецЕсли; 
	
	Если Компонент = Неопределено Тогда 	
		Возврат;
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("sCoupone", Строка(sCoupone));
	СтруктураПараметров.Вставить("result", "");

	Если ВерсияПлатформы = "8.3" Тогда
		Попытка	
			ОпОп = Вычислить("Новый ОписаниеОповещения(""ОповещениеОВыполненииМетода"", ЭтаФорма, ""ActivateCoupone"")"); 
			Компонент.BeginCallingActivateCoupone(ОпОп, СтруктураПараметров.sCoupone, СтруктураПараметров.result);
		Исключение
		КонецПопытки;
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		ActivateCoupone82(sCoupone);
	КонецЕсли;

КонецПроцедуры // ActivateCoupone()

&НаКлиенте
// Активация купона.
// 
Функция ActivateCoupone82(sCoupone) 
	Если НЕ ЗначениеЗаполнено(sCoupone) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Компонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("sCoupone", Строка(sCoupone));
	СтруктураПараметров.Вставить("result", "");

	Попытка
		Компонент.ActivateCoupone(СтруктураПараметров.sCoupone, СтруктураПараметров.result);
		ОтработанаУспешно = Истина;
	Исключение
		ОтработанаУспешно = Ложь;
	КонецПопытки; 
	Оповестить("MIKOLIC_Coupone", СтруктураПараметров.result, "");

	Возврат ОтработанаУспешно;
КонецФункции // ActivateCoupone()

&НаКлиенте
// Получение пробного ключа / установка значения ключа
// 
Процедура GetSetTrialLicense(Параметр)
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Если Компонент <> Неопределено Тогда
			УстановкаПолучениеЛицензии(Параметр); 
		КонецЕсли;
	Иначе	
		GetTrialLicense(Параметр);		
	КонецЕсли; 
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭкранироватьСпецСимволыXML(Знач ИсхСтрока)
	Результат = ИсхСтрока;
	Результат = СтрЗаменить(Результат, "&"," ");
	Результат = СтрЗаменить(Результат, """","&quot;");
	Результат = СтрЗаменить(Результат, "'","&apos;");	
	Результат = СтрЗаменить(Результат, "<","&lt;");	
	Результат = СтрЗаменить(Результат, ">","&gt;");	
	
	Возврат Результат;
КонецФункции // ЭкранироватьСпецСимволыXML()

&НаКлиентеНаСервереБезКонтекста 
Функция ОтменитьЭкранированиеСпецСимволовXML(Знач ИсхСтрока)
	Результат = ИсхСтрока;
	Результат = СтрЗаменить(Результат,"&quot;", """");	
	Результат = СтрЗаменить(Результат,"&apos;", "'");	
	Результат = СтрЗаменить(Результат,"&lt;", "<");	
	Результат = СтрЗаменить(Результат,"&gt;", ">");	
	Результат = СтрЗаменить(Результат,"&amp;", "&");	
	
	Возврат Результат;
КонецФункции // ОтменитьЭкранированиеСпецСимволовXML()
 
&НаСервере  
// Функция парсит ответ сервера
// возвращет результат сбора информации в виде структуры.
Функция ИнформацияПоКлючамЗащиты(Знач Результат)
	//Результат = Результат + "<licenseinfo activated='true' key='MIKO-XXXXX-XXXXX-XXXXX-XXXXX' expired='' companyname='ООО «МИКО»' contact='' email='help@miko.ru' tel='+74952293042'>
	//| 	<availablefeatures>
	//|		<feature name='SDK 1C+Asterisk' count='255' counteach='USER' />
	//|		<feature name='SDK 1C+SIP' count='255' counteach='USER' />
	//|	</availablefeatures>
	//|	<capturedfeatures>
	//|	</capturedfeatures>
	//| </licenseinfo>"; //.
	// 1. Производим парсинг - перечень страниц
    ЧтениеHTML 	 	= Новый ЧтениеHTML;	
    ПостроительDOM 	= Новый ПостроительDOM; 
    Попытка
        ЧтениеHTML.УстановитьСтроку(Результат);
        ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);
    Исключение
    КонецПопытки;
	
	ОтветСервера = Новый Структура("version,ОстатокДнейЛицензии,ТипЛицензии,РегистрационныйНомер,ДополнительнаяИнформация,HASP_ОстатокДнейЛицензии,HASP_ТипЛицензии,HASP_РегистрационныйНомер,HASP_ДополнительнаяИнформация","",-1,"","",Новый Структура,-1,"","",Новый Структура);

	// ПОДГОТОВКА ОТВЕТА
	ОтветСервераМИКО = ПолучитьСведенияПоКлючамЗащитыМИКО(ДокументDOM);
	ОтветСервераHASP = ПолучитьСведенияSentinelHasp(ДокументDOM);	
	ЗаполнитьЗначенияСвойств(ОтветСервера, ОтветСервераМИКО);
	ЗаполнитьЗначенияСвойств(ОтветСервера, ОтветСервераHASP);
		
	Возврат ОтветСервера;
КонецФункции

&НаСервере  
Функция ПолучитьСведенияSentinelHasp(ДокументDOM)
	ОтветСервера = Новый Структура("HASP_ОстатокДнейЛицензии,HASP_ТипЛицензии,HASP_РегистрационныйНомер,HASP_ДополнительнаяИнформация",-1,"","",Новый Структура);

	ТаблицаКлючей = Новый ТаблицаЗначений;
	ТаблицаКлючей.Колонки.Добавить("id");
	ТаблицаКлючей.Колонки.Добавить("feature_id");
	ТаблицаКлючей.Колонки.Добавить("license_type");
	ТаблицаКлючей.Колонки.Добавить("count_days");
	ТаблицаКлючей.Колонки.Добавить("type");
	
	// Получить перечень страниц
    ЭлементыUl = ДокументDOM.ПолучитьЭлементыПоИмени("hasp");
	Если ЭлементыUl.Количество()=0 Тогда
	 	Возврат ОтветСервера;
	КонецЕсли; 
	
    ВсегоДнейОсталось = 0;
    Для каждого ТекЭлемент_hasp Из ЭлементыUl Цикл
        // <?xml version="1.0" encoding="UTF-8" ?>
        // <hasp_info>
        //  <license_manager>
        //	<hostname>VCENTER</hostname>
        //	<ip>172.16.32.6</ip>
        //	<osname>Microsoft Windows Server 2003</osname>
        //	<hasp id="13542686473463621" type="HASP-SL-AdminMode">
        //	  <feature id="2">
        //		<license>
        //		  <license_type>perpetual</license_type>
        //		</license>
        //	  </feature>
        //	</hasp>
        //  </license_manager>
        // </hasp_info>.
        АтрибутType = ТекЭлемент_hasp.Атрибуты.ПолучитьИменованныйЭлемент("type");
        АктивацияType = ?(АтрибутType = Неопределено,"",АтрибутType.Значение);
        id = ТекЭлемент_hasp.Идентификатор;
        
        Элементы_feature = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("feature");
        Для каждого ТекЭлементUl Из Элементы_feature Цикл
            feature_id = ТекЭлементUl.Идентификатор;
            

			эл_license_type = ТекЭлементUl.ПолучитьЭлементыПоИмени("license_type");
            license_type = ?(эл_license_type.Количество()=0,"",эл_license_type[0].ТекстовоеСодержимое);
            Если license_type = "perpetual" Тогда
                ОстатокДнейЛицензии = 0;
                ВсегоДнейОсталось = 999;
            Иначе	

				эл_time_start = ТекЭлементUl.ПолучитьЭлементыПоИмени("time_start");
                time_start = ?(эл_time_start.Количество()=0,"",эл_time_start[0].ТекстовоеСодержимое);
                time_start = ?(НРег(time_start) = "uninitialized","0",time_start);

				эл_total_time = ТекЭлементUl.ПолучитьЭлементыПоИмени("total_time");
                total_time = ?(эл_total_time.Количество()=0,"",эл_total_time[0].ТекстовоеСодержимое);
                Попытка
                    ТекущееВремяВФорматеUnix 	= МестноеВремя(Текущаядата())-'19700101';
                    ВремяОКончанияДействияКлюча	= ?(time_start="0",ТекущееВремяВФорматеUnix,Число(time_start)) + Число(total_time);
                    
                    ОстатокДнейЛицензии 		= Цел((ВремяОКончанияДействияКлюча-ТекущееВремяВФорматеUnix)/86400);
                    ВсегоДнейОсталось = ВсегоДнейОсталось + ОстатокДнейЛицензии;
                Исключение
                    ОстатокДнейЛицензии = 0;
                    Продолжить;
                КонецПопытки; 
                ОстатокДнейЛицензии = ОстатокДнейЛицензии;
            КонецЕсли; 
            
            СтрокаКлюча = ТаблицаКлючей.Добавить();
            СтрокаКлюча.id 			= id;
            СтрокаКлюча.license_type= license_type; 
            СтрокаКлюча.count_days 	= ОстатокДнейЛицензии;
            СтрокаКлюча.type 		= АктивацияType;
            СтрокаКлюча.feature_id  = feature_id;
        КонецЦикла	
    КонецЦикла;
	
	Если ТаблицаКлючей = Неопределено Тогда
		Возврат ОтветСервера;
	КонецЕсли;
	
	Ключ_perpetual = ТаблицаКлючей.Найти("perpetual", "license_type");
	Если НЕ Ключ_perpetual = Неопределено Тогда
		ОтветСервера.HASP_ОстатокДнейЛицензии = 0;
		ОтветСервера.HASP_ТипЛицензии		 = Ключ_perpetual.type;
		ОтветСервера.HASP_РегистрационныйНомер= Ключ_perpetual.id;
		Возврат ОтветСервера;
	КонецЕсли;
			
	Для каждого Ключ_trial Из ТаблицаКлючей Цикл
		Если НЕ ТипЗнч(Ключ_trial.count_days) = Тип("Число") 
			 ИЛИ НЕ Ключ_trial.license_type = "trial" 
			 ИЛИ Ключ_trial.count_days  <= 0 Тогда
			Продолжить;
		КонецЕсли; 	
		ОтветСервера.HASP_ОстатокДнейЛицензии = Ключ_trial.count_days;
		ОтветСервера.HASP_ТипЛицензии		 = Ключ_trial.type;
		ОтветСервера.HASP_РегистрационныйНомер= Ключ_trial.id;
		Возврат ОтветСервера;
	КонецЦикла; 

	Если ТаблицаКлючей.Количество()>0
		 И ОтветСервера.HASP_РегистрационныйНомер = "" Тогда
		Ключ_trial = ТаблицаКлючей[0]; 
		ОтветСервера.HASP_ОстатокДнейЛицензии = Ключ_trial.count_days;
		ОтветСервера.HASP_ТипЛицензии		 = Ключ_trial.type;
		ОтветСервера.HASP_РегистрационныйНомер= Ключ_trial.id;
		Возврат ОтветСервера;	
	КонецЕсли; 
КонецФункции // ПолучитьСведенияSentinelHasp()
&НаСервере  
Функция ПолучитьСведенияПоКлючамЗащитыМИКО(ДокументDOM)
	ОтветСервера = Новый Структура("ОстатокДнейЛицензии,ТипЛицензии,РегистрационныйНомер,ДополнительнаяИнформация", -1,"","",Новый Структура);
    ЭлементыUl = ДокументDOM.ПолучитьЭлементыПоИмени("licenseinfo");
	Если ЭлементыUl.Количество()=0 Тогда
		ОтветСервера = ПолучитьСведенияПоКлючамЗащитыМИКО_v2(ДокументDOM);
		Возврат ОтветСервера;
	КонецЕсли;
	ТекЭлемент_hasp = ЭлементыUl[0];
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("key", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "key") );
	ДополнительнаяИнформация.Вставить("expired", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "expired") );
	ДополнительнаяИнформация.Вставить("companyname",ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "companyname") );
	ДополнительнаяИнформация.Вставить("contact", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "contact") );
	ДополнительнаяИнформация.Вставить("email", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "email") );
	ДополнительнаяИнформация.Вставить("tel", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "tel") );
	ДополнительнаяИнформация.Вставить("activated", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "activated") = "1");
	
	expired = ПреобразоватьВДату(СтрЗаменить(ДополнительнаяИнформация.expired,"-",""));	
	Если ЗначениеЗаполнено(expired) Тогда
		ОстатокДнейЛицензии = (expired - ТекущаяДата())/(24*60*60);
	Иначе
		ОстатокДнейЛицензии = 0;
	КонецЕсли; 
	
	Продукты = Новый Массив;
	products = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("product");
	Для каждого product Из products Цикл
		name  = ЗначениеАтрибутаDOM(product.Атрибуты, "name");
		Продукты.Добавить(name);
	КонецЦикла; 
	
	ДоступныеФункции = Новый Соответствие;
	availablefeatures = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("availablefeatures");
	Если availablefeatures.Количество()>0 Тогда
		feature = availablefeatures[0].ПолучитьЭлементыПоИмени("feature");  	
		Для каждого тек_feature Из feature Цикл
			name  = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "name");
			count = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "count");
			ДоступныеФункции.Вставить(name, count);
		КонецЦикла; 
	КонецЕсли; 
	
	ЗахваченныеЛицензии = Новый Соответствие;
	capturedfeatures = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("capturedfeatures");
	Если capturedfeatures.Количество()>0 Тогда
		feature = capturedfeatures[0].ПолучитьЭлементыПоИмени("feature");  	
		Для каждого тек_feature Из feature Цикл
			name  = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "name");
			Попытка
				count = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "count");
			Исключение
			  	Продолжить;
			КонецПопытки; 
			ЗахваченныеЛицензии.Вставить(name, count);
		КонецЦикла; 
	КонецЕсли; 
	ДополнительнаяИнформация.Вставить("Продукты",			Продукты);
	ДополнительнаяИнформация.Вставить("ДоступныеФункции",	ДоступныеФункции);
	ДополнительнаяИнформация.Вставить("ЗахваченныеЛицензии",ЗахваченныеЛицензии);
	
	ОтветСервера.Вставить("ОстатокДнейЛицензии", 		ОстатокДнейЛицензии);
	ОтветСервера.Вставить("ДополнительнаяИнформация", 	ДополнительнаяИнформация);
	ОтветСервера.Вставить("РегистрационныйНомер", 		ДополнительнаяИнформация.key);
	ОтветСервера.Вставить("ТипЛицензии", 				"MIKO SaaS");
	
	Возврат ОтветСервера;
КонецФункции // ПолучитьСведенияПоКлючамЗащитыМИКО()
&НаСервере  
Функция ПолучитьСведенияПоКлючамЗащитыМИКО_v2(ДокументDOM)
	ОтветСервера = Новый Структура("ОстатокДнейЛицензии,ТипЛицензии,РегистрационныйНомер,ДополнительнаяИнформация", -1,"","",Новый Структура);
	ОстатокДнейЛицензии = 0;
	// Пример ответа от сервера лицензирования МИКО                                        
    ЭлементыUl = ДокументDOM.ПолучитьЭлементыПоИмени("saaslicenseinfo");
	Если ЭлементыUl.Количество()=0 Тогда
	 	Возврат ОтветСервера;
	КонецЕсли;
	ТекЭлемент_hasp = ЭлементыUl[0];
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("key", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "key") );
	ДополнительнаяИнформация.Вставить("companyname",ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "companyname") );
	ДополнительнаяИнформация.Вставить("contact", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "contact") );
	ДополнительнаяИнформация.Вставить("email", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "email") );
	ДополнительнаяИнформация.Вставить("tel", 		ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "tel") );
	ДополнительнаяИнформация.Вставить("activated", 	ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "activated") = "1");
	version = ЗначениеАтрибутаDOM(ТекЭлемент_hasp.Атрибуты, "version");
	
	Продукты = Новый Массив;
	products = ТекЭлемент_hasp.ПолучитьЭлементыПоИмени("product");
	Для каждого product Из products Цикл
		врПродукт = Новый Структура("name,id,trial,expired,feature");
		name  = ЗначениеАтрибутаDOM(product.Атрибуты, "name");
		ID    = ЗначениеАтрибутаDOM(product.Атрибуты, "id");
		trial = ЗначениеАтрибутаDOM(product.Атрибуты, "trial");
		
		врПродукт.Вставить("name",	name);
		врПродукт.Вставить("id",	ID);
		врПродукт.Вставить("trial",	trial);
		
		expired  	 = ЗначениеАтрибутаDOM(product.Атрибуты, "expired");
		дата_expired = ПреобразоватьВДату(СтрЗаменить(СтрЗаменить(СтрЗаменить(expired,"-","")," ",""),":",""));
		Если ID = ИдентификаторПродукта Тогда
			Если expired = "" И trial = "0" Тогда
			 	ОстатокДнейЛицензии = 0;
			ИначеЕсли ОстатокДнейЛицензии <> 0 И ЗначениеЗаполнено(дата_expired) Тогда
				врОстатокДнейЛицензии = (дата_expired - ТекущаяДата())/(24*60*60);
				ОстатокДнейЛицензии = ?(ОстатокДнейЛицензии > 0, ОстатокДнейЛицензии + врОстатокДнейЛицензии, врОстатокДнейЛицензии);
			КонецЕсли; 
		КонецЕсли; 
		врПродукт.Вставить("expired",	дата_expired);
		
		feature = Новый Массив;
		элfeature = product.ПолучитьЭлементыПоИмени("feature");  	
		Для каждого тек_feature Из элfeature Цикл
			name   	 = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "name");
			count 	 = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "count");
			captured = ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "captured");
			counteach= ЗначениеАтрибутаDOM(тек_feature.Атрибуты, "counteach");
			
			врfeature = Новый Структура("name,count,captured,counteach", name,count,captured,counteach);
			feature.Добавить(врfeature);
		КонецЦикла; 
		врПродукт.Вставить("feature",	feature);
		
		Продукты.Добавить(врПродукт);
	КонецЦикла; 
		
	ДополнительнаяИнформация.Вставить("Продукты",		Продукты);
	ОтветСервера.Вставить("ОстатокДнейЛицензии", 		ОстатокДнейЛицензии);
	ОтветСервера.Вставить("ДополнительнаяИнформация", 	ДополнительнаяИнформация);
	ОтветСервера.Вставить("РегистрационныйНомер", 		ДополнительнаяИнформация.key);
	ОтветСервера.Вставить("ТипЛицензии", 				"MIKO SaaS");
	ОтветСервера.Вставить("version", 					version);
	
	Возврат ОтветСервера;
КонецФункции // ПолучитьСведенияПоКлючамЗащитыМИКО()

&НаСервере 
Функция ЗначениеАтрибутаDOM(врАтрибуты, врИмяАтрибута)
	
	врЗначение = врАтрибуты.ПолучитьИменованныйЭлемент(врИмяАтрибута).Значение;
	врЗначение = ОтменитьЭкранированиеСпецСимволовXML(врЗначение);
	
	Возврат врЗначение;
КонецФункции // ПолучитьЗначениеАтрибутаDOM()

&НаСервере
// Производится попытка преобразовать строку в дату
// 
Функция ПреобразоватьВДату(Знач парамДата)
	Если ТипЗнч(парамДата) = Тип("Дата") Тогда
		Возврат парамДата;
	КонецЕсли; 
	НачалоВремен 	= Дата("19700101");
	ПустаяДата 		= Дата("00010101");
	
	Если НЕ ЗначениеЗаполнено(парамДата) Тогда
		Возврат ПустаяДата;
	КонецЕсли; 
	
	Если Найти(""+парамДата, ".")>0 Тогда
		// Формат даты UNIX
		Если ТипЗнч(парамДата) = Тип("Строка") Тогда
			Попытка
			  	парамДата = Число(парамДата);
			Исключение
				Возврат ПустаяДата;
			КонецПопытки; 
		ИначеЕсли ТипЗнч(парамДата) = Тип("Число") Тогда
			// тут все ок	
		Иначе
			Возврат ПустаяДата;
		КонецЕсли; 
		Если (ПустаяДата + парамДата) < НачалоВремен Тогда
			парамДата = НачалоВремен + парамДата;	
		КонецЕсли;
	Иначе	
		Попытка
			парамДата = Дата(парамДата);
		Исключение
			Возврат ПустаяДата;
		КонецПопытки; 	
	КонецЕсли; 
	
	Возврат парамДата;
КонецФункции // ПреобразоватьВДату()

&НаКлиенте 
Процедура ОбновитьТекстЛицензии(Знач ИнформацияПоКлючамЗащиты = Неопределено, Знач MIKO_Error = Неопределено)
	Если ТипЗнч(ИнформацияПоКлючамЗащиты) <> Тип("Структура") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(MIKO_Error) Тогда
		нТекстЛицензии = MIKO_Error;
	Иначе	
		// Отобразим информацию по остатку дней лицензии.
		Если ЗначениеЗаполнено(ИнформацияПоКлючамЗащиты.РегистрационныйНомер) Тогда
			Если ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии = 0 Тогда
				нТекстЛицензии 	= 	""; // безсрочная.
			ИначеЕсли ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии < 0 Тогда
				нТекстЛицензии 	= 	"Срок действия лицензии истек.";
			Иначе	
				ДатаОкончания = ТекущаяДата() + 60*60*24*ИнформацияПоКлючамЗащиты.ОстатокДнейЛицензии;
			    нТекстЛицензии 	= 	"Лицензия действует до "+ Формат(ДатаОкончания,"ДЛФ=DD") + ".";
			КонецЕсли; 
		Иначе
			нТекстЛицензии 	= 	"Не найден ключ защиты.";
		КонецЕсли;
	КонецЕсли; 
	
	ИнформацияПоКлючамЗащиты.Вставить("нТекстЛицензии", нТекстЛицензии);
	Оповестить("MIKO_ТекстЛицензии_stat", ИнформацияПоКлючамЗащиты, ЭтаФорма);
КонецПроцедуры

///
// Очистка службных регистров / истории звонков.
///

&НаКлиенте
Процедура УдалитьДокументы(Команда)
	УдалитьДокументыНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура УдалитьCDR(Команда)
	Если ТипАТС = 1 Тогда
		УдалитьCDR_НаСервере_MyPBX();
	ИначеЕсли ТипАТС = 0 Тогда
		УдалитьCDR_CELНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Очищаем служебные регистры.
// При необходимости фиксируется точка отсчета.
Процедура УдалитьCDR_CELНаСервере()
	
	id_pbx = ПолучитьПоследний_id_pbx_ОсновнойАТС(); 
	idCEL = ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковCEL", 	id_pbx);
	idCDR = ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковCDR", 	id_pbx);
	idCDRa= ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковAskozia",id_pbx);
	    
	ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковCDR", 		id_pbx);
	ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковCEL", 		id_pbx);
	ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковAskozia",  id_pbx);

	Если НачатьЗагрузкуЗаново = Ложь Тогда		
		Попытка
			СоздатьЗаписьТочкуЗагрузки(idCEL,  "МИКО_стИсторияЗвонковCEL", 		id_pbx);
			СоздатьЗаписьТочкуЗагрузки(idCDR,  "МИКО_стИсторияЗвонковCDR", 		id_pbx);
			СоздатьЗаписьТочкуЗагрузки(idCDRa, "МИКО_стИсторияЗвонковAskozia",	id_pbx);
		Исключение
			МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Ошибка при попытке очистить служебные регистры.");
			Возврат;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

// Очищаем служебные регистры.
// При необходимости фиксируется точка отсчета.
// 
Процедура УдалитьCDR_НаСервере_MyPBX()
	idCEL = ПолучитьПоследнийПолученныйПакет_MyPBX("МИКО_стMyPBX_Asteriskcdr");
	idCDR = ПолучитьПоследнийПолученныйПакет_MyPBX("МИКО_стMyPBX_Autorecord");
	
	ОчиститьРегистрВТранзакции_MyPBX("МИКО_стMyPBX_Asteriskcdr");
	ОчиститьРегистрВТранзакции_MyPBX("МИКО_стMyPBX_Autorecord");
	
	Если НачатьЗагрузкуЗаново = Ложь Тогда
		Попытка
		СоздатьЗаписьТочкуЗагрузки_MyPBX(idCEL, "МИКО_стMyPBX_Autorecord");
		СоздатьЗаписьТочкуЗагрузки_MyPBX(idCDR, "МИКО_стMyPBX_Asteriskcdr");
		Исключение
			Сообщить(НСтр("ru = 'Ошибка при попытке очистить служебные регистры.'"));
			Возврат;
		КонецПопытки; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИКО_стЗаписьИсторииЗвонков.Ссылка
	|ИЗ
	|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла; 
	
КонецПроцедуры

// Очистки регистра.
// Удаляем записи по 10000шт за раз.
Процедура ОчиститьРегистрВТранзакции(ИмяРегистра, id_pbx)

	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"+ИмяРегистра+".AcctId
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК "+ИмяРегистра+"
		|ГДЕ
		|   "+ИмяРегистра+".id_pbx = "+id_pbx+"";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	сч = 0;
	Пока Выборка.Следующий() Цикл
		Если сч = 0 Тогда
		 	НачатьТранзакцию();
		КонецЕсли; 
		
		МЗ = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.id_pbx = id_pbx;
		МЗ.Удалить();
		
		сч = сч + 1;
		Если сч > 10000 Тогда
			ЗафиксироватьТранзакцию();
			сч = 0;
		КонецЕсли; 
	КонецЦикла; 
	
	Если сч > 0 Тогда
		ЗафиксироватьТранзакцию();
		сч = 0;
	КонецЕсли; 
	
КонецПроцедуры

// Очистки регистра.
// Удаляем записи по 10000шт за раз.
Процедура ОчиститьРегистрВТранзакции_MyPBX(ИмяРегистра)

	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"+ИмяРегистра+".uniqueid_pt1c
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК "+ИмяРегистра+"";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	сч = 0;
	Пока Выборка.Следующий() Цикл
		Если сч = 0 Тогда
		 	НачатьТранзакцию();
		КонецЕсли; 
		
		МЗ = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Удалить();
		
		сч = сч + 1;
		Если сч > 10000 Тогда
			ЗафиксироватьТранзакцию();
			сч = 0;
		КонецЕсли; 
	КонецЦикла; 
	
	Если сч > 0 Тогда
		ЗафиксироватьТранзакцию();
		сч = 0;
	КонецЕсли; 
	
КонецПроцедуры

// Получаем последний ID записи.
//
&НаСервереБезКонтекста
Функция ПолучитьПоследнийПолученныйПакет(ИмяТаблицы, id_pbx)
	Если ИмяТаблицы <> "МИКО_стИсторияЗвонковCDR" 
		 И ИмяТаблицы <> "МИКО_стИсторияЗвонковCEL"
		 И "МИКО_стИсторияЗвонковAskozia" <> ИмяТаблицы Тогда
	   	Возврат 0;                                
	КонецЕсли;      
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
					|	МИКО_ИсторияЗвонков.AcctId КАК AcctId
					|ИЗ
					|	РегистрСведений."+ИмяТаблицы+" КАК МИКО_ИсторияЗвонков
					|ГДЕ
					|	МИКО_ИсторияЗвонков.AcctId > 0
				    |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
					|
					|УПОРЯДОЧИТЬ ПО
					|	AcctId УБЫВ";
	Запрос.УстановитьПараметр("id_pbx", id_pbx);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийПолученныйПакет = Выборка.AcctId;
	КонецЕсли;
	ПоследнийПолученныйПакет = ?(ЗначениеЗаполнено(ПоследнийПолученныйПакет),ПоследнийПолученныйПакет,0); 
   	Возврат ПоследнийПолученныйПакет;
КонецФункции // ПолучитьПоследнийПолученныйПакет()


&НаСервереБезКонтекста
Функция ПолучитьПоследний_id_pbx_ОсновнойАТС()
	id_pbx = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx();
	
	ПризнакВыходаИзЦикла = Ложь;
	
	Пока НЕ ПризнакВыходаИзЦикла Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_ДополнительныеАТС.Наименование
			|ИЗ
			|	Справочник.МИКО_ДополнительныеАТС КАК МИКО_ДополнительныеАТС
			|ГДЕ
			|	МИКО_ДополнительныеАТС.id_pbx = &id_pbx";
		
		Запрос.УстановитьПараметр("id_pbx", id_pbx);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ПризнакВыходаИзЦикла = Истина;
		Иначе
			id_pbx = id_pbx - 1;
		КонецЕсли; 
		
	КонецЦикла;
	Возврат id_pbx;
КонецФункции // ПолучитьПоследний_id_pbx_ОсновнойАТС()

 

// Получаем последний ID записи.
//
&НаСервереБезКонтекста
Функция ПолучитьПоследнийПолученныйПакет_MyPBX(ИмяТаблицы)
	ПустаяДата = Дата("00010101");
	Если ИмяТаблицы <> "МИКО_стMyPBX_Asteriskcdr" И  ИмяТаблицы <> "МИКО_стMyPBX_Autorecord" Тогда
	   	Возврат ПустаяДата;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МИКО_ИсторияЗвонков.datetime КАК datetime
	|ИЗ
	|	РегистрСведений."+ИмяТаблицы+" КАК МИКО_ИсторияЗвонков
	|
	|УПОРЯДОЧИТЬ ПО
	|	datetime УБЫВ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийПолученныйПакет = Выборка.datetime;
	КонецЕсли;
	ПоследнийПолученныйПакет = ?(ЗначениеЗаполнено(ПоследнийПолученныйПакет),ПоследнийПолученныйПакет,ПустаяДата); 
   	Возврат ПоследнийПолученныйПакет;
КонецФункции // ПолучитьПоследнийПолученныйПакет()

&НаСервереБезКонтекста
Процедура СоздатьЗаписьТочкуЗагрузки(id, ИмяТаблицы, id_pbx)
	
	Если id = 0 Тогда Возврат; КонецЕсли; 
	Если ИмяТаблицы <> "МИКО_стИсторияЗвонковCDR" И  ИмяТаблицы <> "МИКО_стИсторияЗвонковCEL" Тогда
	   	Возврат;
	КонецЕсли; 
	
	МЗ = РегистрыСведений[ИмяТаблицы].СоздатьМенеджерЗаписи();
    МЗ.AcctId = id;
	МЗ.id_pbx = id_pbx;
	МЗ.Записать();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьЗаписьТочкуЗагрузки_MyPBX(id, ИмяТаблицы)
    Если ИмяТаблицы <> "МИКО_стMyPBX_Asteriskcdr" И  ИмяТаблицы <> "МИКО_стMyPBX_Autorecord" Тогда
	   	Возврат;
	КонецЕсли; 
	
	МЗ = РегистрыСведений[ИмяТаблицы].СоздатьМенеджерЗаписи();
    МЗ.uniqueid_pt1c = 0;
	МЗ.datetime = id;
	
	МЗ.Записать();	
	
КонецПроцедуры

&НаКлиенте
// Изменение доступности команд.
// 
Процедура ПользовательОзнакомилсяСПердупреждеиемПриИзменении(Элемент)
	Элементы.ГруппаПерезаполнитьДокументыИстории.Доступность = ПользовательОзнакомилсяСПердупреждеием;
	Элементы.ГруппаПерезаполнитьТелефоннуюКнигу.Доступность  = ПользовательОзнакомилсяСПердупреждеием;
	Элементы.грОтладкаМодуляСтатистики.Доступность = ПользовательОзнакомилсяСПердупреждеием;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	ТипАТСПриИзменении(Элементы.ТипАТС);

КонецПроцедуры // УстановитьВидимостьЭлементов()

&НаКлиенте
Процедура ТипАТСПриИзменении(Элемент)
	
	Если ТипАТС = 1 Тогда
		Элементы.РесурсCDR.Доступность = Ложь;
		Элементы.РесурсCEL.Доступность = Ложь;
		// Элементы.Проверить.Доступность = Ложь;
	Иначе
		Элементы.РесурсCDR.Доступность = Истина;
		Элементы.РесурсCEL.Доступность = Истина;
		// Элементы.Проверить.Доступность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

///
// Отчет по ошибкам.

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ПрочитатьЖурналРегистрации();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЖурналРегистрации()
	ОтчетЖурналРегистрации.Очистить();	
	ИдентификаторыДокументовСОшибкой.Очистить();
	ТаблицаРезультат = Новый ТаблицаЗначений;
		
	МакетОтчета = Новый ТабличныйДокумент;
	МакетОтчета = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПолучитьМакет("ОшибкиЖурналРегистрации");
	
	ОбластьШапка  = МакетОтчета.ПолучитьОбласть("ОбластьШапка");
	
	ОтчетЖурналРегистрации.Вывести(ОбластьШапка);
		
	Фильтр = Новый Структура();
	Фильтр.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение); 
	Фильтр.Вставить("Событие", "МИКО.ЗагрузкаИсторииЗвонков");	
	ВыгрузитьЖурналРегистрации(ТаблицаРезультат, Фильтр,,, 100);  
	ТаблицаРезультат.Сортировать("Дата Убыв");
	Если ТаблицаРезультат.Количество()=0 Тогда
		ОбластьНетОшибок = МакетОтчета.ПолучитьОбласть("ОбластьНетОшибок");
		ОтчетЖурналРегистрации.Вывести(ОбластьНетОшибок);
	Иначе
		Для каждого СтрокаСОшибкой Из ТаблицаРезультат Цикл
			ОбластьСтрока = МакетОтчета.ПолучитьОбласть("ОбластьСтрока");		
			ОбластьСтрока.Параметры.Заполнить(СтрокаСОшибкой);
			ОтчетЖурналРегистрации.Вывести(ОбластьСтрока);
			
			ПозицияКомментария = Найти(СтрокаСОшибкой.Комментарий, "Ошибка загрузки звонка:");
			Если ПозицияКомментария >0 Тогда
				id = Прав(СтрокаСОшибкой.Комментарий, СтрДлина(СтрокаСОшибкой.Комментарий) - (ПозицияКомментария + 23));	
				id = МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(id);	
				Попытка
				ИдентификаторыДокументовСОшибкой.Добавить().id = Число(id);
				Исключение
				КонецПопытки; 
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли; 
	Элементы.СформироватьСообщениеВТехническуюПоддержку.Видимость = Истина;
	
КонецПроцедуры // ПрочитатьЖурналРегистрации()

&НаКлиенте
Процедура СформироватьСообщениеВТехническуюПоддержку(Команда)
	
		
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог, где будет сохранена отладочная информация:";
	
	Если ВерсияПлатформы = "8.3" Тогда
		ДопПараметры = "МИКО_СообщениеВТехническуюПоддержку";
		ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработкаВыбораКаталога"", МИКО_стОбщегоНазначенияКлиент, ДопПараметры)");
		Попытка	
			Выполнить("ДиалогОткрытияФайла.Показать(ОписаниеОповещения)");
		Исключение
			Возврат;
		КонецПопытки; 
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		Результат = Вычислить("ДиалогОткрытияФайла.Выбрать()");
		Если Результат = Истина Тогда
			
			МассивРезультат = Новый Массив;
			МассивРезультат.Добавить(ДиалогОткрытияФайла.Каталог);
			СохранитьОтладочнуюИнформацию(МассивРезультат);		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

//
//
&НаКлиенте
Процедура СохранитьОтладочнуюИнформацию(ИменаФайлов)

	Если НЕ ТипЗнч(ИменаФайлов) = Тип("Массив") Тогда
	 	Возврат;
	КонецЕсли; 	
	МассивUID = Новый Массив;
	Для каждого ТекущаяСтрока Из ИдентификаторыДокументовСОшибкой Цикл
		МассивUID.Добавить(ТекущаяСтрока.id);	
	КонецЦикла; 
	Разделитель = ?(Найти(ИменаФайлов[0], "\")>0, "\","/");
	
	ИмяФайла = ИменаФайлов[0] + Разделитель + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_hh_mm") + "stat_log.txt";
	
	ТекстОтладки = ПолучитьДанныеЗвонков(МассивUID);
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстОтладки);
	ТекстовыйДокумент.Записать(ИмяФайла);
	
	ИмяФайлаОтчета = ИменаФайлов[0] + Разделитель + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_hh_mm") + "stat_log_report.pdf";
	ОтчетЖурналРегистрации.Записать(ИмяФайлаОтчета, ТипФайлаТабличногоДокумента.PDF);
	
КонецПроцедуры // СохранитьОтладочнуюИнформацию()
&НаСервереБезКонтекста
Функция ПолучитьДанныеЗвонков(МассивUID)
	Попытка
		мод_МИКО_стЗагрузкаИсторииЗвонков_v7=Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	Исключение
	 	Возврат "";
	КонецПопытки; 
	
	ДанныеИзБазы = мод_МИКО_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCEL_CDR(МассивUID);
	Возврат ЗначениеВСтрокуВнутр(ДанныеИзБазы);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если "8" <> ИдентификаторПродукта И НЕ ЗначениеЗаполнено(АдресАрхиваКомпонента) Тогда
		АдресАрхиваКомпонента = ПолучитьАдресВК();
		// Пробуем подключить компоненту защиты.
		ПодключитьКомпоненту();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЛицензированию(Команда)
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат;	
	КонецПопытки; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СведенияОПродукте", мМИКО_Лицензирование.ПолучитьСведенияОПродукте("Модуль статистики"));
	
	ОткрытьФорму("ОбщаяФорма.МИКО_РегистрацияПродукта",ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьДопАТСПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнициироватьЗагрузкуСНачала(Команда)
	ИнициироватьЗагрузкуСНачалаНаСервере();
	Сообщить("Служебные регистры очищены. ");
КонецПроцедуры

&НаСервере
Процедура ИнициироватьЗагрузкуСНачалаНаСервере()
	
	Если ИспользоватьДопАТС Тогда
		ДанныеДопАТС = Элементы.ДополнительныеАТС1.ТекущаяСтрока;	
		
		Если ДанныеДопАТС <> Неопределено Тогда
			id_pbx = ДанныеДопАТС.id_pbx; 
		//	idCEL  = ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковCEL", id_pbx);
		//	idCDR  = ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковCDR", id_pbx);
		//	idCDRa = ПолучитьПоследнийПолученныйПакет("МИКО_стИсторияЗвонковAskozia",id_pbx);
			ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковAskozia",  id_pbx);
			ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковCDR", 		id_pbx);
			ОчиститьРегистрВТранзакции("МИКО_стИсторияЗвонковCEL", 		id_pbx);	
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсторию(Команда)
	УдалитьИсториюНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьИсториюНаСервере()
	
	ИнициироватьЗагрузкуСНачалаНаСервере();
	Сообщить("Служебные регистры очищены. ");
	
	ДанныеДопАТС = Элементы.ДополнительныеАТС1.ТекущаяСтрока;	
	Если ДанныеДопАТС <> Неопределено Тогда
	
		id_pbx = ДанныеДопАТС.id_pbx;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стЗаписьИсторииЗвонков.Ссылка
		|ИЗ
		|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
		|ГДЕ
		|	МИКО_стЗаписьИсторииЗвонков.id_pbx = &id_pbx";
		Запрос.УстановитьПараметр("id_pbx", id_pbx);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Удалить();
		КонецЦикла; 
		Сообщить("Документы истории для АТС ID = "+id_pbx+" удалены. ");
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПротоколОтладкиНажатие(Элемент)
	ТабДок = Новый ТабличныйДокумент;
	мод_стОтладкаМодуляСтатистики = Вычислить("МИКО_стОтладкаМодуляСтатистики");
	мод_стОтладкаМодуляСтатистики.ВывестиРезультатыВПротоколОтладки(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ЛицензионноеСоглашениеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
	 	ЗапуститьПриложение(ДанныеСобытия.Href);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПринятьСоглашение(Команда)
	ПринятьСоглашениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПринятьСоглашениеНаСервере()
	ЛицензионноеСоглашениеПринято = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ЛицензионноеСоглашениеПринято(Истина);
	// Вставить содержимое обработчика.
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры



//#КонецОбласти 
