Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;
Перем мИспользоватьОборотнуюНоменклатуру Экспорт;
Перем мРазделятьПоСтавкамНДС Экспорт;
Перем ПартионныйУчетНУ;
Перем ВестиУчетПоСкладуНУ;
Перем мВалютаРегламентированногоУчета Экспорт;

Перем мУдалятьДвижения;

Перем мОтражатьВРегламентированномУчете Экспорт;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;
Перем Проведение Экспорт;
Перем мПараметрыСвязиСтрокТЧ Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция осуществляет запись в RFID метки.
//
// Параметры
//  Нет
//
Процедура ЗаписатьВRFIDМетки()

	ЗаполнениеДокументов.ЗаписатьRFIDМеткиИзДокумента(Ссылка);

КонецПроцедуры // ЗаписатьВRFIDМетки()

// Функция осуществляет печать этикеток для позиций ТЧ
//
// Параметры
//  Нет
//
Процедура ПечататьЭтикетки()

	Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
	 Или СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка, "Цена");
	Иначе
		УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка);
	КонецЕсли;

КонецПроцедуры // ПечататьЭтикетки()

// Функция печатает ценники.
//
Функция ПечатьЦенников()

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИСТИНА КАК Печать,
	                      |	Док.Номенклатура КАК Номенклатура,
	                      |	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                      |	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	                      |	0 КАК Цена,
	                      |	Док.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ПеремещениеТоваров.Товары КАК Док
	                      |ГДЕ
	                      |	Док.Ссылка = &Док");

	Запрос.УстановитьПараметр("Док", Ссылка);

	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаполнитьЦены", Истина);

	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Параметр = СтруктураПараметров;
	ФормаПечатьЦенников.Открыть();

КонецФункции // ПечатьЦенников()

// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
//
// Параметры:
//  ИмяМакета - Имя макета для печати.
//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьБланк(ИмяМакета, НаПринтер)

	Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, ИмяМакета, , НаПринтер);

	Возврат Неопределено;

КонецФункции // ПечатьБланк()
	
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьПеремещениеТоваров()
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Артикул";
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды    = Истина;
		Колонка         = "Код";
		ТекстКодАртикул = "Код";
	Иначе
		ВыводитьКоды    = Ложь;
		Колонка         = "";
		ТекстКодАртикул = "Код";
	КонецЕсли;

	ЕстьЦена = (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
			 ИЛИ СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ);
			 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|   СкладОтправитель КАК Поставщик,
	|	СкладПолучатель КАК Покупатель,
	|	Ответственный.ФизЛицо.Наименование КАК Отпустил
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерТЧ,
	|	НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.Наименование КАК СТРОКА(1000)) КАК Товар,
	|	Номенклатура.Код     КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	КоличествоМест,
	|	ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|	ЕдиницаИзмеренияМест.Представление КАК ЕдиницаМест,
	|	Цена,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия
	|ИЗ 
	|	(ВЫБРАТЬ
	|		МИНИМУМ(НомерСтроки) КАК НомерСтрокиТЧ,
	|		Номенклатура         КАК Номенклатура,
	|		ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		Цена                 КАК Цена,
	|		СерияНоменклатуры    КАК СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(Количество)    КАК Количество,
	|		СУММА(КоличествоМест)КАК КоличествоМест
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|	ГДЕ
	|		ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест,
	|		Цена,
	|		СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры
	|	) КАК ВложенныйЗапросПоТоварам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК НомерТЧ,
	|	НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК Товар,
	|	Номенклатура.Код     КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	КоличествоМест,
	|	ЕдиницаИзмерения.Представление КАК ЕдиницаЦены,
	|	ЕдиницаИзмеренияМест.Представление КАК ЕдиницаМест,
	|	Цена,
	|	ХарактеристикаНоменклатуры КАК Характеристика,
	|	СерияНоменклатуры КАК Серия
	|ИЗ 
	|	(ВЫБРАТЬ
	|		МИНИМУМ(НомерСтроки) КАК НомерСтрокиТЧ,
	|		Номенклатура         КАК Номенклатура,
	|		ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		NULL	                 КАК Цена,
	|		СерияНоменклатуры    КАК СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(Количество)    КАК Количество,
	|		СУММА(КоличествоМест)КАК КоличествоМест
	|	ИЗ
	|		Документ.ПеремещениеТоваров.БланкиСтрогогоУчета КАК ПеремещениеТоваров
	|	ГДЕ
	|		ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест,
	|		СерияНоменклатуры,
	|		ХарактеристикаНоменклатуры
	|	) КАК ВложенныйЗапросПоТоварам
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТЧ, НомерСтрокиТЧ
	|";
	
	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НомерСтроки						КАК НомерСтрокиТЧ,
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000))  КАК Товар,
	|	Номенклатура.Код                КАК Код,
	|	Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|	Количество,
	|	Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаЦены
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ПеремещениеТоваров
	|
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиТЧ
	|";
	
	ЗапросТара = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";

	Макет = ПолучитьМакет("Накладная");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Выводим шапку нкладной
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Накладная на перемещение';uk='Накладна на переміщення'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Организация");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.РеквизитыПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ПлательщикНалогаНаПрибыль,",,КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);	
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.Поставщик;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = Шапка.Покупатель;
	ТабДокумент.Вывести(ОбластьМакета);

	Если ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	//Если Товары.Итог("КоличествоМест") > 0 Тогда
	//	ОбластьШапки  = ОбластьШапки  + "Мест";
	//	ОбластьСтроки = ОбластьСтроки + "Мест";
	//Конецесли;
	//
	//Если ЕстьЦена Тогда
	//	ОбластьШапки  = ОбластьШапки  + "Цена";
	//	ОбластьСтроки = ОбластьСтроки + "Цена";
	//КонецЕсли; 
	
	// Вывести табличную часть (товары и услуги)
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = Колонка;
	КонецЕсли;
	
	Если ЕстьЦена Тогда
		ОбластьМакета.Параметры.Цена  = НСтр("ru='Розн. цена';uk='Роздр. ціна'",КодЯзыкаПечать);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	
	ТабР = ОбщегоНазначения.ТаблицаРостовок(Товары.Выгрузить(),СкладОтправитель);
	
	Для каждого ВыборкаСтрокТовары из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Товар);
		ОбластьМакета.Параметры.Характеристика =  СтрЗаменить(СтрЗаменить(ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары),"(",""),")","");
		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТовары.КодАртикул;
		КонецЕсли;
		
		НайденаСтрока = ТабР.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры,Количество",ВыборкаСтрокТовары.Характеристика,ВыборкаСтрокТовары.Количество));	
		Если НайденаСтрока.Количество()>0 Тогда
			ОбластьМакета.Параметры.Р = ОбщегоНазначения.НольФормат(НайденаСтрока[0].Р1);
			ОбластьМакета.Параметры.В1 = ОбщегоНазначения.НольФормат(НайденаСтрока[0].В1);
			ОбластьМакета.Параметры.В2 = ОбщегоНазначения.НольФормат(НайденаСтрока[0].В2);
		Иначе
			ОбластьМакета.Параметры.Р = "";
			ОбластьМакета.Параметры.В1 = "";
			ОбластьМакета.Параметры.В2 = "";
		КонецЕсли;


		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	// Вывести подвал таблицы
	ОбластьПодвала  = "Подвал";
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьПодвала);
	ОбластьМакета.Параметры.Количество = Товары.Итог("Количество");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести таблицу с возвратной тарой
	ОбластьШапки  = СтрЗаменить(ОбластьШапки,"Мест","");
	ОбластьСтроки = СтрЗаменить(ОбластьСтроки,"Мест","");
	ОбластьШапки  = СтрЗаменить(ОбластьШапки,"Цена","")+"Тара";
	ОбластьСтроки = СтрЗаменить(ОбластьСтроки,"Цена","")+"Тара";
	
	Если ЗапросТара.Количество() > 0 Тогда
		
		// сделаем отступ от основной таблицы
		ОбластьПробел = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьПробел);
		
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ВыводитьКоды Тогда
			ОбластьМакета.Параметры.Колонка = Колонка;
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		
		Для каждого ВыборкаСтрокТара Из ЗапросТара Цикл 
		
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТара);
			ОбластьМакета.Параметры.НомерСтроки = ЗапросТара.Индекс(ВыборкаСтрокТара) + 1;
			ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТара.Номенклатура);

			Если ВыводитьКоды Тогда
				ОбластьМакета.Параметры.КодАртикул = ВыборкаСтрокТара.КодАртикул;
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 
		
		// Вывести подвал
		ОбластьПодвал = "ПодвалТара";
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьПодвал);
		ТабДокумент.Вывести(ОбластьМакета);		
		
		// сделаем отступ
		ТабДокумент.Вывести(ОбластьПробел);
		
	КонецЕсли;
	
	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьПеремещениеТоваров()

// Функция осуществляет запуск обработки формирующей печатную форму 1-ТН - ТТН
//
// Параметры
//  Нет.
//
// Возвращаемое значение:
//  <Неопределено> – Загрулшка для УниверсальныеМеханизмы.НапечататьДокумент(), т.к. табличный 
//                   документ формирутеся вызываемой обработкой.
//
Функция ПечатьТТН()

	ОбработкаПечати          = Обработки.ПечатьТТН.ПолучитьФорму("Форма");
	ОбработкаПечати.Документ = ЭтотОбъект.Ссылка;

	ОбработкаПечати.Открыть();

	Возврат Неопределено;

КонецФункции // ПечатьТТН()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Ведомость" Тогда

		ТабДокумент = ПечатьПеремещениеТоваров();
	ИначеЕсли ИмяМакета = "1Т"
		  ИЛИ ИмяМакета = "_1Т" Тогда
		ТабДокумент = ПечатьТТН();	
	ИначеЕсли ИмяМакета = "БланкОтправитель" Или ИмяМакета = "БланкПолучатель" Тогда
		ТабДокумент = ПечатьБланк(ИмяМакета, НаПринтер);
	ИначеЕсли ИмяМакета = "Ценники" Тогда
		ТабДокумент = ПечатьЦенников();
	ИначеЕсли ИмяМакета = "Этикетки" Тогда
		ПечататьЭтикетки();
		Возврат;
	ИначеЕсли ИмяМакета = "ЗаписьВRFIDМетки" Тогда
		ЗаписатьВRFIDМетки();
		Возврат;
	КонецЕсли; 

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура("Ведомость", "Перемещение товаров");
	СтруктураМакетов.Вставить("_1Т",                "1-ТН (Товарно-транспортная накладная)");
	СтруктураМакетов.Вставить("БланкОтправитель",   "Бланк товарного наполнения, склад отправитель");
	СтруктураМакетов.Вставить("БланкПолучатель",    "Бланк товарного наполнения, склад получатель");
	СтруктураМакетов.Вставить("Ценники",            "Ценники на товары");
	СтруктураМакетов.Вставить("Этикетки",           "Этикетки");
	СтруктураМакетов.Вставить("ЗаписьВRFIDМетки",   "Запись в RFID метки");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


// Заполняет счета БУ в строке табличной части.
//
Процедура ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, СчетаУчетаНовые, ЗаполнятьБУ)

	Если ЗаполнятьБУ = Истина Тогда
		
		СтрокаТЧ.СчетУчетаБУ      = СчетаУчета.СчетУчетаБУ;
		СтрокаТЧ.НовыйСчетУчетаБУ = СчетаУчетаНовые.СчетУчетаБУ;
		
		Если ИмяТабЧасти = "БланкиСтрогогоУчета" Тогда
			СтрокаТЧ.СчетУчетаБУ      = СчетаУчета.СчетУчетаБУ;			
			СтрокаТЧ.НовыйСчетУчетаБУ = СчетаУчетаНовые.СчетУчетаБУ;
			
			СтрокаТЧ.СчетУчетаЗабалансовыйБУ = СчетаУчета.СчетУчетаДоп;
			СтрокаТЧ.НовыйСчетУчетаЗабалансовыйБУ = СчетаУчетаНовые.СчетУчетаДоп;
		КонецЕсли;

	ИначеЕсли ЗаполнятьБУ = Ложь Тогда

		Если ИмяТабЧасти = "БланкиСтрогогоУчета" Тогда
			СтрокаТЧ.СчетУчетаБУ      = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.НовыйСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			
			СтрокаТЧ.СчетУчетаЗабалансовыйБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.НовыйСчетУчетаЗабалансовыйБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Иначе
			СтрокаТЧ.СчетУчетаБУ      = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.НовыйСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
        КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаБУ()

// Заполняет счета НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, СчетаУчетаНовые, ЗаполнятьНУ)

	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	
	Если ЗаполнятьНУ  = Истина Тогда
						
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		КонецЕсли;		
				
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
        				
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НалоговоеНазначение", МетаданныеДокумента, ИмяТабЧасти) Тогда
			СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаНУ()

// Заполняет счета БУ и НУ в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	СчетаУчета 		= БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, СкладОтправитель);
	СчетаУчетаНовые = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, СкладПолучатель);

	ЗаполнитьСчетаБУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, СчетаУчетаНовые, ЗаполнятьБУ);
	ЗаполнитьСчетаНУ(СтрокаТЧ, ИмяТабЧасти, СчетаУчета, СчетаУчетаНовые, ЗаполнятьНУ);

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()


// Процедура выполняет обход по всем строка указанной табличной части и заполняет счета учета
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабЧасти, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()


// Заолняет табличную часть по сериям при оперативном проведении
//
Процедура ЗаполнитьПоСериям() Экспорт

	ТоварыТабличнойЧасти = Товары.Выгрузить();
	ТоварыТабличнойЧасти.Свернуть("Номенклатура"); 

	МассивНоменклатуры = ТоварыТабличнойЧасти.ВыгрузитьКолонку("Номенклатура");

	ТаблицаРезервовПоСериям = Новый ТаблицаЗначений;
	ТаблицаСерий = УправлениеЗапасами.ПолучитьТаблицуОстатковПоСериям(СкладОтправитель, Организация, МассивНоменклатуры, , СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ,ТаблицаРезервовПоСериям);
	ТаблицаСерий.Индексы.Добавить("Номенклатура,ХарактеристикаНоменклатуры,Качество");

	ТоварыТабличнойЧасти=Товары.Выгрузить();

	Товары.Очистить();

	КолонкиТабЧасти = ТоварыТабличнойЧасти.Колонки;
	ИспользоватьУказаниеСерийНоменклатурыПриРезервировании = Константы.ИспользоватьУказаниеСерийНоменклатурыПриРезервировании.Получить();

	Для Каждого ИсходнаяСтрока ИЗ ТоварыТабличнойЧасти Цикл

		СтуктураПоиска   = Новый Структура;
		СтуктураПоиска.Вставить("Номенклатура",               ИсходнаяСтрока.Номенклатура);
		СтуктураПоиска.Вставить("ХарактеристикаНоменклатуры", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
		СтуктураПоиска.Вставить("Качество",                   ИсходнаяСтрока.Качество);

		
		Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			СтуктураПоиска.Вставить("Цена",                   ИсходнаяСтрока.Цена);
		КонецЕсли;
		
		ЗаполнятьИзРезервов = Ложь;
		Если ТипЗнч(ИсходнаяСтрока.ДокументРезерва) = Тип("ДокументСсылка.ЗаказПокупателя") 
		   И ИспользоватьУказаниеСерийНоменклатурыПриРезервировании
		   И СкладОтправитель.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда

			Если ИсходнаяСтрока.ДокументРезерва.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				СтуктураПоиска.Вставить("ДокументРезерва",    ИсходнаяСтрока.ДокументРезерва);
				ЗаполнятьИзРезервов = Истина;
			КонецЕсли;

		КонецЕсли;

		Если ЗаполнятьИзРезервов Тогда
			НайденныеСтроки = ТаблицаРезервовПоСериям.НайтиСтроки(СтуктураПоиска);
		Иначе
			НайденныеСтроки = ТаблицаСерий.НайтиСтроки(СтуктураПоиска);
		КонецЕсли;

		СтрокаСПустойСерией = Неопределено;
		КоличествоОсталосьПогасить = ИсходнаяСтрока.Количество;

		Для Каждого Строка Из НайденныеСтроки Цикл

			Если КоличествоОсталосьПогасить<=0 Тогда
				Прервать;
			КонецЕсли;

			Если Строка.Остаток <= 0 Тогда
				Продолжить;
			КонецЕсли;

			ОстатокВЕдиницахДокумента = Строка.Остаток * ИсходнаяСтрока.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсходнаяСтрока.ЕдиницаИзмерения.Коэффициент;

			Если ОстатокВЕдиницахДокумента >= КоличествоОсталосьПогасить Тогда
				КоэффСписания = КоличествоОсталосьПогасить/ОстатокВЕдиницахДокумента;
			Иначе
				КоэффСписания = 1
			КонецЕсли;

			СписанноеКоличество = Окр(ОстатокВЕдиницахДокумента * КоэффСписания, 3, РежимОкругления.Окр15как20);
			
			Если СписанноеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура                 = ИсходнаяСтрока.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения             = ИсходнаяСтрока.ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмеренияМест         = ИсходнаяСтрока.ЕдиницаИзмеренияМест;
			НоваяСтрока.Коэффициент                  = ИсходнаяСтрока.Коэффициент;
			НоваяСтрока.Цена                         = ИсходнаяСтрока.Цена;
			НоваяСтрока.ХарактеристикаНоменклатуры   = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры            = Строка.СерияНоменклатуры;
			НоваяСтрока.ДокументРезерва              = ИсходнаяСтрока.ДокументРезерва;
			НоваяСтрока.Качество                     = ИсходнаяСтрока.Качество;
			НоваяСтрока.ВнутреннийЗаказ              = ИсходнаяСтрока.ВнутреннийЗаказ;
			НоваяСтрока.Количество                   = СписанноеКоличество; 

			НоваяСтрока.СчетУчетаБУ 					= ИсходнаяСтрока.СчетУчетаБУ;
			НоваяСтрока.НовыйСчетУчетаБУ 				= ИсходнаяСтрока.НовыйСчетУчетаБУ;			
			
			НоваяСтрока.СуммаВРознице 					= ИсходнаяСтрока.Цена * СписанноеКоличество;
			НоваяСтрока.СтавкаНДСВРознице 				= ИсходнаяСтрока.СтавкаНДСВРознице;			
			НоваяСтрока.НалоговоеНазначение 			= ИсходнаяСтрока.НалоговоеНазначение;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СерияНоменклатуры) Тогда
				СтрокаСПустойСерией = НоваяСтрока;
			КонецЕсли;

			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить-СписанноеКоличество;
			Строка.Остаток = Строка.Остаток - СписанноеКоличество* ИсходнаяСтрока.ЕдиницаИзмерения.Коэффициент / ИсходнаяСтрока.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;            

		КонецЦикла;

		Если КоличествоОсталосьПогасить>0 Тогда
			Если СтрокаСПустойСерией = Неопределено Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура                 = ИсходнаяСтрока.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения             = ИсходнаяСтрока.ЕдиницаИзмерения;
				НоваяСтрока.ЕдиницаИзмеренияМест         = ИсходнаяСтрока.ЕдиницаИзмеренияМест;
				НоваяСтрока.Коэффициент                  = ИсходнаяСтрока.Коэффициент;
				НоваяСтрока.Цена                         = ИсходнаяСтрока.Цена;
				НоваяСтрока.ХарактеристикаНоменклатуры   = ИсходнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.СерияНоменклатуры            = ИсходнаяСтрока.СерияНоменклатуры;
				НоваяСтрока.ДокументРезерва              = ИсходнаяСтрока.ДокументРезерва;
				НоваяСтрока.ВнутреннийЗаказ              = ИсходнаяСтрока.ВнутреннийЗаказ;
				НоваяСтрока.Качество                     = ИсходнаяСтрока.Качество;
				НоваяСтрока.Количество                   = КоличествоОсталосьПогасить;
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ЭтотОбъект);
				
				НоваяСтрока.СчетУчетаБУ 					= ИсходнаяСтрока.СчетУчетаБУ;
				НоваяСтрока.НовыйСчетУчетаБУ 				= ИсходнаяСтрока.НовыйСчетУчетаБУ;			
				НоваяСтрока.СуммаВРознице 					= ИсходнаяСтрока.Цена * КоличествоОсталосьПогасить;
				НоваяСтрока.СтавкаНДСВРознице 				= ИсходнаяСтрока.СтавкаНДСВРознице;			
				НоваяСтрока.НалоговоеНазначение 			= ИсходнаяСтрока.НалоговоеНазначение;
				
			Иначе
				СтрокаСПустойСерией.Количество = СтрокаСПустойСерией.Количество+КоличествоОсталосьПогасить;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Производит заполнение поля "Цена" табличной части "Товары".
//
Процедура ЗаполнитьРозничнуюЦену() Экспорт

	ОтправительНТТ   = (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ);
	ПолучательНТТ    = (СкладПолучатель.ВидСклада  = Перечисления.ВидыСкладов.НТТ);
	ПолучательТипЦен = ?((НЕ ОтправительНТТ) И ПолучательНТТ, СкладПолучатель.ТипЦенРозничнойТорговли, Неопределено);

	Для Каждого Строка Из Товары Цикл

		Если НЕ (ОтправительНТТ ИЛИ ПолучательНТТ) Тогда
			Строка.Цена = 0;
		ИначеЕсли (НЕ ОтправительНТТ) И ПолучательНТТ Тогда
			Строка.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры,
			              ПолучательТипЦен, Дата, Строка.ЕдиницаИзмерения, мВалютаРегламентированногоУчета, 1, 1);
		ИначеЕсли ОтправительНТТ Тогда
			Строка.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры, СкладОтправитель,
			              мВалютаРегламентированногоУчета,  Дата, Строка.ЕдиницаИзмерения, мВалютаРегламентированногоУчета, 1, 1);
		КонецЕсли;
		
		Строка.СуммаВРознице = Строка.Количество * Строка.Цена;
		
	КонецЦикла;

КонецПроцедуры

// Производит заполнение поля "Цена" строки табличной части "Товары".
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части "Товары"
//
Процедура ЗаполнитьРозничнуюЦенуВСтроке(СтрокаТабличнойЧасти) Экспорт

	ОтправительНТТ   = (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ);
	ПолучательНТТ    = (СкладПолучатель.ВидСклада  = Перечисления.ВидыСкладов.НТТ);
	ПолучательТипЦен = ?((НЕ ОтправительНТТ) И ПолучательНТТ, СкладПолучатель.ТипЦенРозничнойТорговли, Неопределено);

	Если НЕ (ОтправительНТТ ИЛИ ПолучательНТТ) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	ИначеЕсли (НЕ ОтправительНТТ) И ПолучательНТТ Тогда
		СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
		              ПолучательТипЦен, Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения, мВалютаРегламентированногоУчета, 1, 1);
	ИначеЕсли ОтправительНТТ Тогда
		СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СкладОтправитель,
		              мВалютаРегламентированногоУчета,  Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения, мВалютаРегламентированногоУчета, 1, 1);
	КонецЕсли;

	СтрокаТабличнойЧасти.СуммаВРознице = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

// Выполняет необходимые действия при изменении реквизита ОтражатьВБухгалтерскомУчете
//
Процедура ПриИзмененииОтражатьВБухгалтерскомУчете() Экспорт

КонецПроцедуры // ПриИзмененииОрганизации()

// Выполняет необходимые действия при изменении реквизита ВнутреннийЗаказ
//
Процедура ПриИзмененииЗаказа() Экспорт

	СкладПолучатель = ВнутреннийЗаказ.Заказчик;

КонецПроцедуры // ПриИзмененииОрганизации()

// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;

КонецПроцедуры // ПриИзмененииОрганизации()

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	#Если Клиент Или ВнешнееСоединение Тогда
		
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ПараметрОбъектКопирования, ПараметрОснование);
	
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		СкладОтправитель = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		СкладПолучатель  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	КонецЕсли;
	
	#КонецЕсли

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации      = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьНовыйДокумент()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ
	 или СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
		ТаблицаТоваров.Колонки.Цена.Имя = "ЦенаВРознице";
	КонецЕсли;

	// для проведения по регл. учету
	ТаблицаТоваров.Колонки.Добавить("ДокументОприходования");
	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");

	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(Истина,       "СписыватьТолькоПоЗаказуРегл");

	ТаблицаТоваров.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");
	
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный
		И НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование Тогда
		
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, СтруктураШапкиДокумента.СкладОтправитель,
		                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		ТаблицаТоваров.Колонки.Добавить("ВидСклада");
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.ВидыСкладов.Розничный, "ВидСклада");
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСклада");
		ТаблицаТоваров.Колонки.Удалить("ВидСклада");
		
	КонецЕсли;
	ТаблицаТоваров.Колонки.СуммаПродажная.Имя = "СуммаПродажнаяОтправителя";
	
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный
		И НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование Тогда
		
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, СтруктураШапкиДокумента.СкладПолучатель,
		                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		ТаблицаТоваров.Колонки.Добавить("ВидСклада");
		ТаблицаТоваров.ЗаполнитьЗначения(Перечисления.ВидыСкладов.Розничный, "ВидСклада");
		
		ТаблицаТоваров.Колонки.Склад.Имя 	  = "СкладОтправитель";
		ТаблицаТоваров.Колонки.СкладНовый.Имя = "Склад";
		
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСклада");
		
		ТаблицаТоваров.Колонки.Удалить("ВидСклада");
		
		ТаблицаТоваров.Колонки.Склад.Имя 	  = "СкладНовый";
		ТаблицаТоваров.Колонки.СкладОтправитель.Имя = "Склад";
		
	КонецЕсли;
	ТаблицаТоваров.Колонки.СуммаПродажная.Имя = "СуммаПродажнаяПолучателя";
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();
	
	// для проведения по регл. учету
	ТаблицаТары.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаТары.Колонки.Добавить("ДокументОприходования");
	ТаблицаТары.Колонки.Добавить("Регистратор");
	ТаблицаТары.Колонки.Добавить("СписыватьТолькоПоЗаказуРегл");

	ТаблицаТары.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаТары.ЗагрузитьКолонку(ТаблицаТары.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");
	
	ТаблицаТары.ЗаполнитьЗначения(Неопределено, "ДоговорКонтрагента");
	ТаблицаТары.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");
	ТаблицаТары.ЗаполнитьЗначения(Истина,       "СписыватьТолькоПоЗаказуРегл");

	ТаблицаТары.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда
		
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, СтруктураШапкиДокумента.СкладОтправитель,
		                 ТаблицаТары.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		ТаблицаТары.Колонки.Добавить("ВидСклада");
		ТаблицаТары.ЗаполнитьЗначения(Перечисления.ВидыСкладов.Розничный, "ВидСклада");
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТары, ТаблицаПоЦенам, "ВидСклада");
		ТаблицаТары.Колонки.Удалить("ВидСклада");
		
	КонецЕсли;
	ТаблицаТары.Колонки.СуммаПродажная.Имя = "СуммаПродажнаяОтправителя";
	
	ТаблицаТары.Колонки.Добавить("СуммаПродажная", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда
		
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, СтруктураШапкиДокумента.СкладПолучатель,
		                 ТаблицаТары.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		ТаблицаТары.Колонки.Добавить("ВидСклада");
		ТаблицаТары.ЗаполнитьЗначения(Перечисления.ВидыСкладов.Розничный, "ВидСклада");
		
		ТаблицаТары.Колонки.Склад.Имя 	  = "СкладОтправитель";
		ТаблицаТары.Колонки.СкладНовый.Имя = "Склад";
		
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТары, ТаблицаПоЦенам, "ВидСклада");
		
		ТаблицаТары.Колонки.Удалить("ВидСклада");
		
		ТаблицаТары.Колонки.Склад.Имя 	  = "СкладНовый";
		ТаблицаТары.Колонки.СкладОтправитель.Имя = "Склад";
		
	КонецЕсли;
	ТаблицаТары.Колонки.СуммаПродажная.Имя = "СуммаПродажнаяПолучателя";
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоБланкам - результат запроса по табличной части "Бланки",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуБланков(РезультатЗапросаПоБланкам, СтруктураШапкиДокумента)

	ТаблицаБланков = РезультатЗапросаПоБланкам.Выгрузить();
	
	ТаблицаБланков.Колонки.Добавить("Качество");

	ТаблицаБланков.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаБланков.Колонки.Добавить("ДокументОприходования");
	ТаблицаБланков.Колонки.Добавить("Регистратор");
	
	ТаблицаБланков.Колонки.Добавить("СуммаНоминальная");
	ТаблицаБланков.Колонки.Добавить("КоличествоНоминальное");
	
	ТаблицаБланков.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаБланков.ЗагрузитьКолонку(ТаблицаБланков.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");
                                     
    ТаблицаБланков.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаБланков.ЗаполнитьЗначения(Неопределено, "ДоговорКонтрагента");
	ТаблицаБланков.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");

	// Установим параметры запроса
	ПорядокСубконто = Новый Массив();
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад",           СтруктураШапкиДокумента.Склад);
	Запрос.УстановитьПараметр("КонецПериода",    СтруктураШапкиДокумента.Ссылка.МоментВремени());	
	Запрос.УстановитьПараметр("Организация",     СтруктураШапкиДокумента.Организация);	
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	Запрос.УстановитьПараметр("Счет",     		     ТаблицаБланков.ВыгрузитьКолонку("СчетУчетаЗабалансовыйБУ"));
	Запрос.УстановитьПараметр("Номенклатура", 	     ТаблицаБланков.ВыгрузитьКолонку("Номенклатура"));
		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Субконто1 КАК Номенклатура,
		|	СУММА(Остатки.СуммаОстатокДт) КАК СуммаОстаток,
		|	СУММА(Остатки.КоличествоОстатокДт) КАК КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&КонецПериода,
		|			Счет В (&Счет),
		|			&ПорядокСубконто,
		|				Организация = &Организация
		|				И Субконто1 В (&Номенклатура)
		|				И Субконто2 = &Склад) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Субконто1";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	ТаблицаЦен.Индексы.Добавить("Номенклатура");

	Для Каждого Строка из ТаблицаБланков Цикл
				
	НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
		Если НайденныеСтроки.Количество()> 0 Тогда
			СтрокаТаблицыЦен = НайденныеСтроки[0];			
			Строка.СуммаНоминальная = Строка.Количество * Окр(?(СтрокаТаблицыЦен.КоличествоОстаток = 0, 0, СтрокаТаблицыЦен.СуммаОстаток / СтрокаТаблицыЦен.КоличествоОстаток),2,1);
			Строка.КоличествоНоминальное = СтрокаТаблицыЦен.КоличествоОстаток;	
		Иначе
			Строка.СуммаНоминальная = 0;
			Строка.КоличествоНоминальное = 0;
		КонецЕсли;		
	КонецЦикла;
	
	ТаблицаБланков.Колонки.Добавить("СуммаПродажнаяОтправителя", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТаблицаБланков.Колонки.Добавить("СуммаПродажнаяПолучателя", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	
	Возврат ТаблицаБланков;

КонецФункции // ПодготовитьТаблицуБланков()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, СкладОтправитель, СкладПолучатель");

	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование
		И (    СтруктураШапкиДокумента.СуммоваяРозницаОтправитель  = Истина
		   ИЛИ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель  = Истина) Тогда
	
		ОбщегоНазначения.ОшибкаПриПроведении("При виде операции ""Оборудование"" нельзя выбирать неавтоматизироваенную торговую точку в качестве склада отправитель (получателя)!", Отказ, Заголовок);
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ 
	   И ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Перемещение с НТТ по ордерам не осуществляется!", Отказ, Заголовок);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ВнутреннийЗаказ)
	   И Не СтруктураШапкиДокумента.ВидВнутреннегоЗаказа = Перечисления.ВидыВнутреннегоЗаказа.НаСклад Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Перемещение можно осуществлять только по внутреннему заказу с видом заказа на склад!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения");
	СтруктураОбязательныхПолей.Вставить("Качество");
	
	Если (    СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ
	      Или СтруктураШапкиДокумента.ВидСкладаПолучателя  = Перечисления.ВидыСкладов.НТТ)
	   И (Не мРазрешитьНулевыеЦеныВРознице) Тогда
		СтруктураОбязательныхПолей.Вставить("Цена");
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда	
		
		Если   СтруктураШапкиДокумента.СуммоваяРозницаОтправитель  = Истина
		   ИЛИ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель  = Истина Тогда
			   
			СтруктураОбязательныхПолей.Вставить("СтавкаНДСВРознице");   
			   
		КонецЕсли;
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("НовыйСчетУчетаБУ");
			
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
		   	СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");		   	
		КонецЕсли; 
		
	КонецЕсли;	
	
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов-пакетов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	Если НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование 
		И (     (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный) 
			ИЛИ (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный)) Тогда
			
			// АТТ в продажных ценах
			Для Каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
				Если  (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)  
					и СтрокаТаблицы.СуммаПродажнаяОтправителя = 0 Тогда
					СтрокаСообщения = Локализация.СтрШаблон1("Для товара ""¤1¤"" не задана цена АТТ ""¤2¤""." + Символы.ПС + "Необходимо выполнить переоценку!", СтрокаТаблицы.Номенклатура, СкладОтправитель);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли  (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный)  
					и СтрокаТаблицы.СуммаПродажнаяПолучателя = 0 Тогда					
					СтрокаСообщения = Локализация.СтрШаблон1("Для товара ""¤1¤"" не задана цена АТТ ""¤2¤""." + Символы.ПС + "Необходимо выполнить переоценку!", СтрокаТаблицы.Номенклатура, СкладПолучатель);					
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЦикла;
				
	КонецЕсли;	
	
	ЭтоОборудование = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование);
	
	Если ОтражатьВБухгалтерскомУчете И НЕ Отказ Тогда
	
		Для каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл

			Если НЕ ЭтоОборудование Тогда
				СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Товары"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
			Иначе
				СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Оборудование"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
			КонецЕсли;	
			
			Если   (СтруктураШапкиДокумента.СуммоваяРозницаОтправитель ИЛИ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель)
				 И (СтрокаТЧ.СчетУчетаБУ.Забалансовый ИЛИ СтрокаТЧ.НовыйСчетУчетаБУ.Забалансовый) Тогда
				 
			    СтрокаСообщения = "Указан забалансовый счета бухгалтерского учета!
								  |Нельзя указывать забалансовые счета, если склад получатель (отправитель) является 
								  |НТТ с ведением только суммового учета!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);	
			
			КонецЕсли;
						
			Если НЕ СтрокаТЧ.СчетУчетаБУЗабалансовый = СтрокаТЧ.НовыйСчетУчетаБУЗабалансовый Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + " счет учета получателя (" + СтрокаТЧ.НовыйСчетУчетаБУ + ") и счет учета отправителя (" + СтрокаТЧ.СчетУчетаБУ + ") не совпадают в разрезе балансовости.",Отказ);
			КонецЕсли;
			
			
			Если  СтруктураШапкиДокумента.ЕстьНДС Тогда
				
			    Если НЕ СтрокаТЧ.НалоговоеНазначение.Пустая() Тогда
				   
				    // проверим корректность указания налогового назначения
					// по всем его реквизитам
					Если СтруктураШапкиДокумента.ЕстьНДС
					   И (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ ИЛИ СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
					   И (СтруктураШапкиДокумента.СуммоваяРозницаОтправитель ИЛИ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель)
					   И НЕ СтрокаТЧ.СтавкаНДСВРознице.Пустая()
					   И НЕ СтрокаТЧ.НалоговоеНазначение.ВидДеятельностиНДС = УчетНДС.ПолучитьВидДеятельностиНДС(СтрокаТЧ.СтавкаНДСВРознице) Тогда
						   
					   СтрокаСообщения = "Указано некорректное налоговое назначение! Вид деятельности НДС не соответствует ставке НДС, указанной в строке";
				       ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
							
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;		
		
	КонецЕсли;
	
	ПроверитьСтрокиТабличнойЧасти("Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Бланки".
//
// Параметры:
// Параметры: 
//  ТаблицаПоБланкам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиБланкиСтрогогоУчета(ТаблицаПоБланкам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "БланкиСтрогогоУчета";
	
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("НовыйСчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("СчетУчетаЗабалансовыйБУ");
		СтруктураОбязательныхПолей.Вставить("НовыйСчетУчетаЗабалансовыйБУ");	

		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");   
		КонецЕсли; 
		
	КонецЕсли;
			
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БланкиСтрогогоУчета", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "БланкиСтрогогоУчета", ТаблицаПоБланкам, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "БланкиСтрогогоУчета", ТаблицаПоБланкам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНЕБланковСтрогогоУчета(ЭтотОбъект, "БланкиСтрогогоУчета", ТаблицаПоБланкам, Отказ, Заголовок);
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаПоБланкам Цикл
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Бланки"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
		Если НЕ СтрокаТЧ.СчетУчетаБУЗабалансовый = СтрокаТЧ.НовыйСчетУчетаБУЗабалансовый Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке +""" счет учета получателя (" + СтрокаТЧ.НовыйСчетУчетаБУ + ") и счет учета отправителя (" + СтрокаТЧ.СчетУчетаБУ + ") не совпадают в разрезе балансовости.",Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество");

	Если  СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		СтруктураОбязательныхПолей.Вставить("НовыйСчетУчетаБУ");
			
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
		   	СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");				   	
		КонецЕсли; 
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара",СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов-пакетов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	Если    (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный) 
		ИЛИ (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
			
			// АТТ в продажных ценах
			Для Каждого СтрокаТаблицы Из ТаблицаПоТаре Цикл
				Если  (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)  
					и СтрокаТаблицы.СуммаПродажнаяОтправителя = 0 Тогда
					СтрокаСообщения = Локализация.СтрШаблон1("Для товара ""¤1¤"" не задана цена АТТ ""¤2¤""." + Символы.ПС + "Необходимо выполнить переоценку!", СтрокаТаблицы.Номенклатура, СкладОтправитель);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				ИначеЕсли  (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный)  
					и СтрокаТаблицы.СуммаПродажнаяПолучателя = 0 Тогда
					СтрокаСообщения = Локализация.СтрШаблон1("Для товара ""¤1¤"" не задана цена АТТ по складу ""¤2¤""." + Символы.ПС + "Необходимо выполнить переоценку!", СтрокаТаблицы.Номенклатура, СкладПолучатель);
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЦикла;
				
	КонецЕсли;	
		
	ПроверитьСтрокиТабличнойЧасти("Возвратная тара", ТаблицаПоТаре, Отказ, Заголовок);
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаПоТаре Цикл
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""Тара"": ", СокрЛП(СтрокаТЧ.НомерСтроки));
		Если НЕ СтрокаТЧ.СчетУчетаБУЗабалансовый = СтрокаТЧ.НовыйСчетУчетаБУЗабалансовый Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке +""" счет учета получателя (" + СтрокаТЧ.НовыйСчетУчетаБУ + ") и счет учета отправителя (" + СтрокаТЧ.СчетУчетаБУ + ") не совпадают в разрезе балансовости.",Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

//Проверяет заполнение реквизитов табличных частей, которые зависят от указания реквизита ВнутреннийЗаказ
Процедура  ПроверитьСтрокиТабличнойЧасти(ИмяТЧ, ТЧ, Отказ, Заголовок)
	Для каждого Строка из ТЧ цикл
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
			                               """ табличной части """ + ИмяТЧ + """: ";

		Если не ЗначениеЗаполнено(Строка.ВнутреннийЗаказ) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.ДокументРезерва) Тогда
			Если Строка.ДокументРезерва<>Строка.ВнутреннийЗаказ Тогда
				//неправильный документ резерва
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указан документ резерва, отличающийся от значения реквизита ""Внутренний заказ""" , Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		Если Строка.ВнутреннийЗаказ.ВидЗаказа <> Перечисления.ВидыВнутреннегоЗаказа.НаСклад Тогда
			//неправильный внутренний заказ
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указан Внутренний заказ с видом заказа """+Строка.ВнутреннийЗаказ.ВидЗаказа+""". Может быть указан только заказ с видом ""На склад"" " , Отказ, Заголовок);
        КонецЕсли;
		
		Если Строка.СкладВнутреннегоЗаказа <> СкладПолучатель Тогда
			// неправильный склад
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указан Внутренний заказ, в котором склад-заказчик отличается от склада-получателя, указанного в шапке документа" , Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);
	ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);
    ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);
	
	// Отражение в партионном учете
	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		
		ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);
		
		ТаблицаДвиженийПоСписаннымТоварам = Движения.СписанныеТовары.Выгрузить();
		Если ТаблицаДвиженийПоСписаннымТоварам.Количество()>0 Тогда
			
			// Зарегистрируем в пследовательности
			ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
			ЗаписьРегистрации.Период = Дата;
			
			// Проводить по партиям сразу нужно если установлен параметр
			// учетной политики СписыватьПартииПриПроведенииДокументов
			ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;

			Если ПроводитьПоПартиям Тогда
				
				УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаДвиженийПоСписаннымТоварам);
				
			Иначе
				
				// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
				Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
					УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация)
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок)
	
	Если НЕ ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам Тогда
			
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			Движения.ТоварыКПередачеСоСкладов.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
			Движения.ТоварыКПередачеСоСкладов.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
			
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыКПередачеСоСкладов
		Если НЕ Отказ Тогда
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТаре);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыКПередачеСоСкладов, СтруктТаблицДокумента);
		
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",            СкладОтправитель);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументПередачи", Ссылка);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",     Перечисления.СтатусыПартийТоваров.Купленный,      "ТаблицаПоТоварам");
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",     Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаПоТаре");
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",         Справочники.Качество.Новый,                       "ТаблицаПоТаре");
					
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПередачеСоСкладов, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
		// Если мы перемещаем в НТТ, то надо сделать приход по специальному регистру
		Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ И НЕ Отказ Тогда
			
			// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыКПеремещениюВНТТ
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТаре);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыКПеремещениюВНТТ, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",               СкладПолучатель);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументПеремещения", Ссылка);
					
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПеремещениюВНТТ, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыВРезервеНаСкладах
		ТаблицаПоТоварамРезерв = УдалитьСтрокиНеТребующиеРезервПоЗаказ(ТаблицаПоТоварам);
		ТаблицаПоТареРезерв    = УдалитьСтрокиНеТребующиеРезервПоЗаказ(ТаблицаПоТаре);
		
		Если ТаблицаПоТоварамРезерв.Количество() > 0 ИЛИ ТаблицаПоТареРезерв.Количество() > 0 Тогда
			
			// Проверка остатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				Движения.ТоварыВРезервеНаСкладах.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
				Движения.ТоварыВРезервеНаСкладах.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;
			
			Если Не Отказ Тогда

				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамРезерв);
				СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареРезерв);
											
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
										
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладОтправитель);
												
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
			КонецЕсли;
			
		КонецЕсли;
		
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыКПолучениюНаСклады
		ТаблицаПоТоварамКПолучению = ПодготовитьТаблицуТоваровКПолучению(ТаблицаПоТоварам);
		ТаблицаПоТареКПолучению    = ПодготовитьТаблицуТоваровКПолучению(ТаблицаПоТаре);
		
		Если ТаблицаПоТоварамКПолучению.Количество() > 0 ИЛИ ТаблицаПоТареКПолучению.Количество() > 0 Тогда
			
			// Проверка остатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				Движения.ТоварыКПолучениюНаСклады.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
				Движения.ТоварыКПолучениюНаСклады.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;
			
			Если НЕ Отказ Тогда
			
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамКПолучению);
				СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареКПолучению);
											
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыКПолучениюНаСклады, СтруктТаблицДокумента);
										
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",        СкладОтправитель);
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.Купленный,      "ТаблицаПоТоварам");
				 ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаПоТаре");
												
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
				
			КонецЕсли;
				
		КонецЕсли;
			
	Иначе // Не по ордерам.
		
		Если СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
				
			ТаблицаНаценок  = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаНТТ(Ссылка, СкладОтправитель, мРазделятьПоСтавкамНДС);
			
			ВалютаУправленческогоУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");
			Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, Дата);
			
			ОтборНаценки = Новый Структура();
			ОтборНаценки.Вставить("Склад", СтруктураШапкиДокумента.Склад);
				
			Для каждого Строка Из ТаблицаПоТоварам  Цикл
					
				Если мРазделятьПоСтавкамНДС Тогда
					ОтборНаценки.Вставить("СтавкиНДС", Строка.СтавкаНДСВРознице);
				КонецЕсли;	
					
				НайденныеСтроки = ТаблицаНаценок.НайтиСтроки(ОтборНаценки);
				Если НайденныеСтроки.Количество()>0 Тогда
					СтрокаТаблицыНаценок = НайденныеСтроки[0];
				Иначе
					СтрокаТаблицыНаценок = Неопределено
				КонецЕсли;
					
				Сумма = Строка.СуммаВРознице;
				СуммаНаценки = 0;
				ПокупнаяЦена = 0;
				Если СтрокаТаблицыНаценок = Неопределено Тогда
					ПокупнаяЦена = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС = 0 Тогда
					СуммаНаценки = Окр(СтрокаТаблицыНаценок.ТН * Сумма / (СтрокаТаблицыНаценок.ПС), 2);
					ПокупнаяЦена = Сумма - СуммаНаценки;
				Иначе
					ПокупнаяЦена = 0;
				КонецЕсли;

				ПроводкаПартии = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();
								
				ПроводкаПартии.Активность  = Истина;
				ПроводкаПартии.ВидДвижения = ВидДвиженияНакопления.Расход;
				ПроводкаПартии.Период 	   = Дата;
				ПроводкаПартии.Регистратор = Ссылка;
								
				ПроводкаПартии.Склад 	   = СтруктураШапкиДокумента.СкладОтправитель;
								
				Если мРазделятьПоСтавкамНДС Тогда
					ПроводкаПартии.СтавкаНДС= Строка.СтавкаНДСВРознице;
				КонецЕсли; 
								
				ПроводкаПартии.Сумма 		 = ПокупнаяЦена+СуммаНаценки;
				ПроводкаПартии.СуммаНаценки  = СуммаНаценки;
					
				ПроводкаПартии.Номенклатура  = Строка.Номенклатура;
				ПроводкаПартии.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры;
					
				ПроводкаПартии.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат;
				
				// если склад получатель тоже СНТТ - сформируем проводку
				// иначе - сформируем партию товаров на складах.
				Если СтруктураШапкиДокумента.СуммоваяРозницаПолучатель Тогда
						
					ПроводкаПартии = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();
										
					ПроводкаПартии.Активность  = Истина;
					ПроводкаПартии.ВидДвижения = ВидДвиженияНакопления.Приход;
					ПроводкаПартии.Период 	   = Дата;
					ПроводкаПартии.Регистратор = Ссылка;
										
					ПроводкаПартии.Склад 	   = СтруктураШапкиДокумента.СкладПолучатель;
										
					Если мРазделятьПоСтавкамНДС Тогда
						ПроводкаПартии.СтавкаНДС= Строка.СтавкаНДСВРознице;
					КонецЕсли; 
										
					ПроводкаПартии.Сумма 		 = ПокупнаяЦена+СуммаНаценки;
					ПроводкаПартии.СуммаНаценки  = СуммаНаценки;
							
					ПроводкаПартии.Номенклатура  = Строка.Номенклатура;
					ПроводкаПартии.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры;
							
					ПроводкаПартии.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Поступление;
						
				Иначе
					
					ПроводкаПартии = Движения.ПартииТоваровНаСкладах.Добавить();
										
					ПроводкаПартии.Активность  = Истина;
					ПроводкаПартии.ВидДвижения = ВидДвиженияНакопления.Приход;
					ПроводкаПартии.Период 	   = Дата;
					ПроводкаПартии.Регистратор = Ссылка;
					
					ПроводкаПартии.Номенклатура  			   = Строка.Номенклатура;
					ПроводкаПартии.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры;
					
					Если Строка.ВестиПартионныйУчетПоСериям Тогда
						ПроводкаПартии.СерияНоменклатуры  = Строка.СерияНоменклатуры;
					КонецЕсли;
					Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
						ПроводкаПартии.Склад 	   = СтруктураШапкиДокумента.СкладПолучатель;
					КонецЕсли;
					
					ПроводкаПартии.ДокументОприходования = Ссылка;
					
					ПроводкаПартии.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;
					
					ПроводкаПартии.Качество = Справочники.Качество.Новый;
					
					ПроводкаПартии.Количество	= Строка.Количество;
										
					ПроводкаПартии.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ПокупнаяЦена, 
																		мВалютаРегламентированногоУчета, ВалютаУправленческогоУчета,
																		1, Данные.Курс, 
																		1, Данные.Кратность);
					
					
					ПроводкаПартии.НДС  	 = 0;
							
					ПроводкаПартии.КодОперации   = Перечисления.КодыОперацийПартииТоваров.Оприходование;
						
				КонецЕсли;
				
			КонецЦикла;

		Иначе
			
			// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВНТТ. Расход.
			Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ Тогда
				НаборДвижений = Движения.ТоварыВНТТ;
			ИначеЕсли СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда
				НаборДвижений = Движения.ТоварыВРознице;
			Иначе
				НаборДвижений = Движения.ТоварыНаСкладах;
			КонецЕсли;

			// Проверка остатков при оперативном проведении.
			//Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
			//КонецЕсли;
			
			Если Не Отказ Тогда
				
				ТаблицаПоТоварамКопия = ТаблицаПоТоварам.Скопировать();
				Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда	
					ТаблицаПоТоварамКопия.Колонки.СуммаПродажнаяОтправителя.Имя = "СуммаПродажная";
				КонецЕсли;
				
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамКопия);
												
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
											
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладОтправитель);
																	
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
				
			КонецЕсли;
			
		КонецЕсли;	
						
		// БЛАНКИ ПО РЕГИСТРУ ТоварыНаСкладах Расход.
		Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ Тогда
			НаборДвижений = Движения.ТоварыВНТТ;
		ИначеЕсли СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе	
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;
		
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "БланкиСтрогогоУчета", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоБланкам", ТаблицаПоБланкам);
											
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
										
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладОтправитель);
			Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЦенаВРознице", 0);
			ИначеЕсли СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СуммаПродажная", 0);
			КонецЕсли;
																
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
		// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВНТТ. Расход.
		Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ Тогда
			НаборДвижений = Движения.ТоварыВНТТ;
		ИначеЕсли СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;

		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			ТаблицаПоТареКопия = ТаблицаПоТаре.Скопировать();
			Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.Розничный Тогда	
				ТаблицаПоТареКопия.Колонки.СуммаПродажнаяОтправителя.Имя = "СуммаПродажная";
			КонецЕсли;
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареКопия);
											
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
										
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладОтправитель);
			
			Если НЕ СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ Тогда
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",  Справочники.Качество.Новый,  "ТаблицаПоТаре");
			КонецЕсли;
												
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;			
					
		// ПРИХОД
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВНТТ. 		
		Если СтруктураШапкиДокумента.СуммоваяРозницаПолучатель Тогда
		Иначе				
			Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
				НаборДвижений = Движения.ТоварыВНТТ;
			ИначеЕсли СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда
				НаборДвижений = Движения.ТоварыВРознице;
			Иначе
				НаборДвижений = Движения.ТоварыНаСкладах;
			КонецЕсли;

			ТаблицаПоТоварамКопия = ТаблицаПоТоварам.Скопировать();
			Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда	
				ТаблицаПоТоварамКопия.Колонки.СуммаПродажнаяПолучателя.Имя = "СуммаПродажная";
			КонецЕсли;
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамКопия);
												
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
											
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладПолучатель);
				
			Если (СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный) 
				И (НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование)
				 Тогда
				// Проверка наличия продажных цен на приходуемый товар.
				УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "Товары", ТаблицыДанныхДокумента["ТаблицаПоТоварам"], Отказ, Заголовок);
			КонецЕсли;
													
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);	
			
		КонецЕсли;
			
		// БЛАНКИ ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВРознице
		Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
			НаборДвижений = Движения.ТоварыВНТТ;
		ИначеЕсли СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе	
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоБланкам", ТаблицаПоБланкам);
											
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
										
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладПолучатель);
		Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СуммаПродажная", 0);
		ИначеЕсли СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЦенаВРознице", 0);
		КонецЕсли;
												
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);	
		
		// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВНТТ. Приход.
		Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
			НаборДвижений = Движения.ТоварыВНТТ;
		ИначеЕсли СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;
		
		ТаблицаПоТареКопия = ТаблицаПоТаре.Скопировать();
		Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда	
			ТаблицаПоТареКопия.Колонки.СуммаПродажнаяПолучателя.Имя = "СуммаПродажная";
		КонецЕсли;	
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТареКопия);
											
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
										
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладПолучатель);
			
		Если НЕ СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",  Справочники.Качество.Новый,  "ТаблицаПоТаре");
			Если СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.Розничный Тогда	
				// Проверка наличия продажных цен на приходуемый товар.
				УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "ВозвратнаяТара", ТаблицыДанныхДокумента["ТаблицаПоТаре"], Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
												
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);	
					
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыВРезервеНаСкладах
		//ТаблицаПоТоварамРезерв = УдалитьСтрокиНеТребующиеСнятияСРезерва(ТаблицаПоТоварам);
		//ТаблицаПоТареРезерв    = УдалитьСтрокиНеТребующиеСнятияСРезерва(ТаблицаПоТаре);
		//
		//Если ТаблицаПоТоварамРезерв.Количество() > 0 ИЛИ ТаблицаПоТареРезерв.Количество() > 0 Тогда
		//
		//	// Проверка остатков при оперативном проведении.
		//	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		//		Движения.ТоварыВРезервеНаСкладах.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
		//		Движения.ТоварыВРезервеНаСкладах.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		//	КонецЕсли;
		//	
		//	Если НЕ Отказ Тогда
		//	
		//		СтруктТаблицДокумента = Новый Структура;
		//		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамРезерв);
		//		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареРезерв);
		//									
		//		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
		//								
		//		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладОтправитель);
		//										
		//		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		//		
		//		//приход резерва на склад-получатель
		//		ТаблицаПоТоварамРезерв = УдалитьСтрокиНеТребующиеРезервирования(ТаблицаПоТоварам);
		//		ТаблицаПоТареРезерв    = УдалитьСтрокиНеТребующиеРезервирования(ТаблицаПоТаре);
		//		Если ТаблицаПоТоварамРезерв.Количество() > 0 ИЛИ ТаблицаПоТареРезерв.Количество() > 0 Тогда
		//			СтруктТаблицДокумента = Новый Структура;
		//			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамРезерв);
		//			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареРезерв);
		//			
		//			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);

		//			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладПолучатель);
		//			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		//		КонецЕсли;
		//	
		//	КонецЕсли;
		//	
		//КонецЕсли;
		//
		// ТОВАРЫ И ТАРА ПО РЕГИСТРУ ТоварыКПолучениюНаСклады
		// Для резервов по ордеру надо поменять склад в регистре "Товары к получению на склады"
		ТаблицаПоТоварамКПолучению = ПодготовитьТаблицуТоваровКПолучению(ТаблицаПоТоварам);
		ТаблицаПоТареКПолучению    = ПодготовитьТаблицуТоваровКПолучению(ТаблицаПоТаре);
		
		Если ТаблицаПоТоварамКПолучению.Количество() > 0 ИЛИ ТаблицаПоТареКПолучению.Количество() > 0 Тогда
			
			// Проверка остатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				Движения.ТоварыКПолучениюНаСклады.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
				Движения.ТоварыКПолучениюНаСклады.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;
			
			Если НЕ Отказ Тогда
			
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамКПолучению);
				СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареКПолучению);
											
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыКПолучениюНаСклады, СтруктТаблицДокумента);
										
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",        СкладОтправитель);
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.Купленный,      "ТаблицаПоТоварам");
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаПоТаре");
												
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
				
				// То же в приход на новый склад.
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", СкладПолучатель);
				
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТабЧасти",       "Товары");
	ДопПараметры.Вставить("СтатусПартии",      Перечисления.СтатусыПартийТоваров.Купленный);
	ДопПараметры.Вставить("РежимПроведения",   РежимПроведения);
	ДопПараметры.Вставить("ИмяРеквизитаЗаказ",  "ВнутреннийЗаказ");
	ДопПараметры.Вставить("ЗаказВШапке",        Ложь);
	ТабИсходная = ТаблицаПоТоварам.Скопировать();
	
	ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.Купленный);
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;
	
	ДопПараметры.Вставить("ИмяТабЧасти", "ВозвратнаяТара");
	ДопПараметры.Вставить("СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	ТабИсходная = ТаблицаПоТаре.Скопировать();
	
	ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	Если ТабИсходная.Количество() > 0 Тогда
		УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура  ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, знач СтатусПартии)
	Сч = 0;

	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ЗначениеЗаполнено(СтрокаТаблицы.ВнутреннийЗаказ)  // Считается исполнением внутреннего заказа.
			  И СтрокаТаблицы.ВнутреннийЗаказ.Заказчик = СкладПолучатель Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.ВнутреннийЗаказ, 
																   СтрокаТаблицы.Количество, 
																   СтрокаТаблицы.Номенклатура, 
																   ?(СтатусПартии=Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,неопределено,СтрокаТаблицы.ХарактеристикаНоменклатуры),
																   СтрокаТаблицы.ЕдиницаИзмерения,
																   СтатусПартии);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизаций(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок)
							  
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
								  
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций. 
	НаборДвижений = Движения.ТоварыОрганизаций;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоБланкам, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);	
	
	КонецЕсли;
	

	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
		
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	Иначе 
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОтправитель, "Склад");
	КонецЕсли;
		
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;	
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "БланкиСтрогогоУчета", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;

	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
	ТаблицаДвижений.Очистить();
	
	КопияТаблицыПоТоварам = ТаблицаПоТоварам.Скопировать();
	КопияТаблицыПоТаре    = ТаблицаПоТаре.Скопировать();
	КопияТаблицыПоБланкам = ТаблицаПоБланкам.Скопировать();
	
	КопияТаблицыПоТоварам.Колонки.СчетУчетаБУ.Имя = "СтарыйСчетУчетаБУ";
	КопияТаблицыПоТаре.Колонки.СчетУчетаБУ.Имя    = "СтарыйСчетУчетаБУ";
	КопияТаблицыПоБланкам.Колонки.СчетУчетаБУ.Имя = "СтарыйСчетУчетаБУ";
	
	КопияТаблицыПоТоварам.Колонки.НовыйСчетУчетаБУ.Имя = "СчетУчетаБУ";
	КопияТаблицыПоТаре.Колонки.НовыйСчетУчетаБУ.Имя    = "СчетУчетаБУ";
	КопияТаблицыПоБланкам.Колонки.НовыйСчетУчетаБУ.Имя = "СчетУчетаБУ";
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыПоТаре,    ТаблицаДвижений);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыПоБланкам, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыПоТоварам, ТаблицаДвижений);
	КонецЕсли;

	// Недостающие поля (качество заполнили в "ПередЗаписью" документа).
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");

	Если Не ВестиУчетПоДопРазрезамРегл Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ХарактеристикаНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "СерияНоменклатуры");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Качество");
	КонецЕсли;
	
	Если Не ВестиСкладскойУчетБУ Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	Иначе 
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладПолучатель, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварамИсходная, ТаблицаПоТареИсходная, ТаблицаПоБланкамИсходная, Отказ, Заголовок)

	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтрокиРегистра = 0;
	Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаОтправитель Тогда
		НаборДвижений = Движения.СписанныеТовары;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		
		ТаблицаПоТоварам = ТаблицаПоТоварамИсходная.Скопировать();

		// Удалим строки с документами резерва по ордерам
		НомерСтр=0;
		Пока НомерСтр<ТаблицаПоТоварам.Количество() Цикл
			Если ТаблицаПоТоварам[НомерСтр].РезервБезПраваПродажи=Истина Тогда
				ТаблицаПоТоварам.Удалить(НомерСтр);
			Иначе
				НомерСтр=НомерСтр+1;
			КонецЕсли;
		КонецЦикла;

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
		
		Для Каждого Строка Из ТаблицаПоТоварам Цикл
			
			Движение = ТаблицаДвижений[ТаблицаПоТоварам.Индекс(Строка)];
			
			Если Строка.ОбособленныйУчетТоваровПоЗаказамПокупателей=Истина 
				ИЛИ Строка.ВидЗаказаПокупателя = Перечисления.ВидыОперацийЗаказПокупателя.Переработка
                Тогда         
                Движение.ЗаказПартии = Строка.ДокументРезерва;
				Движение.ЗаказСписания = Строка.ДокументРезерва;
			КонецЕсли;
						
		КонецЦикла;
		
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "СписыватьТолькоПоЗаказу");
		
		// Недостающие поля.
		Для каждого Строка Из ТаблицаДвижений Цикл
			
			НомерСтрокиРегистра = НомерСтрокиРегистра+1;
			Строка.НомерСтрокиДокумента = НомерСтрокиРегистра;
			Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Товары;
		
		КонецЦикла;

		ТаблицаДвижений.ЗаполнитьЗначения(СкладОтправитель,"Склад");
		ТаблицаДвижений.ЗаполнитьЗначения(СкладПолучатель,"СкладПолучатель");

		ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

		Если НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование Тогда 
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус1");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция,"ДопустимыйСтатус2");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВПереработку,"ДопустимыйСтатус3");
			Если НЕ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель Тогда
				ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.НаКомиссию,"ДопустимыйСтатус4");	
			КонецЕсли;
		Иначе
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Оборудование,"ДопустимыйСтатус1");	
		КонецЕсли;
		ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");

		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами,"КодОперацииПартииТоваров");

		// Если Партионный учет по складам  в упр учете
		Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
		КонецЕсли;

		// Если перемещение по ордерам, то партии не списываются документом перемещения
		Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Истина, "НеСписывать");
		КонецЕсли;

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.СписанныеТовары.ВыполнитьДвижения();
		КонецЕсли;
		
	КонецЕсли;
	
	// Бланки ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	
	ТаблицаПоТоварам = ТаблицаПоБланкамИсходная.Скопировать();
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	// Недостающие поля.
	Для каждого Строка Из ТаблицаДвижений Цикл
		
		НомерСтрокиРегистра = НомерСтрокиРегистра+1;
		Строка.НомерСтрокиДокумента = НомерСтрокиРегистра;
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.БланкиСтрогогоУчета;

	КонецЦикла;

	ТаблицаДвижений.ЗаполнитьЗначения(СкладОтправитель,"Склад");
	ТаблицаДвижений.ЗаполнитьЗначения(СкладПолучатель,"СкладПолучатель");

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами,"КодОперацииПартииТоваров");

	// Если Партионный учет по складам  в упр учете
	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	КонецЕсли;

	// Если перемещение по ордерам, то партии не списываются документом перемещения
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "НеСписывать");
	КонецЕсли;

	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	// ТАРА ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	ТаблицаПоТаре = ТаблицаПоТареИсходная.Скопировать();
	НомерСтр = 0;
	Пока НомерСтр<ТаблицаПоТаре.Количество() Цикл
		Если ТаблицаПоТаре[НомерСтр].РезервБезПраваПродажи=Истина Тогда
			ТаблицаПоТаре.Удалить(НомерСтр);
		Иначе
			НомерСтр=НомерСтр+1;
		КонецЕсли;
	КонецЦикла;

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

	// Недостающие поля.
	Для каждого Строка Из ТаблицаДвижений Цикл
		НомерСтрокиРегистра = НомерСтрокиРегистра+1;
		Строка.НомерСтрокиДокумента = НомерСтрокиРегистра;
		Строка.ВидТабличнойЧасти = Перечисления.ВидыТабличныхЧастей.Тара;
	КонецЦикла;

	ТаблицаДвижений.ЗаполнитьЗначения(СкладОтправитель,"Склад");
	ТаблицаДвижений.ЗаполнитьЗначения(СкладПолучатель,"СкладПолучатель");

	ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка,"Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус2");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Продукция,"ДопустимыйСтатус3");
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.ПеремещениеМеждуСкладами,"КодОперацииПартииТоваров");

	// Если Партионный учет по складам  в упр учете
	Если СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
	КонецЕсли;

	// Если перемещение по ордерам, то партии не списываются документом перемещения
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "НеСписывать");
	КонецЕсли;

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
	    Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
	
		Возврат;	
	
	КонецЕсли;
		
	//Если розница
	ПроводкиБУ = Движения.Хозрасчетный;
	
	//Из опта или НТТ без суммового учета
	Если    (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) 
		ИЛИ (     (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
		     И НЕ (СтруктураШапкиДокумента.СуммоваяРозницаОтправитель)) Тогда
						
		//В розницу с продажными ценами
		Если НЕ СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый 
		   И НЕ (     СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ 
		         И НЕ СтруктураШапкиДокумента.СуммоваяРозницаПолучатель) Тогда
				
			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение ТМЦ");
				
			СНТТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ);
			АТТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный);
				
			//Формирование торговой наценки
			Для Каждого Строка Из ТаблицаПоТоварам Цикл
								
				Если Строка.СчетУчетаБУ.Забалансовый Тогда
					// комиссионные товары учитваются по ценам поступления.
					Продолжить;
				КонецЕсли;
								
				//В АТТ с учетом по партиям
				Если АТТ и УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ) Тогда
					
					Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
							
						ТорговаяНаценка = Строка.СуммаПродажнаяПолучателя/Строка.Количество * Партия.Количество - Партия.СуммаСписания;
						ТорговаяНаценкаНУ = Строка.СуммаПродажнаяПолучателя/Строка.Количество * Партия.Количество - Партия.СуммаСписанияНУ;
						СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
														
						Если ТорговаяНаценка <> 0 
							ИЛИ ТорговаяНаценкаНУ <> 0 Тогда
							
							Проводка = ПроводкиБУ.Добавить();
							Проводка.Период      = Дата;
							Проводка.Организация = Организация;
							Проводка.Содержание  = "Торговая наценка";
								
							Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
							Проводка.СчетКт      = СчетНаценки;
														
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
								
							Проводка.Сумма       = ТорговаяНаценка;
							
							Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
							Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
							Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
								 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
								Проводка.СуммаНУДт = ТорговаяНаценкаНУ;
								Проводка.СуммаНУКт = ТорговаяНаценкаНУ;
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
						
				Иначе 						
					// бухгалтерская наценка
					СуммаСписания = 0;
					СуммаСписанияНУ = 0;
					
					Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
						СуммаСписания = СуммаСписания + Партия.СуммаСписания;
						СуммаСписанияНУ = СуммаСписанияНУ + Партия.СуммаСписанияНУ;
					КонецЦикла;
						
					Если АТТ Тогда
						ТорговаяНаценка = Строка.СуммаПродажнаяПолучателя / Строка.Количество * Строка.Количество - СуммаСписания;
						ТорговаяНаценкаНУ = Строка.СуммаПродажнаяПолучателя / Строка.Количество * Строка.Количество - СуммаСписанияНУ;
						СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Иначе
						ТорговаяНаценка = Строка.СуммаВРознице - СуммаСписания;
						ТорговаяНаценкаНУ = Строка.СуммаВРознице - СуммаСписанияНУ;
						СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					КонецЕсли;
						
					Если ТорговаяНаценка <> 0 
						ИЛИ ТорговаяНаценкаНУ <> 0 Тогда
							
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = СчетНаценки;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции", Строка.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции", Строка.НоменклатурнаяПозиция);
							
						Если СНТТ И мРазделятьПоСтавкамНДС Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.КорСубконтоСписанияБУ3);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.КорСубконтоСписанияБУ3);
						КонецЕсли;
							
						Проводка.Сумма       = ТорговаяНаценка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = ТорговаяНаценкаНУ;
							Проводка.СуммаНУКт = ТорговаяНаценкаНУ;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
				
		Иначе //В опт или НТТ по цене приобретения
			УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение ТМЦ");				
				
		КонецЕсли;
			
	//Из АТТ
	ИначеЕсли (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
			
		//Спишем торговую наценку
		ТаблицаНаценок = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаАТТ(Ссылка, СкладОтправитель, ТаблицаПоТоварам.ВыгрузитьКолонку("Номенклатура"), ТаблицаПоТоварам.ВыгрузитьКолонку("НалоговоеНазначение"));
		СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
			
		ПолучательСНТТ =   (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ)
						И (СтруктураШапкиДокумента.СуммоваяРозницаПолучатель);
		ПолучательАТТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный);
		ПолучательОПТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)
						ИЛИ 
						(     (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ)
						 И НЕ (СтруктураШапкиДокумента.СуммоваяРозницаПолучатель));
            
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТоварам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение ТМЦ");
			
		Для Каждого Строка Из ТаблицаПоТоварам Цикл
											
			Если Строка.СчетУчетаБУ.Забалансовый Тогда
				// комиссионные товары учитваются по ценам поступления.
				Продолжить;
			КонецЕсли;
									
			Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
					
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Номенклатура",Строка.Номенклатура);
				СтруктураОтбора.Вставить("Партия",		Партия.Партия);
				СтруктураОтбора.Вставить("НоменклатурнаяПозиция",		Партия.НоменклатурнаяПозиция);
				СтруктураОтбора.Вставить("НалоговоеНазначение",		Строка.НалоговоеНазначение);
					
				СтрокаТаблицыНаценок = ТаблицаНаценок.НайтиСтроки(СтруктураОтбора);
								
				Сумма = Строка.СуммаПродажнаяОтправителя / Строка.Количество * Партия.Количество;
				
				Если СтрокаТаблицыНаценок.Количество() = 0 Тогда
					ПокупнаяЦена = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок[0].ПС = 0 Тогда
					СуммаНаценки = СтрокаТаблицыНаценок[0].ТН * Сумма / (СтрокаТаблицыНаценок[0].ПС);
					ПокупнаяЦена = Сумма - СуммаНаценки;
				Иначе
					ПокупнаяЦена = 0;
				КонецЕсли;
				
				Если НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
					ПокупнаяЦенаНУ = 0;
				ИначеЕсли СтрокаТаблицыНаценок.Количество() = 0 Тогда
					ПокупнаяЦенаНУ = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок[0].ПС_НУ = 0 Тогда
					СуммаНаценкиНУ = СтрокаТаблицыНаценок[0].ТН_НУ * Сумма / (СтрокаТаблицыНаценок[0].ПС_НУ);
					ПокупнаяЦенаНУ = Сумма - СуммаНаценкиНУ;
				Иначе
					ПокупнаяЦенаНУ = 0;
				КонецЕсли;
										
				Если    Сумма - ПокупнаяЦена <> 0
						ИЛИ Сумма - ПокупнаяЦенаНУ <> 0 Тогда
						
					Если ПолучательОПТ Тогда
						// наценку спишем в корреспонденции со счетом учета в АТТ, двумя проводками
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
							
						Проводка.Сумма       = -(Сумма - ПокупнаяЦена);
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = - Сумма + ПокупнаяЦенаНУ;
							Проводка.СуммаНУКт = - Сумма + ПокупнаяЦенаНУ;
						КонецЕсли;
						
						// собственно наценка
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = СчетНаценки;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
							
						Проводка.Сумма       = Сумма - ПокупнаяЦена;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
							Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
						КонецЕсли;
						
					Иначе // АТТ или СНТТ
							
						Если ПолучательАТТ Тогда
							ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
						ИначеЕсли ПолучательСНТТ Тогда
							ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
						КонецЕсли;
							
						// перебросим наценку
						// Наценку нужно списывать правильно, в корреспонденции со счетом учета товара. Иначе будут проблемы при закрытии месяца					
						
						// в начале отсторнируем продажную стоимость на сумму наценки на складе отправителе
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка (корректировка продажной стоимости на стоимость наценки)";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
						КонецЕсли;
							
						Проводка.Сумма       = -(Сумма - ПокупнаяЦена);
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = -(Сумма - ПокупнаяЦенаНУ);
							Проводка.СуммаНУКт = -(Сумма - ПокупнаяЦенаНУ);
						КонецЕсли;
						
						
						// теперь сделаем расход наценки по складу-отправителю
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка (списание наценки при перемещении)";
							
						Проводка.СчетДт      = СчетНаценки;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						
						Проводка.Сумма       = Сумма - ПокупнаяЦена;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
							Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
						КонецЕсли;
						
						
						// теперь сделаем приход наценки по складу-получателю
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = ПолучательСчетНаценки;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
						КонецЕсли;
						
						Проводка.Сумма       = Сумма - ПокупнаяЦена;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
							Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
				// нужно дооценить на складе - получателе
				Если (ПолучательАТТ ИЛИ ПолучательСНТТ) Тогда
					
					Если ПолучательАТТ Тогда
						ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
						СуммаДооценки = Окр((Строка.СуммаПродажнаяПолучателя - Строка.СуммаПродажнаяОтправителя) / Строка.Количество * Партия.Количество, 2); 
					ИначеЕсли ПолучательСНТТ Тогда
						ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
						СуммаДооценки = Окр(Строка.ЦенаВРознице*Партия.Количество - (Строка.СуммаПродажнаяОтправителя) / Строка.Количество * Партия.Количество, 2); 
					КонецЕсли;
					
					Если НЕ СуммаДооценки = 0 Тогда
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка (донаценка на складе-получателе)";
								
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = ПолучательСчетНаценки;
								
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
								
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						
						Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
						КонецЕсли;
						
						Проводка.Сумма = СуммаДооценки;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = СуммаДооценки;
							Проводка.СуммаНУКт = СуммаДооценки;
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
						
	//Из СНТТ
	ИначеЕсли (СтруктураШапкиДокумента.СуммоваяРозницаОтправитель) Тогда
			
		ТаблицаНаценок    = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаНТТБух(Ссылка, СкладОтправитель, ТаблицаПоТоварам.ВыгрузитьКолонку("НалоговоеНазначение"), мРазделятьПоСтавкамНДС);
			
		СчетНаценки 	= ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
		
		ПолучательСНТТ = (СтруктураШапкиДокумента.СуммоваяРозницаПолучатель);
		ПолучательАТТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный);
		ПолучательОПТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)
						ИЛИ 
						(     (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ)
						 И НЕ (СтруктураШапкиДокумента.СуммоваяРозницаПолучатель));
		
		Для Каждого Строка Из ТаблицаПоТоварам Цикл
			
			Если Строка.СчетУчетаБУ.Забалансовый Тогда
				// комиссионные товары учитваются по ценам поступления.
				Продолжить;
			КонецЕсли;

			Если ПолучательАТТ Тогда
				ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
			ИначеЕсли ПолучательСНТТ Тогда
				ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
			Иначе //ПолучательОПТ
				ПолучательСчетНаценки = Неопределено;
			КонецЕсли;
				
			Если мРазделятьПоСтавкамНДС Тогда
				СтрокаТаблицыНаценок = ТаблицаНаценок.Найти(Строка.СтавкаНДСВРознице, "СтавкиНДС");
			Иначе
				СтрокаТаблицыНаценок = ?(ТаблицаНаценок.Количество() > 0, ТаблицаНаценок[0], Неопределено);
			КонецЕсли;
				
			Сумма = Строка.СуммаВРознице;
				
			Если СтрокаТаблицыНаценок = Неопределено Тогда
				ПокупнаяЦена = Сумма;
			ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС = 0 Тогда
				СуммаНаценки = СтрокаТаблицыНаценок.ТН * Сумма / (СтрокаТаблицыНаценок.ПС);
				ПокупнаяЦена = Сумма - СуммаНаценки;
			Иначе
				ПокупнаяЦена = 0;
			КонецЕсли;
			
			Если НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
				ПокупнаяЦенаНУ = 0;
			ИначеЕсли СтрокаТаблицыНаценок = Неопределено Тогда
				ПокупнаяЦенаНУ = Сумма;
			ИначеЕсли НЕ СтрокаТаблицыНаценок.ПС_НУ = 0 Тогда
				СуммаНаценкиНУ = СтрокаТаблицыНаценок.ТН_НУ * Сумма / (СтрокаТаблицыНаценок.ПС_НУ);
				ПокупнаяЦенаНУ = Сумма - СуммаНаценкиНУ;
			Иначе
				ПокупнаяЦенаНУ = 0;
			КонецЕсли;
				
			//Спишем товар из розницы
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = ?(ПолучательОПТ, "Возврат из розницы", "Перемещение ТМЦ");
				
			Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
			Проводка.СчетКт      = Строка.СчетУчетаБУ;
				
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 	"Номенклатура",  Строка.Номенклатура);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 	"НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт,	"Склады",  СтруктураШапкиДокумента.СкладПолучатель);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 	"Партии",  Ссылка);
			Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт,"СтавкиНДС",  Строка.СтавкаНДСВРознице);
			КонецЕсли;
				
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 	"Склады",  СтруктураШапкиДокумента.СкладОтправитель);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 	"Номенклатура",  Строка.Номенклатура);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 	"НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
			Если мРазделятьПоСтавкамНДС Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,"СтавкиНДС",  Строка.СтавкаНДСВРознице);
			КонецЕсли;
				
			Сумма = Строка.СуммаВРознице;
			Проводка.КоличествоДт  = Строка.Количество;				
			Проводка.Сумма         = ПокупнаяЦена;
			
			Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
				Проводка.СуммаНУДт = ПокупнаяЦенаНУ;
				Проводка.СуммаНУКт = ПокупнаяЦенаНУ;
			КонецЕсли;
				
			//Спишем торговую наценку
			Если    Сумма - ПокупнаяЦена   <> 0
					ИЛИ Сумма - ПокупнаяЦенаНУ <> 0 Тогда
					
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = "Торговая наценка";
					
				Проводка.СчетДт      = СчетНаценки;
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  	  СтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
				Если мРазделятьПоСтавкамНДС Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				КонецЕсли;
					
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
					
				Если мРазделятьПоСтавкамНДС Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				КонецЕсли;
					
				Проводка.Сумма  = Сумма - ПокупнаяЦена;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
					 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
					Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
				КонецЕсли;
				
				Если НЕ ПолучательСчетНаценки = Неопределено 
					 И (Сумма - ПокупнаяЦена   <> 0
						    ИЛИ Сумма - ПокупнаяЦенаНУ <> 0) Тогда
					// при необходимости перебрасываем наценку
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период      = Дата;
					Проводка.Организация = Организация;
					Проводка.Содержание  = "Торговая наценка";
						
					Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
					Проводка.СчетКт      = ПолучательСчетНаценки;
						
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Ссылка);
					Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					КонецЕсли;
							
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Ссылка);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
					Если ПолучательСНТТ И мРазделятьПоСтавкамНДС Тогда
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					КонецЕсли;
						
					Проводка.Сумма  = Сумма - ПокупнаяЦена;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
						 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
						Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
					КонецЕсли;
					
					// возможно, нужно дооценить до цены розничного склада
					Если ПолучательАТТ Тогда
						
						СуммаДооценки = Строка.СуммаПродажнаяПолучателя - Сумма; 
						
						Если СуммаДооценки <> 0 Тогда
							Проводка = ПроводкиБУ.Добавить();
							Проводка.Период      = Дата;
							Проводка.Организация = Организация;
							Проводка.Содержание  = "Торговая наценка";
									
							Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
							Проводка.СчетКт      = ПолучательСчетНаценки;
									
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Ссылка);
									
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Ссылка);
							
							Проводка.Сумма = СуммаДооценки;	
							
							Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
							Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
							Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
						 		И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
								Проводка.СуммаНУДт = СуммаДооценки;
								Проводка.СуммаНУКт = СуммаДооценки;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
										
		КонецЦикла;
			
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоТаре, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение ТМЦ");	
	
	// по таре из(в) АТТ необходимо сделать манипуляции с наценками
	//Из опта или НТТ буз суммового учета
	Если    (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) 
		ИЛИ (     (СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
		     И НЕ (СтруктураШапкиДокумента.СуммоваяРозницаОтправитель)) Тогда
						
		//В АТТ
		Если (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				
			//Формирование торговой наценки
			Для Каждого Строка Из ТаблицаПоТаре Цикл
					
				//В АТТ с учетом по партиям
				Если УправлениеЗапасамиПартионныйУчет.НаСчетеВедетсяПартионныйУчет(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ) Тогда
					
					Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
							
						ТорговаяНаценка = Строка.СуммаПродажнаяПолучателя/Строка.Количество * Партия.Количество - Партия.СуммаСписания;
						ТорговаяНаценкаНУ = Строка.СуммаПродажнаяПолучателя/Строка.Количество * Партия.Количество - Партия.СуммаСписанияНУ;
						СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
							
						Если ТорговаяНаценка <> 0 Тогда
							Проводка = ПроводкиБУ.Добавить();
							Проводка.Период      = Дата;
							Проводка.Организация = Организация;
							Проводка.Содержание  = "Торговая наценка";
								
							Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
							Проводка.СчетКт      = СчетНаценки;
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции", Партия.НоменклатурнаяПозиция);
								
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
								
							Проводка.Сумма       = ТорговаяНаценка;
							
							Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
							Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
							Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
								Проводка.СуммаНУДт = ТорговаяНаценкаНУ;
								Проводка.СуммаНУКт = ТорговаяНаценкаНУ;
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
						
				Иначе 						
					// бухгалтерская наценка
					СуммаСписания = 0;
					Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
						СуммаСписания = СуммаСписания + Партия.СуммаСписания;
						СуммаСписанияНУ = СуммаСписанияНУ + Партия.СуммаСписанияНУ;
					КонецЦикла;
						
					ТорговаяНаценка = Строка.СуммаПродажнаяПолучателя / Строка.Количество * Строка.Количество - СуммаСписания;
					ТорговаяНаценкаНУ = Строка.СуммаПродажнаяПолучателя / Строка.Количество * Строка.Количество - СуммаСписанияНУ;
					СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					
					Если ТорговаяНаценка <> 0 Тогда
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = СчетНаценки;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции", Строка.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции", Строка.НоменклатурнаяПозиция);
							
						Проводка.Сумма       = ТорговаяНаценка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						
						Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
							Проводка.СуммаНУДт = ТорговаяНаценкаНУ;
							Проводка.СуммаНУКт = ТорговаяНаценкаНУ;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
	
		//Спишем торговую наценку
		ТаблицаНаценок = УправлениеЗапасамиПартионныйУчет.ТорговаяНаценкаАТТ(Ссылка, СкладОтправитель, ТаблицаПоТаре.ВыгрузитьКолонку("Номенклатура"), ТаблицаПоТаре.ВыгрузитьКолонку("НалоговоеНазначение"));
		СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
			
		ПолучательАТТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный);
		ПолучательОПТ = (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)
						ИЛИ 
						(     (СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ)
						 И НЕ (СтруктураШапкиДокумента.СуммоваяРозницаПолучатель));
			
		Для Каждого Строка Из ТаблицаПоТаре Цикл
				
			Для Каждого Партия Из Строка.СписанныеПартииБУ Цикл
					
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Номенклатура",Строка.Номенклатура);
				СтруктураОтбора.Вставить("Партия",		Партия.Партия);
				СтруктураОтбора.Вставить("НоменклатурнаяПозиция",		Партия.НоменклатурнаяПозиция);
				СтруктураОтбора.Вставить("НалоговоеНазначение",		Строка.НалоговоеНазначение);
					
				СтрокаТаблицыНаценок = ТаблицаНаценок.НайтиСтроки(СтруктураОтбора);
				
				Сумма = Строка.СуммаПродажнаяОтправителя / Строка.Количество * Партия.Количество;
					
				Если СтрокаТаблицыНаценок.Количество() = 0 Тогда
					ПокупнаяЦена = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок[0].ПС = 0 Тогда
					СуммаНаценки = СтрокаТаблицыНаценок[0].ТН * Сумма / (СтрокаТаблицыНаценок[0].ПС);
					ПокупнаяЦена = Сумма - СуммаНаценки;
				Иначе
					ПокупнаяЦена = 0;
				КонецЕсли;
				
				Если НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль = Истина Тогда
					ПокупнаяЦенаНУ = 0;
				ИначеЕсли СтрокаТаблицыНаценок.Количество() = 0 Тогда
					ПокупнаяЦенаНУ = Сумма;
				ИначеЕсли НЕ СтрокаТаблицыНаценок[0].ПС_НУ = 0 Тогда
					СуммаНаценкиНУ = СтрокаТаблицыНаценок[0].ТН_НУ * Сумма / (СтрокаТаблицыНаценок[0].ПС_НУ);
					ПокупнаяЦенаНУ = Сумма - СуммаНаценки;
				Иначе
					ПокупнаяЦенаНУ = 0;
				КонецЕсли;
										
				Если Сумма - ПокупнаяЦена <> 0
					ИЛИ Сумма - ПокупнаяЦенаНУ <> 0 Тогда
						
					Если ПолучательОПТ Тогда
						// наценку спишем в корреспонденции со счетом учета в АТТ, двумя проводками
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
							
						Проводка.Сумма       = -(Сумма - ПокупнаяЦена);
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = ПокупнаяЦенаНУ - Сумма;
							Проводка.СуммаНУКт = ПокупнаяЦенаНУ - Сумма;
						КонецЕсли;
						
						// собственно наценка
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = СчетНаценки;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
							
						Проводка.Сумма       = Сумма - ПокупнаяЦена;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = Сумма - ПокупнаяЦенаНУ;
							Проводка.СуммаНУКт = Сумма - ПокупнаяЦенаНУ;
						КонецЕсли;
						
					Иначе // АТТ 
							
						ПолучательСчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
							
						// перебросим наценку
						Проводка = ПроводкиБУ.Добавить();
						Проводка.Период      = Дата;
						Проводка.Организация = Организация;
						Проводка.Содержание  = "Торговая наценка";
							
						Проводка.СчетДт      = СчетНаценки;
						Проводка.СчетКт      = ПолучательСчетНаценки;
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладОтправитель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
							
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						
						Проводка.Сумма       = Сумма - ПокупнаяЦена;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
							 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
							Проводка.СуммаНУДт = -(Сумма - ПокупнаяЦенаНУ);
							Проводка.СуммаНУКт = -(Сумма - ПокупнаяЦенаНУ);
						КонецЕсли;
						
						Если Строка.СуммаПродажнаяПолучателя <> Строка.СуммаПродажнаяОтправителя Тогда
						// нужно дооценить на складе - получателе
								
							Проводка = ПроводкиБУ.Добавить();
							Проводка.Период      = Дата;
							Проводка.Организация = Организация;
							Проводка.Содержание  = "Торговая наценка";
										
							Проводка.СчетДт      = Строка.КорСчетСписанияБУ;
							Проводка.СчетКт      = ПолучательСчетНаценки;
										
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
										
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  Партия.НоменклатурнаяПозиция);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.СкладПолучатель);
							ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
										
							Проводка.Сумма       = (Строка.СуммаПродажнаяПолучателя - Строка.СуммаПродажнаяОтправителя) / Строка.Количество * Партия.Количество;
							
							Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
							Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
							Если   СтруктураШапкиДокумента.ЕстьНалогНаПрибыль
								 И Строка.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
								Проводка.СуммаНУДт = (Строка.СуммаПродажнаяПолучателя - Строка.СуммаПродажнаяОтправителя) / Строка.Количество * Партия.Количество;
								Проводка.СуммаНУКт = (Строка.СуммаПродажнаяПолучателя - Строка.СуммаПродажнаяОтправителя) / Строка.Количество * Партия.Количество;
							КонецЕсли;
							
						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
						
			КонецЦикла;
		КонецЦикла;
	
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета Тогда
		
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоБланкам, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, ,"Перемещение БСУ");		
		
		// Проводки по бланкам стогого учета		
		Для каждого СтрокаТаблицы Из ТаблицаПоБланкам Цикл
		//проводка по  счету СчетУчетаЗабалансовыйБУ
			Если СтрокаТаблицы.КоличествоНоминальное < СтрокаТаблицы.Количество Тогда
				Учет = "Бух";
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("¤1¤. учет. Строка :¤2¤"
"Не списано ¤3¤ ¤4¤ товара ¤5¤, счет учета ¤6¤", Учет, СтрокаТаблицы.НомерСтроки, (СтрокаТаблицы.Количество - СтрокаТаблицы.КоличествоНоминальное), СтрокаТаблицы.Номенклатура.БазоваяЕдиницаИзмерения, СтрокаТаблицы.Номенклатура, СтрокаТаблицы.СчетУчетаЗабалансовыйБУ), "");

				Отказ = Истина;	
			Иначе		
				ПроводкиБУ = Движения.Хозрасчетный;
				Проводка = ПроводкиБУ.Добавить();
	            Проводка.Период       = Дата;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание   = "Перемещение БСУ";				

				Проводка.СчетДТ       = СтрокаТаблицы.НовыйСчетУчетаЗабалансовыйБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДТ,Проводка.СубконтоДТ,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДТ,Проводка.СубконтоДТ,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДТ,Проводка.СубконтоДТ,"Склады",       СтруктураШапкиДокумента.СкладПолучатель);
				Проводка.КоличествоДТ = СтрокаТаблицы.Количество;

				Проводка.СчетКТ       = СтрокаТаблицы.СчетУчетаЗабалансовыйБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКТ,Проводка.СубконтоКТ,"Номенклатура", СтрокаТаблицы.Номенклатура,Истина, Заголовок);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКТ,Проводка.СубконтоКТ,"НоменклатурныеПозиции", СтрокаТаблицы.НоменклатурнаяПозиция);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКТ,Проводка.СубконтоКТ,"Склады",       СтруктураШапкиДокумента.СкладОтправитель);
				Проводка.КоличествоКТ = СтрокаТаблицы.Количество;			
											
				Проводка.Сумма = СтрокаТаблицы.СуммаНоминальная;
			  КонецЕсли;
		КонецЦикла; // Проводки по бланкам строгого учета

	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда

		Если Не УправлениеЗаказами.ИспользоватьВнутренниеЗаказы() Тогда
			Возврат;
		КонецЕсли;

		// Заполнение шапки
		ОтражатьВУправленческомУчете = Истина;
		ОтражатьВБухгалтерскомУчете  = Ложь;		
		СкладПолучатель    = Основание.Заказчик;
		Организация        = Основание.Организация;
		Ответственный      = Основание.Ответственный;
		Подразделение      = Основание.Подразделение;
		ВнутреннийЗаказ    = Основание.Ссылка;
		Комментарий        = Основание.Комментарий;

		Склад = Неопределено;
		#Если Клиент Тогда
		Если НЕ ВвестиЗначение(Склад, "Выберите склад отправитель", Тип("СправочникСсылка.Склады")) Тогда
			Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		КонецЕсли;
		#КонецЕсли
		СкладОтправитель = Склад;
		
		ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		
		УправлениеЗаказами.ЗаполнитьОстаткамиТоваровСРезервомПоВнутреннемуЗаказу( ЭтотОбъект, Основание, Товары,         	Склад, Дата);
		УправлениеЗаказами.ЗаполнитьОстаткамиТоваровСРезервомПоВнутреннемуЗаказу( ЭтотОбъект, Основание, ВозвратнаяТара, 	Склад, Дата, Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
		ЗаполнитьРозничнуюЦену();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда

		// Заполнение шапки
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
		ОтражатьВБухгалтерскомУчете  = Основание.ОтражатьВБухгалтерскомУчете;		
		Организация                  = Основание.Организация;
		Ответственный                = Основание.Ответственный;
		Подразделение                = Основание.Подразделение;
		Комментарий                  = Основание.Комментарий;

		#Если Клиент Тогда
		Если НЕ ВвестиЗначение(СкладПолучатель, "Выберите склад получатель", Тип("СправочникСсылка.Склады")) Тогда
			СкладПолучатель = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		КонецЕсли;
		#КонецЕсли

		Если Основание.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			СкладОтправитель = Основание.СкладОрдер.Склад;
		Иначе
			СкладОтправитель = Основание.СкладОрдер;
		КонецЕсли;

		Если Основание.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.БланкиСтрогогоУчета Тогда
			ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета;
			ТЧИсточника = Основание.БланкиСтрогогоУчета; 
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
			ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование;	
			ТЧИсточника = Основание.Оборудование;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;	
			ТЧИсточника = Основание.Товары;
		КонецЕсли;
		
		
		// Заполнение таб.части
		Для Каждого ТекСтрокаТовары Из ТЧИсточника Цикл

			Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета Тогда
				НоваяСтрока = БланкиСтрогогоУчета.Добавить();
			Иначе
				НоваяСтрока = Товары.Добавить();
			КонецЕсли;
			
			НоваяСтрока.Номенклатура               = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры          = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения           = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмеренияМест       = ТекСтрокаТовары.ЕдиницаИзмеренияМест;
			НоваяСтрока.Количество                 = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоМест             = ТекСтрокаТовары.КоличествоМест;
			НоваяСтрока.Коэффициент                = ТекСтрокаТовары.Коэффициент;
			Если НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета Тогда
 				НоваяСтрока.Качество                   = Справочники.Качество.Новый;
			КонецЕсли;
			
			Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция Тогда
				НоваяСтрока.ДокументРезерва 	   = ТекСтрокаТовары.Заказ;	
			КонецЕсли;
			
			//заполняем счета учета по умолчанию для склада
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, ?(ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета, "БланкиСтрогогоУчета","Товары"), Истина, Истина);
			
			//переносим нужные реквизиты из основания
			НоваяСтрока.НалоговоеНазначение		   = ТекСтрокаТовары.НалоговоеНазначение;			
			НоваяСтрока.СчетУчетаБУ				   = ТекСтрокаТовары.СчетУчетаБУ;			
			Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета Тогда
			     НоваяСтрока.СчетУчетаЗабалансовыйБУ =  ТекСтрокаТовары.СчетУчетаЗабалансовыйБУ;
			КонецЕсли;
			
		КонецЦикла;

		Для Каждого ТекСтрокаТара Из Основание.ВозвратнаяТара Цикл

			НоваяСтрока = ВозвратнаяТара.Добавить();
			НоваяСтрока.Номенклатура    = ТекСтрокаТара.Номенклатура;
			НоваяСтрока.Количество      = ТекСтрокаТара.Количество;
			НоваяСтрока.ДокументРезерва = ТекСтрокаТара.Заказ;
			
			//заполняем счета учета по умолчанию для склада
			ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "ВозвратнаяТара", Истина, Истина);
			//переносим нужные реквизиты из основания
			НоваяСтрока.НалоговоеНазначение		   = ТекСтрокаТара.НалоговоеНазначение;			
			НоваяСтрока.СчетУчетаБУ				   = ТекСтрокаТара.СчетУчетаБУ;
			
		КонецЦикла;
		
		ЗаполнитьРозничнуюЦену();
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура СвернутьНоменклатуру()Экспорт 
	Товары1 = Товары.Выгрузить();
	Товары1.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,Качество","Количество");
	
	Товары.Очистить();
	ДЛя Каждого Стр Из Товары1 Цикл
		НС = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
	КонецЦикла;
КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Проведение = РежимЗаписи;
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		СвернутьНоменклатуру();
	КонецЕсли;
	
	
	//Если Не РежимЗаписи  = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	Комплект = ОбщегоНазначения.ПроверкаКомплектностиТЗ(Товары.Выгрузить(),Истина);
	//	Если Не Комплект Тогда
	//		Если Вопрос("Товар не комплектен! Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
	//			Отказ = Истина;
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
		
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(БланкиСтрогогоУчета);

	Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
	 Или СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда // В этом случае ДокументРезерва должен быть пуст.

		УстановитьКачество = Ложь;

		Для каждого СтрокаТаблицы Из ЭтотОбъект.Товары Цикл

			Если УстановитьКачество 
			   И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Качество) Тогда
				СтрокаТаблицы.Качество = Справочники.Качество.Новый;
			КонецЕсли;
            Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
				И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВнутреннийЗаказ) Тогда
				СтрокаТаблицы.ДокументРезерва = Неопределено;
			КонецЕсли;
		КонецЦикла;

		Для каждого СтрокаТаблицы Из ЭтотОбъект.ВозвратнаяТара Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
				И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВнутреннийЗаказ) Тогда
				СтрокаТаблицы.ДокументРезерва = Неопределено;
			КонецЕсли;
		КонецЦикла;

	Иначе
		ОбработкаТабличныхЧастей.ЗаполнитьКачествоПоУмолчанию(Товары);
	КонецЕсли;

	Если ВидОперации <> Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета Тогда
		
		БланкиСтрогогоУчета.Очистить();	
		
		Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
		 ИЛИ СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		
			ВозвратнаяТара.Очистить();	
		
		КонецЕсли;
		
	Иначе
		Товары.Очистить();	
		ВозвратнаяТара.Очистить();	
	КонецЕсли;
	
	Если (    ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам)
		И(    (НЕ СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)
		  ИЛИ (НЕ СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)) Тогда
		
		Для Каждого Строка Из Товары Цикл
		
			Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный
				И НЕ Строка.СчетУчетаБУ.Забалансовый Тогда
				Строка.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
			ИначеЕсли СкладОтправитель.СуммовойУчет Тогда
				Строка.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
			КонецЕсли;
			
			Если СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный 
				И НЕ Строка.НовыйСчетУчетаБУ.Забалансовый Тогда
				Строка.НовыйСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
			ИначеЕсли СкладПолучатель.СуммовойУчет Тогда
				Строка.НовыйСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из ВозвратнаяТара Цикл
		
			Если СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Строка.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
			КонецЕсли;
			
			Если СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Строка.НовыйСчетУчетаБУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		Если НЕ мУчетнаяПолитикаНУ.ЕстьНДС Тогда
			// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
			НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
			
			Для каждого СтрокаТЧ  Из Товары Цикл
			    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
			КонецЦикла; 
			Для каждого СтрокаТЧ  Из ВозвратнаяТара Цикл
			    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
			КонецЦикла; 
			Для каждого СтрокаТЧ  Из БланкиСтрогогоУчета Цикл
			    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "Товары");
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "ВозвратнаяТара");
	ОбработкаТабличныхЧастей.ЗаполнитьНоменклатурныеПозицииВТабЧасти(ЭтотОбъект, "БланкиСтрогогоУчета");
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("Склад", СкладОтправитель);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"      ,      "ВалютаУправленческогоУчета",     "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"      ,      "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",      "ВестиПартионныйУчетПоСкладам",   "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОтправитель",     "ВидСклада",                      "ВидСкладаОтправителя");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладПолучатель",      "ВидСклада",                      "ВидСкладаПолучателя");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОтправитель",     "СуммовойУчет",                      "СуммоваяРозницаОтправитель");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладПолучатель",      "СуммовойУчет",                      "СуммоваяРозницаПолучатель");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ВнутреннийЗаказ",      "ВидЗаказа",                      "ВидВнутреннегоЗаказа");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;	
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"            , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("Услуга"                      , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("БланкСтрогогоУчета", "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Набор"                       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                    , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Качество"                    , "Качество");
	СтруктураПолей.Вставить("Цена"                        , "Цена / Коэффициент * Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ДокументРезерва"             , "ДокументРезерва");
	СтруктураПолей.Вставить("ВнутреннийЗаказ"             , "ВнутреннийЗаказ");
	СтруктураПолей.Вставить("СкладВнутреннегоЗаказа"       , "ВнутреннийЗаказ.Заказчик");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"       , "ДокументРезерва.СкладГруппа");
	СтруктураПолей.Вставить("РезервБезПраваПродажи"       , "ДокументРезерва.БезПраваПродажи");
	СтруктураПолей.Вставить("ЗаказПокупателя"             , "ДокументРезерва");
	СтруктураПолей.Вставить("ВидОперации"                 , "ДокументРезерва.ВидОперации");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        "ДокументРезерва.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");

	СтруктураПолей.Вставить("СуммаВРознице"   , "СуммаВРознице");
	СтруктураПолей.Вставить("СтавкаНДСВРознице", "СтавкаНДСВРознице");
	СтруктураПолей.Вставить("СчетУчетаБУ"     , "СчетУчетаБУ");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУ", "НовыйСчетУчетаБУ");
			
	СтруктураПолей.Вставить("НалоговоеНазначение"     		   , "НалоговоеНазначение");
		
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"            , "НоменклатурнаяПозиция");
	
	
	// Поля необходимы для партионного учета
	СтруктураПолей.Вставить("Организация",            "Ссылка.Организация");
	СтруктураПолей.Вставить("Склад",                  "Ссылка.СкладОтправитель");
	СтруктураПолей.Вставить("СкладНовый",             "Ссылка.СкладПолучатель");
	СтруктураПолей.Вставить("КорСчетСписанияБУ",      "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ1", "Номенклатура");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ2", "Ссылка.СкладПолучатель");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ3", "СтавкаНДСВРознице");	
	СтруктураПолей.Вставить("ДоговорКонтрагента"    , "ДокументРезерва.ДоговорКонтрагента"); 
	СтруктураПолей.Вставить("ВидЗаказаПокупателя"   ,  "ДокументРезерва.ВидОперации");	
	СтруктураПолей.Вставить("СчетУчетаБУЗабалансовый",     "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУЗабалансовый","НовыйСчетУчетаБУ.Забалансовый");
		
	Если СтруктураШапкиДокумента.ВидСкладаОтправителя = Перечисления.ВидыСкладов.НТТ
	 Или СтруктураШапкиДокумента.ВидСкладаПолучателя = Перечисления.ВидыСкладов.НТТ Тогда
		СтруктураПолей.Вставить("Цена", "Цена * Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Коэффициент");
	Иначе
		СтруктураПолей.Вставить("Цена", "Цена");
	КонецЕсли;
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	// Получим необходимые данные для проведения и проверки заполенения данных 
	// по табличной части "Возвратная тара".
	СтруктураПолей 		  = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"            , "Номенклатура.ЕдиницаХраненияОстатков");
	СтруктураПолей.Вставить("Количество"                  , "Количество");
	СтруктураПолей.Вставить("Услуга"                      , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"          , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Набор"                       , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                    , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ДокументРезерва"             , "ДокументРезерва");
	СтруктураПолей.Вставить("ВидЗаказаПокупателя"       , "ДокументРезерва.ВидОперации");
	СтруктураПолей.Вставить("ВнутреннийЗаказ"           , "ВнутреннийЗаказ");
	СтруктураПолей.Вставить("СкладВнутреннегоЗаказа"    , "ВнутреннийЗаказ.Заказчик");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"     , "ДокументРезерва.СкладГруппа");
	СтруктураПолей.Вставить("РезервБезПраваПродажи"       , "ДокументРезерва.БезПраваПродажи");
	СтруктураПолей.Вставить("ЗаказПокупателя"             , "ДокументРезерва");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
						  "ДокументРезерва.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ВестиУчетПоХарактеристикам", "Номенклатура.ВестиУчетПоХарактеристикам");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям" , "Номенклатура.ВестиПартионныйУчетПоСериям");

	СтруктураПолей.Вставить("СчетУчетаБУ"     , "СчетУчетаБУ");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУ", "НовыйСчетУчетаБУ");
		
	СтруктураПолей.Вставить("НалоговоеНазначение"     		   , "НалоговоеНазначение");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"            , "НоменклатурнаяПозиция");
	
	СтруктураПростыхПолей.Вставить("СчетУчетаНУ"    	, ПланыСчетов.Налоговый.Запасы);
	СтруктураПростыхПолей.Вставить("КорСчетСписанияНУ"  , ПланыСчетов.Налоговый.Запасы);
	
	// Поля необходимы для партионного учета
	СтруктураПолей.Вставить("Организация",            "Ссылка.Организация");
	СтруктураПолей.Вставить("Склад",                  "Ссылка.СкладОтправитель");
	СтруктураПолей.Вставить("СкладНовый",             "Ссылка.СкладПолучатель");	
	СтруктураПолей.Вставить("КорСчетСписанияБУ",      "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ1", "Номенклатура");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ2", "Ссылка.СкладПолучатель");
	
	СтруктураПолей.Вставить("СчетУчетаБУЗабалансовый",     "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУЗабалансовый","НовыйСчетУчетаБУ.Забалансовый");
	
	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей, СтруктураПростыхПолей);

	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Бланки".
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"                , "Номенклатура");
	СтруктураПолей.Вставить("Количество"                  , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"  , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"           , "СерияНоменклатуры");
	СтруктураПолей.Вставить("Услуга"                      , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("БланкСтрогогоУчета", "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("Набор"                       , "Номенклатура.Набор");
	
	СтруктураПолей.Вставить("СчетУчетаБУ"     , "СчетУчетаБУ");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУ", "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаЗабалансовыйБУ"     , "СчетУчетаЗабалансовыйБУ");
	СтруктураПолей.Вставить("НовыйСчетУчетаЗабалансовыйБУ", "НовыйСчетУчетаЗабалансовыйБУ");
    		
	СтруктураПолей.Вставить("НалоговоеНазначение"     		   , "НалоговоеНазначение");
	
	СтруктураПолей.Вставить("НоменклатурнаяПозиция"            , "НоменклатурнаяПозиция");
	
	// Поля необходимы для партионного учета
	СтруктураПолей.Вставить("Организация",            "Ссылка.Организация");
	СтруктураПолей.Вставить("Склад",                  "Ссылка.СкладОтправитель");
	СтруктураПолей.Вставить("СкладНовый",             "Ссылка.СкладПолучатель");
	СтруктураПолей.Вставить("КорСчетСписанияБУ",      "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ1", "Номенклатура");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ2", "Ссылка.СкладПолучатель");
	
	СтруктураПолей.Вставить("СчетУчетаБУЗабалансовый",     "СчетУчетаБУ.Забалансовый");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУЗабалансовый","НовыйСчетУчетаБУ.Забалансовый");
	
	
	РезультатЗапросаПоБланкам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "БланкиСтрогогоУчета", СтруктураПолей, СтруктураПростыхПолей);
	
	// Подготовим таблицу товаров и тары для проведения.
	ТаблицаПоТоварам 	= ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	ТаблицаПоТаре 		= ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента);
	ТаблицаПоБланкам	= ПодготовитьТаблицуБланков(РезультатЗапросаПоБланкам, СтруктураШапкиДокумента);

	// Проверить заполнение ТЧ "Товары" и "Возвратная тара".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиБланкиСтрогогоУчета(ТаблицаПоБланкам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоБланкам, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
		

КонецПроцедуры // ОбработкаПроведения()

// Функция удаляет из исходной таблицы строки не требующие снятия с резерва.
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиНеТребующиеСнятияСРезерва(ТабТовары)

	ТаблицаПоТоварамРезерв = ТабТовары.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРезерв.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРезерв.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ДокументРезерва) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
		   И НЕ СтрокаТаблицы.РезервБезПраваПродажи) Тогда
			ТаблицаПоТоварамРезерв.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамРезерв;
	
КонецФункции // УдалитьСтрокиНеТребующиеСнятияСРезерва()

// Функция удаляет из исходной таблицы строки не требующие резервирования.
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиНеТребующиеРезервирования(ТабТовары)

	ТаблицаПоТоварамРезерв = ТабТовары.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРезерв.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРезерв.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ДокументРезерва) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
		   И НЕ СтрокаТаблицы.РезервБезПраваПродажи) 
		   ИЛИ (ЗначениеЗаполнено(СтрокаТаблицы.ВнутреннийЗаказ) И СтрокаТаблицы.СкладВнутреннегоЗаказа = СкладПолучатель)
		   Тогда
			ТаблицаПоТоварамРезерв.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамРезерв;
	
КонецФункции // УдалитьСтрокиНеТребующиеСнятияСРезерва()

// Функция удаляет из исходной таблицы строки не требующие снятия с резерва.
// Возвращается КОПИЯ исходной таблицы.
//
Функция ПодготовитьТаблицуТоваровКПолучению(ТабТовары)

	ТаблицаПоТоварамКПолучению = ТабТовары.Скопировать();
	ТаблицаПоТоварамКПолучению.Колонки.Добавить("ДокументПолучения");
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамКПолучению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамКПолучению.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) ИЛИ ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			ТаблицаПоТоварамКПолучению.Удалить(СтрокаТаблицы);
		Иначе 
			СтрокаТаблицы.ДокументПолучения = СтрокаТаблицы.ДокументРезерва;
			Если не СтрокаТаблицы.ДокументРезерва.БезПраваПРодажи Тогда
				СтрокаТаблицы.ДокументРезерва = неопределено;
			КонецЕсли;
			
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамКПолучению;
	
КонецФункции // ПодготовитьТаблицуТоваровКПолучению()

// Функция удаляет из исходной таблицы строки не требующие резерва.
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиНеТребующиеРезервПоЗаказ(ТабТовары)

	ТаблицаПоТоварамРезерв = ТабТовары.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРезерв.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРезерв.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ДокументРезерва) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
		   И НЕ СтрокаТаблицы.РезервБезПраваПродажи) Тогда
			ТаблицаПоТоварамРезерв.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамРезерв;
	
КонецФункции // УдалитьСтрокиНеТребующиеРезервПоЗаказ()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Бух");

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Нал");

	СтруктураШапкиДокумента.Вставить("ПартионныйУчетБУ",	УправлениеЗапасами.ВедетсяПартионныйУчет(мУчетнаяПолитикаБУ));

	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль", 	мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"           , 	мУчетнаяПолитикаНУ.ЕстьНДС);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры
             
Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт 

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Ссылка.Дата, УчетнаяПолитикаНеЗадана, Ссылка.Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
	ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
	ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
	
КонецПроцедуры

// Функция проверяет, есть ли НТТ среди склада-отправителя или склад-получателя.
//
// Возвращаемое значение:
//  Булево. Истина, если отправитель или получатель - НТТ.
//
Функция ЕстьНТТ() Экспорт

	ВидНТТ = Перечисления.ВидыСкладов.НТТ;

	Возврат (СкладОтправитель.ВидСклада = ВидНТТ Или СкладПолучатель.ВидСклада = ВидНТТ);

КонецФункции // ЕстьНТТ()

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата,Ссылка.Организация, Ложь);

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));
мПараметрыСвязиСтрокТЧ.Вставить("СоставНабора", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));
