функция СтарыйЗапрос()	
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.ИгнорироватьНоль, ЛОЖЬ)) КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТВсеХарактеристики
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		|		ПО ХарактеристикиНоменклатуры.Ссылка = ГруппыХарактеристикХарактеристики.Характеристика
		|ГДЕ
		|	(ХарактеристикиНоменклатуры.Владелец В ИЕРАРХИИ (&Номенклатура)
		|			ИЛИ &НоменклатураВыбрана)
		|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код <> ""000000010""
		|	И НЕ ХарактеристикиНоменклатуры.Владелец.НеВыгружатьНаРозетку
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиНоменклатуры.Владелец,
		|	ХарактеристикиНоменклатуры.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.НеВыгружать, ЛОЖЬ))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
		|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
		|	СУММА(КомплектующиеНоменклатуры.Количество) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.ИгнорироватьНоль, ЛОЖЬ)) КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТКомплектующие
		|ИЗ
		|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		|		ПО КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры = ГруппыХарактеристикХарактеристики.Характеристика
		|ГДЕ
		|	(КомплектующиеНоменклатуры.Номенклатура В ИЕРАРХИИ (&Номенклатура)
		|			ИЛИ &НоменклатураВыбрана)
		|	И КомплектующиеНоменклатуры.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|	И НЕ КомплектующиеНоменклатуры.Номенклатура.НеВыгружатьНаРозетку
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектующиеНоменклатуры.Комплектующая,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей,
		|	КомплектующиеНоменклатуры.Номенклатура,
		|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.НеВыгружать, ЛОЖЬ))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комплектующая,
		|	ХарактеристикаКомплектующей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТКомплектующие.Номенклатура КАК Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ВТКомплектующие.Количество > 0
		|					И (ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) / ВТКомплектующие.Количество > 0.5
		|				ТОГДА ВЫРАЗИТЬ((ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) / ВТКомплектующие.Количество - 0.5 КАК ЧИСЛО(15, 0))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Остаток,
		|	ВТКомплектующие.ИгнорироватьНоль КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТ_НКРучные
		|ИЗ
		|	ВТКомплектующие КАК ВТКомплектующие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТКомплектующие.Комплектующая = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТКомплектующие.ХарактеристикаКомплектующей = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТКомплектующие.Комплектующая = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТКомплектующие.ХарактеристикаКомплектующей = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКомплектующие.Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры,
		|	ВТКомплектующие.ИгнорироватьНоль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТВсеХарактеристики.Номенклатура КАК Номенклатура,
		|	ВТВсеХарактеристики.ХарактеристикаНоменклатуры КАК Характеристика
		|ПОМЕСТИТЬ ВТХарактеристикиВНаличии
		|ИЗ
		|	ВТВсеХарактеристики КАК ВТВсеХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТВсеХарактеристики.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТВсеХарактеристики.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТВсеХарактеристики.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТВсеХарактеристики.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТВсеХарактеристики.ИгнорироватьНоль
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НКРучные.Номенклатура,
		|	ВТ_НКРучные.ХарактеристикаНоменклатуры
		|ИЗ
		|	ВТ_НКРучные КАК ВТ_НКРучные
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ_НКРучные.ИгнорироватьНоль
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВТ_НКРучные.Остаток > 0
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТХарактеристикиВНаличии.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Ткани.Свойство, НЕОПРЕДЕЛЕНО) КАК СвойствоТкань,
		|	ЕСТЬNULL(Ткани.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеТкань,
		|	ЕСТЬNULL(Цвета.Свойство, НЕОПРЕДЕЛЕНО) КАК СвойствоЦвет,
		|	ЕСТЬNULL(Цвета.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеЦвет
		|ПОМЕСТИТЬ ВТТканиИЦвета
		|ИЗ
		|	ВТХарактеристикиВНаличии КАК ВТХарактеристикиВНаличии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Ткани
		|		ПО ВТХарактеристикиВНаличии.Характеристика = Ткани.Объект
		|			И (Ткани.Свойство.Код = ""000000065"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Цвета
		|		ПО ВТХарактеристикиВНаличии.Характеристика = Цвета.Объект
		|			И (Цвета.Свойство.Код = ""000000069""
		|				ИЛИ Цвета.Свойство.Код = ""000000072"")
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТХарактеристикиВНаличии.Номенклатура,
		|	СвойствоТкань,
		|	СвойствоЦвет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ЗначенияСвойствОбъектов.Объект КАК ХарактеристикаНоменклатуры
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТТканиИЦвета.Номенклатура КАК Номенклатура,
		|		ЗначенияСвойствОбъектов.Объект КАК ХарактеристикаНоменклатуры,
		|		ВТТканиИЦвета.СвойствоЦвет КАК СвойствоЦвет,
		|		ВТТканиИЦвета.ЗначениеЦвет КАК ЗначениеЦвет
		|	ИЗ
		|		ВТТканиИЦвета КАК ВТТканиИЦвета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ПО ВТТканиИЦвета.Номенклатура = ЗначенияСвойствОбъектов.Объект.Владелец
		|				И (ВЫБОР
		|					КОГДА ВТТканиИЦвета.СвойствоТкань <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ВТТканиИЦвета.СвойствоТкань = ЗначенияСвойствОбъектов.Свойство
		|								И ВТТканиИЦвета.ЗначениеТкань = ЗначенияСвойствОбъектов.Значение
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ВложенныйЗапрос.ХарактеристикаНоменклатуры = ЗначенияСвойствОбъектов.Объект
		|			И ВложенныйЗапрос.СвойствоЦвет = ЗначенияСвойствОбъектов.Свойство
		|			И ВложенныйЗапрос.ЗначениеЦвет = ЗначенияСвойствОбъектов.Значение
		|ГДЕ
		|	НЕ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТканиИЦвета.Номенклатура,
		|	ЗначенияСвойствОбъектов.Объект
		|ИЗ
		|	ВТТканиИЦвета КАК ВТТканиИЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ВТТканиИЦвета.Номенклатура = ЗначенияСвойствОбъектов.Объект.Владелец
		|			И (ВЫБОР
		|				КОГДА ВТТканиИЦвета.СвойствоТкань = НЕОПРЕДЕЛЕНО
		|					ТОГДА ВТТканиИЦвета.СвойствоЦвет = ЗначенияСвойствОбъектов.Свойство
		|							И ВТТканиИЦвета.ЗначениеЦвет = ЗначенияСвойствОбъектов.Значение
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	НЕ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристики.Номенклатура КАК Номенклатура,
		|	ВТХарактеристики.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры) КАК ХарактеристикаНК
		|ПОМЕСТИТЬ ВТХарактеристики_С_НК
		|ИЗ
		|	ВТХарактеристики КАК ВТХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ПО (КомплектующиеНоменклатуры.Номенклатура.ВидНоменклатуры.Код <> ""000000010"")
		|			И ВТХарактеристики.Номенклатура = КомплектующиеНоменклатуры.Комплектующая
		|			И ВТХарактеристики.ХарактеристикаНоменклатуры = КомплектующиеНоменклатуры.ХарактеристикаКомплектующей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТХарактеристики.Номенклатура,
		|	ВТХарактеристики.ХарактеристикаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	ХарактеристикаНК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристики_С_НК.Номенклатура КАК Номенклатура,
		|	ВТХарактеристики_С_НК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки
		|ПОМЕСТИТЬ ВТХарактеристикиСкидкиНаценки
		|ИЗ
		|	ВТХарактеристики_С_НК КАК ВТХарактеристики_С_НК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Комплект)
		|					И (КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &Дата
		|						ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|					И (ПолучательСкидки = НЕОПРЕДЕЛЕНО
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|					И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
		|					И (ЗначениеУсловия = НЕОПРЕДЕЛЕНО
		|						ИЛИ ЗначениеУсловия = 0
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.ПустаяСсылка)
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка))) КАК СкидкиНаценкиНоменклатурыСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВТХарактеристики_С_НК.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|					ТОГДА ВТХарактеристики_С_НК.Номенклатура = СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура
		|				ИНАЧЕ ВТХарактеристики_С_НК.ХарактеристикаНК.Владелец = СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТХарактеристики_С_НК.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|					ТОГДА ВТХарактеристики_С_НК.ХарактеристикаНоменклатуры = СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|				ИНАЧЕ ВТХарактеристики_С_НК.ХарактеристикаНК = СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|			КОНЕЦ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТКомплектующие.Номенклатура КАК Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТКомплектующие.Комплектующая КАК Комплектующая,
		|	ВТКомплектующие.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
		|	ВТКомплектующие.Количество КАК Количество
		|ИЗ
		|	ВТКомплектующие КАК ВТКомплектующие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.Родитель.Родитель КАК Группа,
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура КАК Номенклатура,
		|	ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ВТВсеХарактеристики.ИгнорироватьНоль КАК ИгнорироватьНоль,
		|	ЛОЖЬ КАК ЭтоНаборКомплектРучной,
		|	ВТХарактеристикиСкидкиНаценки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
		|ИЗ
		|	ВТХарактеристикиСкидкиНаценки КАК ВТХарактеристикиСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеХарактеристики КАК ВТВсеХарактеристики
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ВТВсеХарактеристики.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ВТВсеХарактеристики.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.ВидНоменклатуры.Код <> ""000000010""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.Родитель.Родитель,
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура,
		|	ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры,
		|	ВТ_НКРучные.Остаток,
		|	ВТ_НКРучные.ИгнорироватьНоль,
		|	ИСТИНА,
		|	ВТХарактеристикиСкидкиНаценки.ПроцентСкидкиНаценки
		|ИЗ
		|	ВТХарактеристикиСкидкиНаценки КАК ВТХарактеристикиСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НКРучные КАК ВТ_НКРучные
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ВТ_НКРучные.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ВТ_НКРучные.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика";
	
	
	ГруппаВсеСклады = Справочники.Склады.НайтиПоКоду("000000053");
	МассивСкладов = Справочники.Склады.ПолучитьМассивСкладов(ГруппаВсеСклады);

	
	//Запрос.УстановитьПараметр("Номенклатура"       , Номенклатура);
	//Запрос.УстановитьПараметр("НоменклатураВыбрана", Не ЗначениеЗаполнено(Номенклатура));
	//Запрос.УстановитьПараметр("МассивСкладов"      , МассивСкладов);
	Запрос.УстановитьПараметр("Дата"               , ТекущаяДата());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Комплектующие = РезультатыЗапроса[8].Выгрузить();
	Остатки       = РезультатыЗапроса[9].Выгрузить();

КонецФункции


//Функция ВсеНулевые(Стр, Таб)
//	
//	Все0 = Истина;
//	
//	ТЗ = Таб.НайтиСтроки(Новый Структура("Номенклатура, Цвет, Ткань", Стр.Номенклатура, Стр.Цвет, Стр.Ткань));
//	
//	Для Каждого Стр1 Из ТЗ Цикл
//		
//		Если Не Стр1.РознКол = 0 Тогда
//			
//			Все0 = Ложь;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат Все0;
//	
//КонецФункции
