// #Область СлужебныеПроцедурыИФункции

&НаСервере 
Перем МТ;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Видимость элементов формы
	MIKO_Asterisk_Подключена = Метаданные.Обработки.Найти("MIKO_Asterisk")<>Неопределено;
	МИКО_ПанельТелефонииДля1С_Подключена = Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С")<>Неопределено;
	ПанельТелефонииЕсть = (MIKO_Asterisk_Подключена ИЛИ МИКО_ПанельТелефонииДля1С_Подключена);
	Элементы.ОткрытьСобытие.Видимость 		= ПанельТелефонииЕсть;
	Элементы.ДобавитьНомерКонтакту.Видимость= ПанельТелефонииЕсть;
	Элементы.Позвонить.Видимость 			= ПанельТелефонииЕсть;
	
	Параметры.Свойство("НомерТелефона", НомерТелефона);
	Параметры.Свойство("Клиент"       , Клиент);
	
	Если Не ЗначениеЗаполнено(НомерТелефона) И
		 Не ЗначениеЗаполнено(Клиент) Тогда
		
		БезПоследующегоКонтакта = Истина;
		
	КонецЕсли;
	
	Если Не Параметры.Свойство("ДатаОтсчета", ДатаОтсчета) Тогда
		
		ДатаОтсчета = НачалоДня(ТекущаяДата() - 60 * 60 * 24 * 3);
		
	КонецЕсли;
	
	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтсчетаПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	НаложитьФильтрНаТаблицуПропущенных();
КонецПроцедуры

&НаКлиенте
// Обработка выбора строки таблицы. Открытие значения.
// 
Процедура ПропущенныеВызовыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначениеКолонки(Поле.Имя);
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПропущенный(Команда)
	ОткрытьЗначениеКолонки("ПропущенныеВызовыПропущенныйПредставление");
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьОтвеченный(Команда)
	ОткрытьЗначениеКолонки("ПропущенныеВызовыОтвеченныйПредставление");
КонецПроцедуры
&НаКлиенте
Процедура ПропущенныеВызовыОтвеченныйПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначениеКолонки("ПропущенныеВызовыОтвеченныйПредставление");
КонецПроцедуры
&НаКлиенте
Процедура ПропущенныеВызовыПропущенныйПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначениеКолонки("ПропущенныеВызовыПропущенныйПредставление");
КонецПроцедуры
&НаКлиенте
Процедура ПропущенныеВызовыКлиентОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначениеКолонки("ПропущенныеВызовыКлиент");
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьКлиента(Команда)
	ОткрытьЗначениеКолонки("ПропущенныеВызовыКлиент");
КонецПроцедуры

&НаКлиенте
Процедура ПропущенныеВызовыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
// Основная команда формы.
// 
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
// Подготовка таблицы пропущенных вызовов.
// 
Процедура СформироватьНаСервере()
	
	врПропущенныеВызовы = Обработки.МИКО_стАнализПропущенныхВызовов.ПолучитьПропущенные(ДатаОтсчета, КлиентаНетВБазе);
	ПропущенныеВызовы.Загрузить(врПропущенныеВызовы);
	НаложитьФильтрНаТаблицуПропущенных();
	
КонецПроцедуры

// Накладываем пользовательские фильтры.
// 
&НаСервере
Процедура НаложитьФильтрНаТаблицуПропущенных()
	
	СтруктураОтбора = Новый Структура();
	
	Если КлиентаНетВБазе Тогда
		СтруктураОтбора.Вставить("КлиентаНетВБазе", КлиентаНетВБазе);
	КонецЕсли;
	Если БезПоследующегоКонтакта Тогда
		СтруктураОтбора.Вставить("КоличествоОтвеченных", 0);
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		СтруктураОтбора.Вставить("НомерТелефона", НомерТелефона);
	КонецЕсли;
	
	Элементы.ПропущенныеВызовыОтвеченныйПредставление.Видимость = НЕ БезПоследующегоКонтакта;
	Элементы.ПропущенныеВызовыКлиент.Видимость 					= НЕ КлиентаНетВБазе;
	
	Если СтруктураОтбора.Количество()=0 Тогда
	    Отбор = Неопределено;
	Иначе
		Отбор = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	КонецЕсли; 
	
	Элементы.ПропущенныеВызовы.ОтборСтрок = Отбор;

КонецПроцедуры // НаложитьФильтрНаТаблицуПропущенных()

&НаКлиенте
// Открываем значение, если выбрана строка.
// 
Процедура ОткрытьЗначениеКолонки(ИмяКолонки)

	ТекущиеДанные = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ИмяКолонки = "ПропущенныеВызовыПропущенныйПредставление" Тогда
		унОткрытьЗначение(ТекущиеДанные.СсылкаНаПропущенный);	
	ИначеЕсли ИмяКолонки = "ПропущенныеВызовыОтвеченныйПредставление" Тогда 	
		унОткрытьЗначение(ТекущиеДанные.СсылкаНаОтвеченный);
	ИначеЕсли ИмяКолонки = "ПропущенныеВызовыКлиент" И ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда 	
		унОткрытьЗначение(ТекущиеДанные.Клиент);
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
// Открывает значение, выбирает метод в зависимости от версии платформы.
// 
Процедура унОткрытьЗначение(Значение)

	Если ВерсияПлатформы = "8.3" Тогда
	
		Если НЕ ИспользоватьРежимМодальности Тогда
			Попытка
				Выполнить("ПоказатьЗначение(,Значение)");
			Исключение
				Возврат;
			КонецПопытки; 
		Иначе	
			ОткрытьЗначение(Значение);
		КонецЕсли; 

	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		ОткрытьЗначение(Значение);
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ПропущенныеВызовыПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьДействий();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДействий()

	ТекущиеДанные = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	Элементы.ОткрытьПропущенный.Доступность = ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаПропущенный);
	Элементы.ОткрытьОтвеченный.Доступность 	= ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОтвеченный);
	Элементы.ОткрытьКлиента.Доступность 	= ЗначениеЗаполнено(ТекущиеДанные.Клиент);
	
	Элементы.ПропущенныеВызовыКонтекстноеМенюОткрытьПропущенный.Доступность = ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаПропущенный);
	Элементы.ПропущенныеВызовыКонтекстноеМенюОткрытьОтвеченный.Доступность 	= ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОтвеченный);
	Элементы.ПропущенныеВызовыКонтекстноеМенюОткрытьКлиента.Доступность 	= ЗначениеЗаполнено(ТекущиеДанные.Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНомеру(Команда)
	ТекущиеДанные = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НомерТелефона = ТекущиеДанные.НомерТелефона;
	НаложитьФильтрНаТаблицуПропущенных();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

///
//
///

&НаКлиенте
Процедура Позвонить(Команда)
	Вызов = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если Вызов = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Miko_Ajam = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();	
	Если Miko_Ajam <> Неопределено Тогда
		Miko_Ajam.НабратьНомер(Вызов.НомерТелефона);	
	Иначе
		врДанные = Новый Структура("ОснованиеЗвонка", Вызов.СсылкаНаПропущенный);
		Оповестить("Позвонить", Вызов.НомерТелефона, врДанные);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Задействует механизм панели телефонии по созданию документа "Событие".
// 
Процедура СоздатьСтикер(Команда)
	ТекДанные = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Событие = ПолучитьСсылкуНаСобытие(ТекДанные.СсылкаНаПропущенный);
	Если ЗначениеЗаполнено(Событие) Тогда
		Если Событие <> Неопределено Тогда
			Попытка
				Выполнить("ОткрытьЗначение(Событие)");
				Возврат;
			Исключение
			КонецПопытки;
			
			Попытка
				Выполнить("ПоказатьЗначение(,Событие)");				
				Возврат;
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	Иначе
		Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile,linkedid");
		Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекДанные.СсылкаНаПропущенный) = Ложь Тогда
			// Внутренний вызов.
			Возврат;
		КонецЕсли;
		// Управляемое приложение.
		Вызов.Вставить("UniqueID",		Вызов.linkedid);
		Вызов.Вставить("ВремяЗвонка",	ТекДанные.ДатаПропущенного);
		Вызов.Вставить("Длительность",	0);
		
		// Обычное приложение.
		Вызов.Вставить("ИдентификаторЗвонка",	Вызов.linkedid);
		Вызов.Вставить("Когда",					ТекДанные.ДатаПропущенного);
		Вызов.Вставить("СекундДлился",			0);
		Вызов.Вставить("ВходящийЗвонок",		Истина);
		Вызов.Вставить("ПропущенныйЗвонок",		Истина);
		Вызов.Вставить("ДокументСобытие",		Неопределено);
		Вызов.Вставить("ИмяФайла",				"");         
		Вызов.Вставить("Контрагент",			Вызов.Партнер);         
		Вызов.Вставить("КонтактноеЛицо",		Вызов.Абонент);         
		    
		// Найдем в какой глобальной переменной определена панель телефонии.
		Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
		сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
		
		Если сфпФормаТелефон <> Неопределено Тогда
			врДанные = Новый Структура("Вызов,Пропущенный", Вызов, Истина);
			Оповестить("СоздатьСтикер",врДанные,ЭтаФорма);
		ИначеЕсли Miko_Ajam	<> Неопределено Тогда
			Попытка
				Miko_Ajam.ОткрытьСоздатьСобытие(Вызов.linkedid, Вызов);	
			Исключение
			КонецПопытки;
		Иначе
			МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности создать документ ""Событие"".");	
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНомерКонтакту(Команда)
	ТекущиеДанные = Элементы.ПропущенныеВызовы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile,linkedid");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, ТекущиеДанные.СсылкаНаПропущенный) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;

	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	врПараметры = Новый Структура;
	врПараметры.Вставить("НомерТелефона", 		Вызов.НомерТелефона);
	врПараметры.Вставить("КонтактКНазначению",  Вызов.Партнер);
	врПараметры.Вставить("Абонент", 			Вызов.Абонент);
		
	Если сфпФормаТелефон <> Неопределено Тогда
		// Управляемое приложение.
		Оповестить("ДобавитьНомерКонтакту",врПараметры,ЭтаФорма);
		Возврат;
	КонецЕсли;	
	
	врПараметры.Вставить("Контрагент", 		 	Вызов.Партнер);
	врПараметры.Вставить("КонтактноеЛицо", 		Вызов.Абонент);
	// Обычное приложение.
	ОбъектКИ = Неопределено;
	Если ЗначениеЗаполнено(врПараметры.КонтактноеЛицо) Тогда
	 	ОбъектКИ = врПараметры.КонтактноеЛицо;
	ИначеЕсли ЗначениеЗаполнено(врПараметры.Контрагент) 
		 	  И ТипЗнч(врПараметры.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектКИ = врПараметры.Контрагент;
	Иначе
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// Сперва предложим пользователю выбрать контрагента.
		ФормаВыбораКонтрагента = Вычислить("Справочники.Контрагенты.ПолучитьФормуВыбора()");
		ОбъектКИ 			   = ФормаВыбораКонтрагента.ОткрытьМодально();
		#КонецЕсли 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СоздатьНомерКИ(Неопределено, ОбъектКИ, Неопределено, Вызов.НомерТелефона);	
		Исключение
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности назначить номер контакту.");	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Вспомогательная функция, получает данные по документу "МИКО_стЗаписьИсторииЗвонков".
// 
Функция ЗаполнитьПоДокументуИсторииЗвонков(Вызов, СсылкаНаДокумент)
	Если СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний") Тогда
		Возврат Ложь;	
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Src_Владелец_Ссылка,Src_Ссылка,Src,linkedid");
		Партнер				= врДанные.Src_Владелец_Ссылка;	
		Абонент 			= врДанные.Src_Ссылка;
		Вызов.НомерТелефона = врДанные.Src;
		Вызов.linkedid 	 	= врДанные.linkedid;
		Вызов.Входящий 		= Истина;
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Dst_Владелец_Ссылка,Dst_Ссылка,Dst,linkedid");
		Партнер 			= врДанные.Dst_Владелец_Ссылка;	
		Абонент 			= врДанные.Dst_Ссылка;
		Вызов.НомерТелефона = врДанные.Dst;
		Вызов.linkedid 	 	= врДанные.linkedid;
		Вызов.Входящий 		= Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Вызов.Партнер = Партнер;	
		Вызов.Абонент = Абонент;	
	Иначе
		Вызов.Партнер = Абонент;	
	КонецЕсли;
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ИменаФайлов");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ИменаФайлов 		= РезульатЗапроса.Выгрузить();
		Вызов.ЕстьЗапись 	= Истина;
		Вызов.recordingfile = ИменаФайлов[0].ИмяФайла;
	Иначе	
		Вызов.ЕстьЗапись    = Ложь;
		Вызов.recordingfile = "";
	КонецЕсли; 
	
	Возврат Истина;	
КонецФункции

// Вспомогательная функция, получает ссылку на первый документ "Событие".
// 
Функция ПолучитьСсылкуНаСобытие(СсылкаНаДокумент)
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ДокументыСобытие");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ДокументыСобытие = РезульатЗапроса.Выгрузить();
		Событие = ДокументыСобытие[0].Событие;
	Иначе	
	    Событие = Неопределено;
	КонецЕсли; 
	
	Возврат Событие;
КонецФункции // ПолучитьСсылкуНаСобытие()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если "ПрисвоенНомерТелефона" = ИмяСобытия Тогда
		ЗаполнитьВладельцаНомера(Параметр);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьВладельцаНомера(врПараметры)

	Для каждого ТекСтрока Из ПропущенныеВызовы Цикл
		ТекСсылка = ТекСтрока.СсылкаНаПропущенный;
		Если ТекСтрока.НомерТелефона <> врПараметры.Номер Тогда
			Продолжить;		
		КонецЕсли; 
		
		ТекСтрока.Клиент = врПараметры.Организация;
		врОбъект = ТекСсылка.ПолучитьОбъект();
		Если врОбъект.Dst = врПараметры.Номер Тогда
			Если ЗначениеЗаполнено(врПараметры.Абонент) Тогда
			 	врОбъект.Dst_Ссылка = врПараметры.Абонент;
				врОбъект.Dst_Владелец_Ссылка = врПараметры.Организация;
			Иначе
			 	врОбъект.Dst_Ссылка = врПараметры.Организация;
			КонецЕсли;
		КонецЕсли; 
		Если врОбъект.Src = врПараметры.Номер Тогда
			Если ЗначениеЗаполнено(врПараметры.Абонент) Тогда
			 	врОбъект.Src_Ссылка = врПараметры.Абонент;
				врОбъект.Src_Владелец_Ссылка = врПараметры.Организация;
			Иначе
			 	врОбъект.Src_Ссылка  = врПараметры.Организация;
			КонецЕсли;
		КонецЕсли; 
		
		Попытка
			врОбъект.Записать();
		Исключение
		КонецПопытки; 
	КонецЦикла; 
КонецФункции // ЗаполнитьВладельцаНомера()


// #КонецОбласти 