Функция ПолучитьТолькоЧисла(Строка) // Экспорт
	Результат = "";	
	ДлинаСтроки = СтрДлина(Строка);	
	СтрокаЦифр = "0123456789";
	Для i = 1 По ДлинаСтроки Цикл	
		Символ = Сред(Строка,i,1);			
		Если Найти(СтрокаЦифр,Символ)>0 Тогда
			Результат = Результат+Символ;
		КонецЕсли;		
	КонецЦикла;		
	Возврат Результат;	
КонецФункции

Функция ОтправитьФайл(ПолныйАдресРесурса,ТекстЗапроса)	  	
	Попытка 
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
		WinHttp.Option(2,"utf-8"); 
		WinHttp.Open("POST",ПолныйАдресРесурса,0); 
		WinHttp.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8"); 
		WinHttp.Send(ТекстЗапроса); 
		ТекстОтвета = WinHttp.ResponseText(); 
	Исключение
		Возврат("ОШИБКА! Неудачная попытка отправки данных на сервер!");
	КонецПопытки;  	
	
	Возврат(ТекстОтвета);
КонецФункции

Функция ВыполнитьОбменКонтактнойИнформацией() Экспорт

	КлючОбработки = ЭтотОбъект.Метаданные().ПолноеИмя();
	ПолныйАдресРесурса =  ХранилищеОбщихНастроек.Загрузить(КлючОбработки, "ПолныйАдресРесурса", , КлючОбработки);
	УзелОбмена =  ХранилищеОбщихНастроек.Загрузить(КлючОбработки, "УзелОбмена", , КлючОбработки);
	Если ПолныйАдресРесурса = "" Тогда
		Возврат("Адрес ресурса пуст, его нужно заполнить и сохранить настройку");
    КонецЕсли;			
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Объект КАК Объект,
		|	КонтактнаяИнформация.Тип КАК Тип
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				КонтрагентыИзменения.Ссылка
		|			ИЗ
		|				Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
		|			ГДЕ
		|				КонтрагентыИзменения.Узел = &Узел)
		|	И КонтактнаяИнформация.Тип В(&ТипыКонтактнойИнформации)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объект,
		|	Тип
		|ИТОГИ ПО
		|	Объект";
		
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
			Запрос.УстановитьПараметр("Узел",УзелОбмена);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"В
			|			(ВЫБРАТЬ
			|				КонтрагентыИзменения.Ссылка
			|			ИЗ
			|				Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
			|			ГДЕ
			|				КонтрагентыИзменения.Узел = &Узел)"," ССЫЛКА Справочник.Контрагенты");
		КонецЕсли;
		МассивКИ = Новый Массив;
		МассивКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		МассивКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);		
		Запрос.УстановитьПараметр("ТипыКонтактнойИнформации",МассивКИ);	
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаОбъект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		КоличествоОбъектов = ВыборкаОбъект.Количество();
		й=0;
		Пока ВыборкаОбъект.Следующий() Цикл
			й=й+1;
			Контрагент = СтрЗаменить(Строка(ВыборкаОбъект.Объект),";","");		
			Результат = ""+Результат+Контрагент+";";
			ВыборкаДетальныеЗаписи = ВыборкаОбъект.Выбрать();	
			СтрокаТелефоны = "";
			СтрокаИмейл = "";
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Телефон = ПолучитьТолькоЧисла(ВыборкаДетальныеЗаписи.Представление);
					СтрокаТелефоны = СтрокаТелефоны+Телефон+";";
				ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					СтрокаИмейл = ВыборкаДетальныеЗаписи.Представление+"";				
				КонецЕсли;
			КонецЦикла;
			Если СтрокаТелефоны = "" Тогда
				СтрокаТелефоны = ";";
			КонецЕсли;	
			Если й<=КоличествоОбъектов Тогда
				Если й=КоличествоОбъектов Тогда
					Результат = Результат+СтрокаТелефоны+СтрокаИмейл;
				Иначе					 
					Результат = Результат+СтрокаТелефоны+СтрокаИмейл+Символы.ПС;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Результат = "" Тогда
			Возврат("Нет данных для отправки. Контактная информация контрагентов пуста.");
		Иначе
			Результат = "data="+Результат;
			Ответ = ОтправитьФайл(ПолныйАдресРесурса,Результат);
		КонецЕсли;
		Возврат(Ответ);	
КонецФункции
