///////////////////////////////////////////////////////////////////////////.
// ПЕРЕМЕННЫЕ ОБРАБОТКИ.
Перем РаботаВозможна;

Перем НабранныйКонтакт;			             // При наборе номера хранит структуру номера и контакт из базы данных с которым идет соединение.
Перем ТипВнутреннийВнешнийЗвонок Экспорт;    // Структура содержит тип внутренний или внешний звонок.
Перем ФормаТелефон Экспорт;                  // Ссылается на открытую форму телефона.
Перем Компонент Экспорт;                     // Компонент телефонии.
Перем ХЭШ_Компонент;		                 // Компонент телефонии.
///
// История звонков.
Перем ТЗИсторииЗвонковВременная Экспорт;	// Таблица для накопления истории звонков при запросе с астериска через компоненту.
Перем ЖурналЗвонков Экспорт;
///

Перем ТЗФаксовВременная;					// Таблица для накомления списка факсимильных сообщений при запросе через последовательное чтение.
Перем ТЗУчастникиЗвонков Экспорт; 			// Таблица для расшифровки списка участников звонков.
Перем ТЗ_КЭШ_КИ;
Перем КоличествоАварийныйхРеконнектов;      // Счетчик для подсчета разрывов связи, если их много надо отрубить компоннет и разбираться в причинах.
// переадресация на ответственного / Начало.
Перем ChanTimeOut Экспорт;                  // таймаут оэидания набора номера при переводе на отвественного.
Перем RedirectNumber Экспорт;               // резерный номер для перевода на ответственного, если мы не ответили, то вызов пойдет на него.
Перем мНомераТелефоновПоОтветственному;		// Список номеров телефонов для текущего пользователя, который нужно забирать из общей очереди на себя.
// переадресация на ответственного / Конец.
Перем СостояниеЭкстеншена Экспорт;			// Структура содержит представление состояний экстеншена Свободен, Разговаривает, Недоступен.
Перем ЗапланированныйДонабор Экспорт;		// Соответсвие номера набора и донабора, т.к. донабор нам нужно делать во время соединения.
Перем УРЛСервераДляОтправкиФакса;			// Адрес сервера для заливки Файла с факсом. 
Перем GhostScriptУстановленНаAsterisk;		// Переменная для проверки на какой стороне будем проводить конвертацию файла PDF в TIF 
Перем мСписокНомеровПользователяДляИстории 	 Экспорт; // Список внутренних номеров сотрудника панели для закладки история, тут могут быть номера групп, очередей, сотовые, внутренние, конференции.
Перем мСписокНомеровПользователяДляОбработки Экспорт; // Список внутренних номеров сотрудника панели для обработки вызовов, часто достаточно внутреннего номера и мобильного номера.
// + Автоподъем.
Перем ВидСофтфонаПользователя Экспорт;		// Информация о используемом софтфоне/хардфоне текущего пользователя.
Перем СтрокаАвтоподъема;
Перем СоответствиеАвтоподъем;
// - Автоподъем.
Перем НомерГолосовойПочтыПользователя;      // Номер ящика голосовой почты пользователя.	
Перем КонтекстНабораПоУмолчанию Экспорт;	// Конекст набора номера на сервере Asterisk. Получаем из настроек sip.conf или iax.conf.
Перем КонтекстНабораSkype Экспорт;			// Контекст для исходящих Skype звонков.   

Перем КонтекстНабораСлужебныхКоманд;		// Конекст набора номера для служебных команд на сервере Asterisk. 
Перем КонтекстДляКонсультативногоПеревода;  // Используется при переводе звонков.
Перем КлючУникальности;						// Специальный параметр отправляемый командами астрериск, чтобы однозначно идентифицировать адресата получателя ответа. Передаем в ActionID 	
Перем НазваниеPBX Экспорт;					// Значение переменной SYSTEMNAME из asterisk.conf.
Перем ВерсияДиалплана Экспорт;				// В диалплане передаем версию для того чтобы можно было однозначно понимать обновил пользователь диалплан на Asterisk или нет.
Перем МинимальнаяВерсияДиалплана Экспорт;   // Минимально поддерживаемая версия диалплана asterisk.
Перем КоличествоПоследовательныхСбоевПриLogin Экспорт;
// Лицензирование / Начало.
Перем ИнформацияПоЛицензиям Экспорт;        // Сведения по ключам защиты.

Перем ОстатокДнейЛицензии Экспорт;			// Если используется триальная лицензия, то в этой переменной хранится остаток дней активности.
Перем ТипЛицензии Экспорт;                  // Тип используемой HASP лицнезии постоянная или триальная.
Перем РегистрационныйНомер Экспорт;			// KeyID HASP ключа.
// Лицензирование / Конец.
Перем ХостAsterisk Экспорт;					// Если испльзуется Proxy то хост к которому нужно отправлять запросы на получение отправку. 
											// файлов отличается от хоста к которому подключена панель.
Перем ТекущийПрофильНастроек Экспорт;		// Профиль настроек подключения к серверу Asterisk.
Перем ТаблицаХинтов Экспорт;                // Таблица хинтов хранит статусы устройств.
Перем ИспользоватьПрокси;
// Банер / Начало.
Перем НомерПрямойПарковки;
Перем ГлавноеОкноПрограммы1С Экспорт; 		// Компонента управления главным окном 1С предприятия.
Перем мВнешняяПанель Экспорт;               // Внешняя панель для оповещений.
// Банер / Конец.
Перем РаботаетСтартовыйПомощник Экспорт;
// Документ "Событие" / Начало.
Перем КлючиУникальностиСобытий Экспорт;
// Документ "Событие" / Конец.

// Структура для хранения значений глобальных констант 
Перем ГлобальныеПеременные Экспорт;

Перем ПользовательСтатистики Экспорт;   	// Имя пользователя для скачивания записи разговора.
Перем ПарольПользователяСтатистики Экспорт; // Пароль для скачивания записи разговора.

Перем КаналыКПарковке Экспорт;              // Каналы для парковки / удержания вызова.

Перем ИмяТекущейКонфигурации Экспорт;		// Имя конфигурации	 
Перем ИмяТекущегоПользователя Экспорт;		// Имя пользователя спр сотрудники
Перем ЗаписиДляВнешнейПанели Экспорт;       // Массив имен фалов записей разговоров, запрошены из внешней панели.

Перем НашDAHDIПорт;
//Оптимизация GetVar
Перем ПортGetVar Экспорт;
Перем ПеремКаналовСтруктура;
Перем UseMp3Player;

Перем ТаблицаПользователей Экспорт;         // Таблица пользователей / сотрудников.

/////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ИНТЕГРАЦИИ С БАЗОЙ ДАННЫХ

// Выполняем подключение Софтфона, вызов функции располагается в модуле приложения
//  в процедуре ПриСтартеСистемы
Функция ПодключитьСофтФон() Экспорт
	
	Если Компонент<>Неопределено 
		И Компонент.Enabled Тогда
		Возврат Истина; //Уже все включено
	КонецЕсли;	
	/////////////////////////////////////////////////////////////////////////
	// Инициализация
	Если ДопМодули = Неопределено Тогда
		ИнициализироватьОсновныеДопМодули();
		// Получим сохраненные ранее значения настроек панели
	КонецЕсли;
	мОбработкаДанных.ВосстановитьОсновныеНастройки();
	// Инициализация
	/////////////////////////////////////////////////////////////////////////
	РезультатПодключенияСофтФона = Ложь;
	Попытка
		// Можно использовать софт фон
		Если ИспользоватьСофтФон() Тогда
			
			// Если форма уже определена, то вызовем ее
			Если БезИнтеграционныйРежим ИЛИ ГлобальныеПеременные.глИспользоватьПанельТелефонии Тогда
				
				// Если форма уже определена, то вызовем ее
				Если ФормаТелефон = Неопределено Тогда
					ФормаТелефон = ЭтотОбъект.ПолучитьФорму("ФормаПанели");
				КонецЕсли;
				
				Если ИспользоватьAsterisk И Компонент=Неопределено Тогда
					ПодключитьВК();
				ИначеЕсли НЕ ИспользоватьAsterisk И ИспользоватьСофтфон Тогда	
					ИнициализироватьSIP();
				КонецЕсли;	
				// Банер / Начало
				Если ИспользоватьAsterisk Тогда
					Банер_ПодключитьКомпонент();
				КонецЕсли; 
				// Банер / Конец
				Если НЕ ФормаТелефон.Открыта() Тогда 
					ФормаТелефон.Открыть();
				КонецЕсли;
				РезультатПодключенияСофтФона = Истина;
			Иначе
				// Если флаг изменился, то принудительно закроем форму
				Если ФормаТелефон <> Неопределено 
					И ФормаТелефон.Открыта() 
					Тогда ФормаТелефон.Закрыть(); КонецЕсли;
				// Отключение СофтФона, результат отработки процедуры истина
				РезультатПодключенияСофтФона = Истина;
			КонецЕсли;
		Иначе
			Если НЕ ФормаТелефон = Неопределено Тогда
				Если ФормаТелефон.Открыта() Тогда ФормаТелефон.Закрыть(); КонецЕсли;
				// Отключение СофтФона, результат отработки процедуры истина
				РезультатПодключенияСофтФона = ?(РаботаВозможна = Ложь, Ложь, Истина);
			ИначеЕсли БезИнтеграционныйРежим И ФормаТелефон = Неопределено Тогда 
				// отработка открытия через "Файл" - "Открыть"
				РезультатПодключенияСофтФона = Ложь;
			КонецЕсли; 
		КонецЕсли;
	Исключение
		Сообщить("ВНИМАНИЕ! Инициализация обработки ""Панель телефонии Asterisk"", не выполнена!", СтатусСообщения.ОченьВажное);
		Сообщить(ОписаниеОшибки());
		РезультатПодключенияСофтФона = Ложь;
	КонецПопытки;
	
	Возврат РезультатПодключенияСофтФона;
	
КонецФункции

// Функция определяет используется ли СофтФон в системе и для текущего пользователя
//
Функция ИспользоватьСофтФон() Экспорт
	// проверка параметров запуска
	Если КонтрольПервогоЗапуска() = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьAsterisk И НЕ ИспользоватьСофтфон Тогда
	  	Возврат Ложь;
	КонецЕсли; 
	
	// проверим права, выдадим Сообщение в случае нехватки 
	ВыполнитьПроверкуПравПользователя();
	ГлобальныеПеременные.Вставить("глИспользоватьПанельТелефонии", мОбщийМодуль.ИспользоватьПанельТелефонии(БезИнтеграционныйРежим) ИЛИ ЭтоПервыйЗапуск);
	
	// "ЭтоПервыйЗапуск" на случай, если роль была назначена пользователю в процессе работы помощника.
	Возврат (ГлобальныеПеременные.глИспользоватьПанельТелефонии);
КонецФункции

// Проверка параметров запуска
// Старт помощника настройки
Функция КонтрольПервогоЗапуска()

	Если РаботаВозможна = Ложь Тогда
		// на случай, если проверка уже происходила ранее в этом сеансе работы
		//
		Возврат РаботаВозможна;	
	КонецЕсли; 
	
	ПервыйЗапускТекП = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","ЭтоПервыйЗапуск"+БезИнтеграционныйРежим,,ИмяТекущегоПользователя);
	Если ПервыйЗапускТекП <> "НЕТ" Тогда
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			// со стартовым помощником при первом запуске может работать только
			// пользователь с полными правами
			РаботаВозможна = Ложь;
			Возврат РаботаВозможна;		
		КонецЕсли; 
		
		Форма = ПолучитьФорму("СтартовыйПомощник"); 
		Если Форма.Открыта() Тогда
			Возврат Ложь;		
		КонецЕсли; 
		Результат = Форма.ОткрытьМодально();
		Если Результат = Истина Тогда
			// Восстановим настройки.
			мОбработкаДанных.ВосстановитьОсновныеНастройки();
			Если НЕ БезИнтеграционныйРежим 
				И НЕ мОбщийМодуль.ПервыйЗапускВозможен() Тогда
				РаботаВозможна = Истина;
				// Получим новые настройки.
				Возврат РаботаВозможна;
			КонецЕсли;
			ЭтоПервыйЗапуск = Истина;
		Иначе
			Если НЕ ФормаТелефон = Неопределено Тогда
				ФормаТелефон.Закрыть();
			КонецЕсли;
			РаботаВозможна = Ложь;
			Возврат РаботаВозможна;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции // КонтрольПервогоЗапуска()
 
// Дополнить данные телефонных номеров для мастера создания автоматического клиента
//  или контактного лица
Процедура ДополнитьДанныеНезарегистрированногоКонтрагента(ДанныеНезарегистрированногоКонтрагента) Экспорт
	
	ТекущийЗвонок = ФормаТелефон.ЭлементыФормы.ТабличноеПолеЗвонки.ТекущиеДанные;
	Если ТекущийЗвонок = Неопределено Тогда Возврат; КонецЕсли;
	
	НомерТелефона = ПреобразоватьНомерСУчетомПрефиксов(ТекущийЗвонок.CallerID, Истина); 
	Дополнение = мОбщийМодуль.ПолучитьДополнениеНезарегистрированногоКонтрагента(НомерТелефона, ДанныеНезарегистрированногоКонтрагента);	
	ЗаполнитьЗначенияСвойств(ДанныеНезарегистрированногоКонтрагента, Дополнение);
	
КонецПроцедуры

// Процедура вызывается из карточек тех объектов, к которым можно вводить
//  контактную информацию, изменяет текущую запись регистра и вызывает 
//  обработку заполнения телефона, Идентификатор и Номер телефона передается из документа
//  в виде строки параметров СтрокаПараметров, а так же внутренний или внешний это номер
Процедура СоздатьНомерКИ(ТекущаяСтрока, ОбъектКИ, ФормаВладелец, Знач СтрокаПараметров) Экспорт 
	Если НЕ ЗначениеЗаполнено(СтрокаПараметров) Тогда
		Возврат;
	КонецЕсли; 
	СтрокаПараметров = Строка(СтрокаПараметров);
	
	врСтруктураПараметров = ПреобразоватьСтрокуВПараметры(СтрокаПараметров);
	Если ТипЗнч(врСтруктураПараметров) <> Тип("Структура") ИЛИ врСтруктураПараметров.Количество()>0 Тогда
		врСтрокаПараметров = ""+врСтруктураПараметров.Параметр2+врСтруктураПараметров.Параметр3+врСтруктураПараметров.Параметр4;
	Иначе
		врСтрокаПараметров = СтрокаПараметров;
	КонецЕсли; 
	
	// Проверим может ли пользователь работать с СофтФоном
	ФормаДобавленияКИ = ЭтотОбъект.ПолучитьФорму("ДобавлениеНомераКИ", ФормаВладелец, врСтрокаПараметров);
	
	// дозаполняем поля формы
	ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияСоздатьНомерКИ(ОбъектКИ);
	ЗаполнитьЗначенияСвойств(ФормаДобавленияКИ, ДанныеЗаполнения);
	
	ФормаДобавленияКИ.ОткрытьМодально();
	
	Если ФормаВладелец = Неопределено Тогда
		ЗаполнитьТаблицуИсторииЗвонков(ФормаТелефон.ЭлементыФормы.ПолеКалендаряИсторииЗвонков.Значение);
	КонецЕсли; 
КонецПроцедуры


// Процедура вызывается из карточек тех объектов, у которых необходимо набрать номер.
//
Процедура НабратьНомерКИ(ТекущаяСтрока) Экспорт
	мОбработка = мОбработкаДанных;
	// Проверим может ли пользователь работать с СофтФоном
	Если мОбработка = Неопределено
		И НЕ мОбработка.РаботаССофтФономРазрешена(Истина, ГлобальныеПеременные.глИспользоватьПанельТелефонии, мПользователь) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ЭтоСкайп = Ложь;
		Если Тип(ТекущаяСтрока)=Тип("Структура") 
			И ТекущаяСтрока.Свойство("Вид") 
			И Найти(ТекущаяСтрока.Вид,"Skype")>0 Тогда
			
			ЭтоСкайп=Истина;
		ИначеЕсли Тип(ТекущаяСтрока)=Тип("РегистрСведенийЗапись.КонтактнаяИнформация") 
			И Найти(ТекущаяСтрока.Вид,"Skype")>0 Тогда
			ЭтоСкайп=Истина;		
		КонецЕсли;
		
		Если ТекущаяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон 
			И ЭтоСкайп
			Тогда
			
			НомерДляНабора = "" + ТекущаяСтрока.Представление;
			НабратьНомер(НомерДляНабора,КонтекстНабораSkype);
		ИначеЕсли ТекущаяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = мОбработка.СформироватьСтруктуруНомераИзПолей(ТекущаяСтрока);
			Если ЗначениеЗаполнено(СтруктураТелефона.Представление) Тогда
				НабранныйКонтакт = мОбработка.ПреобразоватьКонтактВСтруктуру(ТекущаяСтрока.Объект, ТекущаяСтрока.Поле1, ТекущаяСтрока.Поле2, ТекущаяСтрока.Поле3, ТекущаяСтрока.Поле4);
				НабираемыйНомер	 = ПреобразоватьНомерСУчетомПрефиксов(СтруктураТелефона,Ложь);
				Если ЗначениеЗаполнено(ТекущаяСтрока.Поле4) Тогда
					ЗапланированныйДонабор.Вставить(НабираемыйНомер, ТекущаяСтрока.Поле4);
				КонецЕсли;	
				НабратьНомер(НабираемыйНомер,КонтекстНабораПоУмолчанию);
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// Процедура выдает пользователю на экран список телефонных номеров
//   объектов, переданных в СписокОбъектов. И по выбранному выполняем дозвон
Процедура ПозвонитьВыбравТелефон(СписокОбъектов) Экспорт
	
	СписокТелефонов = Новый СписокЗначений;
	
	Для каждого ТекущийОбъект Из СписокОбъектов Цикл
		мОбщийМодуль.ПолучитьСписокТелефоновСофтФон(ТекущийОбъект.Значение, СписокТелефонов);
	КонецЦикла;
	
	КоличествоНайденныхНомеров = СписокТелефонов.Количество();
	Если КоличествоНайденныхНомеров = 0 Тогда
		Возврат;
		// как минимум две записи (одна корневая)
	ИначеЕсли КоличествоНайденныхНомеров = 2 Тогда 
		ЭлементСписка = СписокТелефонов[1];
	Иначе
		ЭлементСписка = СписокТелефонов.ВыбратьЭлемент("Выберите телефон");
	КонецЕсли;
	
	Если ЭлементСписка = Неопределено Тогда Возврат; КонецЕсли;
	
	Если  Найти(ЭлементСписка.Представление,"Skype")>0 Тогда
		
		НомерДляНабора = "" + ЭлементСписка.Значение.НомерТелефона;
		НабратьНомер(ЭлементСписка.Значение.НомерТелефона,КонтекстНабораSkype);
	Иначе	 
		ТелефонныйНомер = ЭлементСписка.Значение;
		Если ТелефонныйНомер.Количество() = 0 Тогда Возврат; КонецЕсли;
		
		НабранныйКонтакт = мОбработкаДанных.ПреобразоватьКонтактВСтруктуру(ТелефонныйНомер.Объект, ТелефонныйНомер.КодСтраны, ТелефонныйНомер.КодГорода, ТелефонныйНомер.НомерТелефона, ТелефонныйНомер.Внутренний);
		НабираемыйНомер	 = ПреобразоватьНомерСУчетомПрефиксов(ТелефонныйНомер,Ложь);
		Если ЗначениеЗаполнено(ТелефонныйНомер.Внутренний) Тогда
			ЗапланированныйДонабор.Вставить(НабираемыйНомер, ТелефонныйНомер.Внутренний);
		КонецЕсли;	
		НабратьНомер(НабираемыйНомер,КонтекстНабораПоУмолчанию);
	КонецЕсли; 
	
	
КонецПроцедуры

// Прослушиваем запись разговора по переданному идентификитору, обычно из документа Событие
//
Процедура ПрослушатьЗаписьРазговора(GUIDЗвонка, ИмяФайла="") Экспорт
	Если НазваниеPBX = "MYPBX" Тогда
		врИмяФайла = ?(Найти(GUIDЗвонка,"/")>0, GUIDЗвонка, ИмяФайла);
		Если "/tmp/" = Лев(врИмяФайла, 5) Тогда
			// Косвенно определяем s20 MyPBX (S серия)
			ИмяФайлаЗаписиРазговора = врИмяФайла;
			врСтроки = ЗаписиРазговоров.НайтиСтроки(Новый Структура("uniqueid", GUIDЗвонка));
			Если врСтроки.Количество()>1 Тогда
				ИменаФайлов = Новый Массив;
				Для каждого текСтрока Из врСтроки Цикл
					ИменаФайлов.Добавить(текСтрока.recordingfile)
				КонецЦикла; 
				
				ФормаВыбораФайлаЗаписи = ЭтотОбъект.ПолучитьФорму("ФормаВыбораФайлаЗаписи");
				ФормаВыбораФайлаЗаписи.Инициализировать(ИменаФайлов, Неопределено, "");
				Возврат;
			КонецЕсли; 
		Иначе
			ИмяФайлаЗаписиРазговора = "/media/"+MYPBX_TypeStorage+"/autorecords/" + врИмяФайла;
		КонецЕсли; 
		ПрослушатьЗвонок(ИмяФайлаЗаписиРазговора);	 
	Иначе                                          
		// если файл есть, он вернется через эвент UserEvent тогда и вызовем прослушивание записи
		ЗапроситьИмяФайлаЗаписиCDRПоИдентификатору(GUIDЗвонка, ИмяФайла);
	КонецЕсли;
КонецПроцедуры	

// Отправляет полученный табдок факсимильным сообщением в текущий разговор
//
Процедура ОтправитьФаксомТабДок(ТабДок) Экспорт
	Если НЕ РаботаСФаксамиВозможна Тогда
		Сообщить("АТС не поддерживает отправку факсов.");
	ИначеЕсли Звонки.Количество()>0 тогда
		ТекущийЗвонок=ФормаТелефон.ЭлементыФормы.ТабличноеПолеЗвонки.ТекущаяСтрока;
		ОтправитьФакс(ТекущийЗвонок, ТабДок);
	Иначе
		Сообщить("Сначала позвоните абоненту, затем отправляйте факс!");
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБАТЫВАЮЩИЕ СОБЫТИЯ КОМПОНЕНТЫ

//Обработка внешнего события нашей компоненты из главного модуля
//
Процедура ОбработкаВнешнегоСобытияАстериск(Источник, Событие, Данные) Экспорт
	// транслируем события во внешние модули
	Для каждого Модуль Из ДопМодули Цикл
		Если ДопМодули[Модуль.Ключ] = Неопределено
			ИЛИ ТипЗнч(ДопМодули[Модуль.Ключ]) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		ДопМодули[Модуль.Ключ].ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	КонецЦикла; 
	
	Если "MikoAjamError" = Источник 
		 И Найти(Данные, "'Too many events per waitevent request'")>0 Тогда
	   	Сообщить("Не корректно настроена АТС. Слишком большой поток оповещений. Необходимо проверить парва доступа в manager.conf. https://wiki.miko.ru/doc:1cajam:astcastomize_v6#nastrojka_asterisk_manager_api");
	ИначеЕсли КоличествоАварийныйхРеконнектов = 0 
		 И (Найти(Данные, "mansession lost")>0 ИЛИ Найти(Данные, "more then 10 times")>0 ИЛИ Найти(Данные, "code='1022'")>0) Тогда	
		Событие = "Error"; 
		Данные  = "NeedReconnect"; 
	ИначеЕсли НЕ Источник="MikoAjamEvent" Тогда		
		// тут все прочие события
		Если Источник = "hWindow" Тогда // обработка команды банера
			onОбработкаКомандБанера(Источник, Событие, Данные);
		КонецЕсли; 
		// не пускаем дальше события от прочих компонентов.
		Возврат;
	КонецЕсли;
	
	Если  Событие="Error" 
		И Найти(Данные,"NeedReconnect") 
		И КоличествоАварийныйхРеконнектов<15 Тогда
		Звонки.Очистить();
		// счетчики реконнектов
		КоличествоАварийныйхРеконнектов = КоличествоАварийныйхРеконнектов + 1;
		КоличествоПоследовательныхСбоевПриLogin = КоличествоПоследовательныхСбоевПриLogin + 1;	
		
		ФормаТелефон.Реконнект();
		СообщитьОтладочнуюИнформацию("Аварийный реконект №"+КоличествоАварийныйхРеконнектов,Данные);
		ЗаписьЖурналаРегистрации("AddIn.Comp.MikoAjam",  УровеньЖурналаРегистрации.Ошибка, , ,   "Аварийный реконект №"+КоличествоАварийныйхРеконнектов +" причина: " +Данные);
		Возврат;
	ИначеЕсли Событие="Error" 
		И Найти(Данные,"NeedReconnect") 
		И КоличествоАварийныйхРеконнектов>15 Тогда
		СообщитьОтладочнуюИнформацию("Превышено количество аварийных реконнектов с астериском ",Данные);
		ОтключитьВК();
		Звонки.Очистить();
		ЗаписьЖурналаРегистрации("AddIn.Comp.MikoAjam",  УровеньЖурналаРегистрации.Ошибка, , ,   "Превышено количество аварийных реконнектов. Последняя ошибка: " +Данные);
		Возврат;
	ИначеЕсли Событие="HASP_EVENT" Тогда
		СообщитьОтладочнуюИнформацию("","""Панель телефонии Asterisk"", система защиты: " + Данные);
		Возврат;
	КонецЕсли;
	
	Если Событие="Dial" Тогда
		onDial(Данные);
	// Asterisk 13 // Начало + 	
	ИначеЕсли Событие="DialBegin"   ИЛИ Событие="DialEnd" 	  Тогда
		onDialAst13(Событие, Данные);
	ИначеЕсли Событие="BridgeEnter" ИЛИ Событие="BridgeLeave" Тогда
		onBridgeAst13(Событие, Данные);	
	// Asterisk 13 // Конец - 	
	ИначеЕсли Событие="Hangup" Тогда
		onHandUp(Данные);
	ИначеЕсли Событие="Bridge" Тогда 
		onBridge(Данные);	
	ИначеЕсли Событие="UserEvent" Тогда
		onUserEvent(Данные);	
	ИначеЕсли Событие="SendFAX" Тогда
		onSendFAX(Данные);
	ИначеЕсли Событие="Newchannel" Тогда
		// МИКО / Портнов / Оптипизация.
		// onNewchannel(Данные);
		// МИКО / Портнов / Оптипизация.
	ИначеЕсли Событие="Cdr" Тогда	
		onCDR(Данные);
	ИначеЕсли Событие="ExtensionStatus" Тогда
		onExtensionStatus(Данные);
	ИначеЕсли Событие="ChanSpyStart" Тогда
		onChanSpyStart(Данные);
	ИначеЕсли Событие="ChanSpyStop" Тогда
		onChanSpyStop(Данные);
	ИначеЕсли Событие="Newstate" Тогда
		onNewstate(Данные);
	ИначеЕсли Событие="Pickup" Тогда
		onPickup(Данные);
	ИначеЕсли Событие="ParkedCall" Тогда 
        onParkedCall(Данные);
	ИначеЕсли Событие="UnParkedCall" ИЛИ "ParkedCallGiveUp"=Событие Тогда 
        onUnParkedCall(Данные);
	КонецЕсли;
	
	Если НЕ Событие = "Newexten" И НЕ Событие = "DeviceStateChange"  Тогда
		СообщитьОтладочнуюИнформацию("",Данные);
	КонецЕсли; 
	
КонецПроцедуры

// Парсим переданную строку данных как XML 
// Параметры 
//		Данные - тип.Строка - Данные полученные от компоненты, в виде XML струтктуры
//
Функция ПолучитьЧтениеXML(СтрокаХМЛ) Экспорт
	Если НЕ ЗначениеЗаполнено(СтрокаХМЛ) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ," context=""miko_ajam""", "");
	СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ," context='miko_ajam'", "");
	                                     
	Попытка
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.УстановитьСтроку(СтрокаХМЛ);
		Если ЧтениеХМЛ.Прочитать() Тогда
			Возврат ЧтениеХМЛ;
		КонецЕсли;
	Исключение
	КонецПопытки;
	СообщитьОтладочнуюИнформацию("Невозможно разобрать данные XML. ",СтрокаХМЛ);
	Возврат Неопределено;
КонецФункции // ПолучитьЧтениеXML()

// Обработка события HandUp компонента miko_ajam (положили трубку)
//
Процедура onHandUp(Знач XMLУзел) 
	
	// Связи каналов / Начало
	onHangUpОбвновитьСвязиКаналов(XMLУзел);
	// Связи каналов / Конец
	
	XMLУзел = ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	channel = "" + XMLУзел.ЗначениеАтрибута("channel");
	
	//Оптимизация GetVar. Очистим кеш по каналу
	Если ЗначениеЗаполнено(channel) Тогда
		ОчиститьКешПеременныхКанала(channel);
	КонецЕсли;
	
	// Парковка / Начало
	// Очистка таблицы парковки (собеседник не дождался и положил трубку)
	ЗапаркованныйВызов = Парковка.Найти(channel, "Канал");
	Если НЕ ЗапаркованныйВызов = Неопределено Тогда
		Банер_УдалитьЗапаркованныйВызов(ЗапаркованныйВызов);
	  	Парковка.Удалить(ЗапаркованныйВызов);
		Оповестить("ОбновитьОтображениеПарковки");
	КонецЕсли; 
	// Парковка / Конец

	Если НЕ ЭтоНомерТекущегоПользователя(channel, мСписокНомеровПользователяДляОбработки) Тогда
		Возврат;	
	КонецЕсли; 	
	
	СтрочкаЗвонка 	= НайтиСтрочкуЗвонка(XMLУзел);
	КаналHangup 	= мОбработкаДанных.ОтсечьПлечоВLocal(channel, Ложь); 
	Если НЕ СтрочкаЗвонка =	Неопределено Тогда		
		Если СтрочкаЗвонка.СейчасЗаписывается Тогда
			ЗапроситьФайлЗаписиНаСкачивание(,СтрочкаЗвонка.UniqueID1+".gsm"); 		                                                    
		КонецЕсли; 
		УдалитьСтрокуЗвонкаПоИндексу(СтрочкаЗвонка);
	КонецЕсли;
	Банер_УдалитьСтрочкуЗвонка(КаналHangup);
	
КонецПроцедуры	

// Обработка события Bridge компонента miko_ajam (соединения 2-х абонентов)
//
Процедура onBridge(Знач XMLУзел)
	
	врXMLУзел = XMLУзел;
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	
	bridgestate = XMLУзел.ЗначениеАтрибута("bridgestate");
	channel1 = XMLУзел.ЗначениеАтрибута("channel1");
	channel2 = XMLУзел.ЗначениеАтрибута("channel2");

	Если ЭтоСлужебныйКанал(channel1) ИЛИ ЭтоСлужебныйКанал(channel2) Тогда
		Возврат;
	КонецЕсли; 
	
	var_c1 = "DIALEDPEERNUMBER";
	var_c2 = "DIALEDPEERNUMBER";
	
	врСписокПеременных = Новый СписокЗначений;
	врСписокПеременных.Добавить("", "channel1_DIALEDPEERNUMBER", Ложь);
	врСписокПеременных.Добавить("", "channel2_DIALEDPEERNUMBER", Ложь);
	
	Если bridgestate = "Link" Тогда
		врСписокПеременных.Добавить("", "CDR(linkedid)", Ложь);
		var_c1 = var_c1 + ",CDR(linkedid)";
		var_c2 = var_c2 + ",CDR(linkedid)";
		Если НазваниеPBX = "MyPBX" Тогда
			врСписокПеременных.Добавить("", "channel1_MIXMONITOR_FILENAME", Ложь);
			врСписокПеременных.Добавить("", "channel2_MIXMONITOR_FILENAME", Ложь);
			
			var_c1 = var_c1 + ",MIXMONITOR_FILENAME";
			var_c2 = var_c2 + ",MIXMONITOR_FILENAME";
		КонецЕсли; 
	КонецЕсли;
	
	// Портнов / Оптимизация / Начало
	linkedid = "";
	Если НЕ НазваниеPBX = "MyPBX" И Найти(channel1, "Local/")>0 Тогда
		src_chan = ПоискПоСвязямКаналов(channel1);
		linkedid = ПеремКаналовСтруктура.Получить(channel1 + "" + src_chan);
		Для каждого ТекПеременная Из врСписокПеременных Цикл
		 	ТекПеременная.Пометка = Истина;
			Если "CDR(linkedid)" = ТекПеременная.Представление Тогда			
				ТекПеременная.Значение = ""+linkedid;	
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	Если НЕ НазваниеPBX = "MyPBX" И Найти(channel2, "Local/")>0 Тогда
		src_chan = ПоискПоСвязямКаналов(channel1);
		linkedid = ПеремКаналовСтруктура.Получить(channel1 + "" + src_chan);
		Для каждого ТекПеременная Из врСписокПеременных Цикл
		 	ТекПеременная.Пометка = Истина;
			Если "CDR(linkedid)" = ТекПеременная.Представление Тогда			
				ТекПеременная.Значение = ""+linkedid;	
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(linkedid) Тогда
		HTTP_GetVar(channel1,врСписокПеременных,var_c1);
		HTTP_GetVar(channel2,врСписокПеременных,var_c2);
	КонецЕсли; 
	// Портнов / Оптимизация / Конец
	
	Для каждого врТекущаяПеременная Из врСписокПеременных Цикл
		Если врТекущаяПеременная.Пометка Тогда
			Если Найти(врТекущаяПеременная.Представление, "channel1_")>0 Тогда
				ПеремКаналовСтруктура.Вставить(channel1+"_"+СтрЗаменить(врТекущаяПеременная.Представление,"channel1_",""),врТекущаяПеременная.Значение);
			ИначеЕсли Найти(врТекущаяПеременная.Представление, "channel2_")>0 Тогда
				ПеремКаналовСтруктура.Вставить(channel2+"_"+СтрЗаменить(врТекущаяПеременная.Представление,"channel2_",""),врТекущаяПеременная.Значение);
			Иначе
				ПеремКаналовСтруктура.Вставить(channel1+"_"+врТекущаяПеременная.Представление,врТекущаяПеременная.Значение);
				ПеремКаналовСтруктура.Вставить(channel2+"_"+врТекущаяПеременная.Представление,врТекущаяПеременная.Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	// Связи каналов / Начало
	ДанныеСвязи = onBridgeОбновитьСвязиКаналов(врXMLУзел);
	// Связи каналов / Конец

	Если XMLУзел=Неопределено 
		ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли; 
	// + чистим "пропущенные"-отвеченные
	мОбработкаДанных.УдалитьСтрокуПропущенного(XMLУзел.ЗначениеАтрибута("uniqueid1"));
	мОбработкаДанных.УдалитьСтрокуПропущенного(XMLУзел.ЗначениеАтрибута("uniqueid2"));
	// -
	// Пытаемся уточнить номера телефонов // Начало //. 
	ch1 = Лев(channel1,ПолучитьПозициюБлижнегоСимвола(channel1, "@-,")-1);
	ch2 = Лев(channel2,ПолучитьПозициюБлижнегоСимвола(channel2, "@-,")-1);
	Хинт1 = ТаблицаХинтов.найти(ch1, "Канал");
	Хинт2 = ТаблицаХинтов.найти(ch2, "Канал");
	
	Если Найти(Нрег(channel1), "local")>0 Тогда
		cid1=?(ЗначениеЗаполнено(ДанныеСвязи.cid1),ДанныеСвязи.cid1,cid1);
		channel1=?(ЗначениеЗаполнено(ДанныеСвязи.Канал1),ДанныеСвязи.Канал1,channel1);
	КонецЕсли;
	
	Если Найти(Нрег(channel2), "local")>0 Тогда
		cid2=?(ЗначениеЗаполнено(ДанныеСвязи.cid2),ДанныеСвязи.cid2,cid2);
		channel2=?(ЗначениеЗаполнено(ДанныеСвязи.Канал2),ДанныеСвязи.Канал2,channel2);
	КонецЕсли; 
	
	cid1=?(Хинт1=Неопределено,XMLУзел.ЗначениеАтрибута("callerid1"),Хинт1.ВнутреннийНомер);
	cid2=?(Хинт2=Неопределено,XMLУзел.ЗначениеАтрибута("callerid2"),Хинт2.ВнутреннийНомер);
	
	ВнутреннийDST = (ОпределитьВнутреннийВнешнийЗвонок(cid2) = ТипВнутреннийВнешнийЗвонок.Внутренний);
	// Пытаемся уточнить номера телефонов // Конец //.  
	
	/// 
	// + Имя файла записи разговора.
	LongUniqueID = "";
	Если НазваниеPBX = "MYPBX" И bridgestate="Link" Тогда
		MIXMONITOR_FILENAME1 = ПеремКаналовСтруктура.Получить(channel1+"_MIXMONITOR_FILENAME");
		Если НЕ ЗначениеЗаполнено(MIXMONITOR_FILENAME1) Тогда
			MIXMONITOR_FILENAME1 = ПолучитьПеременнуюКанала(channel1, "MIXMONITOR_FILENAME");
		КонецЕсли; 
		
		MIXMONITOR_FILENAME2 = ПеремКаналовСтруктура.Получить(channel2+"_MIXMONITOR_FILENAME");
		Если НЕ ЗначениеЗаполнено(MIXMONITOR_FILENAME2) Тогда
			MIXMONITOR_FILENAME2 = ПолучитьПеременнуюКанала(channel2, "MIXMONITOR_FILENAME");
		КонецЕсли;

		MIXMONITOR_FILENAME = ?(ЗначениеЗаполнено(MIXMONITOR_FILENAME1),MIXMONITOR_FILENAME1,MIXMONITOR_FILENAME2);
		Если ЗначениеЗаполнено(MIXMONITOR_FILENAME) Тогда
			позСлэш		 = мОбщийМодуль.ПолучитьПозициюДальнегоСимвола(MIXMONITOR_FILENAME, "/")+1;
			позКонец	 = мОбщийМодуль.ПолучитьПозициюДальнегоСимвола(MIXMONITOR_FILENAME, ".") + 4;
			LongUniqueID = Сред(MIXMONITOR_FILENAME, позСлэш, позКонец - позСлэш);
			LongUniqueID = Лев(LongUniqueID,8)+ "/" +LongUniqueID;
		КонецЕсли; 
	КонецЕсли; 
	// -
	п_channel1 	  = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(channel1);
	п_channel2 	  = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(channel2);
	СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел, channel1, channel2);
	Если bridgestate="Link" 
		 И Найти(channel1, НашКаналФильтр) > 0 И п_channel1 = НашDAHDIПорт
		 И НЕ СтрочкаЗвонка = Неопределено Тогда // Исходящий
		
		СтрочкаЗвонка.CallerID				=   cid2;
		СтрочкаЗвонка.Канал1				=   channel1;
		СтрочкаЗвонка.Канал2				=   channel2;
		СтрочкаЗвонка.UniqueID1 			=   XMLУзел.ЗначениеАтрибута("uniqueid1");
		СтрочкаЗвонка.UniqueID2 			=   XMLУзел.ЗначениеАтрибута("uniqueid2");
		СтрочкаЗвонка.ВходящийЗвонок 		= 	Ложь;
		СтрочкаЗвонка.СейчасРазговаривают 	=   Истина;
		СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;
		ИдентификаторЗвонка					=	XMLУзел.ЗначениеАтрибута("uniqueid1");
		
		// Если у нас запланирован донабор, то выполним его
		НомерДонабора=ЗапланированныйДонабор.Получить(СтрочкаЗвонка.CallerID);
		Если НомерДонабора<>Неопределено Тогда
			// донабор должен быть инициирован только один раз
			ЗапланированныйДонабор.Удалить(СтрочкаЗвонка.CallerID);
			
			ДонаборНомера(СтрочкаЗвонка,НомерДонабора);
			// для донабора используется объект "Предупреждение" с таймаутом 5 сек
			// за это время строка звонка может быть уже удалена в событии hangup
			// проверим это
			СтрочкаЗвонка 	=	НайтиСтрочкуЗвонка(XMLУзел);
			Если СтрочкаЗвонка = Неопределено Тогда
				Состояние("Набор добавочного номера был отменен.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли bridgestate="Link"
		И ЗначениеЗаполнено(КонтекстДляКонсультативногоПеревода) 
		И Найти(channel1, КонтекстДляКонсультативногоПеревода) > 0
		И ЭтоНомерТекущегоПользователя(""+channel1 + channel2, мСписокНомеровПользователяДляОбработки)
		И НЕ СтрочкаЗвонка = Неопределено Тогда  // входящий начало переадресации, говорим с тем, кто переадресует
		
		СтрочкаЗвонка.CallerID				=   cid1;
		СтрочкаЗвонка.Канал1				=   channel1;
		СтрочкаЗвонка.Канал2				=   channel2;
		СтрочкаЗвонка.UniqueID1 			=   XMLУзел.ЗначениеАтрибута("uniqueid1");
		СтрочкаЗвонка.UniqueID2 			=   XMLУзел.ЗначениеАтрибута("uniqueid2");
		СтрочкаЗвонка.ВходящийЗвонок 		=	Истина;
		СтрочкаЗвонка.СейчасРазговаривают	=   Истина;
		СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;
		ИдентификаторЗвонка					=	XMLУзел.ЗначениеАтрибута("uniqueid2");
		
	ИначеЕсли bridgestate="Link" 
		И ЗначениеЗаполнено(КонтекстДляКонсультативногоПеревода) 
		И Найти(channel2, КонтекстДляКонсультативногоПеревода) Тогда // Входящий при переадресации, когда тот, кто переадресует, положил трубку

		Для каждого врСтрочкаЗвонка Из Звонки Цикл
			// Поиск локального канала (второе плечо) 
			// channel2 = "Local/104@internal-caller-transfer-00000014;1"
			// Канал1   = "Local/104@internal-caller-transfer-00000014;2"
			// ";2" - плечо канала.
			Если Найти(врСтрочкаЗвонка.Канал1, Лев(channel2, СтрДлина(channel2)- 2)) > 0 Тогда
				СтрочкаЗвонка = врСтрочкаЗвонка;
				СтрочкаЗвонка.CallerID				=   cid1;
				СтрочкаЗвонка.Канал1				=   channel2;
				СтрочкаЗвонка.UniqueID1 			=   XMLУзел.ЗначениеАтрибута("uniqueid1");
				СтрочкаЗвонка.UniqueID2 			=   XMLУзел.ЗначениеАтрибута("uniqueid2");
				СтрочкаЗвонка.ВходящийЗвонок 		=	Истина;
				СтрочкаЗвонка.СейчасРазговаривают	=   Истина;
				СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;
				ИдентификаторЗвонка					=	XMLУзел.ЗначениеАтрибута("uniqueid2");
			КонецЕсли; 
		КонецЦикла; 	  
		
		Если СтрочкаЗвонка = Неопределено Тогда
			Возврат;
		КонецЕсли; 		
	ИначеЕсли bridgestate="Link" 
		И Найти(channel2, НашКаналФильтр) > 0 И п_channel2 = НашDAHDIПорт 
		И НЕ СтрочкаЗвонка = Неопределено Тогда // Входящий вызов

		СтрочкаЗвонка.CallerID				=   cid1;
		СтрочкаЗвонка.Канал1				=   channel1; 
		СтрочкаЗвонка.Канал2				=   channel2;
		
		СтрочкаЗвонка.UniqueID1 			=   XMLУзел.ЗначениеАтрибута("uniqueid1");
		СтрочкаЗвонка.UniqueID2 			=   XMLУзел.ЗначениеАтрибута("uniqueid2");
		СтрочкаЗвонка.ВходящийЗвонок 		=	Истина;
		СтрочкаЗвонка.СейчасРазговаривают	=   Истина;
		СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;
		ИдентификаторЗвонка					=	XMLУзел.ЗначениеАтрибута("uniqueid2");
		
		УстановитьПеременнуюКанала(channel1,"SIPADDHEADER01","");    // Автоподьем трубки у второго абонента не нужно, проверенно на Linksys SPA-942
		УстановитьПеременнуюКанала(channel2,"SIPADDHEADER01","");    // Автоподьем трубки у второго абонента не нужно, проверенно на Linksys SPA-942
	ИначеЕсли НЕ СтрочкаЗвонка = Неопределено
		И bridgestate="Link"
		И Найти(channel2, НашКаналФильтр) > 0 И п_channel2 = НашDAHDIПорт
		И ЭтоЛокальныйНомерТекущегоПользователя(СтрочкаЗвонка.Канал1, мСписокНомеровПользователяДляОбработки)
		И ЭтоЛокальныйНомерТекущегоПользователя(channel2,мСписокНомеровПользователяДляОбработки) Тогда
		// Клиент позвонил нам на внешний номер и набрал группу вызова 04 
		// dial SIP/104 тут создауются два локальных канала Local/04;1 Local/04;2 (два плеча)
		// один соединен с каналом провайдера, другой с каналом SIP/104
		// в этом обработчике мы сопоставляем канал провайдера с каналом SIP/104
		// от Local/ каналов избавляемся, они в последствии отобьются
		СтрочкаЗвонка.Канал1 = channel1;
		СтрочкаЗвонка.СейчасРазговаривают = Истина;
	// если есть не заполненные каналы
	ИначеЕсли bridgestate="Link" 
		И ЭтоНомерТекущегоПользователя(""+channel1 + channel2,мСписокНомеровПользователяДляОбработки)
		И НЕ СтрочкаЗвонка = Неопределено
		И (НЕ ЗначениеЗаполнено(СтрочкаЗвонка.Канал1) ИЛИ НЕ ЗначениеЗаполнено(СтрочкаЗвонка.Канал2)) Тогда // исходящий

		СтрочкаЗвонка.Канал1				=   channel1;
		СтрочкаЗвонка.Канал2				=   channel2;
		Если ЭтоНомерТекущегоПользователя(channel1,мСписокНомеровПользователяДляОбработки)>0 Тогда
			СтрочкаЗвонка.ВходящийЗвонок 		=	Ложь;
		Иначе	
			СтрочкаЗвонка.ВходящийЗвонок 		=	Истина;
		КонецЕсли;
		СтрочкаЗвонка.СейчасРазговаривают = Истина;
		
	// Консультативный перевод 
	// сотрудник на которого переводим не готов говорить и положил трубку
	// строка звонка на этот момент уже была удалена. добавим
	ИначеЕсли bridgestate="Link" 
		И ЭтоНомерТекущегоПользователя(""+channel1 + channel2,мСписокНомеровПользователяДляОбработки)
		И СтрочкаЗвонка = Неопределено Тогда

		Входящий = ЭтоНомерТекущегоПользователя(""+channel2,мСписокНомеровПользователяДляОбработки);
		// Прекрасный повод добавить новую активную линию звонка
		СтрочкаЗвонка =	ДобавитьСтрокуЗвонка();
		СтрочкаЗвонка.CallerID			  =   ?(Входящий = Истина, cid1, cid2);
		СтрочкаЗвонка.Канал1			  =   channel1;
		СтрочкаЗвонка.Канал2			  =   channel2;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid1");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("uniqueid2");
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Входящий;
		СтрочкаЗвонка.СейчасРазговаривают =   Истина;
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
		
	ИначеЕсли bridgestate="Link" 
		И ЭтоНомерТекущегоПользователя(""+channel1 + channel2,мСписокНомеровПользователяДляОбработки)
		И НЕ СтрочкаЗвонка = Неопределено Тогда
		СтрочкаЗвонка.СейчасРазговаривают =   Истина;
		Возврат; 
		// 
	Иначе	
		Возврат; // Это звонок другого сотрудника или вообще не звонок
	КонецЕсли;
	
	Если ЗначениеЗаполнено(LongUniqueID) Тогда
		// MYPBX U Серии.
		ИдентификаторЗвонка = LongUniqueID;
	ИначеЕсли bridgestate="Link" Тогда	
		// Корректируем идентификатор с учетом Asterisk 1.8+.
		linkedid = ПеремКаналовСтруктура.Получить(СтрочкаЗвонка.Канал1+"_CDR(linkedid)");
		Если НЕ ЗначениеЗаполнено(linkedid) Тогда
			linkedid = ПолучитьПеременнуюКанала(СтрочкаЗвонка.Канал1 , "CDR(linkedid)");
		КонецЕсли;
		
		ИдентификаторЗвонка = ?(ЗначениеЗаполнено(linkedid),linkedid,ИдентификаторЗвонка);
	КонецЕсли; 
	
	onBridgeЭтап2(СтрочкаЗвонка, ИдентификаторЗвонка);
	
КонецПроцедуры
 
// Обработка события Bridge компонента miko_ajam (соединения 2-х абонентов)
//
Процедура onBridgeAst13(Знач Событие, Знач XMLУзел)
	// Связи каналов / Начало
	ДеталиСвязи = onBridgeОбновитьСвязиКаналов13_v2(XMLУзел);
	// Связи каналов / Конец
	
	// Проверим корректность входных данных.
	Если Событие <> "BridgeEnter" ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда Возврат; КонецЕсли; 
	XMLУзел = ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел = Неопределено Тогда Возврат; КонецЕсли; 
	
	ИдентификаторЗвонка = XMLУзел.ЗначениеАтрибута("destlinkedid");
	Если ИдентификаторЗвонка = Неопределено Тогда
		ИдентификаторЗвонка = XMLУзел.ЗначениеАтрибута("linkedid");
	КонецЕсли; 
	// + чистим "пропущенные"-отвеченные
	мОбработкаДанных.УдалитьСтрокуПропущенного(ИдентификаторЗвонка);
	channel = XMLУзел.ЗначениеАтрибута("channel");
	Если ЭтоСлужебныйКанал(channel) Тогда Возврат; КонецЕсли; 

	// Получим переменную канала
	Если ИдентификаторЗвонка = Неопределено Тогда
		chan_linkedid = ПеремКаналовСтруктура.Получить(channel+"CDR(linkedid)");
		Если НЕ ЗначениеЗаполнено(chan_linkedid) Тогда
			врСписокПеременных = Новый СписокЗначений;
			врСписокПеременных.Добавить("", "CDR(linkedid)", Ложь);
			Если HTTP_GetVar(channel,врСписокПеременных) Тогда
				Для каждого врТекущаяПеременная Из врСписокПеременных Цикл
					Если врТекущаяПеременная.Пометка Тогда
						ПеремКаналовСтруктура.Вставить(channel+"_"+врТекущаяПеременная.Представление,врТекущаяПеременная.Значение);
						chan_linkedid = врТекущаяПеременная.Значение;
						Прервать;
					КонецЕсли; 
				КонецЦикла;
			Иначе	
				chan_linkedid = ПолучитьПеременнуюКанала(channel, "CDR(linkedid)");
			КонецЕсли; 
		КонецЕсли;
		ИдентификаторЗвонка = ?(ЗначениеЗаполнено(chan_linkedid),chan_linkedid,ИдентификаторЗвонка);
	КонецЕсли; 
	
	LongUniqueID = "";
	Если НазваниеPBX = "MYPBX" Тогда
		MIXMONITOR_FILENAME = ПеремКаналовСтруктура.Получить(channel+"_MIXMONITORCALL_FILENAME");
		Если НЕ ЗначениеЗаполнено(MIXMONITOR_FILENAME) Тогда
			MIXMONITOR_FILENAME = ПолучитьПеременнуюКанала(channel, "MIXMONITORCALL_FILENAME");
		КонецЕсли; 
		Если ЗначениеЗаполнено(MIXMONITOR_FILENAME) Тогда
			ПеремКаналовСтруктура.Вставить(channel+"_MIXMONITORCALL_FILENAME", MIXMONITOR_FILENAME);
		КонецЕсли; 
	КонецЕсли; 
	Если ДеталиСвязи = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	// ДанныеКаналов = НайтиИсходныеКаналы(channel);
	СтрочкаЗвонка =	НайтиСтрочкуЗвонка(XMLУзел, ДеталиСвязи.channel, ДеталиСвязи.dstchannel);
	Если СтрочкаЗвонка = Неопределено И НЕ ДеталиСвязи = Неопределено Тогда
		СтрочкаЗвонка = Звонки.Найти(ИдентификаторЗвонка, "UniqueID1");	
	КонецЕсли; 	
	
	Если СтрочкаЗвонка = Неопределено Тогда
		// Соединение абонентов еще не произошло.
		Возврат;
	КонецЕсли; 
	
	Если (ЭтоНомерТекущегоПользователя(ДеталиСвязи.dstchannel, мСписокНомеровПользователяДляОбработки)
		  ИЛИ ЭтоНомерТекущегоПользователя(ДеталиСвязи.channel, мСписокНомеровПользователяДляОбработки) ) Тогда	
		СтрочкаЗвонка.Канал1		=   ДеталиСвязи.channel;
		СтрочкаЗвонка.Канал2		=   ДеталиСвязи.dstchannel;
		Если СтрочкаЗвонка.ВходящийЗвонок = Истина Тогда
			СтрочкаЗвонка.CallerID 	=   ДеталиСвязи.calleridnum;
		Иначе	                            
			СтрочкаЗвонка.CallerID 	=   ДеталиСвязи.connectedlinenum;
		КонецЕсли;  
		СтрочкаЗвонка.СейчасРазговаривают 	=   Истина;
		СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;		
	Иначе	
		// Это звонок другого сотрудника или вообще не звонок.
		Возврат;
	КонецЕсли;
	
	// Если у нас запланирован донабор, то выполним его
	НомерДонабора = ЗапланированныйДонабор.Получить(СтрочкаЗвонка.CallerID);
	Если НомерДонабора<>Неопределено И СтрочкаЗвонка.ВходящийЗвонок = Ложь Тогда
		// донабор должен быть инициирован только один раз
		ЗапланированныйДонабор.Удалить(СтрочкаЗвонка.CallerID);
		
		ДонаборНомера(СтрочкаЗвонка,НомерДонабора);
		// для донабора используется объект "Предупреждение" с таймаутом 5 сек
		// за это время строка звонка может быть уже удалена в событии hangup
		// проверим это
		СтрочкаЗвонка 	=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	onBridgeЭтап2(СтрочкаЗвонка, ИдентификаторЗвонка);

КонецПроцедуры

// Обработка добавленной ранее и обновленной строчки вызова.
// Открытие документа "Событие".
// 
Процедура onBridgeЭтап2(СтрочкаЗвонка, ИдентификаторЗвонка)

	// + Парковка / отложенная парковка вызова
	элКанал1 = КаналыКПарковке.Получить(СтрочкаЗвонка.Канал1);
	элКанал2 = КаналыКПарковке.Получить(СтрочкаЗвонка.Канал2);
	Если НЕ элКанал1 = Неопределено 
		 ИЛИ НЕ элКанал2 = Неопределено Тогда
		ЗапарковатьНаСвободныйСлот(СтрочкаЗвонка);
		// не требуется далее обрабатывать это событие
		Возврат;	
	КонецЕсли; 
	// - Парковка
	
	ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрочкаЗвонка);
	
	// обновим таблицу пропущенных звонков
	Для каждого ТекущийПропущенный Из ПропущенныеЗвонки Цикл
		Если Найти(ТекущийПропущенный.НомерТелефона, СокрЛП(СтрочкаЗвонка.CallerID)) > 0 Тогда
			// строки пропущенный сворачиваются по полю "НомерТелефона"
			// потому строка только одна, удаляем ее, т.к. разговор теперь состоялся
			ПропущенныеЗвонки.Удалить(ТекущийПропущенный);
			// оповещаем объект "ФормаТелефон"
			Оповестить("ОбновитьТаблицуПропущенных");
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	СтруктураЗвонка = Новый Структура;
	СтруктураЗвонка.Вставить("Контрагент",			СтрочкаЗвонка.Контрагент);
	СтруктураЗвонка.Вставить("КонтактноеЛицо",		СтрочкаЗвонка.КонтактноеЛицо);
	СтруктураЗвонка.Вставить("Когда",				ТекущаяДата());
	СтруктураЗвонка.Вставить("ВходящийЗвонок",		СтрочкаЗвонка.ВходящийЗвонок);
	СтруктураЗвонка.Вставить("НомерТелефона",		СтрочкаЗвонка.CallerID);
	СтруктураЗвонка.Вставить("ИдентификаторЗвонка",	ИдентификаторЗвонка);
	
	// Документ "Событие" Начало         
	СтруктураЗвонка.Вставить("onBridge", Истина);
	СтруктураЗвонка.Вставить("Канал1", СтрочкаЗвонка.Канал1);
	СтруктураЗвонка.Вставить("Канал2", СтрочкаЗвонка.Канал2);        
	Оповестить("МИКО_Bridge", СтруктураЗвонка, ЭтотОбъект);
	// Документ "Событие" Начало
	
	// найдем строчку звонка, в которой возможен автоподъем			
	Если ИспользоватьБаннер Тогда
		Банер_ДобавитьСтрокуЗвонка(СтрочкаЗвонка);  //TODO
	КонецЕсли;
	
	Если ОткрыватьСобытиеПриЗвонке
		 И ОпределитьВнутреннийВнешнийЗвонок(СтрочкаЗвонка.CallerID) = ТипВнутреннийВнешнийЗвонок.Внешний
		 И СтрочкаЗвонка.ЭтоМыПодслушиваем = Ложь
		 Тогда
		 
		Если ОткрыватьКонтрагентаПриЗвонке 
			 И ЗначениеЗаполнено(СтрочкаЗвонка.Контрагент)
			 И ТипЗнч(СтрочкаЗвонка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОткрытьЗначение(СтрочкаЗвонка.Контрагент);	
		Иначе	
			СтруктураЗвонка.Вставить("СтрочкаЗвонка", СтрочкаЗвонка);
			
			ID = ИдентификаторЗвонка;
			Если НазваниеPBX = "MYPBX" Тогда
				MIXMONITOR_FILENAME = ПеремКаналовСтруктура.Получить(СтруктураЗвонка.Канал1+"_MIXMONITORCALL_FILENAME");
				Если НЕ ЗначениеЗаполнено(MIXMONITOR_FILENAME) Тогда
					MIXMONITOR_FILENAME = ПеремКаналовСтруктура.Получить(СтруктураЗвонка.Канал2+"_MIXMONITORCALL_FILENAME");
				КонецЕсли; 
				Если ЗначениеЗаполнено(MIXMONITOR_FILENAME) Тогда
					ID = MIXMONITOR_FILENAME;
					СтруктураЗвонка.ИдентификаторЗвонка = ID;
				КонецЕсли; 
			КонецЕсли;
			ОткрытьСоздатьСобытие(ID, СтруктураЗвонка);
		КонецЕсли;  
	ИначеЕсли ОпределитьВнутреннийВнешнийЗвонок(СтрочкаЗвонка.CallerID) = ТипВнутреннийВнешнийЗвонок.Внешний Тогда
		// восстановим значение переменной сброшеной при звонке из документа события	
		СтруктураНастроек = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","PanelAsterisk",,ИмяТекущегоПользователя); 
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			СтруктураНастроек.Свойство("AMI_ОткрыватьСобытиеПриЗвонке", 	ОткрыватьСобытиеПриЗвонке);
		Иначе // такого в принципе быть не должно, но на всякий случай оставим.
			ОткрыватьСобытиеПриЗвонке = Ложь; 
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если НЕ ФормаТелефон.Открыта() Тогда
		ФормаТелефон.Открыть();
	КонецЕсли;
	ФормаТелефон.Панель.ТекущаяСтраница=ФормаТелефон.Панель.Страницы.Панель;

КонецПроцедуры

// Обработка события Dial компонента miko_ajam (Входящий звонок)
//
Процедура onDial(Знач XMLУзел)
	
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено 
		ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) 
		Тогда
		Возврат;
	КонецЕсли; 
	
	Если XMLУзел.ЗначениеАтрибута("subevent")<>"Begin" Тогда
		Возврат;
	КонецЕсли; 
	/// 
	// + СВЯЗИ КАНАЛОВ
	// получение строки с каналом	
	destination = ""+XMLУзел.ЗначениеАтрибута("destination");
	channel 	= ""+XMLУзел.ЗначениеАтрибута("channel");
	массСтрок = СвязиКаналов.НайтиСтроки(Новый Структура("Канал1,Канал2", channel, destination));
	// поиск строки связи
	Если массСтрок.Количество()=0 Тогда
		СтрокаСвязи = СвязиКаналов.Добавить();
		СтрокаСвязи.Канал1		= ""+channel;  
		СтрокаСвязи.Канал2		= ""+destination; 
		СтрокаСвязи.Dial		= Истина; 
	КонецЕсли; 
	/// - СВЯЗИ КАНАЛОВ 
	            
	п_channel 	  = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(channel);
	п_destination = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(destination);
	Если Найти(channel, НашКаналФильтр) > 0 И НашDAHDIПорт = п_channel Тогда //Исходящий
		
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		
		пНомерТелефона = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(XMLУзел.ЗначениеАтрибута("dialstring"));		
		Если ТипЗнч(ТаблицаХинтов) = Тип("ТаблицаЗначений") 
			 И Найти(ВРЕГ(XMLУзел.ЗначениеАтрибута("destination")), "DAHDI/"+пНомерТелефона+"-")>0 Тогда
			пХинт = ТаблицаХинтов.Найти("DAHDI/"+пНомерТелефона, "Канал");
			Если НЕ пХинт = Неопределено Тогда
				пНомерТелефона = пХинт.ВнутреннийНомер;
			КонецЕсли; 
		КонецЕсли; 

		СтрочкаЗвонка.CallerID 			  =   пНомерТелефона;
		СтрочкаЗвонка.Канал1			  =   XMLУзел.ЗначениеАтрибута("channel");
		СтрочкаЗвонка.Канал2			  =   XMLУзел.ЗначениеАтрибута("destination");
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Ложь;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
		СтрочкаЗвонка.АвтоПодъемВозможен  =   Ложь;
	ИначеЕсли Найти(destination, НашКаналФильтр) > 0 И НашDAHDIПорт = п_destination Тогда //Входящий
		
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		
		СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		СтрочкаЗвонка.Канал1			  =   XMLУзел.ЗначениеАтрибута("channel");
		СтрочкаЗвонка.Канал2			  =   XMLУзел.ЗначениеАтрибута("destination");
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Истина;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают = Ложь;
	ИначеЕсли ЭтоНомерТекущегоПользователя(XMLУзел.ЗначениеАтрибута("dialstring"),мСписокНомеровПользователяДляОбработки) Тогда // входящий на неосновной номер пользователя
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		
		СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		
		СтрочкаЗвонка.Канал1			  =   XMLУзел.ЗначениеАтрибута("channel");
		СтрочкаЗвонка.Канал2			  =   XMLУзел.ЗначениеАтрибута("destination");
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Истина;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают = Ложь;
		
	Иначе	
		Возврат; // Это звонок другого абонента
	КонецЕсли;
	
	// DND / Переадресация на голосовую почту // Начало
	Если СтатусТелефона = "DND" 
		 И СтрочкаЗвонка.ВходящийЗвонок = Истина Тогда
		Результат = "";
		// стараемся отбить все мобильные		
		Попытка
			Компонент.Hangup(СтрочкаЗвонка.Канал2, "AST_CAUSE_USER_BUSY",КлючУникальности, Результат);
		Исключение
		КонецПопытки;  
		Возврат;
	КонецЕсли; 	
	// DND / Переадресация на голосовую почту // Конец
	
	ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрочкаЗвонка);
	
	// найдем строчку звонка, в которой возможен автоподъем			
	Если ИспользоватьБаннер Тогда
		Банер_ДобавитьСтрокуЗвонка(СтрочкаЗвонка);  //TODO
	КонецЕсли;
	
	Если НЕ ФормаТелефон.Открыта() Тогда
		ФормаТелефон.Открыть();
	КонецЕсли;
	
	ФормаТелефон.Панель.ТекущаяСтраница=ФормаТелефон.Панель.Страницы.Панель;
	
КонецПроцедуры // onDial()

// Обработка события Dial Asterisk 13 компонента miko_ajam (Входящий звонок)
//
Процедура onDialAst13(Знач Событие, Знач XMLУзел)
	// Проверим корректность входных данных.
	Если НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда Возврат; КонецЕсли; 
	XMLУзел = ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел = Неопределено Тогда Возврат; КонецЕсли; 
	
	// Анализ оповещения.
	Если Событие<>"DialBegin" Тогда
		Возврат;
	КонецЕсли; 
	
	dialstring  = ""+XMLУзел.ЗначениеАтрибута("dialstring");
	channel 	= ""+XMLУзел.ЗначениеАтрибута("channel");
	destination = ""+XMLУзел.ЗначениеАтрибута("destchannel");
	Если ЭтоСлужебныйКанал(destination) Тогда Возврат; КонецЕсли; 

	/// 
	// + СВЯЗИ КАНАЛОВ
	// получение строки с каналом	
	массСтрок = СвязиКаналов.НайтиСтроки(Новый Структура("Канал1,Канал2", channel, destination));
	// поиск строки связи
	Если массСтрок.Количество()=0 Тогда
		СтрокаСвязи = СвязиКаналов.Добавить();
		СтрокаСвязи.Канал1		= ""+channel;  
		СтрокаСвязи.Канал2		= ""+destination; 
		СтрокаСвязи.Dial		= Истина; 
		Если НазваниеPBX = "MIKOPBX" 
			 И Найти(destination, "Local/"+НашНомерТелефона) > 0 
			 И XMLУзел.ЗначениеАтрибута("context") = "internal-originate" Тогда				
		 	СтрокаСвязи.IS_ORIGINATE = Истина;
			
			linkedid 	 = XMLУзел.ЗначениеАтрибута("linkedid");
			linkedid 	= ?(linkedid = Неопределено,  XMLУзел.ЗначениеАтрибута("destlinkedid"),linkedid);
			СтрокаСвязи.linkedid 	 = linkedid;
		Иначе
		 	СтрокаСвязи.IS_ORIGINATE = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	/// - СВЯЗИ КАНАЛОВ 
	
	Если Найти(channel, НашКаналФильтр)>0 Тогда 
		// Исходящий вызов.
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		СтрочкаЗвонка.CallerID			  =   ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(dialstring);
		СтрочкаЗвонка.Канал1			  =   channel;
		СтрочкаЗвонка.Канал2			  =   destination;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Ложь;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
		СтрочкаЗвонка.АвтоПодъемВозможен  =   Ложь;
	ИначеЕсли НазваниеPBX = "MIKOPBX"
			  И Найти(destination,НашКаналФильтр) > 0 И Найти(channel, "internal-originate")>0 Тогда
		// Исходящий вызов.
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		СтрочкаЗвонка.Канал1			  =   destination;
		СтрочкаЗвонка.Канал2			  =   channel;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Ложь;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  = Ложь;
		
	ИначеЕсли Найти(destination, НашКаналФильтр)>0  Тогда 
		// Входящий вызов.
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		
		СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		СтрочкаЗвонка.Канал1			  =   channel;
		СтрочкаЗвонка.Канал2			  =   destination;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Истина;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  = Ложь;
		
		destconnectedlinename = XMLУзел.ЗначениеАтрибута("destconnectedlinename");
		Если НЕ ЗначениеЗаполнено(СтрочкаЗвонка.CallerID) И "CDR_RECORDS" = destconnectedlinename Тогда
			// Это прослушивание разговора из истории.
			// Скорее всего MyPBX.
			СтрочкаЗвонка.CallerID			  =   destconnectedlinename;	
		КонецЕсли; 
		
	ИначеЕсли ЭтоНомерТекущегоПользователя(dialstring, мСписокНомеровПользователяДляОбработки) Тогда 
		// Входящий на неосновной номер пользователя.
		СтрочкаЗвонка			=	НайтиСтрочкуЗвонка(XMLУзел);
		Если СтрочкаЗвонка		=	Неопределено Тогда
			СтрочкаЗвонка		=	ДобавитьСтрокуЗвонка();	
		КонецЕсли; 
		
		СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		
		СтрочкаЗвонка.Канал1			  =   channel;
		СтрочкаЗвонка.Канал2			  =   destination;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("destuniqueid");
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Истина;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают = Ложь;
	Иначе	
		Возврат;
	КонецЕсли;
	
	ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрочкаЗвонка);
	
	// Найдем строчку звонка, в которой возможен автоподъем.			
	Если ИспользоватьБаннер Тогда
		Банер_ДобавитьСтрокуЗвонка(СтрочкаЗвонка);  //TODO
	КонецЕсли;
	
	Если НЕ ФормаТелефон.Открыта() Тогда
		ФормаТелефон.Открыть();
	КонецЕсли;
	
	ФормаТелефон.Панель.ТекущаяСтраница = ФормаТелефон.Панель.Страницы.Панель;
	
КонецПроцедуры // onDialAst13()

// Обработка события SendFAX компонента miko_ajam (Отправка факсимильного сообщения)
//
Процедура onSendFAX(Знач XMLУзел) 
	// Надо будет сделать котнтроль отправки факса или обратный звонок для выяснения получилось или нет.
	
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

// Обработка события UserEvent компонента miko_ajam (Произвольные данные от астериска)
//
Процедура onUserEvent(Знач XMLУзел)
	
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		// "битый" XML
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(НашКаналФильтр)
		      И Найти(XMLУзел.ЗначениеАтрибута("userevent"), "Hint")=0
			  И Найти(XMLУзел.ЗначениеАтрибута("userevent"), "AsteriskSettings")=0 Тогда
		// Еще не получено значение нашего канала	  
		Возврат;
	КонецЕсли; 
	Событие = XMLУзел.ЗначениеАтрибута("userevent");
	// Статусы // начало
	Если Событие = "DB_UserBuddyStatus" Тогда
		//userevent="UserBuddyStatus" action="UserEvent" actionid="47283" key="140" val="0"
		НомерТелефона = XMLУзел.ЗначениеАтрибута("key");
		Статус 		  = XMLУзел.ЗначениеАтрибута("val");
		ОбновитьСтатусСотрудника(НомерТелефона, Статус);
	ИначеЕсли Событие = "DB_CF" Тогда
		Канал 		= XMLУзел.ЗначениеАтрибута("channel");
		Ключ 		= XMLУзел.ЗначениеАтрибута("key");
		Значение 	= XMLУзел.ЗначениеАтрибута("val");
		Если Канал = НашКаналФильтр Тогда
			Оповестить("DB_CF_Переадресация",Новый Структура("Ключ,Значение",Ключ,Значение));
		КонецЕсли;
	// Статусы // Конец
	// Перехват на ответственного / Начало
	ИначеЕсли Событие="Interception" Тогда	
		//; Interception
		// При входящем звонке на АТС должно генерироваться пользовательское сообщение
		// UserEvent(Interception,CALLERID: ${CALLERID(num)},CHANNEL: ${CHANNEL},UNIQUEID: ${UNIQUEID},CONTEXT: ${CONTEXT})

		// UserEvent в 1С
		// <generic event="UserEvent" privilege="user,all" userevent="Interception" uniqueid="askozia-1380423468.269" 
		// callerid="201" channel="SIP/SIP-PROVIDER-4035187125240654b73576-0000008b" uniqueid="askozia-1380423468.269" />
		ОбработатьПерехватНаОтветственного(XMLУзел);	
	// Перехват на ответственного / Конец
	КонецЕсли;	
	
	
	// TODO // Asterisk 13
	Если ЗначениеЗаполнено(XMLУзел.ЗначениеАтрибута("1сchan")) Тогда
		// прочие функции
		channel = XMLУзел.ЗначениеАтрибута("1сchan");
	ИначеЕсли ЗначениеЗаполнено(XMLУзел.ЗначениеАтрибута("chan1c")) Тогда
		// dialplan 1.0.0.7
		channel = XMLУзел.ЗначениеАтрибута("chan1c");
	Иначе
		// dialplan 1.0.0.6
		channel = XMLУзел.ЗначениеАтрибута("channel");
	КонецЕсли; 
	
	Если Найти(channel,НашКаналФильтр)=0
		 И Найти(channel,СтрЗаменить(ВРег(НашКаналФильтр), "IAX2", "IAX"))=0
		 // проверим, возможно это оповещение о настройках (приложение 10000111)
		 И Найти(channel,КлючУникальности)=0 Тогда
		Возврат; // тут все события не про нашего отслеживаемого пользователя
	КонецЕсли; 
	
	Если Событие="FromCDR" Тогда
		СтрокаCDR=XMLУзел.ЗначениеАтрибута("lines");
		// мОбработкаДанных.onUserEvent_FromCDR(СтрокаCDR); // OLD
		ЖурналЗвонков = ?(ЗначениеЗаполнено(ЖурналЗвонков),ЖурналЗвонков, Новый Массив);
		врИсторияЗвонков = мОбработкаДанных.onUserEvent_FromCDR(СтрокаCDR);
		Для Каждого ЗаписьИстории Из врИсторияЗвонков Цикл
			ЖурналЗвонков.Добавить(ЗаписьИстории);
		КонецЦикла;

	ИначеЕсли Событие="Refresh1CHistory" Тогда	
		ЗаполнитьТаблицуИсторииЗвонков(,ЖурналЗвонков);
		ЖурналЗвонков = Новый Массив;
	ИначеЕсли Событие="CallRecord" Тогда
		ИмяФайлаЗаписиРазговора=XMLУзел.ЗначениеАтрибута("filename");
		fpath 		= ""+XMLУзел.ЗначениеАтрибута("fpath");
		uniqueid1c 	= ""+XMLУзел.ЗначениеАтрибута("uniqueid1c");
		
		ИменаФайлов = ПолучитьИменаФайловИзстроки(ИмяФайлаЗаписиРазговора);		
		Если ЗаписиДляВнешнейПанели.Найти(uniqueid1c) = Неопределено Тогда
			врИмяФайла = ИменаФайлов[0];
			Если ИменаФайлов.Количество()=1 Тогда
				ПрослушатьЗвонок(врИмяФайла);
			Иначе	
				ФормаВыбораФайлаЗаписи = ЭтотОбъект.ПолучитьФорму("ФормаВыбораФайлаЗаписи");
				ФормаВыбораФайлаЗаписи.Инициализировать(ИменаФайлов, Событие, fpath);
			КонецЕсли; 
		Иначе	
		  	ЗаписиДляВнешнейПанели.Удалить(ЗаписиДляВнешнейПанели.Найти(uniqueid1c));
			Если НазваниеPBX = "MYPBX" Тогда
			  	ПолучитьФорму("custom_MyPBX").ПолучитьФайлЗаписи(ИменаФайлов, uniqueid1c);
			Иначе	
			  	ПолучитьФорму("custom_Askozia").ПолучитьФайлЗаписи(ИменаФайлов, uniqueid1c, fpath);
			КонецЕсли; 
		КонецЕсли; 
		
	ИначеЕсли Событие="FaxFromCDR" Тогда
		СтрокаCDR=XMLУзел.ЗначениеАтрибута("lines");
		
		МассивПодстрок = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаCDR, ".....");
		Для каждого СтрокаМассива Из МассивПодстрок Цикл
			МассивСвойств = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаМассива, "@.@");
			
			Если МассивСвойств.Количество()>=6 Тогда
				
				СтрокаТаблицыCDR=ТЗФаксовВременная.Добавить();
				СтрокаТаблицыCDR.calldate		=	СтрЗаменить(СтрЗаменить(СтрЗаменить(МассивСвойств[0],"-",""),":","")," ","");
				СтрокаТаблицыCDR.src			=	МассивСвойств[1];
				СтрокаТаблицыCDR.dst			=	МассивСвойств[2];
				СтрокаТаблицыCDR.lastdata		=	МассивСвойств[3];
				СтрокаТаблицыCDR.uniqueid		=	МассивСвойств[4];
				СтрокаТаблицыCDR.lastapp		=	МассивСвойств[5];
				
			КонецЕсли;
		КонецЦикла; 
	ИначеЕсли Событие="Refresh1CFAXES" Тогда	
		ЗаполнитьТаблицуФаксимильныхСообщений(,,ТЗФаксовВременная);
	ИначеЕсли Событие="StartDownloadFax" Тогда
		ИмяФайлаСФаксом=XMLУзел.ЗначениеАтрибута("filename");
		Если НазваниеPBX = "ASKOZIA" Тогда
			ПолучитьФорму("custom_Askozia").ПолучитьФайлФакса(ХостAsterisk, ИмяФайлаСФаксом);
		Иначе	
			ЗапуститьПриложение("http://"+ХостAsterisk+":"+ИмяФайлаСФаксом);
		КонецЕсли; 
	ИначеЕсли Событие="FailDownloadFax" Тогда	
		Сообщить("Файл с факсимильным сообщением не найден на сервере ASTERISK.");
	ИначеЕсли Событие="StartDownloadRecord" Тогда
		ИмяФайлаЗаписиРазговора=XMLУзел.ЗначениеАтрибута("filename");
		fpath = ""+XMLУзел.ЗначениеАтрибута("fpath");
		ИменаФайлов = ПолучитьИменаФайловИзстроки(ИмяФайлаЗаписиРазговора);		
		Если ИменаФайлов.Количество()=1 Тогда
			врИмяФайла = ИменаФайлов[0];
			Если НазваниеPBX = "MYPBX" Тогда
			  	ПолучитьФорму("custom_MyPBX").ПолучитьФайлЗаписи(врИмяФайла);
			ИначеЕсли НазваниеPBX = "ASKOZIA" Тогда
			  	ПолучитьФорму("custom_Askozia").ПолучитьФайлЗаписи(врИмяФайла);
			ИначеЕсли Найти(НРег(ХостAsterisk), "sipteco")>0 Тогда
				ЗапуститьПриложение("http://"+ХостAsterisk + ":" + врИмяФайла);	
			ИначеЕсли Найти(НРег(ХостAsterisk), "quickfon")>0 Тогда
				ЗапуститьПриложение("http://"+ХостAsterisk + ":" + врИмяФайла);	
			Иначе	
			  	ПолучитьФорму("custom_Askozia").ПолучитьФайлЗаписи(fpath+врИмяФайла);
			КонецЕсли; 
		Иначе	
			ФормаВыбораФайлаЗаписи = ЭтотОбъект.ПолучитьФорму("ФормаВыбораФайлаЗаписи");
			ФормаВыбораФайлаЗаписи.Инициализировать(ИменаФайлов, Событие, fpath);
		КонецЕсли; 
	ИначеЕсли Событие = "FailDownloadRecord" ИЛИ  Событие = "CallRecordFail" Тогда	
		Сообщить("Файл с записью разговора не найден на сервере ASTERISK.");
	ИначеЕсли Событие="SendFaxStatusOk" Тогда	
		Сообщить("Факс отправленный абоненту "+XMLУзел.ЗначениеАтрибута("CallerID")+" успешно доставлен.");
	ИначеЕсли Событие="SendFaxStatusFail" Тогда	
		Сообщить("Ошибка при доставке факсимильного сообщения абоненту "+XMLУзел.ЗначениеАтрибута("CallerID")+"!");
	// статусы / начало 
	ИначеЕсли Событие = "FromUserBuddyStatus" Тогда
		Строкаlines		= XMLУзел.ЗначениеАтрибута("lines");
		МассивПодстрок 	= мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(Строкаlines, ".....");
		Для каждого СтрокаМассива Из МассивПодстрок Цикл
			МассивСвойств = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаМассива, "@.@");
			
			Если МассивСвойств.Количество()>=2 Тогда
				ОбновитьСтатусСотрудника(МассивСвойств[0], МассивСвойств[1]);		
			КонецЕсли;
		КонецЦикла; 
		Банер_ЗаполнитьТаблицуСотрудинков();
		Оповестить("ОбновитьОтображениеСтатусов");
	// статусы / конец 
	ИначеЕсли Событие="AsteriskSettings" Тогда	
		// факсы
		faxsendurl 				= XMLУзел.ЗначениеАтрибута("faxsendurl");
		РаботаСФаксамиВозможна 	= (faxsendurl<>"NO");
		УРЛСервераДляОтправкиФакса 		= ?(РаботаСФаксамиВозможна,"http://"+ХостAsterisk+":"+faxsendurl,"");
		GhostScriptУстановленНаAsterisk = ЗначениеЗаполнено(XMLУзел.ЗначениеАтрибута("ghostscriptver"));
		// автоподъем
		UseMp3Player 		= (XMLУзел.ЗначениеАтрибута("usemp3player")<>Неопределено); 
		НомерПрямойПарковки = XMLУзел.ЗначениеАтрибута("autoanswernumber");
		DefaultContext 		= XMLУзел.ЗначениеАтрибута("defaultcontext");
		ВерсияДиалплана 	= XMLУзел.ЗначениеАтрибута("dialplanver");
		
		Если НЕ мОбработкаДанных.ВерсияДиалпланаАктуальна(ВерсияДиалплана,МинимальнаяВерсияДиалплана) Тогда
			Сообщить("Используемая версия диалплана Asterisk не актуальна! Возможна некорректная работа панели телефонии!", СтатусСообщения.ОченьВажное);	
		КонецЕсли; 
		SkypeContext 	= XMLУзел.ЗначениеАтрибута("skypecontext");
		Если ЗначениеЗаполнено(SkypeContext) Тогда
			КонтекстНабораSkype				= SkypeContext;
		КонецЕсли; 
		Если ЗначениеЗаполнено(DefaultContext) Тогда
			КонтекстНабораПоУмолчанию       = DefaultContext;
		КонецЕсли;
		Оповестить("ОбновитьФормуНастройкиПанелиТелефонии");
		
		// + ПользовательСтатистики
		врНастрокиСтат = ""+XMLУзел.ЗначениеАтрибута("statistic");
		Разделитель = Найти(врНастрокиСтат, ":");
		Если Разделитель > 0 Тогда
			ПользовательСтатистики = Лев(врНастрокиСтат, Разделитель-1);
			ПарольПользователяСтатистики = Прав(врНастрокиСтат, СтрДлина(врНастрокиСтат) - Разделитель);
		КонецЕсли; 
		// -
		HTTP_GetVarPing();
	ИначеЕсли Событие="GetContest" Тогда	
		// <generic event="UserEvent" privilege="user,all" userevent="GetContest" uniqueid="askozia-1393922251.486" 
		// channel="IAX/306" context="IAX-PHONE-199984127053158a250537d" />
		DefaultContext 	= XMLУзел.ЗначениеАтрибута("peercontext");
		Если НЕ ЗначениеЗаполнено(DefaultContext) Тогда
			DefaultContext 	= XMLУзел.ЗначениеАтрибута("context");
		КонецЕсли;
		Если ЗначениеЗаполнено(DefaultContext) Тогда
			КонтекстНабораПоУмолчанию       = DefaultContext;
		КонецЕсли;
		Оповестить("ОбновитьФормуНастройкиПанелиТелефонии");
	// таблица хинтов / Начало
	ИначеЕсли Событие="HintsStart" Тогда	
		// очистка таблицы хинтов
		Если ТипЗнч(ТаблицаХинтов) = Тип("ТаблицаЗначений") Тогда
			ТаблицаХинтов.Очистить();	
		КонецЕсли; 
	ИначеЕсли Событие="RowsHint" Тогда	
		// наполнение таблицы хинтов
		// UserEvent RowsHint,channel:$chan,lines:$result"
		Строкаlines		= XMLУзел.ЗначениеАтрибута("lines");
		МассивПодстрок 	= мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(Строкаlines, ".....");
		Для каждого СтрокаМассива Из МассивПодстрок Цикл
			// Разбиваем на поля
			МассивСвойств = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаМассива, "@.@");
			Если МассивСвойств.Количество()<3 Тогда
				Продолжить;	
			КонецЕсли;
			// получаем значения полей
			НомерКонтекст = МассивСвойств[0];
			ПозицияРазделителя = Найти(НомерКонтекст, "@");
			Если ПозицияРазделителя = 0 Тогда
				Продолжить;	
			КонецЕсли;
			Канал = ВРЕГ(СокрЛП(МассивСвойств[1]));
			Если Найти(Канал, "SIP")=1 ИЛИ Найти(Канал, "IAX2")=1 ИЛИ Найти(Канал, "DAHDI")=1 ИЛИ Найти(Канал, "PJSIP")=1 Тогда
				// добавим строку хинта
				СтрокаХинта = ТаблицаХинтов.Добавить();
				СтрокаХинта.ВнутреннийНомер = Лев(НомерКонтекст, ПозицияРазделителя - 1);
				СтрокаХинта.Контекст		= Прав(НомерКонтекст, СтрДлина(НомерКонтекст) - ПозицияРазделителя);
				СтрокаХинта.Состояние		= СтрЗаменить(МассивСвойств[2],"State:","");
				СтрокаХинта.Канал			= МассивСвойств[1];				
				Если МассивСвойств.Количество()>=4 Тогда
					СтрокаХинта.UserAgent = URLDecode( МассивСвойств[3] );
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли Событие="HintsEnd"
		 	  И НЕ ЗначениеЗаполнено(НашКаналФильтр)
			  И НЕ Компонент = Неопределено Тогда
		// старт заполнения таблицы сотрудников
			
		ЗаполнитьТаблицуСотрудников();
		
		Если НЕ ЗначениеЗаполнено(НашКаналФильтр)
			 И РаботаетСтартовыйПомощник = Истина Тогда
			Оповестить("СтартовыйПомощник","ОшибкаВнутреннийНомер","Внутренний номер должен быть зарегистрирован на АТС!");
		ИначеЕсли НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда	
			ФормаНастройки=мОбщийМодуль.ПолучитьФормуНастройки();
			Если ФормаНастройки.Открыта() Тогда
				ФормаНастройки.Активизировать();
			Иначе
				ФормаНастройки.Открыть();
			КонецЕсли; 
		Иначе
			УстановитьАктивнуюФильтрациюСобытийНаПрокси();
		КонецЕсли; 
		// Статистика
		SendMetrikaStat(Компонент);
		Оповестить("ОбновитьОтображениеСтатусов");
		ЗаполнитьТаблицуИсторииЗвонков(ТекущаяДата());
	
	// таблица хинтов / Конец
	КонецЕсли;
КонецПроцедуры

// Преобразование переданной строки из URLencoded версии
// (необходимо декодировать данные).
Функция URLDecode(стр)
	Хекс=Новый Массив;	
	Хекс.Добавить("0");
	Хекс.Добавить("1");       
	Хекс.Добавить("2");       
	Хекс.Добавить("3");
	Хекс.Добавить("4");
	Хекс.Добавить("5");
	Хекс.Добавить("6");
	Хекс.Добавить("7");
	Хекс.Добавить("8");
	Хекс.Добавить("9");
	Хекс.Добавить("A");
	Хекс.Добавить("B");
	Хекс.Добавить("C");
	Хекс.Добавить("D");
	Хекс.Добавить("E");
	Хекс.Добавить("F");
	рез="";

	ДлиннаСтроки = СтрДлина(стр);
	Для сч=1 по ДлиннаСтроки Цикл
		чар=Сред(стр,сч,1);
		Если чар = "%" И сч+2<=ДлиннаСтроки Тогда
			Сим1 = Сред(стр,сч+1,1);	
			Сим2 = Сред(стр,сч+2,1);

			Ном1 = Хекс.Найти(Сим1);
			Ном2 = Хекс.Найти(Сим2);
			Если Ном1 = Неопределено
				 ИЛИ Ном2 = Неопределено Тогда
				 рез = рез + чар;

				 Продолжить;
			КонецЕсли; 

			кс = 16 * Ном1 + Ном2;
			КорректныйСимвол = Символ(кс);

			рез = рез + КорректныйСимвол;

			сч = сч + 2;
		иначе
			рез = рез + чар;
		КонецЕсли; 
	КонецЦикла;
    рез=СтрЗаменить(рез,"+"," ");
    рез=СтрЗаменить(рез,"%3a",":");
	
	Возврат рез; 
КонецФункции

// Обработка события Newchannel компонента miko_ajam (При создании нового канала)
//
Процедура onNewchannel(Знач XMLУзел)
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли; 
	
	Канал = ""+XMLУзел.ЗначениеАтрибута("channel");
	Если ЭтоСлужебныйКанал(Канал) Тогда
		Возврат;
	КонецЕсли; 
	
	// DND / Переадресация на голосовую почту // Начало
	Если СтатусТелефона = "DND" 
		 И ЭтоЛокальныйНомерТекущегоПользователя(Канал, мСписокНомеровПользователяДляОбработки) Тогда
		// стараемся отбить все мобильные
		врНомерТелефона = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(Канал);
		НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(врНомерТелефона);
		
		Если ОпределитьВнутреннийВнешнийЗвонок(НомерТелефона) = ТипВнутреннийВнешнийЗвонок.Внешний Тогда
			Попытка
				Компонент.Hangup(Канал, "AST_CAUSE_USER_BUSY", КлючУникальности, "");
				// это  звонок обабатывать далее не требуется
				Возврат;
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 	
	// DND / Переадресация на голосовую почту // Конец
	
КонецПроцедуры

// Обработка события CDR компонента miko_ajam (Запись сведений о звонке)
//
Процедура onCDR(Знач XMLУзел)
	
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаТаблицыCDR = Новый Структура;
	СтрокаТаблицыCDR.Вставить("src"			,	"" + XMLУзел.ЗначениеАтрибута("source")+XMLУзел.ЗначениеАтрибута("src"));
	СтрокаТаблицыCDR.Вставить("dst"			,	"" + XMLУзел.ЗначениеАтрибута("destination")+XMLУзел.ЗначениеАтрибута("dst"));
	СтрокаТаблицыCDR.Вставить("channel"		,	XMLУзел.ЗначениеАтрибута("channel"));
	СтрокаТаблицыCDR.Вставить("dstchannel"	,	"" + XMLУзел.ЗначениеАтрибута("destinationchannel")+XMLУзел.ЗначениеАтрибута("dstchannel"));
	СтрокаТаблицыCDR.Вставить("calldate"	,	СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLУзел.ЗначениеАтрибута("starttime"),"-",""),":","")," ",""));
	СтрокаТаблицыCDR.Вставить("billsec"		,	"" + XMLУзел.ЗначениеАтрибута("billableseconds")+XMLУзел.ЗначениеАтрибута("billsec"));
	СтрокаТаблицыCDR.Вставить("disposition"	,	ВРЕГ(XMLУзел.ЗначениеАтрибута("disposition")));
	СтрокаТаблицыCDR.Вставить("uniqueid"	,	"" + ?(ЗначениеЗаполнено(XMLУзел.ЗначениеАтрибута("linkedid")),XMLУзел.ЗначениеАтрибута("linkedid"),XMLУзел.ЗначениеАтрибута("uniqueid")) ) ;
	СтрокаТаблицыCDR.Вставить("callerid"	,	XMLУзел.ЗначениеАтрибута("callerid"));
	СтрокаТаблицыCDR.Вставить("lastapp"		,	"" + ВРЕГ(XMLУзел.ЗначениеАтрибута("lastapplication"))+ВРЕГ(XMLУзел.ЗначениеАтрибута("lastapp")) );
	СтрокаТаблицыCDR.Вставить("recordingfile",  "" + XMLУзел.ЗначениеАтрибута("recordingfile"));
	СтрокаТаблицыCDR.Вставить("lastdata"	,   "" + XMLУзел.ЗначениеАтрибута("lastdata"));
	СтрокаТаблицыCDR.Вставить("answertime"	,   мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(XMLУзел.ЗначениеАтрибута("answertime"))  );
	СтрокаТаблицыCDR.Вставить("endtime"	    ,   мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(XMLУзел.ЗначениеАтрибута("endtime"))  );
	
	СтрокаПоискаНомер =    "" + СтрокаТаблицыCDR.channel+ СтрокаТаблицыCDR.dstchannel	+ "@@"+СтрокаТаблицыCDR.dst+"@@"+"@@"+СтрокаТаблицыCDR.src+"@@"+ СтрокаТаблицыCDR.lastdata;
	////////////////////////////////////////////////////////////////
	// временные переменные для фильтрации истории как и на Askozia
	ЭтоПереводЗвонка 	= (СтрокаТаблицыCDR.lastapp = "TRANSFERRED CALL" И ЭтоНомерТекущегоПользователя(СтрокаТаблицыCDR.lastdata, мСписокНомеровПользователяДляИстории));
	ЭтоЗвонокНаНашНомер = ((СтрокаТаблицыCDR.lastapp = "DIAL" ИЛИ СтрокаТаблицыCDR.lastapp = "QUEUE") 
						   И (ЭтоНомерТекущегоПользователя(СтрокаПоискаНомер,мСписокНомеровПользователяДляИстории) ИЛИ ЭтоЛокальныйНомерТекущегоПользователя(СтрокаПоискаНомер,мСписокНомеровПользователяДляИстории)) );
	////////////////////////////////////////////////////////////////
	
	// СтрокаТаблицыCDR.uniqueid;
	//СтрВременнойТаблицы =  ТЗИсторииЗвонковВременная.Найти(XMLУзел.ЗначениеАтрибута("uniqueid"),"uniqueid");
	СтрВременнойТаблицы = мОбработкаДанных.НайтиСтрокуИсторииПоУИД(СтрокаТаблицыCDR.uniqueid);	
	Если СтрокаТаблицыCDR.lastapp="PLAYBACK" Тогда
		Возврат;
	ИначеЕсли ( СтрокаТаблицыCDR.lastapp="SENDFAX" ИЛИ СтрокаТаблицыCDR.lastapp="RECEIVEFAX" ) 
			  И ЗначениеЗаполнено(СтрокаТаблицыCDR.recordingfile) // Нам нужны только те строки в которых есть файл факса
			  И ТЗФаксовВременная.Количество()>0 Тогда  		// добавляем только если в таблице уже есть записи, инчае запросим с Asterisk
		НоваяСтрокаТаблицыCDR			=	ТЗФаксовВременная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыCDR,СтрокаТаблицыCDR);
		Возврат;	
	ИначеЕсли (ЭтоПереводЗвонка ИЛИ ЭтоЗвонокНаНашНомер)
			   И СтрВременнойТаблицы=Неопределено Тогда
	    // Это новая строка истории
		Если ТЗИсторииЗвонковВременная.Количество()>0 Тогда // вдруг пользователь включил панель не с самого утра, 
															// нам нужно держать таблицу пустой до первого обращения 
			НоваяСтрокаТаблицыCDR			=	ТЗИсторииЗвонковВременная.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыCDR,СтрокаТаблицыCDR);
		КонецЕсли; 
		
		// контроль направления звонка
		Если НЕ ЭтоНомерТекущегоПользователя( "@@"+СтрокаТаблицыCDR.src+"@@", мСписокНомеровПользователяДляИстории)
			 И НЕ ЭтоНомерТекущегоПользователя(СтрокаТаблицыCDR.channel, мСписокНомеровПользователяДляИстории)  Тогда // Входящий
			ВходящийЗвонок	=	Истина;
			НомерТелефона	=	СтрокаТаблицыCDR.src;     
		ИначеЕсли "s" = СтрокаТаблицыCDR.dst 		// служебные
				  ИЛИ "i" = СтрокаТаблицыCDR.dst    // extentions
				  ИЛИ "t" = СтрокаТаблицыCDR.dst    //(номера)
				  ИЛИ Найти(СтрокаТаблицыCDR.dst, "submodule")>0
				  ИЛИ Найти(СтрокаТаблицыCDR.dst, "CALLFLOW-START")>0 Тогда // Входящий
			ВходящийЗвонок	=	Истина;
			НомерТелефона	=	СтрокаТаблицыCDR.src;     
		Иначе // исходящий
			ВходящийЗвонок	=	Ложь;
			ПропущенныйЗвонок = Ложь;
		КонецЕсли;			

		// обработка пропущенного звонка 
		ОбновитьСтрокуПропущенного(СтрокаТаблицыCDR, ВходящийЗвонок);
		// Документ "Событие" Начало дополнительного заполнения
		ИмяПоля = ?(ВходящийЗвонок = Истина,"src", "dst");
		КлючCDRЗаписи = мОбработкаДанных.ПолучитьОписаниеСобытияПоКлючу(СтрокаТаблицыCDR[ИмяПоля], СтрокаТаблицыCDR.channel, СтрокаТаблицыCDR.dstchannel);
		Если НЕ КлючCDRЗаписи = Неопределено Тогда
			ФормаСобытия = мОбщийМодуль.ПолучитьДозаполнитьФормуСобытия(ФормаТелефон, КлючCDRЗаписи, СтрокаТаблицыCDR);
			Если НЕ ФормаСобытия = Неопределено Тогда
				ПериодСобытия = Новый Структура;
				ПериодСобытия.Вставить("НачалоСобытия", 	СтрокаТаблицыCDR.answertime);
				ПериодСобытия.Вставить("ОкончаниеСобытия", 	СтрокаТаблицыCDR.endtime);
				
				Если НазваниеPBX <> "MYPBX" Тогда
					ПериодСобытия.Вставить("CRM_GUIDЗвонка",	XMLУзел.ЗначениеАтрибута("linkedid"));
				КонецЕсли; 
				
				мОбщийМодуль.ЗаполнитьПериодСобытия(ФормаСобытия, ПериодСобытия);
			КонецЕсли;
			// чистим соответствие ключей
			КлючиУникальностиСобытий.Удалить(КлючCDRЗаписи);
		КонецЕсли; 
		// Документ "Событие" Конец
	ИначеЕсли НЕ СтрВременнойТаблицы = Неопределено 
		      И ЗначениеЗаполнено(СтрокаТаблицыCDR.recordingfile) Тогда
		// дозаполним строку истории 
		СтрВременнойТаблицы.recordingfile = СтрокаТаблицыCDR.recordingfile;
		СтрВременнойТаблицы.billsec       = СтрокаТаблицыCDR.billsec;
	КонецЕсли;
	
КонецПроцедуры

// Обработка события ExtensionStatus компонента miko_ajam (Изменение статуса Экстеншена)
//
Процедура onExtensionStatus(Знач XMLУзел)
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Канал  = XMLУзел.ЗначениеАтрибута("hint");
	Если НЕ ЗначениеЗаполнено(Канал) Тогда
		Возврат;
	КонецЕсли; 
	// хинт может прийти в формате, Custom:busystate132&amp;SIP/132
	НомерТелефона = "" + XMLУзел.ЗначениеАтрибута("exten");
	КаналНайден = ПолучитьЗначениеХинта(Канал, НомерТелефона);
	Если КаналНайден = Ложь Тогда
		Возврат;
	КонецЕсли; 
	
	Статус = XMLУзел.ЗначениеАтрибута("status");
	Если Статус="0" Тогда 		// Idle
		ОбновитьСостояниеСотрудника(Канал,СостояниеЭкстеншена.Свободен);
	ИначеЕсли Статус="1" Тогда 	// In Use
		// это состояние еще не значит: что сотрудник "разговаривает" - это состояние конкретного хинта / набора хинтов
		ОбновитьСостояниеСотрудника(Канал,СостояниеЭкстеншена.Разговаривает);
	ИначеЕсли Статус="2" Тогда 	// Busy
	ИначеЕсли Статус="4" Тогда 	// Unavailable
		ОбновитьСостояниеСотрудника(Канал,СостояниеЭкстеншена.Недоступен);
		
	// теперь будем отделять, Ringing - сотрудник еще НЕ разговаривает с абонентом	
	ИначеЕсли Статус="8" Тогда 	// Ringing
		ОбновитьСостояниеСотрудника(Канал,СостояниеЭкстеншена.ИдетВхЗвонок);
	ИначеЕсли Статус="16" Тогда	//On Hold 	 
	КонецЕсли; 
	
КонецПроцедуры

// Обработка события ChanSpyStart компонента miko_ajam (Подслушивание или конференция с другим разговором начало)
//
Процедура onChanSpyStart(Знач XMLУзел)
	
	//<generic event="ChanSpyStart" privilege="call,all" spyerchannel="SIP/126-00000754" spyeechannel="SIP/104-00000751" />
	//XMLУзел = СтрЗаменить(XMLУзел, "spyerchannel", "channel1");
	//XMLУзел = СтрЗаменить(XMLУзел, "spyeechannel", "channel2");
	//
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли; 
	//
	//Если Найти(XMLУзел.ЗначениеАтрибута("channel1"),НашКаналФильтр)>0 Тогда //Это мы подслушиваем
	//	СтрочкаЗвонка	=	НайтиСтрочкуЗвонка(XMLУзел);
	//	Если СтрочкаЗвонка = Неопределено Тогда
	//		СтрочкаЗвонка					=	ДобавитьСтрокуЗвонка();	
	//	КонецЕсли; 
	//	// СтрочкаЗвонка.CallerID				=   XMLУзел.ЗначениеАтрибута("spyeechannel");
	//	СтрочкаЗвонка.Канал1				=   XMLУзел.ЗначениеАтрибута("channel1");
	//	СтрочкаЗвонка.Канал2				=   XMLУзел.ЗначениеАтрибута("channel2");
	//	СтрочкаЗвонка.UniqueID1 			=   "";
	//	СтрочкаЗвонка.UniqueID2 			=   "";
	//	СтрочкаЗвонка.ВходящийЗвонок 		= 	Ложь;
	//	СтрочкаЗвонка.СейчасРазговаривают 	=   Истина;
	//	СтрочкаЗвонка.СейчасПодслушивают 	= 	Ложь;
	//	СтрочкаЗвонка.АвтоПодъемВозможен 	= 	Ложь;                
	//	СтрочкаЗвонка.ЭтоМыПодслушиваем 	= 	Истина;
	//ИначеЕсли  Найти(XMLУзел.ЗначениеАтрибута("channel2"),НашКаналФильтр)>0 Тогда //Это нас подслушивают
	//	СтрочкаЗвонка	=	НайтиСтрочкуЗвонка(XMLУзел);
	//	Если СтрочкаЗвонка<>Неопределено Тогда
	//		СтрочкаЗвонка.СейчасПодслушивают = Истина;		
	//	КонецЕсли; 
	//	
	//КонецЕсли;	
	
	КтоШпионит 	 = XMLУзел.ЗначениеАтрибута("spyerchannel");
	Если Найти(КтоШпионит, НашКаналФильтр)=0 Тогда
		Возврат;
	КонецЕсли; 
	ЗаКемШпионят = XMLУзел.ЗначениеАтрибута("spyeechannel");
	
	ТекущийВызов = Звонки.Найти(КтоШпионит, "Канал1,Канал2");
	Если ТекущийВызов <> Неопределено Тогда
		ТекущийВызов.Канал1 = КтоШпионит;
		ТекущийВызов.Канал2 = ЗаКемШпионят;
		
		// Установить связь канала.
		ТекущийВызов.ChanSpyКанал = ЗаКемШпионят;
		ТекущийВызов.ВходящийЗвонок 		= 	Ложь;
		ТекущийВызов.СейчасРазговаривают 	=   Истина;
		ТекущийВызов.СейчасПодслушивают 	= 	Ложь;
		ТекущийВызов.АвтоПодъемВозможен 	= 	Ложь;                
		ТекущийВызов.ЭтоМыПодслушиваем 		= 	Истина;
		
		врСотрудники = Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ТекущийВызов.Контрагент));
		Если врСотрудники.Количество()>0 Тогда
			// Перетасуем.              
			ТекущийВызов.Контрагент = ТекущийВызов.Контрагент; 		// Это наш коллега.
		 	ТекущийВызов.КонтактноеЛицо = врСотрудники[0].Собеседник;  // Собеседник коллеги.
		КонецЕсли; 
		
		Банер_ДобавитьСтрокуЗвонка(ТекущийВызов);	
	КонецЕсли;
	
КонецПроцедуры	

// Обработка события ChanSpyStop компонента miko_ajam (Подслушивание или конференция с другим разговором окончание)
//
Процедура onChanSpyStop(Знач XMLУзел)
	//<generic event="ChanSpyStop" privilege="call,all" spyeechannel="SIP/104-00000751" />
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	КаналДляПоиска	=	XMLУзел.ЗначениеАтрибута("spyeechannel");
	СтрочкаЗвонка	=	Звонки.Найти(КаналДляПоиска,"Канал1,Канал2");
	Если СтрочкаЗвонка<>Неопределено и ЗначениеЗаполнено(КаналДляПоиска) Тогда
		Если СтрочкаЗвонка.СейчасПодслушивают Тогда
			СтрочкаЗвонка.СейчасПодслушивают = Ложь; //Это нас подслушивали
		Иначе		
			// отбой вызова выполняем в onHandUp
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры	

// Обработка события Newstate компонента miko_ajam (При изменении состояния канала)
//
Процедура onNewstate(Знач XMLУзел)
	
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли; 
	
	channel		 = XMLУзел.ЗначениеАтрибута("channel");
	Если ЭтоСлужебныйКанал(channel) Тогда
		Возврат;
	КонецЕсли; 
	
	СтрочкаЗвонка=	НайтиСтрочкуЗвонка(XMLУзел);
	channelstate = XMLУзел.ЗначениеАтрибута("channelstate");
	calleridname = XMLУзел.ЗначениеАтрибута("calleridname");
	// Получим переменную канала
	врСписокПеременных = Новый СписокЗначений;
	// МИКО / Портнов / Оптипизация.
	врСписокПеременных.Добавить("", "extenfrom1c", Истина);
	// HTTP_GetVar(channel,врСписокПеременных);
	// МИКО / Портнов / Оптипизация.
	Для каждого врТекущаяПеременная Из врСписокПеременных Цикл
		Если врТекущаяПеременная.Пометка Тогда
			ПеремКаналовСтруктура.Вставить(channel+"_"+врТекущаяПеременная.Представление,врТекущаяПеременная.Значение);
		КонецЕсли; 
	КонецЦикла;	
	
	Если channelstate = "4"
		И ЭтоНомерТекущегоПользователя(channel,мСписокНомеровПользователяДляОбработки) Тогда 
		// Исходящий "Ring".
		Если СтрочкаЗвонка = Неопределено Тогда
			СтрочкаЗвонка =	ДобавитьСтрокуЗвонка();
		КонецЕсли; 
		
		connectedlinenum = XMLУзел.ЗначениеАтрибута("connectedlinenum");
		Если Найти(connectedlinenum, "unknown")>0 Тогда
			connectedlinenum = XMLУзел.ЗначениеАтрибута("exten")
		КонецЕсли; 
		СтрочкаЗвонка.CallerID			  =   connectedlinenum;
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("connectedlinename");
		СтрочкаЗвонка.Канал1			  =   channel;
		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");

		СтрочкаЗвонка.our_cidname 	  	  =	  calleridname;
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Ложь;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;       
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
		
	ИначеЕсли channelstate = "6"
		И ЭтоНомерТекущегоПользователя(channel,мСписокНомеровПользователяДляОбработки)
		И НЕ СтрочкаЗвонка = Неопределено И НЕ СтрочкаЗвонка.ВходящийЗвонок Тогда 
		// Подняли трубку "Up" при исходящем звонке.
		
		новый_CallerID = XMLУзел.ЗначениеАтрибута("connectedlinenum");
		Если Найти(новый_CallerID, "unknown")>0 Тогда
			новый_CallerID = "";
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(новый_CallerID) Тогда
			СтрочкаЗвонка.CallerID		  =   новый_CallerID;
		ИначеЕсли НЕ ЗначениеЗаполнено(""+новый_CallerID+СтрочкаЗвонка.CallerID) Тогда 
			СтрочкаЗвонка.CallerID		  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		КонецЕсли; 
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("connectedlinename");
		СтрочкаЗвонка.Канал1			  =   channel;

		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.our_cidname 	  	  =	  calleridname;
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Ложь; 
		СтрочкаЗвонка.СейчасРазговаривают =   Истина;
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
		
	ИначеЕсли channelstate = "6"
		И ЭтоНомерТекущегоПользователя(channel,мСписокНомеровПользователяДляОбработки)
		И СтрочкаЗвонка = Неопределено Тогда 
		// Подняли трубку "Up" при исходящем звонке, при использовании автоподъема.
		
		СтрочкаЗвонка =	ДобавитьСтрокуЗвонка();
		новый_CallerID = XMLУзел.ЗначениеАтрибута("connectedlinenum");
		Если Найти(новый_CallerID, "unknown")>0 Тогда
			новый_CallerID = "";
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(новый_CallerID) Тогда
			СтрочкаЗвонка.CallerID		  =   новый_CallerID;
		ИначеЕсли НЕ ЗначениеЗаполнено(""+новый_CallerID+СтрочкаЗвонка.CallerID) Тогда 
			СтрочкаЗвонка.CallerID		  =   XMLУзел.ЗначениеАтрибута("calleridnum");
		КонецЕсли; 
		СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("connectedlinename");
		Если НЕ ЗначениеЗаполнено(СтрочкаЗвонка.Контрагент) Тогда
			СтрочкаЗвонка.Контрагент		  =	  XMLУзел.ЗначениеАтрибута("calleridname");
		КонецЕсли; 
		
		СтрочкаЗвонка.Канал1			  =   channel;

		СтрочкаЗвонка.UniqueID1 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.our_cidname 	  	  =	  calleridname;
		СтрочкаЗвонка.ВходящийЗвонок 	  =	  Ложь; 
		СтрочкаЗвонка.СейчасРазговаривают =   Истина;
		СтрочкаЗвонка.СейчасПодслушивают  =	  Ложь;
	ИначеЕсли НЕ СтрочкаЗвонка = Неопределено
			  И НазваниеPBX = "MIKOPBX" И channelstate = "5"
			  И ЭтоНомерТекущегоПользователя(channel,мСписокНомеровПользователяДляОбработки)
			  И Найти(channel,НашКаналФильтр) > 0 И Найти(СтрочкаЗвонка.Канал2, "internal-originate")>0 Тогда
		
		Если XMLУзел.ЗначениеАтрибута("connectedlinenum")<>Неопределено Тогда
			// для Asterisk 1.8+
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("connectedlinenum");	
			СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("connectedlinename");
		ИначеЕсли НЕ ЭтоНомерТекущегоПользователя("@@"+XMLУзел.ЗначениеАтрибута("calleridnum")+"@@",мСписокНомеровПользователяДляОбработки) Тогда
			// Для Asterisk 1.6 нет поля "connectedlinenum", при статусе "Ringing" необходимый номер может быть найден в поле "calleridnum".
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");	
			// Для Asterisk 1.6 нет поля "connectedlinename", при статусе "Ringing" необходимый номер может быть найден в поле "calleridname". 
			СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		Иначе
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");	
			СтрочкаЗвонка.ВходящийЗвонок 	  =   Ложь;
		КонецЕсли; 
		
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.our_cidname 	  	  =	  calleridname;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  =   Ложь;
	ИначеЕсли channelstate = "5" 
			  И ЭтоНомерТекущегоПользователя(channel,мСписокНомеровПользователяДляОбработки) Тогда 
		// TODO // MYPBX (+)
		// При входящем звонке на группу вызовов, не корректно определяется CallerID.
		Если НЕ СтрочкаЗвонка = Неопределено 
			 И НазваниеPBX = "MYPBX" И ЗначениеЗаполнено(СтрочкаЗвонка.CallerID) Тогда
			// Номер телефона уже определен ранее в Dial.
			Возврат;
		КонецЕсли; 
		// TODO // MYPBX (-)
		
		// Входящий "Ringing".
		Если СтрочкаЗвонка = Неопределено Тогда
			СтрочкаЗвонка =	ДобавитьСтрокуЗвонка();
		КонецЕсли;
		
		Если НазваниеPBX = "MIKOPBX" Тогда
			IS_ORIGINATE = СвязиКаналов.НайтиСтроки(Новый Структура("linkedid,IS_ORIGINATE",XMLУзел.ЗначениеАтрибута("linkedid"), Истина)).Количество()>0;
			Если IS_ORIGINATE Тогда
				Входящий = Ложь;
			Иначе	
				Входящий = Истина;
			КонецЕсли; 
		Иначе	
			Входящий = Истина;
		КонецЕсли; 			
		
		СтрочкаЗвонка.ВходящийЗвонок 	  =   Входящий;
		Если XMLУзел.ЗначениеАтрибута("connectedlinenum")<>Неопределено Тогда
			// для Asterisk 1.8+
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("connectedlinenum");	
			СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("connectedlinename");
		ИначеЕсли НЕ ЭтоНомерТекущегоПользователя("@@"+XMLУзел.ЗначениеАтрибута("calleridnum")+"@@",мСписокНомеровПользователяДляОбработки) Тогда
			// Для Asterisk 1.6 нет поля "connectedlinenum", при статусе "Ringing" необходимый номер может быть найден в поле "calleridnum".
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");	
			// Для Asterisk 1.6 нет поля "connectedlinename", при статусе "Ringing" необходимый номер может быть найден в поле "calleridname". 
			СтрочкаЗвонка.Контрагент		  =   XMLУзел.ЗначениеАтрибута("calleridname");
		Иначе
			СтрочкаЗвонка.CallerID			  =   XMLУзел.ЗначениеАтрибута("calleridnum");	
			СтрочкаЗвонка.ВходящийЗвонок 	  =   Ложь;
		КонецЕсли; 
		
		СтрочкаЗвонка.Канал2			  =   channel;
		СтрочкаЗвонка.UniqueID2 		  =   XMLУзел.ЗначениеАтрибута("uniqueid");
		СтрочкаЗвонка.our_cidname 	  	  =	  calleridname;
		СтрочкаЗвонка.СейчасРазговаривают =   Ложь;
		СтрочкаЗвонка.СейчасПодслушивают  =   Ложь;
	КонецЕсли;
	
	Если НЕ СтрочкаЗвонка = Неопределено Тогда
		Если "CDR_RECORDS" <> СтрочкаЗвонка.our_cidname Тогда
			ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрочкаЗвонка);
		КонецЕсли; 
		// Банер / Начало
		// Открывается на все при звонке на наш номер
		// при исходящем звонке, откытие формы тоже происходит, 
		// но форма будет закрыта в событии "Dial"
		// найдем строчку звонка, в которой возможен автоподъем			
		Если ИспользоватьБаннер Тогда
			Банер_ДобавитьСтрокуЗвонка(СтрочкаЗвонка);  //TODO
		КонецЕсли;
		
		Если channelstate = "5"
			 И ЭтоНомерТекущегоПользователя(channel, мСписокНомеровПользователяДляОбработки) Тогда
			 
			Если Не ЗначениеЗаполнено(СтрочкаЗвонка.CallerID) Тогда
				СтрочкаЗвонка.CallerID = ПеремКаналовСтруктура.Получить(channel+"_extenfrom1c");
				Если НЕ ЗначениеЗаполнено(СтрочкаЗвонка.CallerID) Тогда
					СтрочкаЗвонка.CallerID = ПолучитьПеременнуюКанала(channel,"extenfrom1c");
				КонецЕсли;
			КонецЕсли; 
		ИначеЕсли channelstate = "6" Тогда  // "Up" - подняли трубку	
			СтрочкаЗвонка.АвтоПодъемВозможен = Ложь;
		КонецЕсли; 
		// Банер / Конец 
	КонецЕсли; 
	
КонецПроцедуры

// Обработка события Pickup компонента miko_ajam (При изменении состояния канала)
//
Процедура onPickup(Знач XMLУзел)
	// <generic event="Pickup" privilege="call,all" channel="SIP/112-000001eb" targetchannel="SIP/126-000001ea" />
	XMLУзел=ПолучитьЧтениеXML(XMLУзел);
	Если XMLУзел=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	channel		  =  XMLУзел.ЗначениеАтрибута("channel");       // этот наш новый канал
	targetchannel =  XMLУзел.ЗначениеАтрибута("targetchannel"); // этот канал пропадет
	Если Найти(channel, НашКаналФильтр)>0 И Найти(targetchannel, НашКаналФильтр)=0 Тогда
		// Мы перехватываем чужой канал (*8).
		Возврат;
	КонецЕсли; 
	ЗвонокКУдалению = Неопределено;
	Для каждого Звонок Из Звонки Цикл
		Если Звонок.ВходящийЗвонок // входящий ищем в канале 2
			 И (ЗначениеЗаполнено(targetchannel) 
			 И Найти(Звонок.Канал2, targetchannel) > 0) Тогда	
			// обновляем значение канала  
			Звонок.Канал2 = channel;
		ИначеЕсли ЗначениеЗаполнено(channel)
			  	  И Найти(channel, НашКаналФильтр)>0 // Удаляем только звонок по нашему каналу.
				  И Найти(Звонок.Канал1 + Звонок.Канал2, channel) > 0 Тогда
			// при обратном звонке на мобильный каналы могут быть перетасованы	  
			ЗвонокКУдалению = Звонок;
		КонецЕсли;
		Если Найти(Звонок.Канал1 + Звонок.Канал2, НашКаналФильтр) = 0 Тогда
			// Это больше не наш звонок. Вызов перехвачен другим сотрудником.
			ЗвонокКУдалению = Звонок;
		КонецЕсли; 
	КонецЦикла;   
	Если НЕ ЗвонокКУдалению = Неопределено Тогда
		УдалитьСтрокуЗвонкаПоИндексу(ЗвонокКУдалению);	
	КонецЕсли; 
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// СВЯЗИ КАНАЛОВ 

// Обработка информации о парковке вызова
// Параметры 
//   СтрокаXMLУзел - тип - строка, XML структура в строковом представлении
Процедура onParkedCall(СтрокаXMLУзел)

	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутов(СтрокаXMLУзел);
	Если СтруктураАтрибутов = Неопределено 
		 ИЛИ НЕ СтруктураАтрибутов.Получить("event")="ParkedCall" Тогда
		Возврат;
	КонецЕсли;
	channel 	= СтруктураАтрибутов.Получить("channel");	
	Если channel = Неопределено Тогда
	 	// Это скорее всего Asterisk 13 / 12
		channel 	= СтруктураАтрибутов.Получить("parkeechannel");
		exten 		= СтруктураАтрибутов.Получить("parkingspace");
		parkinglot	= СтруктураАтрибутов.Получить("parkingspace");
		from 		= СтруктураАтрибутов.Получить("parkerdialstring");
	    calleridnum = СтруктураАтрибутов.Получить("parkeecalleridnum");
	Иначе
		exten 		= СтруктураАтрибутов.Получить("exten");
		parkinglot	= СтруктураАтрибутов.Получить("exten");
		from 		= СтруктураАтрибутов.Получить("from");
		calleridnum = "";
	КонецЕсли; 
	
	СлотПарковки = Парковка.Найти(channel, "Канал");;
	Если СлотПарковки = Неопределено 
		 И Найти(from, НашКаналФильтр)>0 
		 Тогда
		СлотПарковки = Парковка.Добавить();
		СлотПарковки.Канал 		 = channel;
		СлотПарковки.calleridnum = calleridnum;
		СлотПарковки.Слот 		 = exten;
	ИначеЕсли НЕ СлотПарковки = Неопределено 
			  И СлотПарковки.Автоподъем = Истина Тогда
		НабратьНомер(СлотПарковки.Слот, КонтекстНабораПоУмолчанию, "", calleridnum);
	КонецЕсли;
	
	Если НЕ СлотПарковки = Неопределено Тогда
		СлотПарковки.Слот  = exten;
		Банер_ДобавитьЗапаркованныйВызов(СлотПарковки);
		Оповестить("ОбновитьОтображениеПарковки");
	КонецЕсли; 
КонецПроцедуры

// Обработка события снятия вызова с парковки
// Параметры 
//   СтрокаXMLУзел - тип - строка, XML структура в строковом представлении
Процедура onUnParkedCall(СтрокаXMLУзел)
	//  <generic event="ParkedCallGiveUp" privilege="call,all" systemname="mikopbx" parkeechannel="SIP/204-00000032" parkeechannelstate="6" parkeechannelstatedesc="Up" parkeecalleridnum="204" parkeecalleridname="204" parkeeconnectedlinenum="212" parkeeconnectedlinename="212" parkeelanguage="ru-ru" parkeeaccountcode="" parkeecontext="peer_212" parkeeexten="204" parkeepriority="1" parkeeuniqueid="mikopbx-1532943596.248" parkeelinkedid="mikopbx-1532943595.247" parkerdialstring="SIP/212" parkinglot="default" parkingspace="807" parkingtimeout="595" parkingduration="5" />

	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутов(СтрокаXMLУзел);
	Если СтруктураАтрибутов = Неопределено Тогда
		Возврат;
	КонецЕсли;                                            
	channel 	= СтруктураАтрибутов.Получить("channel");
	Если channel = Неопределено Тогда
	 	// Это скорее всего Asterisk 13 / 12
		channel 	= СтруктураАтрибутов.Получить("parkeechannel");
		exten 		= СтруктураАтрибутов.Получить("parkingspace");
		parkinglot	= СтруктураАтрибутов.Получить("parkingspace");
	Иначе
		exten 		= СтруктураАтрибутов.Получить("exten");
		parkinglot	= СтруктураАтрибутов.Получить("exten");
	КонецЕсли; 
	
	СлотПарковки = Парковка.Найти(exten, "Слот");
	Если НЕ СлотПарковки = Неопределено Тогда
		Если НазваниеPBX = "ASKOZIA" ИЛИ НазваниеPBX = "MIKOPBX" Тогда
			// Gри звонке на "внешний" номер сотрудника callerid может быть назначен внутренним 
			// номером вызывающего абонента.
			// Установим верный CALLERID(num).
			УстановитьПеременнуюКанала(channel,"CALLERID(num)",СлотПарковки.calleridnum);
		КонецЕсли; 
		
		Банер_УдалитьЗапаркованныйВызов(СлотПарковки);
		Парковка.Удалить(СлотПарковки);
		Оповестить("ОбновитьОтображениеПарковки");
	КонецЕсли; 

КонецПроцедуры 

// Дополнительная процедура обработки onBridge. Производит обновление таблицы связей каналов. 
// Параметры 
//   СтрокаXMLУзел - тип - строка, XML структура в строковом представлении
Функция onBridgeОбновитьСвязиКаналов(СтрокаXMLУзел)
	ДанныеСвязи = Новый Структура("Канал1,Канал2,cid1,cid2");
		
    Если Не ЗначениеЗаполнено(СтрокаXMLУзел) Тогда
		Возврат ДанныеСвязи;
	КонецЕсли;
	
	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутов(СтрокаXMLУзел);
	Если СтруктураАтрибутов = Неопределено 
		 ИЛИ НЕ СтруктураАтрибутов.Получить("event")="Bridge" Тогда
		Возврат ДанныеСвязи;
	КонецЕсли;
		
	// получение строки с каналом	
	массСтрок = СвязиКаналов.НайтиСтроки(Новый Структура("Канал1,Канал2",
										 СтруктураАтрибутов.Получить("channel1"),
										 СтруктураАтрибутов.Получить("channel2")));
	// поиск строки связи
	Если массСтрок.Количество()=0 Тогда
		СтрокаСвязи = СвязиКаналов.Добавить();
		СтрокаСвязи.Канал1		= "" + СтруктураАтрибутов.Получить("channel1");  
		СтрокаСвязи.Канал2		= "" + СтруктураАтрибутов.Получить("channel2"); 
		
	Иначе
		СтрокаСвязи = массСтрок[0];
	КонецЕсли;
	
	СтрокаСвязи.cid1  		= "" + СтруктураАтрибутов.Получить("callerid1");
	СтрокаСвязи.cid2   		= "" + СтруктураАтрибутов.Получить("callerid2");
	СтрокаСвязи.Dial 		= Ложь;
	СтрокаСвязи.bridgestate = "" + СтруктураАтрибутов.Получить("bridgestate");
	
	Если (Найти(ВРЕГ(СтрокаСвязи.Канал1), "LOCAL")>0 И Найти(СтрокаСвязи.Канал2, Лев(СтрокаСвязи.Канал1, Найти(СтрокаСвязи.Канал1, ";")))>0) Тогда
		// зомбирование канала
		// после этого LOCAL отмирает ZOMBIрование
		// удаление связи произойдет по hangup - событию
		Возврат ДанныеСвязи;
	КонецЕсли; 
	
	Если СтрокаСвязи.bridgestate = "Link" Тогда
		Канал1 = Лев(СтрокаСвязи.Канал1,ПолучитьПозициюБлижнегоСимвола(СтрокаСвязи.Канал1, "@-,")-1);
		Канал2 = Лев(СтрокаСвязи.Канал2,ПолучитьПозициюБлижнегоСимвола(СтрокаСвязи.Канал2, "@-,")-1);
		
		// иногда в brige приходят одинаковые callerid
		// в случае dial на "внешний" ноемер для Askozia
		// попытаемся получить номер абонента из переменной DIALEDPEERNUMBER
		Если Найти(СтрокаСвязи.Канал2, СтрокаСвязи.cid1)>0 Тогда
			DIALEDPEERNUMBER = ПеремКаналовСтруктура.Получить(СтрокаСвязи.Канал2+"_DIALEDPEERNUMBER");
			Если НЕ ЗначениеЗаполнено(DIALEDPEERNUMBER) Тогда
				DIALEDPEERNUMBER = ПолучитьПеременнуюКанала(СтрокаСвязи.Канал2, "DIALEDPEERNUMBER");
			КонецЕсли; 
			СтрокаСвязи.cid1 = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(DIALEDPEERNUMBER);
		КонецЕсли; 
		Если Найти(СтрокаСвязи.Канал1, СтрокаСвязи.cid2)>0 Тогда
			DIALEDPEERNUMBER = ПеремКаналовСтруктура.Получить(СтрокаСвязи.Канал1+"_DIALEDPEERNUMBER");
			Если НЕ ЗначениеЗаполнено(DIALEDPEERNUMBER) Тогда
				DIALEDPEERNUMBER = ПолучитьПеременнуюКанала(СтрокаСвязи.Канал1, "DIALEDPEERNUMBER");
			КонецЕсли; 
			СтрокаСвязи.cid2 = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(DIALEDPEERNUMBER);
		КонецЕсли; 
		
		Если Найти(ВРЕГ(СтрокаСвязи.Канал1), "LOCAL")>0 Тогда

			ИмяКанала = СтрокаСвязи.Канал1; cid_chan=Неопределено; cid_sob1=Неопределено;
			ПоискРеальногоКанала(ИмяКанала, cid_chan, cid_sob1);
			ДанныеСвязи.Канал1 = ИмяКанала;
			ДанныеСвязи.cid1 = cid_sob1;
			
			ИмяКанала = Лев(ИмяКанала,ПолучитьПозициюБлижнегоСимвола(ИмяКанала, "@-,")-1);
			СтрокаСвязи.ПсевдоКанал = ИмяКанала;
		Иначе
			ИмяКанала = Канал1;
		КонецЕсли; 
		врКанал1 = ИмяКанала;
		
		Если Найти(ВРЕГ(СтрокаСвязи.Канал2), "LOCAL")>0 Тогда 

			ИмяКанала = СтрокаСвязи.Канал2; cid_chan=Неопределено; cid_sob=Неопределено;
			ПоискРеальногоКанала(ИмяКанала, cid_chan, cid_sob);
			ДанныеСвязи.Канал2 = ИмяКанала;
			ДанныеСвязи.cid2 = cid_sob;
			ИмяКанала = Лев(ИмяКанала,ПолучитьПозициюБлижнегоСимвола(ИмяКанала, "@-,")-1);
			
			СтрокаСвязи.ПсевдоКанал = ИмяКанала;
		Иначе
			ИмяКанала = Канал2;
		КонецЕсли; 
		
		врКанал2 = ИмяКанала;
		ОбновитьСобеседникаДляСотрудника(врКанал1, СтрокаСвязи.cid2, врКанал2);
		Хинт = ?(ТаблицаХинтов = Неопределено, Неопределено, ТаблицаХинтов.найти(врКанал2, "Канал"));
		
		Если Хинт=Неопределено ИЛИ cid_sob1 = Неопределено Тогда
			ДанныеСвязи.cid2 = СтрокаСвязи.cid1;
			ОбновитьСобеседникаДляСотрудника(врКанал2, СтрокаСвязи.cid1, врКанал1);
		Иначе	
			// доверяем только строке с "Внешним" каналом
			ОбновитьСобеседникаДляСотрудника(врКанал2, cid_sob1, врКанал1);
		КонецЕсли; 
	КонецЕсли; 
	Возврат ДанныеСвязи;
КонецФункции

// Дополнительная процедура обработки onHangUp. Производит обновление таблицы связей каналов.
//
Процедура onHangUpОбвновитьСвязиКаналов(СтрокаXMLУзел)
    Если Не ЗначениеЗаполнено(СтрокаXMLУзел) Тогда
		Возврат;
	КонецЕсли;
	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутов(СтрокаXMLУзел);
	Если СтруктураАтрибутов = Неопределено 
		 ИЛИ НЕ СтруктураАтрибутов.Получить("event")="Hangup" Тогда
		Возврат;
	КонецЕсли;
	
	Канал = СтруктураАтрибутов.Получить("channel");
	СтрокаСвязи = СвязиКаналов.Найти(Канал, "Канал1,Канал2");
	Пока Истина Цикл
		СтрокаСвязи = СвязиКаналов.Найти(Канал, "Канал1,Канал2");
		Если СтрокаСвязи = Неопределено Тогда
			Прервать;	
		Иначе
			СвязиКаналов.Удалить(СтрокаСвязи);
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

// Установка собеседника сотрудника
// Обновление информации, с кем говорит сотрудник
// Параметры 
//   peer - тип  - строка, идентификатор канала в формате (Технология)/(номер), пример SIP/104, IAX/105
//   calleridnum - тип  - строка, Номер абонента - собеседника для "peer"
//   КаналСвязи  - тип  - строка, Канал абонента - собеседника для "peer" - уточнение (не обязателен)
Процедура ОбновитьСобеседникаДляСотрудника(Знач peer, Знач calleridnum,Знач КаналСвязи="")
    Если ЗначениеЗаполнено(КаналСвязи) И ТипЗнч(ТаблицаХинтов)=Тип("ТаблицаЗначений") Тогда
        // Попробуем определить внутренний номер по таблице хинтов.
        Хинт = ТаблицаХинтов.найти(КаналСвязи, "Канал");
        calleridnum = ?(Хинт=Неопределено,calleridnum,Хинт.ВнутреннийНомер);
    ИначеЕсли ТипЗнч(ТаблицаХинтов) <> Тип("ТаблицаЗначений") Тогда 
        СообщитьОтладочнуюИнформацию("Исключительная ситуация таблицы хинтов", "peer -"+peer+", calleridnum - "+calleridnum+", КаналСвязи - "+КаналСвязи);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(calleridnum)
		 ИЛИ НЕ ЗначениеЗаполнено(peer) Тогда
		Возврат;	
	КонецЕсли; 
	
	СтрокаСотрудника = Сотрудники.Найти(peer,"КаналСотрудника");
	Если НЕ СтрокаСотрудника = Неопределено Тогда
		// проверия канал собеседника
		Если ЗначениеЗаполнено(КаналСвязи)
			 И ТипЗнч(КаналСвязи) = Тип("Строка") 
			 И Найти(ВРЕГ(КаналСвязи), "LOCAL")=0
			 И Найти(КаналСвязи, calleridnum)=0 Тогда
		  	// если в канале собеседника не найден его номер телефона, то попробуем
			// проанализировать канал на наличие другого номера
			
			Если Найти(КаналСвязи, "DAHDI")>0 Тогда
				Хинт = ТаблицаХинтов.найти(КаналСвязи, "Канал");
				cid_from_chan = ?(Хинт=Неопределено, calleridnum, Хинт.ВнутреннийНомер);
			Иначе
				cid_from_chan = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(КаналСвязи);
			КонецЕсли; 
			Если мОбработкаДанных.ЭтоНеЧисловойНомер(cid_from_chan) Тогда
				// ТОЛЬКо числовое представение номера
				cid_from_chan = "";
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(cid_from_chan) Тогда
				// дополнительная проверка
				Если НЕ мОбработкаДанных.ЭтоНеЧисловойНомер(calleridnum) И СтрДлина(calleridnum)>5 Тогда
					// calleridnum = calleridnum;
				Иначе	
					calleridnum = cid_from_chan;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		// очистим
		СтрокаСотрудника.Собеседник = "";
		// ХЭШ // Смотрим всегда.
		Если ЗначениеЗаполнено(calleridnum) Тогда
			СтрокаКЭШ = ТЗ_КЭШ_КИ.Найти(calleridnum, "CallerID");
			Если НЕ СтрокаКЭШ = Неопределено 
				 И СтрокаКЭШ.ДатаАктуальности > ТекущаяДата() Тогда
				СтрокаСотрудника.Собеседник = ?(СтрокаКЭШ.Контрагент = "Неизвестный контрагент", calleridnum, СтрокаКЭШ.Контрагент);
			ИначеЕсли НЕ СтрокаКЭШ = Неопределено Тогда
				// Кэш не аткуален
				ТЗ_КЭШ_КИ.Удалить(СтрокаКЭШ);	
			КонецЕсли; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(calleridnum) И НЕ ЗначениеЗаполнено(СтрокаСотрудника.Собеседник) Тогда		
			Запрос = Новый Запрос;
			// получим текст запроса
			Если мОбработкаДанных.ЭтоНеЧисловойНомер(calleridnum) Тогда
				Запрос = мОбщийМодуль.ПолучитьЗапросОпределитьКонтрагентаКонтактногоЛицаПоНомеру("Skype:"+calleridnum);
				ТелефонДляПоиска = calleridnum;
			Иначе	
				ТелефонДляПоиска = мОбработкаДанных.ПреобразоватьНомерДляСохранения(calleridnum,  ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
				Запрос = мОбщийМодуль.ПолучитьЗапросОпределитьКонтрагентаКонтактногоЛицаПоНомеру(calleridnum);
			КонецЕсли; 
			// контроль заполнения параметра запроса
			Если ЗначениеЗаполнено(ТелефонДляПоиска) Тогда
				Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
				Запрос.УстановитьПараметр("ТелефонДляПоиска", ТелефонДляПоиска);
				// выполняем
				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					ВыборкаДетальныеЗаписи.Следующий();
					
					ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияОпределитьКонтрагентаКонтактногоЛицаПоНомеру(ВыборкаДетальныеЗаписи);
					СтрокаСотрудника.Собеседник = ДанныеЗаполнения.Контрагент;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		// назначим, если не нашли по базе
		Если НЕ ЗначениеЗаполнено(СтрокаСотрудника.Собеседник) Тогда
		 	СтрокаСотрудника.Собеседник = calleridnum;
		КонецЕсли;
		
		// ХЭШ // Добавляем всегда, даже если не нашли собеседника.
		Если ЗначениеЗаполнено(calleridnum) 
			 И ТЗ_КЭШ_КИ.Найти(calleridnum, "CallerID")=Неопределено Тогда
			СтрокаКЭШ = ТЗ_КЭШ_КИ.Добавить();
			СтрокаКЭШ.Контрагент = СтрокаСотрудника.Собеседник;                     
	        СтрокаКЭШ.CallerID	 = calleridnum;                                               
			СтрокаКЭШ.ДатаАктуальности = ТекущаяДата()+120; // две минуты актуальность ХЭШ.
		КонецЕсли; 

		Если ЗначениеЗаполнено(СтрокаСотрудника.Собеседник) Тогда
			СтрокаСотрудника.Состояние  = СостояниеЭкстеншена.Разговаривает;
		КонецЕсли;  
	КонецЕсли;

КонецПроцедуры

// Формирует ЧтениеXML из строки XML 
// Возвращает соответствие с атрибутами корневого элемента
// Параметры 
//   СтрокаXMLУзел - тип - строка, XML структура в строковом представлении
// Возвращаемое значение
//   Тип - Соответствие, Имя атрибута - ключ, Значение атрибута - значение
Функция ПолучитьСтруктуруАтрибутов(СтрокаХМЛ)
	Попытка
		XMLУзел = Новый ЧтениеXML;
		XMLУзел.УстановитьСтроку(СтрокаХМЛ);
		Если XMLУзел.Прочитать() Тогда
			СтруктураАтрибутов = Новый Соответствие;
			Если XMLУзел.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				// атрибуты можно получить только для начала элемента 
				// ЧтениеXML.Прочитать()
				Пока XMLУзел.ПрочитатьАтрибут() Цикл
					Если НЕ XMLУзел.ТипУзла = ТипУзлаXML.Атрибут Тогда
					 	Продолжить;
					КонецЕсли; 
					
					СтруктураАтрибутов.Вставить(XMLУзел.ЛокальноеИмя,XMLУзел.Значение);
				КонецЦикла; 
			КонецЕсли;
			
			// завершили разбор
			Возврат СтруктураАтрибутов;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	СообщитьОтладочнуюИнформацию("Невозможно разобрать данные XML. ",СтрокаХМЛ);
	Возврат Неопределено;
КонецФункции // ПолучитьЧтениеXML()

// Обработка парковки вызова. 
// Наполнение таблицы парковки
// Параметры 
//   СтрокаЗвонка - строка табличной части "Звонки"
//   timeout      - тип - строка,время, в милисекудах, только числа, без пробелов
//   Автоподъем   - НЕ Используется, булево, флаг о необходимости автоподъема (снятия с парковки)
Процедура ЗапарковатьНаСвободныйСлот(СтрокаЗвонка, timeout="600000", Автоподъем = Ложь) Экспорт 
	Если Компонент = Неопределено 
		ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;			
	КонецЕсли; 
	
	Если СтрокаЗвонка.ВходящийЗвонок = Истина Тогда
		Channel		=	СтрокаЗвонка.Канал1; // кого паркуем	
		channel2	=	СтрокаЗвонка.Канал2; // куда сообщить о парковке
	Иначе
		Channel		=	СтрокаЗвонка.Канал2;	
		channel2	=	СтрокаЗвонка.Канал1;
	КонецЕсли; 	
	
	Если  Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
		// нет возможности парковать локальный канал 
		// необходимо найти реальный
		Связь = мОбработкаДанных.НайтиСвязьКанала(Channel);
		КаналСвязи = Неопределено;
		Если НЕ Связь = Неопределено
			 И Связь.Свойство("КаналСвязи", КаналСвязи) 
			 И ЗначениеЗаполнено(КаналСвязи) Тогда
			Channel = КаналСвязи;	
		КонецЕсли;
		
		Если Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
			// Попробуем найти исходный канал.
			// Если получилится, процедура переопрелит переменную Channel.
			ПоискРеальногоКанала(Channel);
		КонецЕсли; 
		
		Если Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
		   	// нет возможности запарковать вызов
			Сообщить("Нет возможности запарковать этот вызов!");
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	элКанал = КаналыКПарковке.Получить(Channel);
	Если НЕ элКанал = Неопределено Тогда
		КаналыКПарковке.Удалить(Channel);
	КонецЕсли; 
	
	parkinglot	=	"";					// Слот паркови, пустой - запарковать на свободный
	actionid	=	КлючУникальности;   //
	result		=	"";                 // в переменную будет помещен result выполнения команды
	
	Попытка
		Компонент.Park(channel,channel2,timeout,parkinglot,actionid,result);
		СообщитьОтладочнуюИнформацию("Парковка абонента " + Channel, result);
		
		Если Найти(result, "Park successful")>0 Тогда
			СлотПарковки 			 = Парковка.Добавить();
			СлотПарковки.Канал 		 = channel;
			СлотПарковки.Слот  		 = parkinglot;
			СлотПарковки.calleridnum = СтрокаЗвонка.CallerID;
			СлотПарковки.Контакт 	 = ?(ЗначениеЗаполнено(СтрокаЗвонка.КонтактноеЛицо), СтрокаЗвонка.КонтактноеЛицо, СтрокаЗвонка.Контрагент);
			СлотПарковки.Автоподъем  = Автоподъем;
		ИначеЕсли Найти(result, "Error")>0
				  И Найти(result, channel)>0 Тогда	
			Сообщить("Нет возможности запарковать текущую линию!");
			СообщитьОтладочнуюИнформацию("Парковка абонента", result);
		ИначеЕсли Найти(result, "Error")>0
				  И Найти(result, channel2)>0 Тогда	
			// Нет возможности оповестить паркующему абоненту: куда запарковали клиента.
			// Позже придет event с оповещением.
			СообщитьОтладочнуюИнформацию("Парковка абонента", result);
		Иначе
			Сообщить("Нет возможности запарковать текущую линию!");
			СообщитьОтладочнуюИнформацию("Парковка абонента channel = " + channel + ", channel2 = " + channel2, result);
		КонецЕсли; 
	Исключение
		СообщитьОтладочнуюИнформацию("Парковка абонента, ошибка " + Channel, result);
	КонецПопытки;	

КонецПроцедуры

/// 
// Asterisk 13 

// Дополнительная процедура обработки onBridge. Производит обновление таблицы связей каналов. 
// Параметры 
//   СтрокаXMLУзел - тип - строка, XML структура в строковом представлении.
Функция onBridgeОбновитьСвязиКаналов13_v2(Знач ДанныеXML)
	Результат = Неопределено;
	
	УзелХМЛ = ПолучитьЧтениеXML(ДанныеXML);
	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутов(ДанныеXML);
	Если ТипЗнч(СтруктураАтрибутов) <> Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;
	БриджУстановлен = Ложь;
	
	event  			= СтруктураАтрибутов.Получить("event");
	channel		 	= СтруктураАтрибутов.Получить("channel");
	bridgeuniqueid  = СтруктураАтрибутов.Получить("bridgeuniqueid");
	connectedlinenum= СтруктураАтрибутов.Получить("connectedlinenum");
	calleridnum     = СтруктураАтрибутов.Получить("calleridnum");
	linkedid 		= СтруктураАтрибутов.Получить("linkedid");
	
	врСтроки = СвязиКаналов13.НайтиСтроки(Новый Структура("bridgeuniqueid,channel", bridgeuniqueid, channel));
	Если event = "BridgeEnter" Тогда
		Если врСтроки.Количество()=0 Тогда
			врСвязь = СвязиКаналов13.Добавить();
			врСвязь.bridgeuniqueid 	 = СтруктураАтрибутов.Получить("bridgeuniqueid");
			врСвязь.channel 		 = СтруктураАтрибутов.Получить("channel");
		Иначе
			врСвязь = врСтроки[0];
		КонецЕсли; 
		врСвязь.calleridnum 	 = calleridnum;
		врСвязь.calleridname 	 = СтруктураАтрибутов.Получить("calleridname");
		врСвязь.linkedid 		 = СтруктураАтрибутов.Получить("linkedid");
		врСвязь.connectedlinenum = connectedlinenum;
		врСвязь.connectedlinename= СтруктураАтрибутов.Получить("connectedlinename");
		
		ПервоеПлечо = НайтиСвязьКанала13_v2(врСвязь.bridgeuniqueid, channel);
		Если Найти(ВРЕГ(channel), "LOCAL")>0 Тогда
			ВтороеПлечо = НайтиСвязьКанала13_v2(врСвязь.bridgeuniqueid, channel, 0, Ложь, Ложь);
			Если НЕ ВтороеПлечо = Неопределено Тогда
				СтруктураАтрибутов.Вставить("connectedchannel1", ВтороеПлечо.channel);			
			КонецЕсли;
		Иначе
			ВтороеПлечо = врСвязь;
			СтруктураАтрибутов.Вставить("connectedchannel1", ВтороеПлечо.channel);
		КонецЕсли; 
		
		Если ПервоеПлечо<>Неопределено И ВтороеПлечо<>Неопределено Тогда
			БриджУстановлен = Истина;
			// Переопределяем канал.
			СтруктураАтрибутов.Вставить("connectedchannel2", ПервоеПлечо.channel);			
			Если Найти(connectedlinenum, "unknown")>0 Тогда
				// Правим номер телефона в данных звонка.
				СтруктураАтрибутов.Вставить("connectedlinenum", ПервоеПлечо.calleridnum);
			КонецЕсли; 
			Если Найти(ВтороеПлечо.connectedlinenum, "unknown")>0 Тогда
				ВтороеПлечо.connectedlinenum = ПервоеПлечо.calleridnum;
			КонецЕсли;
			Если Найти(ПервоеПлечо.connectedlinenum, "unknown")>0 Тогда
				ПервоеПлечо.connectedlinenum = ВтороеПлечо.calleridnum;
			КонецЕсли;
			
			врКанал1 = Лев(ПервоеПлечо.channel,НайтиСправаОдинИзСимволов(ПервоеПлечо.channel, "-")-1);
			ОбновитьСобеседникаДляСотрудника(врКанал1, ПервоеПлечо.connectedlinenum);
			
			врКанал2 = Лев(ВтороеПлечо.channel,НайтиСправаОдинИзСимволов(ВтороеПлечо.channel, "-")-1);
			ОбновитьСобеседникаДляСотрудника(врКанал2, ВтороеПлечо.connectedlinenum);
			
			Если ЗначениеЗаполнено(ПервоеПлечо.channel) И ЗначениеЗаполнено(ВтороеПлечо.channel)
				 И Найти(ВРЕГ(ПервоеПлечо.channel+ВтороеПлечо.channel), "LOCAL")=0 Тогда			 
				 
				СтрочкаЗвонка =	НайтиСтрочкуЗвонка(УзелХМЛ);
				IS_ORIGINATE = СвязиКаналов.НайтиСтроки(Новый Структура("linkedid,IS_ORIGINATE",СтруктураАтрибутов.Получить("linkedid"), Истина)).Количество()>0;
				Если НЕ СтрочкаЗвонка = Неопределено Тогда
					Входящий = СтрочкаЗвонка.ВходящийЗвонок;
				ИначеЕсли IS_ORIGINATE И НазваниеPBX = "MIKOPBX" Тогда
					Входящий = Ложь
				Иначе
				 	Входящий = Истина;
				КонецЕсли; 
 
				Результат = Новый Структура();
				Если Найти(ПервоеПлечо.channel, НашКаналФильтр)>0 Тогда
					Если Входящий Тогда
						Результат.Вставить("channel", 			ВтороеПлечо.channel);								 
						Результат.Вставить("calleridnum", 		ВтороеПлечо.calleridnum);								 
						Результат.Вставить("dstchannel", 		ПервоеПлечо.channel);								 
						Результат.Вставить("connectedlinenum", 	ПервоеПлечо.calleridnum);								 						
					Иначе	
						Результат.Вставить("channel", 			ПервоеПлечо.channel);								 
						Результат.Вставить("calleridnum", 		ПервоеПлечо.calleridnum);								 
						Результат.Вставить("dstchannel", 		ВтороеПлечо.channel);								 
						Результат.Вставить("connectedlinenum", 	ВтороеПлечо.calleridnum);								 
					КонецЕсли; 
				Иначе
					// ПервоеПлечо.channel - чужой канал.
					Если Входящий Тогда
						Результат.Вставить("channel", 			ПервоеПлечо.channel);								 
						Результат.Вставить("calleridnum", 		ПервоеПлечо.calleridnum);								 
						Результат.Вставить("dstchannel", 		ВтороеПлечо.channel);								 
						Результат.Вставить("connectedlinenum", 	ВтороеПлечо.calleridnum);								 
					Иначе	
						Результат.Вставить("channel", 			ВтороеПлечо.channel);								 
						Результат.Вставить("calleridnum", 		ВтороеПлечо.calleridnum);								 
						Результат.Вставить("dstchannel", 		ПервоеПлечо.channel);								 
						Результат.Вставить("connectedlinenum", 	ПервоеПлечо.calleridnum);								 						
					КонецЕсли; 
				КонецЕсли;
				
				Результат.Вставить("linkedid", 			linkedid);
				Результат.Вставить("БриджУстановлен", 	БриджУстановлен);
			КонецЕсли; 
		КонецЕсли; 
		
	ИначеЕсли event = "BridgeLeave" И врСтроки.Количество()>0 Тогда	
		Для каждого врСтрока Из врСтроки Цикл
			СвязиКаналов13.Удалить(врСтрока);
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

// Поиск канала, связанного с текущим.
// Помогает определить собеседника.
Функция НайтиСвязьКанала13_v2(Знач bridgeuniqueid, Знач channel, УровеньРекурсии=0, ИскатьПоLocal=Ложь, МенятьПлечоLocal = Истина)
	Результат = Неопределено; УровеньРекурсии = УровеньРекурсии + 1;
	Если УровеньРекурсии > 100 Тогда Возврат Неопределено; КонецЕсли; 
	
	Если Найти(ВРЕГ(channel), "LOCAL")>0 И ИскатьПоLocal=Ложь Тогда
 		Если МенятьПлечоLocal = Истина Тогда
			// Базовое имя канала  Local/04@internal-caller-transfer-000001f0
			LocalКанал = мОбработкаДанных.ОтсечьПлечоВLocal(channel, Ложь);
			// Необходимо найти, с каким каналом связано его второе плечо
			ИмяПлеча = ?(Найти(channel, ";2"), ";1", ";2");
			КаналДляПоиска = ""+LocalКанал+ИмяПлеча;
		Иначе
			КаналДляПоиска = ""+channel;
		КонецЕсли; 
		врСтроки = СвязиКаналов13.НайтиСтроки(Новый Структура("channel", КаналДляПоиска));
		Если врСтроки.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Идентификатор bridgeuniqueid будет отличаться от исходного.
		Возврат НайтиСвязьКанала13_v2(врСтроки[0].bridgeuniqueid, КаналДляПоиска, УровеньРекурсии, Истина);
	КонецЕсли;
	
	// Не более двух каналов в бридж.
	врСтроки = СвязиКаналов13.НайтиСтроки(Новый Структура("bridgeuniqueid", bridgeuniqueid));
	Для каждого врТекСтрока Из врСтроки Цикл
		Если врТекСтрока.channel = channel Тогда
			// В одном бридже только два канала.
		 	Продолжить;
		КонецЕсли; 
		
		Если Найти(ВРЕГ(врТекСтрока.channel), "LOCAL")>0 Тогда
			Возврат НайтиСвязьКанала13_v2(bridgeuniqueid, врТекСтрока.channel, УровеньРекурсии);
		КонецЕсли; 
		
		Результат = врТекСтрока;		
		Прервать;
	КонецЦикла;
	
	
	Возврат Результат;
КонецФункции // НайтиСвязьКанала13()

/////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ОТПРАВКИ КОММАНД ASTERISK серверу

// Экспериментальныя процедура. 
// Проверено ТОЛЬКО с телефонами Linksys.
Функция ОтветитьНаЗвонок(СтрочкаЗвонка) Экспорт
	Если СтрочкаЗвонка.СейчасРазговаривают = Истина Тогда
		// Подъем трубки не требуется.
		Возврат Истина;
	КонецЕсли; 
	
	Результат = Ложь;
	
	ЛинияSIP = ЗвонкиSIP.Найти(СтрочкаЗвонка.CallerID, "CallerID");        
	Если ИспользоватьСофтфон 
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено)
		 И ЛинияSIP <> Неопределено Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ЛинияSIP.Канал, "КнопкаПринятьПоID");
	ИначеЕсли НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(СтрочкаЗвонка, "КнопкаПринять");
		Результат = Истина;
	ИначеЕсли ИспользоватьАвтоподъем = Истина
		 И СтрочкаЗвонка.АвтоПодъемВозможен Тогда 
			  
		Channel = ?(СтрочкаЗвонка.ВходящийЗвонок,СтрочкаЗвонка.Канал2,СтрочкаЗвонка.Канал1);	
		Если PickupChan(СтрочкаЗвонка.CallerID, Channel) Тогда
			Результат = Истина;
			СтрочкаЗвонка.СейчасРазговаривают = Истина;
		Иначе
			Сообщить("Автоматический подъем не возможен!");
		КонецЕсли; 
		
		// Запрещаем автоводъем для сторки звонка.
		СтрочкаЗвонка.АвтоПодъемВозможен = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Инициализируем исходящий звонок
//
Функция НабратьНомер(НомерАбонента, КонтекстНабора=Неопределено, CallerID = "", ConnectedCID = "") Экспорт
	Если НаборНомераРазрешен
		 И ЗначениеЗаполнено(НомерАбонента) Тогда
		// временный запрет набора
		параметрНабора = НомерАбонента;
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Рез = Ложь;
	
	Если НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(НомерАбонента, "НабратьНомер");
		Возврат Истина;	
	КонецЕсли;
	
	Если КонтекстНабора=Неопределено Тогда	
		КонтекстНабора=КонтекстНабораПоУмолчанию;	
	КонецЕсли; 
	
	СтрокаТекущегоСотрудника = Сотрудники.Найти(мПользователь,"Сотрудник");
	Если СтрокаТекущегоСотрудника<>Неопределено Тогда
		НомерТекущегоПользователя = СтрокаТекущегоСотрудника.ВнутреннийНомер;	
	Иначе
		НомерТекущегоПользователя = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(НашКаналФильтр);
	КонецЕсли;                                         
	
	Если ФормаТелефон<>Неопределено Тогда             
		Если НЕ ФормаТелефон.Открыта() Тогда
			ФормаТелефон.Открыть();
		КонецЕсли;
		ФормаТелефон.Панель.ТекущаяСтраница=ФормаТелефон.Панель.Страницы.Панель;
	КонецЕсли;
	
	Если (НЕ ПустаяСтрока(НомерАбонента)) И (НЕ ПустаяСтрока(НашКаналФильтр)) И (НЕ ПустаяСтрока(КонтекстНабора)) тогда
		Если НазваниеPBX = "MIKOPBX" Тогда
		 	Channel = "Local/"+НашНомерТелефона+"@internal-originate/n";
		Иначе
			Channel		=	НашКаналФильтр;		
		КонецЕсли;  
		Context		=	КонтекстНабора;			//	Context: Название контекста для совершения исходящего вызова (используется только совместно с параметрами Exten и Priority)
		Exten		=	НомерАбонента;			//	Exten: Extension to use on connect (используется только совместно с параметрами Context и Priority)
		Priority	=	"1";					//	Priority: Priority to use on connect (используется только совместно с параметрами Context и Exten)
		Timeout		=	"";						//	Timeout: Таймаут (в миллисекундах) для соединения с инициатором исходящего вызова (значение по умолчанию: 30000 миллисекунд).
		
		Если НЕ ЗначениеЗаполнено(CallerID) Тогда
			CallerID	=	"""" + мОбработкаДанных.Транслитерация(мПользователь.Наименование) + """" + " <" + НомерТекущегоПользователя + ">"; //	CallerID: Значение CallerID, используемое для совершения исходящего вызова.
		Иначе
			CallerID= Строка(CallerID);
		КонецЕсли; 
		IS_ORGNT    =  Формат(ТекущаяДата() - НачалоДня(ТекущаяДата()), "ЧДЦ=0; ЧГ=0");
		pt1c_cid 	= ?(ЗначениеЗаполнено(ConnectedCID), ConnectedCID, НомерАбонента);
		Variable	=	"_IS_ORGNT="+IS_ORGNT+",pt1c_cid="+pt1c_cid+",extenfrom1c="+URLEncode(НомерАбонента)+","
						+"from_1C=true,"
						+?(ИспользоватьАвтоподъем,URLEncode(СтрокаАвтоподъема),"");   // Linksys SPA-942 точно умеет автоподьем
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		Account		=	"";						//	Account: Значение для “Account code” исходящего вызова.
		Application	=	"";						//	Application: Команда плана набора, используемая для совершения исходящего вызова (используется параметр “Data”, для указания ее параметров)
		Data		=	"";						//	Data : Параметры команды плана набора, используемой для совершения исходящего вызова.
		Async		=	"1";					//	Async: Если указано “true” исходящий вызов будет производиться асинхронно. Результат ее выполнения будет возвращен позже, в пакете типа “Event” (позволяет осуществлять несколько вызовов без ожидания результата предыдущей команды, совершающей исходящий вызов)
		Codecs		=	"";						//  Используемый кодек
		ActionID	=	КлючУникальности;		//	ActionID: Не обязательный идентификатор запроса. Позволяет сопоставить результат выполнения конкретному запросу. В качестве значения можно использовать или номер или строку. Очень полезно использовать, когда выполняется несколько асинхронных запросов одновременно.
		
		Результат="";
		Попытка
			Компонент.Originate(Channel, Context, Exten, Priority, Timeout, CallerID, Variable, Account, Application, Data, Async, Codecs, "", ActionID, Результат);
			СообщитьОтладочнуюИнформацию("Инициирован звонок с "+НашКаналФильтр+" на номер "+НомерАбонента,Результат);
			Рез=Истина;
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при инициализации звонка на номер "+НомерАбонента,Результат);
		КонецПопытки;	
		
	КонецЕсли;
	Возврат Рез;
КонецФункции

// Пробуем перехватить звонок на наш номер
// с автоматически подъемом трубки
// 
Функция PickupChan(Знач CallerIDЗвонка, Знач Канал)
	
	НомерПользователя = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(Канал);
	стр_auto_answer = СоответствиеАвтоподъем.Получить(НомерПользователя);	
	стр_auto_answer = ?(ЗначениеЗаполнено(стр_auto_answer), стр_auto_answer, СтрокаАвтоподъема);
	// автоматический подъем трубки возможне ТОЛЬКО на SIP устройствах
	// переданный в функцию канал - должен быть нашим каналом
	// НомерПрямойПарковки - параметр должен быть получен с АТС
	Если НЕ ЭтоНомерТекущегоПользователя(Канал, мСписокНомеровПользователяДляОбработки)
		 ИЛИ НЕ ЗначениеЗаполнено(НомерПрямойПарковки)
		 ИЛИ НЕ ЗначениеЗаполнено(стр_auto_answer) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
    Упех = Ложь; 
	Если ИспользоватьАвтоподъем тогда
		ЭтоMYPBX_U  = (НазваниеPBX = "MYPBX" И НЕ Лев(НашКаналФильтр,5)="PJSIP");
		ЭтоMIKOPBX  = (НазваниеPBX = "MIKOPBX");
	
		Channel		=	НашКаналФильтр;			
		Context		=	КонтекстНабораПоУмолчанию;
		Exten		=	""+НомерПрямойПарковки+НомерПользователя;		
		Priority	=	?(ЭтоMYPBX_U,"7","1");					
		Timeout		=	"30000";				
		CallerID	=	CallerIDЗвонка; 	
		Variable	=	"from_1C=true,CTICHANNEL="+
						URLEncode(Канал)+","+
						URLEncode(стр_auto_answer);
		Account		=	"";						
		Application	=	?(ЭтоMYPBX_U ИЛИ ЭтоMIKOPBX,"","PickupChan");
		Data		=	?(ЭтоMYPBX_U ИЛИ ЭтоMIKOPBX,"",""+Канал);
		Async		=	"";
		Codecs		=	"";
		ActionID	=	КлючУникальности;
		
		Результат="";
		Попытка
			Компонент.Originate(Channel, Context, Exten, Priority, Timeout, CallerID, Variable, Account, Application, Data, Async, Codecs, "", ActionID, Результат);
			Упех = ?(Найти(Результат,"Success")>0,Истина,Ложь);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при инициализации автоподъема! ",Результат);
		КонецПопытки;	
	КонецЕсли;
   	Возврат Упех;
КонецФункции // PickupChan()

// Подслушиваем разговор другого пользователя
//
Процедура ПодслушатьРазговор(КаналАбонента,НомерАбонента=Неопределено) Экспорт
	Если НаборНомераРазрешен
		 И ЗначениеЗаполнено(КаналАбонента) И ЗначениеЗаполнено(НашКаналФильтр) Тогда
		// временный запрет набора
		параметрНабора = НомерАбонента;
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерАбонента)
		ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр)
		Тогда
		Возврат;			
	КонецЕсли; 
	
	Channel		=	НашКаналФильтр;			//	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	CallerID	=	"Spy-" + НомерАбонента + " <"+НомерАбонента+">";
	Application	=	"ChanSpy";				//	Application: Команда плана набора, используемая для совершения исходящего вызова (используется параметр “Data”, для указания ее параметров)
	Data		=	КаналАбонента+",qx";	//	Data : Параметры команды плана набора, используемой для совершения исходящего вызова.
	Variable	=	"from_1C=true,1с_ChanSpy="+НашКаналФильтр+","+?(ИспользоватьАвтоподъем,URLEncode(СтрокаАвтоподъема),"");   // Linksys SPA-942 точно умеет автоподьем
	ActionID	=	КлючУникальности;
	
	Результат="";
	Попытка
		Компонент.Originate(Channel,,,,, CallerID,Variable,, Application, Data,"1",,"",ActionID, Результат);
		СообщитьОтладочнуюИнформацию("Начало прослушивания номера "+НомерАбонента,Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при прослушивании номера "+НомерАбонента,Результат);
	КонецПопытки;	
	
КонецПроцедуры
 
// Функция шепота. Слышать нас будет только коллега.
//
Процедура ШепнутьКоллеге(КаналАбонента, НомерАбонента=Неопределено) Экспорт
	Если НаборНомераРазрешен
		 И ЗначениеЗаполнено(КаналАбонента) И ЗначениеЗаполнено(НашКаналФильтр) Тогда
		// временный запрет набора
		параметрНабора = НомерАбонента;
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат;
	КонецЕсли;
	
	Channel		=	НашКаналФильтр;			//	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	CallerID	=	"Whisper-" + НомерАбонента + " <"+НомерАбонента+">";
	Application	=	"ChanSpy";				//	Application: Команда плана набора, используемая для совершения исходящего вызова (используется параметр “Data”, для указания ее параметров)
	Data		=	КаналАбонента+",wqv(4)";//	Data : Параметры команды плана набора, используемой для совершения исходящего вызова.
	Variable	=	"from_1C=true,1с_ChanSpy="+НашКаналФильтр+","+?(ИспользоватьАвтоподъем,URLEncode(СтрокаАвтоподъема),"");   // Linksys SPA-942 точно умеет автоподьем
	ActionID	=	КлючУникальности;
	
	Результат="";
	Попытка
		Компонент.Originate(Channel,,,,, CallerID,Variable,, Application, Data,"1",,"",ActionID, Результат);
		СообщитьОтладочнуюИнформацию("Начало прослушивания номера "+НомерАбонента,Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при прослушивании номера "+НомерАбонента,Результат);
	КонецПопытки;	

КонецПроцедуры

// Вмешиваемся в разговор другого пользователя
//
Процедура ВмешатьсяВРазговор(КаналАбонента, НомерАбонента=Неопределено) Экспорт
	Если НаборНомераРазрешен
		 И ЗначениеЗаполнено(КаналАбонента) И ЗначениеЗаполнено(НашКаналФильтр) Тогда
		// временный запрет набора
		параметрНабора = НомерАбонента;
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат;
	КонецЕсли;
	
	Channel		=	НашКаналФильтр;			//	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	CallerID	=	"Conference-" + НомерАбонента + " <"+НомерАбонента+">";
	Application	=	"ChanSpy";				//	Application: Команда плана набора, используемая для совершения исходящего вызова (используется параметр “Data”, для указания ее параметров)
	Data		=	КаналАбонента+",qB";	//	Data : Параметры команды плана набора, используемой для совершения исходящего вызова.
	Variable	=	"from_1C=true,1с_ChanSpy="+НашКаналФильтр+","+?(ИспользоватьАвтоподъем,URLEncode(СтрокаАвтоподъема),"");   // Linksys SPA-942 точно умеет автоподьем
	ActionID	=	КлючУникальности;
	
	Результат="";
	Попытка
		Компонент.Originate(Channel,,,,, CallerID,Variable,, Application, Data,"1",,"",ActionID, Результат);
		СообщитьОтладочнуюИнформацию("Начало конференции с номером "+НомерАбонента,Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка конференц связи с номером "+НомерАбонента,Результат);
	КонецПопытки;	
	
КонецПроцедуры

// Разрываем соединение для канала в выбранной строке
//
Процедура ОтбойЗвонка(ТекущийЗвонок, Знач Cause = "") Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЛинияSIP = ЗвонкиSIP.Найти(ТекущийЗвонок.CallerID, "CallerID");        
	
	Если ИспользоватьСофтфон 
		 И ДопМодули.Свойство("НаборНомера") И НЕ (ДопМодули.НаборНомера = Неопределено) И ЛинияSIP <> Неопределено Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ЛинияSIP.Канал, "КнопкаЗавершитьПоID");
	ИначеЕсли НЕ ИспользоватьAsterisk
		 	  И ДопМодули.Свойство("НаборНомера") И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ТекущийЗвонок, "ОтбойЗвонка");
		Возврат;	
	КонецЕсли;
	Если Компонент = Неопределено Тогда Возврат; КонецЕсли; 
	
	Если Найти(ТекущийЗвонок.Канал1, НашКаналФильтр)>0 Тогда 
		Channel = ТекущийЗвонок.Канал1;
	ИначеЕсли Найти(ТекущийЗвонок.Канал2, НашКаналФильтр) Тогда
		Channel = ТекущийЗвонок.Канал2;
	Иначе
		Channel		=	""+ПолучитьАктивныйКанал(ТекущийЗвонок.НомерСтроки);	
	КонецЕсли;
	
	ActionID	=	""+КлючУникальности;
	Результат	= 	"";
 	Cause	 	= 	Строка(Cause);
	Попытка
		Компонент.Hangup(Channel,Cause,ActionID,Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение завершения вызова ",Результат);
	КонецПопытки; 
	
КонецПроцедуры

// Для текущего звонка осуществляет перевод звонка в зависимости от соотояния,
// если для выбранной строки оператор уже общается с клиентом то будет использоваться 
// консультативный перевод, иначе звонок переадресуется безконсультативно.
//
Процедура ПереводЗвонка(ТекущийЗвонок,НомерПеревода) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекущийЗвонок) Тогда
		Возврат;
	КонецЕсли; 
	
	КонтекстДляПеревода = ?(ЗначениеЗаполнено(КонтекстДляКонсультативногоПеревода),КонтекстДляКонсультативногоПеревода, КонтекстНабораПоУмолчанию);	
	
	Если ТекущийЗвонок.СейчасРазговаривают Тогда
		КонсультативныйПеревод(ТекущийЗвонок,НомерПеревода,КонтекстДляПеревода);
	Иначе
		БезКонсультативныйПеревод(ТекущийЗвонок,НомерПеревода,КонтекстДляПеревода);
	КонецЕсли; 
КонецПроцедуры	

// Инициирование консультативного перевода звонка из текущей строки.
//
Процедура КонсультативныйПеревод(ТекущийЗвонок,НомерКудаПереводимЗвонокAtxfer,КонтекстПеревода) Экспорт
	
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ТекущийЗвонок, "КонсультативныйПеревод", НомерКудаПереводимЗвонокAtxfer);
		Возврат;	
	КонецЕсли;
	
	Channel		=	?(ТекущийЗвонок.ВходящийЗвонок,ТекущийЗвонок.Канал2,ТекущийЗвонок.Канал1); // Channel - Название канала, для которого производиться перевод вызова (обязательный параметр)
	// ищем СВОЙ Канал
	Если Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
		врChannel = мОбработкаДанных.ОтсечьПлечоВLocal(Channel, Ложь);
		п1_Channel = врChannel + ";2";
		п2_Channel = врChannel + ";1";
		
		ПоискРеальногоКанала(п1_Channel, Неопределено, Неопределено, Ложь);
		ПоискРеальногоКанала(п2_Channel, Неопределено, Неопределено, Ложь);
		// НАШ канал
		Если Найти(п1_Channel, НашКаналФильтр)>0 Тогда
			Channel = п1_Channel;
		Иначе
			Channel = п2_Channel;
		КонецЕсли;
	КонецЕсли; 
	
	Context		=	КонтекстПеревода;					 //	Context - Название контекста в плане набора, куда переводиться вызов (обязательный параметр)
	Exten		=	НомерКудаПереводимЗвонокAtxfer;		 //	Exten -Название екстеншена в плане набора, куда переводиться вызов (обязательный параметр)
	Priority	=	"1";								 //	Priority - Номер приоритета в плане набора, куда переводиться вызов (обязательный параметр)
	ActionID	=	КлючУникальности;					 //	ActionID -Не обязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		Сообщить("Компонент не подключен");
		Возврат;
	КонецЕсли; 
	
	Попытка
		Результат="";
		Компонент.Atxfer(Channel,Exten,Context,Priority,ActionID,Результат);
		Сообщить("Переводим звонок консультативно "+ТекущийЗвонок.CallerID+" на номер "+НомерКудаПереводимЗвонокAtxfer);
		СообщитьОтладочнуюИнформацию("Результат консультативного перевода звонка ",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение консультативного перевода звонка ",Результат);
	КонецПопытки; 
КонецПроцедуры	

// Инициирование безусловного перевода звонка из текущей строки.
//
Процедура БезКонсультативныйПеревод(ТекущийЗвонок,НомерКудаПереводимЗвонокRedirect,КонтекстПеревода) Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ТекущийЗвонок, "БезКонсультативныйПеревод", НомерКудаПереводимЗвонокRedirect);
		Возврат;	
	КонецЕсли;
	
	Channel		=	?(ТекущийЗвонок.ВходящийЗвонок,ТекущийЗвонок.Канал1,ТекущийЗвонок.Канал2);	//	Channel: Название канала, для которого производиться перевод вызова (обязательный параметр).
	// ищем канал СОБЕСЕДНИКА
	Если Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
		врChannel = мОбработкаДанных.ОтсечьПлечоВLocal(Channel, Ложь);
		п1_Channel = врChannel + ";2";
		п2_Channel = врChannel + ";1";
		
		ПоискРеальногоКанала(п1_Channel, Неопределено, Неопределено, Ложь);
		ПоискРеальногоКанала(п2_Channel, Неопределено, Неопределено, Ложь);
		// Канал СОБЕСЕДНИК
		Если Найти(п1_Channel, НашКаналФильтр)>0 Тогда
			Channel = п2_Channel;
		Иначе
			Channel = п1_Channel;
		КонецЕсли;
	КонецЕсли; 
	
	Exten		=	НомерКудаПереводимЗвонокRedirect;											//	Exten: Название екстеншена в плане набора, куда переводиться вызов (обязательный параметр).
	Context		=	КонтекстПеревода;															//	Context: Название контекста в плане набора, куда переводиться вызов (обязательный параметр)
	Priority	=	"1";																		//	Priority: Номер приоритета в плане набора, куда переводиться вызов (обязательный параметр)
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При безусловном переводе ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Channel) Тогда
		врChannel = ?(НЕ ТекущийЗвонок.ВходящийЗвонок, ТекущийЗвонок.Канал1, ТекущийЗвонок.Канал2);
		Если Найти(ВРЕГ(врChannel), "LOCAL")>0 Тогда
			ПоискРеальногоКанала(врChannel, Неопределено, Неопределено, Ложь);		
		КонецЕсли;
		Channel = ПолучитьПеременнуюКанала(врChannel,"INTERCHANNEL");
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Channel) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Exten = "10000333" Тогда
		Попытка
			Компонент.Redirect(Channel,"",Exten,"",Context,"","1","","", "");
		Исключение
		КонецПопытки;
	Иначе
		БезКонсультативныйПеревод_10000104(Channel, Exten, Context);
	КонецЕсли; 

КонецПроцедуры	

Процедура БезКонсультативныйПеревод_10000104(Знач Канал, Знач врНомерТелефона, Знач врКонтекстНабораСлужебныхКоманд = Неопределено, Знач Канал2="")
	
	Если НЕ ЗначениеЗаполнено(ChanTimeOut) ИЛИ НЕ ЗначениеЗаполнено(RedirectNumber) Тогда
		// устанавливаем значения "по умолчанию"
		ChanTimeOut 	= "900";
		RedirectNumber 	= НашНомерТелефона;
	КонецЕсли; 
	КонтекстПереадресации = ?(ЗначениеЗаполнено(КонтекстДляКонсультативногоПеревода),КонтекстДляКонсультативногоПеревода, КонтекстНабораПоУмолчанию);	
	
	// Таймаут времени звонка для перехвата.
	УстановитьПеременнуюКанала(Канал, "ChanTimeOut", 	СокрЛП(ChanTimeOut)); 	
	// Контекст для набора внутрнних номеров.
	УстановитьПеременнуюКанала(Канал, "MIKO_VMX_CONTEXT", КонтекстПереадресации);
	Если врНомерТелефона = "10000104" Тогда
		// Скажем всем что это наш звонок.
		УстановитьПеременнуюКанала(Канал, "interception",	НашНомерТелефона);
		// Резервный номер для перевода (наш номер).
		УстановитьПеременнуюКанала(Канал, "RedirectNumber", СокрЛП(RedirectNumber));
	Иначе	
		// Скажем всем что это наш звонок.
		УстановитьПеременнуюКанала(Канал, "interception",	врНомерТелефона);
		// Резервный номер для перевода (наш номер).
		УстановитьПеременнуюКанала(Канал, "RedirectNumber", СокрЛП(НашНомерТелефона));
	КонецЕсли; 
	
	// Переводим звонок.
	Channel		=	""+Канал;				
	Channel2	=   ""+Канал2;
	Exten		=	"10000104";			
	Context		=	""+КонтекстНабораСлужебныхКоманд;	
	Priority	=	"1";					
	
	Если ЗначениеЗаполнено(Channel2) Тогда
		Exten2	= Exten;
	    Context2= Context;	
	Иначе
		Exten2  = "";
	    Context2= "";
	КонецЕсли;
	
	Попытка
		Результат="";
		Компонент.Redirect(Channel,Channel2,Exten,Exten2,Context,Context2,Priority,"","", Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение безусловного перевода ",Результат);
	КонецПопытки;
	
КонецПроцедуры	// БезКонсультативныйПеревод();



// В текущий канал отправляется подготовленный для отправки факсом файл tif
// инициируется отправка факсимильного сообщения.
Процедура ОтправитьФакс(ТекущийЗвонок, ИмяФайлаТабДок) Экспорт 
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При отправке факса","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Результат="";
	Попытка
		ИмяФайлаДляОтправки = ПодготовитьPDFФайлДляОтправки(ИмяФайлаТабДок);
		
		Если ИмяФайлаДляОтправки = Неопределено Тогда
			Сообщить("Не удалось сформировать файл для отправки факса.");
			Возврат;
		КонецЕсли;	
		ФайлОтправленНаСерверAsterisk=Ложь;
		Если ЗначениеЗаполнено(УРЛСервераДляОтправкиФакса)
			 И PostFile(ИмяФайлаДляОтправки,Результат)
			 И Найти(Результат, "success")>0 Тогда 
			ФайлОтправленНаСерверAsterisk=Истина;
		ИначеЕсли ПроверитьЗагрузкуМодуляAsterisk("res_http_post") 
			И Компонент.PostFile(ИмяФайлаДляОтправки,,,,Результат) Тогда 
			ФайлОтправленНаСерверAsterisk=Истина;
		КонецЕсли;
		
		Если ФайлОтправленНаСерверAsterisk Тогда
			ПозицияНачалаИмениФайла=Найти(ИмяФайлаДляОтправки,СтрЗаменить(НашКаналФильтр,"/","-"));
			ИмяФайлаБезРасширенияИПути=Сред(ИмяФайлаДляОтправки,ПозицияНачалаИмениФайла,СтрДлина(ИмяФайлаДляОтправки)-ПозицияНачалаИмениФайла-3);
			
			КаналКудаСлатьФакс=?(ТекущийЗвонок.ВходящийЗвонок,ТекущийЗвонок.Канал1,ТекущийЗвонок.Канал2);	
			Если ЗначениеЗаполнено(КаналКудаСлатьФакс) Тогда
				Сообщить("Отправляем факс абоненту "+ТекущийЗвонок.CallerID);	
				
			   	Хинт = ТаблицаХинтов.Найти(НашКаналФильтр);
				Если НЕ Хинт = Неопределено Тогда
					УстановитьПеременнуюКанала(КаналКудаСлатьФакс,"cid_user",Хинт.ВнутреннийНомер);
				КонецЕсли; 
				// установим переменные для канала
				УстановитьПеременнуюКанала(КаналКудаСлатьФакс,"_faxfile",ИмяФайлаБезРасширенияИПути);
				УстановитьПеременнуюКанала(КаналКудаСлатьФакс,"_faxcallerid",ТекущийЗвонок.CallerID);
				УстановитьПеременнуюКанала(КаналКудаСлатьФакс,"_chan",НашКаналФильтр);
				// переведем вызов на приложение отправки факса
				БезКонсультативныйПеревод(ТекущийЗвонок,"10000333",КонтекстНабораСлужебныхКоманд);
			КонецЕсли;	
		Иначе
			Сообщить("Не удалось загрузить файл факса на сервер Asteriisk.");
		КонецЕсли; 
		
		СообщитьОтладочнуюИнформацию("Результат отправки факса ",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение отправки факса ",Результат);
	КонецПопытки; 
КонецПроцедуры

// Передача файла факса на сервер АТС
// 
Функция PostFile(ИмяФайлаДляОтправки,Результат)
	Успех = Ложь;
	Попытка
	    Если НазваниеPBX = "ASKOZIA" Тогда
			// Попробуем сперва отправить файл на порт
			АдресHTTP = СтрЗаменить(УРЛСервераДляОтправкиФакса, "23600", "80");
			Компонент.PostFile(ИмяФайлаДляОтправки,АдресHTTP,ПользовательСтатистики,ПарольПользователяСтатистики,Результат);
			Успех = Найти(НРег(Результат),"success")>0;
			Если Успех = Истина Тогда
				// возвращаем: если успех
				Возврат Успех;
			КонецЕсли; 
		КонецЕсли; 
		// пробуем отправить факс по стандартному порту
		Компонент.PostFile(ИмяФайлаДляОтправки,УРЛСервераДляОтправкиФакса,ПользовательСтатистики,ПарольПользователяСтатистики,Результат);
		Успех = Найти(НРег(Результат),"success")>0;
		Возврат Успех;
	Исключение
	КонецПопытки; 	

	Возврат Успех;
КонецФункции // PostFile()

// Процедуру следует вызывать в блоке "попытка" она НЕ безопасна 
// 
Функция OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат)
	Если Компонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	// Описание работы
	// http://wiki.miko.ru/doc:panel1ccrm:asterisk_config:environments
	ЭтоПолучениеНастроек = Найти(Channel, "10000111")>0;
	Асинхронно = ?(ЭтоПолучениеНастроек,"","1");
	result = Компонент.Originate(Channel,,,,,, Variable,, "NoCDR",,Асинхронно,,"",КлючУникальности, Результат);
	Если ЭтоПолучениеНастроек И Найти(Результат, "'Error'")>0 Тогда
		// ошибка при оригинации 
		ВерсияДиалплана = "1.?.?.?";
		ФормаНастройки=мОбщийМодуль.ПолучитьФормуНастройки();
		Если ФормаНастройки.Открыта() Тогда
			ФормаНастройки.Активизировать()
		Иначе
			ФормаНастройки.Открыть();
		КонецЕсли;
		ФормаНастройки.ЭлементыФормы.ПанельНастроекТелефонии.ТекущаяСтраница = ФормаНастройки.ЭлементыФормы.ПанельНастроекТелефонии.Страницы.Основные;
		Сообщить("Не вышло получить настройки с АТС. Версия dialplan не определена!", СтатусСообщения.ОченьВажное);
	КонецЕсли; 
	Возврат result;
КонецФункции // OriginateНаКаналСПередачейПараметров()

// Для переданного имени файла записи инициируется процедура прослушивания записи звонка.
//
Процедура ПрослушатьЗвонок(ИмяФайлаЗаписи) Экспорт 
	Если ЗначениеЗаполнено(ИмяФайлаЗаписи)
		 И ЗначениеЗаполнено(НашКаналФильтр) Тогда
		// временный запрет набора
		параметрНабора = "";
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяФайлаБезРасширения = мОбработкаДанных.УбратьРасширениеВФайлеЗаписи(ИмяФайлаЗаписи); // в файле не должно быть указано расширение
		
	Channel		=	НашКаналФильтр;
	Priority	=	"";					
	Timeout		=	"";				
	CallerID	=	"CDR_RECORDS <"+НашНомерТелефона+">"; 				//	CallerID: Значение CallerID, используемое для совершения исходящего вызова.
	Variable	=	"from_1C=true,"+ 
					"recfile="+ URLEncode(ИмяФайлаБезРасширения)+ ","+
					СтрокаАвтоподъема;
	Account		=	"";											//	Account: Значение для “Account code” исходящего вызова.
	Async		=	"1";						//	Async: Если указано “1” исходящий вызов будет производиться асинхронно. Результат ее выполнения будет возвращен позже, в пакете типа “Event” (позволяет осуществлять несколько вызовов без ожидания результата предыдущей команды, совершающей исходящий вызов)
	Codecs		=	"";							//  Используемый кодек
	ActionID	=	КлючУникальности;				//	ActionID: Не обязательный идентификатор запроса. Позволяет сопоставить результат выполнения конкретному запросу. В качестве значения можно использовать или номер или строку. Очень полезно использовать, когда выполняется несколько асинхронных запросов одновременно.
	Результат="";

	
	Если НазваниеPBX = "MYPBX" Тогда
		Context		=	КонтекстНабораСлужебныхКоманд;
		Exten		=	"Records";
		Application	=	"";						//	Application: Команда плана набора, используемая для совершения исходящего вызова (используется параметр “Data”, для указания ее параметров)
		Data		=	"";						//	Data : Параметры команды плана набора, используемой для совершения исходящего вызова.
		Priority    =   "1";	
	ИначеЕсли НазваниеPBX = "MIKOPBX" Тогда
		IS_ORGNT    =   Формат(ТекущаяДата() - НачалоДня(ТекущаяДата()), "ЧДЦ=0; ЧГ=0");
	 	Channel = "Local/"+НашНомерТелефона+"@internal-originate/n";
		Variable	= "__NOCDR=1,_IS_ORGNT="+IS_ORGNT+",pt1c_cid=CDR_RECORDS,extenfrom1c="+НашНомерТелефона+",_FROM_PEER="+НашНомерТелефона+","
						+СтрокаАвтоподъема; // Linksys SPA-942 точно умеет автоподьем
		Context	    = "";
		Exten		= "";
		Application = "MP3Player";
		Data 		= ИмяФайлаЗаписи;
	Иначе
		Context	    = 	"";
		Exten		=	"";
		Application = ?(UseMp3Player=Истина, "MP3Player", "Playback");
		Data 		= ""+?(UseMp3Player=Истина, ИмяФайлаЗаписи, ИмяФайлаБезРасширения);
	КонецЕсли; 
	
	Попытка
		Компонент.Originate(Channel, Context, Exten, Priority, Timeout, CallerID, Variable, Account, Application, Data, Async, Codecs, "", ActionID, Результат);
		СообщитьОтладочнуюИнформацию("CDR_RECORDS","Начало прослушивания разговора "+ИмяФайлаБезРасширения);
	Исключение
		СообщитьОтладочнуюИнформацию("CDR_RECORDS","Ошибка при прослушивании разговора "+ИмяФайлаБезРасширения);
	КонецПопытки;	
	
	
КонецПроцедуры

// Запускается принудительная записть текущего разговора в файл 
//
Процедура ЗаписьЗвонкаНачать(ТекущийЗвонок) Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Сообщить("Пишем звонок "+ТекущийЗвонок.CallerID);
	
	Channel		=	ПолучитьАктивныйКанал(ТекущийЗвонок.НомерСтроки);	//	Channel: Канал, для которого нужно прекратить запись вызова, например: SIP/1310-089e1000 (обязательный параметр)
	File		=	ТекущийЗвонок.UniqueID1;	//	File: Не обязательный параметр. Имя файла, которое будет создано в директории spool/asterisk/monitor/. По умолчанию, совпадает с именем канала, на котором производиться запись. (символы косой черты заменены на черточки)
	Format1C	=	"gsm";						//	Format: Не обязательный параметр. Формат, в котором будет сохранен звуковой файл. По умолчанию: ”wav”.
	Mix			=	"1";						//	Mix: Не обязательный булевой параметр. Определяет, миксировать или нет поступающий и исходящий из канала аудиопоток после окончания записи.
	ActionID	=	КлючУникальности; 			//	ActionID: Необязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При записи звонка ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат="";
		Компонент.Monitor(Channel,File,Format1C,Mix,ActionID,Результат);
		СообщитьОтладочнуюИнформацию("Результат записи звонка ",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение записи звонка ",Результат);
	КонецПопытки; 
КонецПроцедуры

// Останавливается запись текущего разговора и в файл записи закрывается
//
Процедура ЗаписьЗвонкаОстановить (ТекущийЗвонок) Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Channel		=	ПолучитьАктивныйКанал(ТекущийЗвонок.НомерСтроки);	//	Channel: Канал, для которого нужно прекратить запись вызова, например: SIP/1310-089e1000 (обязательный параметр)
	ActionID	=	КлючУникальности;									//	ActionID: Необязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При остановки записи звонка ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Попытка                                         
		Результат="";
		Компонент.StopMonitor(Channel,ActionID,Результат);
		ЗапроситьФайлЗаписиНаСкачивание(,ТекущийЗвонок.UniqueID1+".gsm");
		Сообщить("Останавливаем запись звонка "+ТекущийЗвонок.CallerID);
		СообщитьОтладочнуюИнформацию("Результат остановки записи звонка ",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение остановки записи звонка ",Результат);
	КонецПопытки; 
КонецПроцедуры

// Устанавливаем произвольную переменную локального канала или глобально.
//
Процедура УстановитьПеременнуюКанала(Канал,ИмяПеременной,ЗначениеПеременной) 
	
	Channel		=	""+Канал;				//	Channel: Канал, для которого устанавливается переменная. Если не указано, то устанавливается глобальная переменная.
	Variable	=	""+ИмяПеременной;		// 	Variable: Имя переменной.
	Value		=	""+ЗначениеПеременной;	//	Value: Значение переменной.
	ActionID	=	""+КлючУникальности;	//	ActionID: Необязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При установке переменной ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат="";
		Компонент.SetVar(Channel,Variable,Value,ActionID,Результат);
		СообщитьОтладочнуюИнформацию("Результат установки переменной """ + ИмяПеременной + """ в значение """ + ЗначениеПеременной + """",Результат);	
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при установке переменной канала " + ИмяПеременной,Результат);
	КонецПопытки; 
КонецПроцедуры	

// Получаем произвольную переменную локального канала.
//
Функция ПолучитьПеременнуюКанала(Канал,ИмяПеременной) 

	Channel		=	Канал;				//	Channel: Канал, для которого устанавливается переменная. Если не указано, то устанавливается глобальная переменная.
	Variable	=	ИмяПеременной;		// 	Variable: Имя переменной.
	ActionID	=	КлючУникальности;	//	ActionID: Необязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При получении переменной канала ","Компонент не подключен");
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Результат="";
		Компонент.GetVar(Channel,Variable,ActionID,Результат);
		// <AJAX-RESPONSE>
		// <RESPONSE TYPE='OBJECT' ID='UNKNOWN'><GENERIC RESPONSE='SUCCESS' ACTIONID='974FC' VARIABLE='SYSTEMNAME' VALUE='' /></RESPONSE>
		// </AJAX-RESPONSE>
		
		// <ajax-response>
		// <response type='object' id='unknown'><generic response='Success' actionid='098b8' variable='SYSTEMNAME' value='askozia' /></response>
		// </ajax-response>
		
		УзелХМЛ=ПолучитьЧтениеXML(Результат);
		Если УзелХМЛ<>Неопределено Тогда
			Пока УзелХМЛ.Прочитать() Цикл
				Если УзелХМЛ.Имя="generic" И УзелХМЛ.ТипУзла =	ТипУзлаXML.НачалоЭлемента Тогда    // нужный нам узел в котором респонсили Эвент
					Событие	= УзелХМЛ.ЗначениеАтрибута("response");
					Если Событие="Success" Тогда 
						value = УзелХМЛ.ЗначениеАтрибута("value");
						Если value = "(null)" Тогда
							Возврат "";
						Иначе
							Возврат УзелХМЛ.ЗначениеАтрибута("value");
						КонецЕсли; 
												
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		СообщитьОтладочнуюИнформацию("Результат установки переменной ",Результат);	
		
		Возврат Неопределено;
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение получении переменной канала",Результат);
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции	

// Тоновый донабор номера для текущего кнала
//
Процедура ДонаборНомера(ТекущийЗвонок, ДонаборНомер, Непосредственно=Ложь) Экспорт
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(ТекущийЗвонок, "ДонабратьНомер", ДонаборНомер);
		Возврат;	
	КонецЕсли;

	Channel		=	?(ТекущийЗвонок.ВходящийЗвонок,ТекущийЗвонок.Канал1,ТекущийЗвонок.Канал2);	//	Channel: Имя канала, в который нужно отправить DTMF последовательность. (Обязательный параметр)
	Digit		=	Строка(ДонаборНомер);	//	Digit: DTMF последовательность, которую нужно отправить. (Обязательный параметр)
	ActionID	=	КлючУникальности;		//	ActionID: Необязательный ID команды, который будет возвращен в ответе.
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При донаборе номера ошибка ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Результат=""; РезультатИтог="";
	Состояние("Будет произведен набор добавочного номера " + Digit);
	
	Если Непосредственно=Ложь Тогда
		КнопкиДиалога = Новый СписокЗначений;
		КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена, "Отменить...");

		ПроизвестиЛиДонабор = Вопрос("Будет произведен набор добавочного номера " + Digit, КнопкиДиалога, 5,КодВозвратаДиалога.Отмена,"Донабор номера...");
		Если ПроизвестиЛиДонабор = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Попытка
		Для к=1 по СтрДлина(Digit) Цикл
			НабираемаяЦифра=Сред(Digit,к,1);
			Компонент.PlayDTMF(Channel, НабираемаяЦифра, ActionID, Результат);
			РезультатИтог=РезультатИтог+Результат;
		КонецЦикла;
		СообщитьОтладочнуюИнформацию("Результат команды PlayDTMF ",РезультатИтог);	
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при выполнении PlayDTMF: ",РезультатИтог);
	КонецПопытки; 
КонецПроцедуры	

// Запрос к серверу астериск для получения истории звонков для указанного канала и период
//
// Параметры
//  <ДатаНачала>  	 - <Тип.Дата> - Дата начала выборки записей
//  <ДатаОкончания>  - <Тип.Дата> - Дата окончания выборки записей
//
Процедура ЗапроситьЗаписиCDRДляТекущегоПользователя(ДатаЗвонков) Экспорт
	
	// Получим все отслеживаемые номера сотрудника
	СтрокаСНомерами="";
	Для каждого Номер Из мСписокНомеровПользователяДляИстории Цикл
		Если СтрокаСНомерами="" Тогда
			СтрокаСНомерами=СтрокаСНомерами + Номер;
		Иначе	
			СтрокаСНомерами=СтрокаСНомерами +"-"+ Номер;
		КонецЕсли; 
	КонецЦикла; 
	
	// Звоним на номер 10000555, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000555 устанавливаем переменные необходимые для разбора файла истории звонков
	
	Если ЗначениеЗаполнено(ДатаЗвонков)
		И ЗначениеЗаполнено(НашКаналФильтр)
		И ЗначениеЗаполнено(СтрокаСНомерами)
		Тогда
		
		Channel		=	"Local/10000555@"+КонтекстНабораСлужебныхКоманд;  //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		Variable	=
		"v1="	+URLEncode(НашКаналФильтр)
		+",v2="	+Формат(ДатаЗвонков,"ДФ=гггг-ММ-дд")
		+",v3="	+Формат(ДатаЗвонков+24*60*60,"ДФ=гггг-ММ-дд")
		+",v4="	+СтрокаСНомерами;
		
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован запрос CDR ",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе CDR ",Результат);
		КонецПопытки;	
		
	КонецЕсли;
	
КонецПроцедуры // ВернутьЗаписиCDRДляТекущегоПользователя()

// Запрос к серверу астериск для получения имя файла записи для уникального идентификатора звонка
//
// Параметры
//  <ДатаНачала>  	 - <Тип.Дата> - Дата начала выборки записей
//  <ДатаОкончания>  - <Тип.Дата> - Дата окончания выборки записей
//
Процедура ЗапроситьИмяФайлаЗаписиCDRПоИдентификатору(Знач ИдентификаторЗвонка, Знач ИмяФайлаЗаписи = "") Экспорт
	// Звоним на номер 10000777, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000777 устанавливаем переменные необходимые для разбора файла истории звонков
	ИдентификаторЗвонка = СокрЛП(ИдентификаторЗвонка);
	Если НаборНомераРазрешен 
		 И ЗначениеЗаполнено(НашКаналФильтр) 
		 И ЗначениеЗаполнено(ИдентификаторЗвонка)
		 Тогда
		параметрНабора = "";
		мОбработкаДанных.ЗапретитьНаборНомера(параметрНабора);
		
		Channel		=	"Local/10000777@"+КонтекстНабораСлужебныхКоманд;			//	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		Variable	=	
		"chan="			+URLEncode(НашКаналФильтр)
		+",uniqueid1c="	+URLEncode(ИдентификаторЗвонка)
		+",recordingfile=" +URLEncode(ИмяФайлаЗаписи);
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован запрос имени файла записи CDR",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе имени файла записи CDR ",Результат);
		КонецПопытки;	
		
	КонецЕсли;
	
КонецПроцедуры // ЗапроситьИмяФайлаЗаписиCDRПоИдентификатору()

// Запрос к серверу астериск для получения факсимильных сообщений за период
//
Процедура ЗапроситьЗаписиCDRПоФаксимильнымСообщениям(ДатаНачала,ДатаОкончания)
	//Звоним на номер 10000444, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000444 устанавливаем переменные необходимые для разбора файла истории звонков
	
	Если ЗначениеЗаполнено(ДатаНачала)
		И ЗначениеЗаполнено(ДатаОкончания)
		И ЗначениеЗаполнено(НашКаналФильтр) Тогда
		
		Channel		=	"Local/10000444@"+КонтекстНабораСлужебныхКоманд;//	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		Variable	=
		"v1="	+URLEncode(НашКаналФильтр)
		+",v2="	+Формат(ДатаНачала,"ДФ=гггг-ММ-дд")
		+",v3="	+Формат(ДатаОкончания,"ДФ=гггг-ММ-дд");
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован запрос истории факсов CDR ",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе истории факсов CDR ",Результат);
		КонецПопытки;	
		
	КонецЕсли;
	
КонецПроцедуры	

// Проверка связи с сервером телефонии
// 
Процедура ПингСервераТелефонии() Экспорт
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При пинге ошибка: ","Компонент не подключен");
		Возврат;
	КонецЕсли;
	
	Попытка
		respose ="";
		Результат=Компонент.Ping(respose);
		Сообщить("Результат пинга "+respose);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при выполнении Ping: ",Результат);
	КонецПопытки; 
	
Конецпроцедуры	

// НЕ ИСПОЛЬЗУЕМ // Запрашивает на сервере Asterisk список внутренних номеров
//
Функция ЗапроситьСписокХинтовССервераAsterisk()
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При получении списка Хинтов: Ошибка - ","Компонент не подключен");
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаХинтов = Новый ТаблицаЗначений;
	ТаблицаХинтов.Колонки.Добавить("ВнутреннийНомер",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(32)));
	ТаблицаХинтов.Колонки.Добавить("Канал",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаХинтов.Колонки.Добавить("Состояние",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаХинтов.Колонки.Добавить("Контекст",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТаблицаХинтов.Колонки.Добавить("UserAgent",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	
	ПолучитьСписокDAHDIХинтовССервераAsterisk(ТаблицаХинтов);
	Попытка
		Результат="";
		ActionID	=	КлючУникальности;
		
		Path     = "/asterisk/core/hints";
		Search   = "";//"/hints/hint/context=internal";
		Filter   = "/hints/hint/state|application|extension";
		ActionID = КлючУникальности;
		
		Если Компонент.DataGet(Path, Search, Filter, ActionID, Результат) = Истина Тогда // проверено на Asterisk 1.8.4.4
			//<generic event='DataGet Tree' 
			//1_hints_hint_state='Idle' 
			//1_hints_hint_extension='102' 
			//1_hints_hint_application='DAHDI/22' 
			//2_hints_hint_state='Idle' 
			//2_hints_hint_extension='115' 
			//2_hints_hint_application='SIP/115' 
			//3_hints_hint_state='Idle' 
			//3_hints_hint_extension='*84115' 
			//3_hints_hint_application='ccss:SIP/115' 
			//4_hints_hint_state='Idle' 
			//4_hints_hint_extension='*84102' 
			//4_hints_hint_application='ccss:DAHDI/22' 
			///>
			СтруктураПолей = РазобратьОтветАстерискаБезЧтенияХМЛ(Результат);    // такая Структура не читается обычным чтением ХМЛ, ругается на имена атрибутов, наверное потому что они начинаются с цифер 
			Для к=1 По Цел(СтруктураПолей.Количество()/3) Цикл
				врСчетчик = Формат(к, "ЧГ=");
				ВнутреннийНомер = ""+СтруктураПолей.Получить(""+врСчетчик+"_hints_hint_extension");
				
				Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
					Продолжить; // поле не являющееся нужным значенмем, или за пределами массива				
				КонецЕсли; 
				Состояние	 	= СтруктураПолей.Получить(""+врСчетчик+"_hints_hint_state");
				Канал		 	= СтруктураПолей.Получить(""+врСчетчик+"_hints_hint_application");
				
				// хинт может прийти в формате, Custom:busystate132&amp;SIP/132
				КаналНайден = ПолучитьЗначениеХинта(Канал, ВнутреннийНомер);
				Если КаналНайден = Ложь Тогда
					Продолжить;
				КонецЕсли; 
				
				Если Найти(НРег(Канал), "park")>0 Тогда
				 	Продолжить;
				КонецЕсли; 

				НайденныеСтроки = ТаблицаХинтов.НайтиСтроки(Новый Структура("ВнутреннийНомер,Канал",ВнутреннийНомер,Канал));
				Если НайденныеСтроки.Количество()>0 Тогда
				    СтрокаТаблицыХинтов = НайденныеСтроки[0];
				Иначе	
					СтрокаТаблицыХинтов	 = ТаблицаХинтов.Добавить();
				КонецЕсли;
				
				СтрокаТаблицыХинтов.ВнутреннийНомер	=	ВнутреннийНомер;
				СтрокаТаблицыХинтов.Канал			=	Канал;
				СтрокаТаблицыХинтов.Состояние		= 	Состояние;
			КонецЦикла; 
		КонецЕсли;
		
		Если ТаблицаХинтов.Количество()=0 
			И Компонент.Command( "Core Show Hints", ActionID, Результат) = Истина 
			Тогда // работает для большинства версий Asterisk
			ТаблицаХинтов = РазобратьCoreShowHints(Результат);
		Иначе
			Если Найти(Результат,"message='Permission denied'") > 0 Тогда
				СообщитьОтладочнуюИнформацию("Права досутпа: ", "Для менеджера " + МенеджерЛогин + " не хватает привелегии command!");
			КонецЕсли;
		КонецЕсли;
		
		Если ТаблицаХинтов.Количество()=0 Тогда
			СообщитьОтладочнуюИнформацию("При получении списка Хинтов: Ошибка - ","Сервер телефонии не вернул список. " + Символы.ПС + Результат);
			Возврат Неопределено; // ошибка выполнения команды, дальше не пойдем.
		ИначеЕсли Отладка Тогда 
			//ТаблицаХинтов.ВыбратьСтроку("Список номеров которые найдены на серерве телефонии.");
			СимволТАБ =Символы.Таб+Символы.Таб+Символы.Таб+Символы.Таб+Символы.Таб+Символы.Таб;
			Сообщить("ВнутреннийНомер"+Символы.Таб+Символы.Таб+Символы.Таб+"Канал"+СимволТАБ+"Состояние");
			Для каждого СтрокаТаблицыХинтов Из ТаблицаХинтов Цикл
				Сообщить(СтрокаТаблицыХинтов.ВнутреннийНомер+СимволТАБ+СтрокаТаблицыХинтов.Канал+СимволТАБ+СтрокаТаблицыХинтов.Состояние);
			КонецЦикла; 
		КонецЕсли;
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при выполнении DataGet: ",Результат);
		Возврат Неопределено; // ошибка выполнения команды, дальше не пойдем.
	КонецПопытки; 
	
	Возврат ТаблицаХинтов;
КонецФункции

// Запрашивает от ASTERISK выполнить подготовку файла факсимильного сообщения для скачивания 
//
Процедура ЗапроситьФайлФаксаНаСкачивание(ИдентификаторЗвонка)
	// Звоним на номер 10000666, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000666 устанавливаем переменные необходимые для разбора файла истории звонков
	ИдентификаторЗвонка = СокрЛП(ИдентификаторЗвонка);
	
	Если ЗначениеЗаполнено(НашКаналФильтр) 
		И ЗначениеЗаполнено(ИдентификаторЗвонка)  Тогда
		
		Channel		=	"Local/10000666@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		Variable	=	
		"v1="		+URLEncode(НашКаналФильтр)
		+",v2="		+URLEncode(ИдентификаторЗвонка)
		+",v6=FAX";
		
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован запрос имени файла записи CDR",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе имени файла записи CDR ",Результат);
		КонецПопытки;	
		
	КонецЕсли;
	
КонецПроцедуры //ЗапроситьФайлФаксаНаСкачивание

// Запрашивает от ASTERISK выполнить подготовку файла записи разговора для скачивания 
//
Процедура ЗапроситьФайлЗаписиНаСкачивание(ИдентификаторЗвонка,ИмяФайлаЗаписи="")
	// Звоним на номер 10000666, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000666 устанавливаем переменные необходимые для разбора файла истории звонков
	ИдентификаторЗвонка = СокрЛП(ИдентификаторЗвонка);
	Если ЗначениеЗаполнено(НашКаналФильтр) Тогда
		
		Channel		=	"Local/10000666@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		Variable	=	
		"v1="		+URLEncode(НашКаналФильтр)
		+",v2="		+URLEncode(ИдентификаторЗвонка)
		+",v3="		+ИмяФайлаЗаписи
		+",v6=Records";
		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован запрос имени файла записи CDR",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе имени файла записи CDR ",Результат);
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры //ЗапроситьФайлФаксаНаСкачивание

// Проверка загружен ли модуль переданный строкой в параметр ИмяМодуля на сервере Asterisk
//
Функция ПроверитьЗагрузкуМодуляAsterisk (ИмяМодуля)
	
	Если Компонент = Неопределено Тогда
		СообщитьОтладочнуюИнформацию("При проверки загрузки модуля ошибка: ","Компонент не подключен");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Результат   = "";
		Если Компонент.ModuleCheck( ИмяМодуля , , Результат) = Истина Тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при выполнении ModuleCheck: ",Результат);
	КонецПопытки; 
	
	Возврат Ложь;
КонецФункции	

// Запрос дополнительных настроек с сервера Asterisk
//
Функция ПолучитьНастройкиССервераAsterisk() Экспорт
	НашКаналФильтр = "";
	Если ТипЗнч(ТаблицаХинтов) = Тип("ТаблицаЗначений") Тогда
		ТаблицаХинтов.очистить();
	КонецЕсли; 
	
	//Звоним на номер 10000111, для получения вспомогательных настроек с сервера Asterisk
	v1=?(ЗначениеЗаполнено(НашКаналФильтр),НашКаналФильтр,КлючУникальности);
	Channel		=	"Local/10000111@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	
	"v1="		+URLEncode(v1);		//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
	
	Результат="";
	Попытка
		// для диалплана 1.0.0.6
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован запрос настроек с сервера Asterisk",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе настроек с сервера Asterisk.",Результат);
	КонецПопытки;	
	
КонецФункции // ПроверитьУстановкуGhostScriptНаСервереAsterisk()

// Запрос контекста с сервера Asterisk
//
Процедура ПолучитьКонтекстССервераAsterisk()
	Если Не ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли; 
	прПозицияСимвола = Найти(НашКаналФильтр, "/");
	
	Технология = ВРег(Лев(НашКаналФильтр, прПозицияСимвола - 1));
	Технология = ?(Технология="IAX2","IAX",Технология);
	
	Номер	   = Прав(НашКаналФильтр, СтрДлина(НашКаналФильтр) - прПозицияСимвола);
	//Звоним на номер 10000109, для получения вспомогательных настроек с сервера Asterisk
	Channel		=	"Local/10000109@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	
		"tehnology=" +URLEncode(Технология)+ "," +
		"number=" +URLEncode(Номер);		
	//	Variable: Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала).
	
	Результат="";
	Попытка
		// для диалплана 1.0.0.6
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован запрос настроек с сервера Asterisk",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе настроек с сервера Asterisk.",Результат);
	КонецПопытки;	
	
КонецПроцедуры // ПроверитьУстановкуGhostScriptНаСервереAsterisk()


// Получаем параметры пира по внутреннему номеру с сервера Asterisk для заполнения настроек панели
//
Процедура ПолучитьПараметрыSIPПира(ВнутреннийНомер, Технология = "SIP") Экспорт 
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	// Определим используемую пиром технологию
	Если НЕ ЗначениеЗаполнено(ВнутреннийНомер) Тогда
		Возврат;	
	КонецЕсли;
	
    Для каждого ТекущийНомер Из мСписокНомеровПользователяДляОбработки Цикл
		ОсновнойНомер = (ВнутреннийНомер = ТекущийНомер);
		Если ОсновнойНомер = Истина Тогда
			ИнициализироватьSIP(ВнутреннийНомер);
		КонецЕсли;
		
		Если Технология = "SIP" И Лев(НашКаналФильтр, 3)=Технология Тогда
			Результат="";
			Попытка
				Компонент.SIPshowPeer(ТекущийНомер, "", Результат);
				РазобратьПараметрыSIPПира(ТекущийНомер, Результат, ОсновнойНомер);
				СообщитьОтладочнуюИнформацию("Инициирован запрос настроек пира "+ВнутреннийНомер+" с сервера Asterisk.",Результат);
			Исключение
				СообщитьОтладочнуюИнформацию("Ошибка при запросе настроек SIP пира "+ВнутреннийНомер+" с сервера Asterisk.",Результат);
			КонецПопытки;	
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

// Разбор ответа сервера по запросу параметров пира
// 
Процедура РазобратьПараметрыSIPПира(ВнутреннийНомер, Результат, ОсновнойНомер)
		
	УзелХМЛ=ПолучитьЧтениеXML(Результат);
	Если УзелХМЛ<>Неопределено Тогда
		Пока УзелХМЛ.Прочитать() Цикл
			Если УзелХМЛ.Имя="generic" И УзелХМЛ.ТипУзла =	ТипУзлаXML.НачалоЭлемента Тогда    // нужный нам узел в котором респонсили Эвент
				Событие	= УзелХМЛ.ЗначениеАтрибута("response");
				Если Событие="Success" Тогда   
					
					sip_useragent		= УзелХМЛ.ЗначениеАтрибута("sip_useragent"); // линксис или еалинк или циско
					Строка_auto_answer  = ВернутьСтрокуАвтоподъемаТрубки(sip_useragent);
					Если ОсновнойНомер = Истина Тогда
						КонтекстНабораПоУмолчанию		= УзелХМЛ.ЗначениеАтрибута("context");
						ВидСофтфонаПользователя			= sip_useragent; // линксис или еалинк или циско
						НашКаналФильтр					= УзелХМЛ.ЗначениеАтрибута("channeltype")+"/"+УзелХМЛ.ЗначениеАтрибута("objectname"); 
						НомерГолосовойПочтыПользователя	= УзелХМЛ.ЗначениеАтрибута("voicemailbox");
						СтрокаАвтоподъема 				= Строка_auto_answer;
					КонецЕсли;
					
					СоответствиеАвтоподъем.Вставить(""+ВнутреннийНомер, Строка_auto_answer);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры

// Получения информации по DAHDI линиям для Askozia
// Askozia не использует команду "hint: <DAHDI/3>" в плане набора
// потому информация по каналам не попадает в вывод команды "core show hint"
Функция ПолучитьСписокDAHDIХинтовССервераAsterisk(ТаблицаХинтов)
	ActionID = "" + КлючУникальности;
	Результат= "";
	Попытка
		Если ПроверитьЗагрузкуМодуляAsterisk("chan_dahdi.so") 
			И Компонент.Command( "dahdi Show channels", ActionID, Результат) = Истина Тогда
			МассивНомеровКаналовDAHDI = РазобратьDAHDIShowChannels(Результат);
			Для каждого КаналDAHDI Из МассивНомеровКаналовDAHDI Цикл
				Компонент.Command( "dahdi Show channel " + КаналDAHDI, ActionID, Результат);
				ОписаниеНомера = РазобратьDAHDIShowChannel(Результат);
				Если НЕ ОписаниеНомера = Неопределено Тогда
					СтрокаТаблицыХинтов	 = ТаблицаХинтов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыХинтов, ОписаниеНомера);
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			Если Найти(Результат,"message='Permission denied'") Тогда
				СообщитьОтладочнуюИнформацию("Права доступа: ", "Для менеджера " + МенеджерЛогин + " не хватает привелегии command!");
			КонецЕсли;
		КонецЕсли;
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение при выполнении DataGet: ",Результат);
		Возврат Неопределено; // ошибка выполнения команды, дальше не пойдем.
	КонецПопытки; 
	
КонецФункции // ПолучитьСписокDAHDIХинтовССервераAsterisk()

// Оптимизация GetVar
// Проверка наличия сервиса получения переменных.
// 
Функция HTTP_GetVarPing() 
	
	Если НазваниеPBX = "ASKOZIA" Тогда
		Ресурс = "/cfe/wallboard/1c/getvar.php?event=Ping";
	ИначеЕсли НазваниеPBX = "MIKOPBX" Тогда
		Ресурс = "/pbxcore/api/miko_ajam/getvar?event=Ping";
	ИначеЕсли НазваниеPBX = "MYPBX" Тогда
		ПортGetVar = 0;
		Возврат Ложь;
	Иначе	
		Ресурс = "/admin/1c/getvar/index.php?event=Ping";
	КонецЕсли; 
	
	ПортGetVar = 23600;
	Ответ = HTTP_Get(Ресурс);
	Если Ответ = "true" Тогда
	  	Возврат Истина;
	КонецЕсли;

	ПортGetVar = 443;
	Ответ = HTTP_Get(Ресурс);
	Если Ответ = "true" Тогда
	  	Возврат Истина;
	КонецЕсли; 
	
	ПортGetVar = 80;
	Ответ = HTTP_Get(Ресурс);
	Если Ответ = "true" Тогда
	  	Возврат Истина;
	КонецЕсли; 
	
	Если НазваниеPBX <> "ASKOZIA" Тогда
		ПортGetVar = 0;
		Возврат Ложь;
	КонецЕсли; 
		
	ПортGetVar = 0;
	Возврат Ложь;
КонецФункции // ПолучитьФайлССервера()

// Проверка наличия сервиса получения переменных.
// 
Функция HTTP_GetVar(Знач channel, список_variables, Знач УточнениеПеременных="") 
	Если ПортGetVar = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	Переменные = Неопределено;
	variables="";
	Если НЕ ЗначениеЗаполнено(УточнениеПеременных) Тогда
		Для каждого тек_var Из список_variables Цикл
			Если ЗначениеЗаполнено(variables) Тогда
				variables = variables + ",";
			КонецЕсли; 
			variables = variables + тек_var.Представление;
		КонецЦикла; 
	Иначе	
		variables =  УточнениеПеременных;	
	КонецЕсли; 
	
	Если НазваниеPBX = "ASKOZIA" Тогда
		Ресурс = "/cfe/wallboard/1c/getvar.php?event=GetVar&";
	ИначеЕсли НазваниеPBX = "MIKOPBX" Тогда
		Ресурс = "/pbxcore/api/miko_ajam/getvar?event=GetVar&";
	Иначе	
		Ресурс = "/admin/1c/getvar/index.php?event=GetVar&";
	КонецЕсли; 
	
	Ресурс = Ресурс + "actionid=" + КлючУникальности + "&channel=" + channel + "&variables=" + variables + "&";
	
	врВыражение = HTTP_Get(Ресурс);
	Если НЕ ЗначениеЗаполнено(врВыражение) Тогда
	  	Возврат Ложь;
	КонецЕсли; 
	
	Попытка
		Переменные = Вычислить(врВыражение);
	Исключение
		СообщитьОтладочнуюИнформацию("Исключение метода ""HTTP_GetVar"": ",врВыражение);
		Возврат Ложь;	
	КонецПопытки; 
	
	Если НЕ ТипЗнч(Переменные) = Тип("Структура") Тогда
	 	Возврат Ложь;
	КонецЕсли; 
	
	Для каждого тек_var Из список_variables Цикл
		врИмя = СтрЗаменить(тек_var.Представление, "(", "_");
		врИмя = СтрЗаменить(врИмя, ")", "_");
		врИмяПолное = "p_"+врИмя;
		// Служебные поля.
		врИмя = СтрЗаменить(врИмя, "channel1_", "");
		врИмя = СтрЗаменить(врИмя, "channel2_", "_");
		врИмя = "p_"+врИмя;

		врЗначение = "";
		Если Переменные.Свойство(врИмя, врЗначение) 
			 ИЛИ Переменные.Свойство(врИмяПолное, врЗначение) Тогда
			тек_var.Значение= Строка(врЗначение);
			тек_var.Пометка = Истина;
		КонецЕсли; 
	КонецЦикла; 
	 
	Возврат Истина;	

КонецФункции // ПолучитьФайлССервера()

&НаКлиенте
Функция HTTP_Get(Ресурс)
	
	ЗащищенноеСоединение = Неопределено;
	Ответ = "";
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
		HTTP = Новый HTTPСоединение(ХостAsterisk, ПортGetVar, ПользовательСтатистики, ПарольПользователяСтатистики,,1,ЗащищенноеСоединение);
		Результат = HTTP.Получить(HTTPЗапрос);
		Если Результат.КодСостояния = 200 Тогда
			Ответ = СокрЛП(Результат.ПолучитьТелоКакСтроку());
		КонецЕсли; 
		Если Ответ = "" И ПортGetVar = 443 Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
			HTTP = Новый HTTPСоединение(ХостAsterisk, ПортGetVar, ПользовательСтатистики, ПарольПользователяСтатистики,,1,ЗащищенноеСоединение);
			Результат = HTTP.Получить(HTTPЗапрос);
			Если Результат.КодСостояния = 200 Тогда
				Ответ = СокрЛП(Результат.ПолучитьТелоКакСтроку());
			КонецЕсли; 
		КонецЕсли; 
	Исключение
	КонецПопытки; 
	
	Возврат Ответ;
	
КонецФункции // HTTP_Get()
 
/////////////////////////////////////////////////////////////////////////
// Фильтрация и работа с прокси //начало

// При использовании прокси сервера телефонии MIKO, можно установить активную фильтрацию на получаемые от Asterisk пакеты
// Фильтр белый, при установке фильтра нужно описать все необходимые нам события. При необходимости используем спецсимволы
// ! - отрицание
// * - любая строка вначале
// все условия перечисленные внутри тега <ajam-filter> имеют конкатенацию с признаком ИЛИ
// все условия перечисленные внутри тега <filter .../> имеют конкатенацию с признаком И
//
Процедура УстановитьАктивнуюФильтрациюСобытийНаПрокси()
	Если ИспользоватьПрокси=Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Компонент = Неопределено Тогда
		Сообщить("Компонент не подключен");
		Возврат;
	КонецЕсли;                               
	Фильтр ="<ajam-filter>
			|	<filter event='MeetmeJoin' />
			|	<filter event='MeetmeLeave' />
			|	<filter event='MeetmeEnd' />
			|	<filter event='MeetmeMute' />
			|	<filter event='MeetmeTalking' />
			|	<filter event='Hangup' />
			|	<filter event='Bridge' />
			|	<filter event='BridgeEnter' />
			|	<filter event='BridgeLeave' />
			|	<filter event='ParkedCall' />
			|	<filter event='ChanSpyStart' />
			|	<filter event='ChanSpyStop' />
			|	<filter event='UnParkedCall' />
			|	<filter event='ParkedCallGiveUp' />
			|	<filter event='SendFAX' />
			|	<filter event='UserEvent'/>
			|	<filter event='Newchannel'/>
			|	<filter event='Cdr' />
			|	<filter event='OriginateResponse' />
			|	<filter event='ExtensionStatus'/>
			|	<filter event='Dial'/>
			|	<filter event='DialBegin'/>
			|	<filter event='DialEnd'/>
			|	<filter event='Newstate' />
			|	<filter event='Pickup'/>
			|</ajam-filter>";
	Результат = "";

	Попытка
		Command = "Action=ajam_filter&xml=" + URLEncode(Фильтр);
		Компонент.RawCommand(Command, Результат);
		СообщитьОтладочнуюИнформацию("Установлен фильтр ", Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка установки фильтра ", Результат);
	КонецПопытки; 
	
КонецПроцедуры

// Фильтрация и работа с прокси // конец
/////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////
// Статусы // начало // Взаимодействие с AstDB

// Меняет статус пользователя и оповещает об этом других пользователей панели
//
Процедура УстановитьСтатус(Статус, НомерТелефона, ТекстСтатуса) Экспорт
	Если ИспользоватьAsterisk Тогда
	
		Если Компонент = Неопределено ИЛИ НЕ Компонент.Enabled ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
			Возврат;	
		КонецЕсли;

		Channel		=	"Local/10000222@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
		Variable	=	"dbFamily=UserBuddyStatus,command=put"
						+",key=" + URLEncode(НомерТелефона)
						+",val=" + URLEncode(Статус)
						+",chan="+URLEncode(НашКаналФильтр);
		
		Результат="";
		Попытка
			OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
			СообщитьОтладочнуюИнформацию("Инициирован статусов пользователей:",Результат);
		Исключение
			СообщитьОтладочнуюИнформацию("Ошибка при запросе статусов пользователей:",Результат);
			Возврат;
		КонецПопытки;
		// корректировка статуса DND
		УстановитьРежимНеБеспокоить(ТекстСтатуса, мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(НомерТелефона));
	Иначе
		sip_status = ?(ТекстСтатуса = "DND", ""+ТекстСтатуса, ""+Статус);
		Оповестить("set_sip_status", sip_status);
	КонецЕсли; 
	
КонецПроцедуры // СменитьСтатус()

// Установка статуса для номер телефона 
// 
Процедура УстановитьРежимНеБеспокоить(Статус = "DND", НомерТелефона) Экспорт
	Если Компонент = Неопределено ИЛИ НЕ Компонент.Enabled ИЛИ НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;	
	КонецЕсли;
	dbFamily = "DND";
	dbKey	 = НомерТелефона;
	dbValue	 = ?(Статус = "DND", "1", "");

	Channel		=	"Local/10000222@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	"dbFamily=DND,command=put"
					+",key=" + URLEncode(НомерТелефона)
					+",val=" + URLEncode(dbValue)
					+",chan="+URLEncode(НашКаналФильтр);
	
	Результат="";
	Попытка
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован статусов пользователей:",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе статусов пользователей:",Результат);
	КонецПопытки;	
	
КонецПроцедуры

// Читает список пользовательских статусов из БД Asterisk
//
Процедура ПрочитатьСтатусыИзБД()
	// статусы:
	//  0 - Idle
	//  1 - In use
	//  2 - Busy
	//  4 - Unavailable
	//  8 - Ringing
	// 16 - On Hold
	// ============
	// 32 - Away
	// Звоним на номер 10000222, используя контекст для служебных команд. Звонок длится не более 10 секунд.
	// для канала 10000222 устанавливаем переменные необходимые для разбора файла истории звонков
	
	Если НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли;
	Channel		=	"Local/10000222@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	"dbFamily=UserBuddyStatus,command=show"
					+",key="
					+",val="
					+",chan="+URLEncode(НашКаналФильтр);
	
	Результат="";
	Попытка
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован статусов пользователей:",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе статусов пользователей:",Результат);
	КонецПопытки;	
	
КонецПроцедуры // ПрочитатьСтатусыИзБД()

// формирование муршурта переадресации вызова
// 
Процедура НазначитьПереадресацию(ИсходныйНомер, НомерНазначения = "", ВключитьПереадресацию) Экспорт
	Если НЕ ЗначениеЗаполнено(ИсходныйНомер) Тогда
		Возврат;	
	КонецЕсли; 
	dbKey	 = "" + ИсходныйНомер;
	dbValue	 = ?(ВключитьПереадресацию = Истина, ""+НомерНазначения, "");
	Если НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат;
	КонецЕсли;
	Channel		=	"Local/10000222@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	"dbFamily=CF" 
					+",command=put"
					+",key="	+ URLEncode(dbKey)
					+",val=" 	+ URLEncode(dbValue)
					+",chan="	+ URLEncode(НашКаналФильтр);
	
	Результат="";
	Попытка
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован статусов пользователей:",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе статусов пользователей:",Результат);
	КонецПопытки;	
	
	// статусы / начало
	Если ВключитьПереадресацию Тогда
		УстановитьСтатус("4", НашКаналФильтр, "Unavailable");
	Иначе	
		УстановитьСтатус("0", НашКаналФильтр, "Idle");
	КонецЕсли; 
	// статусы / конец
КонецПроцедуры

// Получаем настройки переадресации вызовов.
// 
Функция ПолучитьНазначениеПереадресации() Экспорт
	НомерНазначения = "";
	НашНомер = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(НашКаналФильтр);
	
	// XMLОтвет = ПрочитатьПараметрИзБД("CF", НашНомер);
	
	Если НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Channel		=	"Local/10000222@"+КонтекстНабораСлужебныхКоманд; //	Channel: Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial.)
	Variable	=	"dbFamily=CF" 
					+",command=get"
					+",key="	+ URLEncode(НашНомер)
					+",val="
					+",chan="	+ URLEncode(НашКаналФильтр);
	
	Результат="";
	Попытка
		OriginateНаКаналСПередачейПараметров(Channel, Variable, Результат);			
		СообщитьОтладочнуюИнформацию("Инициирован статусов пользователей:",Результат);
	Исключение
		СообщитьОтладочнуюИнформацию("Ошибка при запросе статусов пользователей:",Результат);
	КонецПопытки;	
	
	Возврат НомерНазначения;
КонецФункции // ПолучитьНазначениеПереадресации()

// Смена статуса сотрудника.
//
Процедура ОбновитьСтатусСотрудника(КаналСотрудника, Статус)
	Попытка
		НовыйСтатус = Число(Статус);
	Исключение
		НовыйСтатус = 0;
	КонецПопытки; 
	
	Для каждого СтрокаСотрудника Из Сотрудники Цикл
		Если Найти(СтрокаСотрудника.КаналСотрудника, КаналСотрудника)<=0 Тогда
			Продолжить;
		КонецЕсли; 
		СтрокаСотрудника.Статус = НовыйСтатус;
	КонецЦикла;
	Оповестить("ОбновитьОтображениеСтатусов");
КонецПроцедуры // ОбновитьСостояниеСотрудника()

// Статусы / окончание
/////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИНИЦИАЛИЗАЦИИ КОМПОНЕНТЫ

// Инициализация встроенного программного телефона
// 
Процедура ИнициализироватьSIP(Знач ВнутреннийНомер=Неопределено) Экспорт

	// + SIP
	МодульНаборНомера = Неопределено;
	Если ДопМодули.Свойство("НаборНомера", МодульНаборНомера) 
		 И НЕ МодульНаборНомера = Неопределено Тогда
		МодульНаборНомера.Конструктор(ВнутреннийНомер);
	КонецЕсли; 
	// - SIP

КонецПроцедуры
 
// Подключаем компоненту связи из макета и логинимся под менеджером астериска
//
Процедура ПодключитьВК() Экспорт
	Если НЕ( ЗначениеЗаполнено(Хост) 
		И ЗначениеЗаполнено(Порт) 
		И ЗначениеЗаполнено(МенеджерЛогин) 
		И ЗначениеЗаполнено(МенеджерПароль)) 
		Тогда
		Сообщить("Не указаны параметры авторизации на сервере телефонии. Панель не будет подключена.");
		ФормаНастройки=мОбщийМодуль.ПолучитьФормуНастройки();
		Если ФормаНастройки.Открыта() Тогда
			ФормаНастройки.Открыть();
		КонецЕсли; 
		Возврат;
	КонецЕсли; 
	
	Состояние("Выполняется инициализация компоненты телефонии");
	
	// инициализируем компонент
	Если НЕ ПодключитьВнешнююКомпонентуAsterisk() Тогда
		СообщитьОтладочнуюИнформацию("Не удалось подключить внешнюю компоненту!","");
		Обозреватель = Обработки.Обозреватель.ПолучитьФорму("Форма");
		Обозреватель.СтартоваяСтраница = "http://wiki.miko.ru/doc:1cajam:install#reshenie_problem_s_texnologiej_zaschity";
		Обозреватель.Заголовок = "Иснтрукция по настройке системы защиты Sentinel HASP.";
		Обозреватель.ВладелецФормы = ФормаТелефон;
		Обозреватель.Открыть();
	КонецЕсли;
	
	// подключение к AJAM
	Если НЕ Компонент = Неопределено Тогда
		Попытка		                                                
			Компонент.MikoLicense = MikoLicense;
		Исключение
		КонецПопытки; 
		
		Компонент.Host					= Хост;
		Компонент.Port 					= Порт;
		Компонент.EventsTimeout			= 15;
		Компонент.UseHTTPS 				= РежимSSL;
		Компонент.DigestAutorization 	= DigestАвторизация;
		// настройка прокси
		Компонент.Proxy				 	= ПроксиСервер;
		Компонент.PorxyLogin		 	= ПроксиЛогин;
		Компонент.PorxySecret		 	= ПроксиПароль;
		// IP сервера лицензирования 127.0.0.1 для локального хоста.
		// Компонент.HaspLicenseServer		= "";
		
		// Если не используется прокси сервер то ХостAsterisk равен тому хосту к которому подключились.
		ХостAsterisk 					= Хост;	 		
		
		Результат="";
		Попытка
			ПодключениеУспешно = Компонент.Login(МенеджерЛогин,МенеджерПароль,Результат);
			ПозицияHost1	= Найти(Результат,"host='");
			ПозицияHost2 	= Найти(Результат,"' idenity='");
			ИспользоватьПрокси = (ПозицияHost1 > 0 И ПозицияHost2 > 0);
			Если ИспользоватьПрокси Тогда
				ХостAsterisk=Сред(Результат,ПозицияHost1+6,ПозицияHost2-ПозицияHost1-6);
			КонецЕсли;	
			СообщитьОтладочнуюИнформацию("Результат соединения ",Результат);
		Исключение
			ПодключениеУспешно = Ложь;
			СообщитьОтладочнуюИнформацию("Результат соединения ","Исключение при подключении к АТС, проверьте доступность Хост: " + Хост + ", Порт: " + Порт + ". Проверьте Логин и Пароль!");
		КонецПопытки; 
		
		Если НЕ ПодключениеУспешно Тогда
			// 0 < КолРеконнект < 15
			Если КоличествоПоследовательныхСбоевПриLogin < 15
				И КоличествоПоследовательныхСбоевПриLogin > 0 Тогда
				СообщитьОтладочнуюИнформацию("Связь с сервером телефонии потеряна!", "Аварийный реконнект будет произведен через "+(КоличествоПоследовательныхСбоевПриLogin*10)+" секунд.");
				ФормаТелефон.Реконнект();
				КоличествоПоследовательныхСбоевПриLogin = КоличествоПоследовательныхСбоевПриLogin + 1;
				// КолРеконнект = 0
			ИначеЕсли КоличествоПоследовательныхСбоевПриLogin = 0  Тогда 	
				// КолРеконнект >= 15
			Иначе
				Сообщить("Панель телефонии: потеряна связь с сервером телефонии, либо сетевое соединение не стабильно. Обратитесь к системному администратору!");
			КонецЕсли;
			
			Если Найти(Результат, "Success")>0 Тогда
				ПодключениеУспешно = Истина;
				ТекстСообщения = "Подключение к АТС произведено успешно." + Символы.ПС + "Не найдено свободной лицензии на панель телефонии!";
			Иначе
				ТекстСообщения = "Не вышло подключиться к АТС! Проверьте параметры подключения.";
			КонецЕсли;
			Сообщить(ТекстСообщения);
		Иначе
			// Обнуляем, если успешно подключились. Успешно - значит не было сбоев, исключений.
			КоличествоПоследовательныхСбоевПриLogin = 0;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Компонент = Неопределено  Тогда 
		Возврат;
	ИначеЕсли НЕ Компонент.Enabled 
		 	  И ПодключениеУспешно = Истина Тогда
		ПолучитьСведенияОЛицензировании();
	ИначеЕсли НЕ Компонент.Enabled Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализацияПанели();
	РарусСофтФонЛайтКомпонента	= "МИКО софтфон вместо Рарус софтфон лайт"; // Подменим компонент Раруса.
	
КонецПроцедуры	

// Подключение компоненты.
// 
Функция ПодключитьВнешнююКомпонентуAsterisk()
	РезПодключение = Ложь;
	
	Если ХЭШ_Компонент = Неопределено Тогда
		СсылкаНаАрхив = ПоместитьВоВременноеХранилище(ЭтотОбъект.ПолучитьМакет("AsteriskAJAMConnector"), Новый УникальныйИдентификатор);
		Если ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, "Comp", ТипВнешнейКомпоненты.Native) Тогда
			Попытка
				Компонент = Новый ("AddIn.Comp.MikoAjam");
				РезПодключение = Истина;
				
				ХЭШ_Компонент = Компонент;
			Исключение
				Компонент = Неопределено;
				Сообщить("Исключение при инициализации компоненты MIKO_AJAM, проверьте установлена ли система защиты.");
			КонецПопытки; 
		КонецЕсли;
	Иначе	
		Компонент 	   = ХЭШ_Компонент;
		РезПодключение = Истина;
	КонецЕсли; 
	
	Возврат РезПодключение;
КонецФункции // ПодключитьВнешнююКомпонентуAsterisk()
 

// Отключаем компоненту связи
//
Процедура ОтключитьВК() Экспорт
	Звонки.Очистить();
	ИсторияЗвонков.Очистить();
	ПропущенныеЗвонки.Очистить();
	Парковка.Очистить();
	СвязиКаналов.Очистить();                       
	ФаксимильныеСообщения.Очистить();
	Сотрудники.Очистить();
	
	СоответствиеАвтоподъем = Новый Соответствие;
	СтрокаАвтоподъема 	   = "";
	ВерсияДиалплана = Неопределено;                  
	ХостAsterisk 	= "";
	
	ОсвободитьДопМодули();
	
	Если ТипЗнч(ТаблицаХинтов) = Тип("ТаблицаЗначений") Тогда
		ТаблицаХинтов.Очистить(); 
	КонецЕсли; 
	
	Если мВнешняяПанель <> Неопределено Тогда
		мВнешняяПанель.Выгрузить();
	КонецЕсли; 
	
	Если Компонент = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	// Статусы / начало
	УстановитьСтатус("4", НашКаналФильтр, "Unavailable");
	// Статусы / конец
	Попытка
		Состояние("Разлогиниваемся на сервере телефонии...");
		Результат="";
		Компонент.Logoff(Результат);
		Состояние("Разлогинились успешно!");
		СообщитьОтладочнуюИнформацию("Результат разлогинивания: ",Результат);
		Сотрудники.Очистить();
	Исключение
		СообщитьОтладочнуюИнформацию("", "Исключение при разлогинивании");
	КонецПопытки; 
	Компонент 		= Неопределено;
	
КонецПроцедуры

// Для совместимости с Рарус софтфон проф 
// 
Процедура ЗавершитьСофтФон()Экспорт
	ОтключитьВК();	
КонецПроцедуры
// Базовая инициализация панели телефонии.
// 
Процедура УстановитьЗначенияПоУмолчанию() Экспорт
	ИнициализацияПанели();
КонецПроцедуры

// Получить информацию о ключах HASP доступных текущей панели
//
Процедура ПолучитьСведенияОЛицензировании() 
	Если Компонент <> Неопределено Тогда
		врКомпонент = Компонент;
	ИначеЕсли ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		 врКомпонент = ДопМодули.НаборНомера.ПолучитьКомпонентSIP();	
	КонецЕсли; 
	
	Если НЕ врКомпонент = Неопределено Тогда 			
		ИнформацияПоЛицензиям = мОбработкаДанных.ПолучитьТаблицуКлючейЗащиты(врКомпонент);
	КонецЕсли; 
	
	ОбновитьТекстЛицензии();
КонецПроцедуры

// Формирует текст свведений по ключам защиты.
// 
Процедура ОбновитьТекстЛицензии(Знач MIKO_Error = Неопределено) Экспорт
	Если ТипЗнч(ИнформацияПоЛицензиям) <> Тип("Структура")
		 ИЛИ НЕ ИнформацияПоЛицензиям.Свойство("РегистрационныйНомер") Тогда
	  	Возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(MIKO_Error) Тогда
		нТекстЛицензии = MIKO_Error;
	Иначе	
		// Отобразим информацию по остатку дней лицензии.
		Если ЗначениеЗаполнено(ИнформацияПоЛицензиям.РегистрационныйНомер) Тогда
			Если ИнформацияПоЛицензиям.ОстатокДнейЛицензии = 0 Тогда
				нТекстЛицензии 	= 	""; // безсрочная.
			ИначеЕсли ИнформацияПоЛицензиям.ОстатокДнейЛицензии < 0 Тогда
				нТекстЛицензии 	= 	"Срок действия лицензии истек.";
			Иначе	
				ДатаОкончания = ТекущаяДата() + 60*60*24*ИнформацияПоЛицензиям.ОстатокДнейЛицензии;
			    нТекстЛицензии 	= 	"Лицензия действует до "+ Формат(ДатаОкончания,"ДЛФ=DD") + ".";
			КонецЕсли; 
		Иначе
			нТекстЛицензии 	= 	"Не найден ключ защиты.";
		КонецЕсли;
	КонецЕсли; 
	
	ИнформацияПоЛицензиям.Вставить("нТекстЛицензии", нТекстЛицензии);
	Оповестить("MIKO_ТекстЛицензииAsterisk", ИнформацияПоЛицензиям, ЭтотОбъект);
КонецПроцедуры

// Обновление информации по лицензиям.
// 
Процедура RefreshLicense() Экспорт
    ПолучитьСведенияОЛицензировании();
КонецПроцедуры // RefreshLicense()

// Получение пробного ключа / установка значения ключа
// 
Процедура GetSetTrialLicense(Параметр) Экспорт
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Если Компонент = Неопределено И НЕ ИспользоватьСофтфон Тогда
			ПодключитьВнешнююКомпонентуAsterisk();
		КонецЕсли; 
		
		Если Компонент <> Неопределено Тогда
			Попытка
				Компонент.MikoLicense	= Параметр;
			Исключение
			КонецПопытки; 
		КонецЕсли;
		// + SIP
		МодульНаборНомера = Неопределено;
		Если ДопМодули.Свойство("НаборНомера", МодульНаборНомера) 
			 И НЕ МодульНаборНомера = Неопределено Тогда
			МодульНаборНомера.GetSetTrialLicense_SIP(Параметр);
		КонецЕсли; 
		// - SIP
	Иначе	
		GetTrialLicense(Параметр);		
	КонецЕсли; 
КонецПроцедуры
 
// Получение временной лицензии на 30 деней. 
//
Функция GetTrialLicense(Данные)
	Если Компонент <> Неопределено Тогда
		врКомпонент = Компонент;
	ИначеЕсли Неопределено <> ХЭШ_Компонент Тогда
		врКомпонент = ХЭШ_Компонент;
	ИначеЕсли ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		 врКомпонент = ДопМодули.НаборНомера.ПолучитьКомпонентSIP();	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	Если врКомпонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	// <reginfo>
	//|<param name = "Companyname" value = "МИКО ООО" / >
	//|<param name = "Contact" value = "Бекетов Николай" / >
	//|<param name = "Email" value = "nbek@mko.ru" / >
	//|<param name = "Telefone" value = "+79265244742" / >
	//|<param name = "INN" value = "773512312" / >
	//|<param name = "TypeOPF" value = "org" / >
	//|<param name = "Description" value = "Активация из 1С" / >
	//< / reginfo>
	врПараметры = Новый Структура("sLicenseKey,sContact,sCompanyname,sEmail,sTel,sDescription,ЮрЛицо,INN");
	ЗаполнитьЗначенияСвойств(врПараметры, Данные);

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Contact", 	врПараметры.sContact);
	СтруктураПараметров.Вставить("Companyname", врПараметры.sCompanyname);
	СтруктураПараметров.Вставить("Email", 		врПараметры.sEmail);
	СтруктураПараметров.Вставить("Telefone", 	врПараметры.sTel);
	СтруктураПараметров.Вставить("Description", врПараметры.sDescription);
	СтруктураПараметров.Вставить("TypeOPF", 	?(врПараметры.ЮрЛицо = Истина, "org", "ind"));
	СтруктураПараметров.Вставить("INN", 		врПараметры.INN);  		
	  	
	Данные = "<reginfo>";
	Для каждого ТекПараметр Из СтруктураПараметров Цикл
		Если ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
			Данные = Данные+Символы.ПС+"<param name="""+ТекПараметр.Ключ+""" value="""+ЭкранироватьСпецСимволыXML(ТекПараметр.Значение)+"""/>";
		КонецЕсли; 
	КонецЦикла; 
	Данные = Данные+Символы.ПС+"</reginfo>";
	
	Данные 	  = URLEncode(Данные);
	ProductID = "3";
	Результат = "";
	Попытка
		Если ЭтоWindows() Тогда
			врКомпонент.GetTrialLicense(ProductID, Данные, Результат);
		Иначе	
			врКомпонент.GetTrialLicense(Данные, Результат);
		КонецЕсли; 
		ОтработанаУспешно = Истина;
	Исключение
		ОтработанаУспешно = Ложь;
	КонецПопытки; 
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Оповестить("MIKOLIC_Trial", Результат, "");
		GetSetTrialLicense(""+Результат);
	Иначе
		Оповестить("MIKOLIC_Trial_Error", Результат, "");
	КонецЕсли; 
	Возврат ОтработанаУспешно;
КонецФункции // GetTrialLicense()
// Активация продукта.
// 
Функция AddTrialProduct() Экспорт 
	
	Если Компонент <> Неопределено Тогда
		врКомпонент = Компонент;
	ИначеЕсли ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		 врКомпонент = ДопМодули.НаборНомера.ПолучитьКомпонентSIP();	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	Если врКомпонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 

	Попытка
		ОтработанаУспешно = врКомпонент.AddTrialProduct("3");
	Исключение
		ОтработанаУспешно = Ложь;
	КонецПопытки; 

	Возврат ОтработанаУспешно;
КонецФункции // ActivateCoupone()

// Активация купона.
// 
Функция ActivateCoupone(sCoupone) Экспорт 
	Если НЕ ЗначениеЗаполнено(sCoupone) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Компонент <> Неопределено Тогда
		врКомпонент = Компонент;
	ИначеЕсли ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		 врКомпонент = ДопМодули.НаборНомера.ПолучитьКомпонентSIP();	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	Если врКомпонент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("sCoupone", Строка(sCoupone));
	СтруктураПараметров.Вставить("result", "");

	Попытка
		врКомпонент.ActivateCoupone(СтруктураПараметров.sCoupone, СтруктураПараметров.result);
		ОтработанаУспешно = Истина;
	Исключение
		ОтработанаУспешно = Ложь;
	КонецПопытки; 
	Оповестить("MIKOLIC_Coupone", СтруктураПараметров.result, "");

	Возврат ОтработанаУспешно;
КонецФункции // ActivateCoupone()

Функция ЭкранироватьСпецСимволыXML(Знач ИсхСтрока)
	Результат = ИсхСтрока;
	Результат = СтрЗаменить(Результат, "&"," ");
	Результат = СтрЗаменить(Результат, """","&quot;");
	Результат = СтрЗаменить(Результат, "'","&apos;");	
	Результат = СтрЗаменить(Результат, "<","&lt;");	
	Результат = СтрЗаменить(Результат, ">","&gt;");	
	
	Возврат Результат;
КонецФункции // ЭкранироватьСпецСимволыXML()

/////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПРОЧИЕ

Функция ЭтоWindows()
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоWindows = (СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64);

	Возврат ЭтоWindows;
КонецФункции // ЭтоUbuntu()

// Функция преобразует параметры в строковый вид в виде 
// [Параметр1]          [Параметр2]         [Параметр3][Параметр4][Параметр5]    [Параметр6]
// [ИдентификаторЗвонка][Входящий/Исходящий][КодСтраны][КодГорода][НомерТелефона][Внутренний]
Функция ПреобразоватьПараметрыВСтроку(ТекущаяСтрока) Экспорт
	
	Результат="";
	
	Номер = "";
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодСтраны) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодГорода) Тогда
		Номер = СокрЛП(ТекущаяСтрока.Внутренний);
	Иначе
		Номер = ?(НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерТелефона), СокрЛП(ТекущаяСтрока.КодГорода), СокрЛП(ТекущаяСтрока.НомерТелефона));
	КонецЕсли;
	
	ТипЗвонка = СокрЛП(ОпределитьВнутреннийВнешнийЗвонок(Номер));
	Результат = Результат + "["+ТипЗвонка+"]";
	
	Если Число(ТипЗвонка) = ТипВнутреннийВнешнийЗвонок.Внутренний Тогда
		ТмпКодСтраны 	= "";
		ТмпКодГорода 	= "";
		ТмпНомер 		= "";
		ТмпВнутренний 	= Номер;
	Иначе
		ТмпКодСтраны 	= ТекущаяСтрока.КодСтраны;
		ТмпКодГорода 	= ТекущаяСтрока.КодГорода;
		ТмпНомер 		= Номер;
		ТмпВнутренний 	= "";
	КонецЕсли;
	
	Результат = Результат + "["+ТмпКодСтраны+"]"+
	"["+ТмпКодГорода+"]"+
	"["+ТмпНомер+"]"+
	"["+ТмпВнутренний+"]";
	
	Возврат Результат;
КонецФункции

// Заполняет таблицу сотрудников компании с внутренними номерами и полом, для правильного отображения картинки
//
Процедура ЗаполнитьТаблицуСотрудников() Экспорт
	Если Компонент=Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	// получаем таблицу зарегистрированных номеров с АТС
	Если ТаблицаХинтов=Неопределено
		 ИЛИ ТаблицаХинтов.Количество()=0 Тогда
		ТаблицаХинтов = ЗапроситьСписокХинтовССервераAsterisk();
		Если ТаблицаХинтов=Неопределено Тогда
			Сообщить("Сервер телефонии не вернул список внутренних номеров, проверяйте настройки!" );
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	Попытка
		// подготавливаем таблицу контактной информации пользователей
		Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьТаблицуСотрудников();
		КИ = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаКИ Из КИ Цикл
			СтрокаКИ.ВнутреннийНомер = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(СтрокаКИ.ВнутреннийНомер);	
			СтрокаКИ.Мобильный 		 = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(СтрокаКИ.Мобильный);	
		КонецЦикла; 
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Запрос = мОбработкаДанных.ПолучитьЗапросЗаполнитьТаблицуСотрудников();
	Запрос.УстановитьПараметр("Контакты", КИ);
	Запрос.УстановитьПараметр("ТаблицаХинтов",ТаблицаХинтов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Сотрудники.Очистить();
	Пока Выборка.СледующийПоЗначениюПоля("Пользователь") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("ЗначениеПоУмолчанию") Цикл
			Если не ЗначениеЗаполнено(Выборка.ВнутреннийНомер) Тогда 
				Продолжить;	 //зачем нам сотрудник без номера
			КонецЕсли; 
			
			СотрудникиСтрока=Сотрудники.Найти(Выборка.Пользователь,"Сотрудник");
			Если СотрудникиСтрока=Неопределено Тогда
				СотрудникиСтрока=Сотрудники.Добавить();	
			ИначеЕсли Не Выборка.ЗначениеПоУмолчанию тогда
				Продолжить;
			КонецЕсли; 
			
			СотрудникиСтрока.Сотрудник			= Выборка.Пользователь;
			СотрудникиСтрока.ВнутреннийНомер	= мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(Выборка.ВнутреннийНомер);
			СотрудникиСтрока.КаналСотрудника 	= Выборка.Канал;
			
			врСтрока = КИ.Найти(Выборка.Пользователь, "Объект");
		    Если врСтрока<>Неопределено Тогда
				СотрудникиСтрока.МобильныйНомер = врСтрока.Мобильный;	
			КонецЕсли; 
			// Вдруг у нас комплекная или УПП. Там есть реквизит физлицо.
			Если ЗначениеЗаполнено(Выборка.ФизЛицо) 
				И Выборка.ФизЛицо.Метаданные().Реквизиты.Найти("Пол")<> Неопределено Тогда
				Попытка
					Пол = Выборка.ФизЛицо["Пол"] 
				Исключение
					СообщитьОтладочнуюИнформацию("Исключительная ситуация: ", "Не хватает прав на просмотр справочника ""Физические лица"".", ИнформацияОбОшибке());
				КонецПопытки; 
			Иначе
				Пол	= Выборка.Пол;
			КонецЕсли;
			
			Если Найти(Пол,"Муж")>0 Тогда
				СотрудникиСтрока.Пол	=	0;
			ИначеЕсли Найти(Пол,"Жен")>0 Тогда
				СотрудникиСтрока.Пол	=	3;
			Иначе
				СотрудникиСтрока.Пол	=	6; 
			КонецЕсли;
			
			Если Найти(Выборка.Состояние,"InUse")>0 Тогда
				СотрудникиСтрока.Состояние	=	СостояниеЭкстеншена.Разговаривает;
			ИначеЕсли Найти(Выборка.Состояние,"Unavailable")>0 Тогда
				СотрудникиСтрока.Состояние	=	СостояниеЭкстеншена.Недоступен;
			Иначе
				СотрудникиСтрока.Состояние	=	СостояниеЭкстеншена.Свободен; 
			КонецЕсли;
			
			// Определим канал текущего пользователя панели телефонии
			Если СотрудникиСтрока.Сотрудник = мПользователь 
				И НЕ ЗначениеЗаполнено(НашКаналФильтр) Тогда
				НашКаналФильтр  = (СотрудникиСтрока.КаналСотрудника);
				НашНомерТелефона = ""+Выборка.ВнутреннийНомерПира;
				ТаблицаХинтов.Найти(НашКаналФильтр);
				
				хинт = ТаблицаХинтов.Найти(НашКаналФильтр);
				Если НЕ хинт = Неопределено И ЗначениеЗаполнено(хинт.UserAgent) Тогда
					ВидСофтфонаПользователя = хинт.UserAgent;	
					СтрокаАвтоподъема  		= ВернутьСтрокуАвтоподъемаТрубки(ВидСофтфонаПользователя);
				КонецЕсли; 
				
				НашDAHDIПорт = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(НашКаналФильтр);
				
				ПолучитьКонтекстССервераAsterisk();
				Если Найти(НашКаналФильтр,"PJSIP")>0 И ИспользоватьАвтоподъем Тогда
					ПолучитьПараметрыSIPПира(НашНомерТелефона, "PJSIP");
				ИначеЕсли Найти(НашКаналФильтр,"SIP")>0 Тогда
					ПолучитьПараметрыSIPПира(НашНомерТелефона, "SIP");
				КонецЕсли;
				// Статусы / начало
				УстановитьСтатус("0", НашКаналФильтр, "Idle");
				// Статусы / конец
				Банер_УстановитьПараметрыТП();

			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	ПрочитатьСтатусыИзБД();
	
	Если Сотрудники.Количество()=0 Тогда
		Сообщить("В справочнике пользователей не прописаны внтуренние номера или не выделены как основные, таблица сотрудников не будет заполнена!",СтатусСообщения.Важное);
	КонецЕсли;		
КонецПроцедуры // ЗаполнитьТаблицуСотрудников()

// Заполнить таблицу истории звонков 
//
// Параметры
//  ДатаЗаполнения  -Дата - Дата за которую выбираем историю звонков с астериск сервера
//
Процедура ЗаполнитьТаблицуИсторииЗвонков(ДатаЗаполнения='00010101', врИсторияЗвонков=Неопределено) Экспорт
	Если НЕ ИспользоватьAsterisk Тогда
	    Оповестить("ЗаполнитьТаблицуИсторииЗвонков_SIP", ДатаЗаполнения, врИсторияЗвонков);
		Возврат;
	КонецЕсли; 
		
	Если врИсторияЗвонков = Неопределено Тогда
		ТЗИсторииЗвонковВременная.Очистить();
		ЗапроситьЗаписиCDRДляТекущегоПользователя(ДатаЗаполнения);
		ИсторияЗвонков.Очистить();
		
		Банер_ЗаполнитьИсториюЗвонков();
		Возврат;
	ИначеЕсли ТипЗнч(врИсторияЗвонков)<>Тип("Массив") ИЛИ врИсторияЗвонков.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоMYPBX_U  = (НазваниеPBX = "MYPBX" И НЕ Лев(НашКаналФильтр,5)="PJSIP");
	Колонка_id = ?(ЭтоMYPBX_U, "recordingfile", "uniqueid");
	Для Каждого Вызов Из врИсторияЗвонков Цикл
		
		// Наполняем таблицу с именами файлов записей разговоров.
		врОтбор = Новый Структура("uniqueid,recordingfile");
		ЗаполнитьЗначенияСвойств(врОтбор, Вызов);
		Если ЗначениеЗаполнено(врОтбор.recordingfile) Тогда
		  	врСтроки = ЗаписиРазговоров.НайтиСтроки(врОтбор);
			Если врСтроки.Количество()=0 Тогда
				врЗапись = ЗаписиРазговоров.Добавить();
				ЗаполнитьЗначенияСвойств(врЗапись, врОтбор);
				врЗапись.Представление = "Длительность: " + Вызов.ПродолжительностьВызова + ", """ + Вызов.ArrayDialers + """"; 
			КонецЕсли; 
		КонецЕсли; 
		
		НомерТелефона = ?(Вызов.Входящий, Вызов.КтоЗвонит, Вызов.КомуЗвонит);
		Если Вызов.Пропущен = Истина И ЭтоMYPBX_U Тогда
			id = Вызов["uniqueid"]; // Имя файла записи не заполнено.
		Иначе	
		 	id = Вызов[Колонка_id];
		КонецЕсли; 
		
		// Проверим не было ли среди списка дозвонов звонка с ответом, если был, надо его подменить.
		СтрокаТаблицыCDR = НайтиСтрокуИсторииПоКолонкам(id, "uniqueid");
		Если СтрокаТаблицыCDR = Неопределено Тогда
			НовыйЗвонок = ТЗИсторииЗвонковВременная.Вставить(0);
			НовыйЗвонок.channel					= Вызов.channel;
			НовыйЗвонок.dstchannel				= Вызов.dstchannel;
			НовыйЗвонок.calldate 	 			= Вызов.Начало;
			НовыйЗвонок.ArrayDialers 		    = Вызов.ArrayDialers;
			НовыйЗвонок.ПропущенныйЗвонок 		= Истина;
			НовыйЗвонок.ВходящийЗвонок	 		= Вызов.Входящий;
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицыCDR.callerid) И ЗначениеЗаполнено(Вызов.dstchannel) Тогда
				СтрокаТаблицыCDR.callerid = НомерТелефона;
			КонецЕсли;

			НовыйЗвонок = СтрокаТаблицыCDR;
			
			// дополняем значениями
			МассивПриемник = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(НовыйЗвонок.ArrayDialers, ",");
			МассивИсточник = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(Вызов.ArrayDialers, ",");
			мОбработкаДанных.ДополнитьМассив(МассивПриемник,МассивИсточник,Истина);
			
			НовыйЗвонок.ArrayDialers = МассивПриемник;
			// Установка даты начала звонка.
			СтараяДата 					= НовыйЗвонок.calldate;
			СтарНаправление 			= НовыйЗвонок.ВходящийЗвонок;
			НовыйЗвонок.calldate		= Вызов.Начало;
			// Скорректируем направление и начало звонка.
			Если НЕ СтараяДата = Дата("00010101")
				 ИЛИ (СтараяДата < СтрокаТаблицыCDR.calldate И НЕ СтараяДата = Дата("00010101"))  Тогда
				НовыйЗвонок.calldate  		= СтараяДата;      // Дата начала вызова.
				НовыйЗвонок.ВходящийЗвонок	= СтарНаправление; // Исходное направление звонка верное.
			КонецЕсли;
		КонецЕсли;
		
		врChanSpy = Ложь;
		Если СтрокаТаблицыCDR = Неопределено И ЗначениеЗаполнено(Вызов.dstchannel) Тогда
			// Номер заполняем из первой записи истории звонков.
			// Исключение - запись, где нет канала назначения.
			НовыйЗвонок.callerid			= НомерТелефона;
		ИначеЕсли Вызов.КтоЗвонит = "Conference_Room" Тогда
			НовыйЗвонок.callerid			= Вызов.КтоЗвонит;
		ИначеЕсли "ChanSpy" = Вызов.LastApp И "" = Вызов.dstchannel Тогда
			НовыйЗвонок.callerid			= Вызов.КтоЗвонит;
			врChanSpy = Истина;	
		ИначеЕсли НЕ ЗначениеЗаполнено(НовыйЗвонок.callerid) Тогда	
			НовыйЗвонок.callerid			= НомерТелефона;
		КонецЕсли; 
		
		НовыйЗвонок.uniqueid	   = id;
		Если НазваниеPBX = "MYPBX" Тогда
			НовыйЗвонок.uid        = Вызов["uniqueid"];
		КонецЕсли; 
		НовыйЗвонок.ПропущенныйЗвонок	= МИН(Вызов.Пропущен, НовыйЗвонок.ПропущенныйЗвонок);
		
		Попытка
			Длительность = Число(Вызов.ПродолжительностьВызова);
		Исключение
			Длительность = 0;            
		КонецПопытки; 
		НовыйЗвонок.СекундДлился = НовыйЗвонок.СекундДлился + Длительность;
		НовыйЗвонок.recordingfile= ?(ЗначениеЗаполнено(НовыйЗвонок.recordingfile),НовыйЗвонок.recordingfile,Вызов.recordingfile);
		НовыйЗвонок.did			 = ?(ЗначениеЗаполнено(НовыйЗвонок.did),НовыйЗвонок.did,Вызов.did);
		НовыйЗвонок.врChanSpy    = врChanSpy;	
	КонецЦикла;
	
	// Найдем список объектов подходящих для номеров в графах  dst и src.
	Состояние("Определяем соответствие номеров телефонов и контактов из CRM.");
	
	врТаб = ТЗИсторииЗвонковВременная.Скопировать();
	врТаб.Свернуть("uniqueid");

	ТЗУчастникиЗвонков = Новый Соответствие;
    Для каждого стр_врТаб Из врТаб Цикл
		ArrayDialers = Новый Массив;
		строкиЗвонка = ТЗИсторииЗвонковВременная.НайтиСтроки(Новый Структура("uniqueid", стр_врТаб.uniqueid));
		Для каждого текЗвонок Из строкиЗвонка Цикл
			мОбработкаДанных.ДополнитьМассив(ArrayDialers,текЗвонок.ArrayDialers,Истина);
		КонецЦикла;
		ТЗУчастникиЗвонков.Вставить(СокрЛП(стр_врТаб.uniqueid), ArrayDialers);
	КонецЦикла; 
	
	ТЗ=ТЗИсторииЗвонковВременная;
	НазначенияВызововdst=ТЗ.ВыгрузитьКолонку("callerid");
	
	ВремМассивНомеровЧислом = Новый Массив;
	Для каждого Вызов Из ТЗИсторииЗвонковВременная Цикл
		Номер1 = мОбработкаДанных.ПреобразоватьНомерДляСохранения(Вызов.callerid, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Если Номер1<>0 Тогда
			ВремМассивНомеровЧислом.Добавить(Номер1);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьТаблицуИстории();
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НазначенияВызововdst", НазначенияВызововdst);
	Запрос.УстановитьПараметр("НазначенияВызововsrc", Новый Массив);
	Запрос.УстановитьПараметр("ВремМассивНомеровЧислом", ВремМассивНомеровЧислом);
	
	Результат 	    = Запрос.Выполнить();
	СписокКонтактов = Результат.Выгрузить();
	
	// Найдем документы события привязанные к истории звонков по GUID
	Колонка_id = ?(НазваниеPBX = "MYPBX", "recordingfile", "uniqueid");
	МассивГуидов = ТЗ.ВыгрузитьКолонку(Колонка_id);
	СпиосокДокументовСобытие = мОбщийМодуль.ПолучитьТаблицуСобытийПоGUID(МассивГуидов);
	
	ИсторияЗвонков.Очистить();

	Для к=0 по ТЗ.Количество()-1 Цикл
		Если ИсторияЗвонков.Найти(ТЗ[к].uniqueid,"ИдентификаторЗвонка")<> Неопределено тогда  // уже есть такая строчка
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ИсторияЗвонков.Добавить();
		НоваяСтрока.Когда				= ТЗ[к].calldate;
		НоваяСтрока.СекундДлился 		= ТЗ[к].СекундДлился;  
		// информация об имени файла записи разговоров 
		НоваяСтрока.ИдентификаторЗвонка	= ТЗ[к].uniqueid;
		НоваяСтрока.ПропущенныйЗвонок 	= ТЗ[к].ПропущенныйЗвонок;
		НоваяСтрока.ИмяФайла			= ?(НоваяСтрока.ПропущенныйЗвонок=Истина,"",ТЗ[к].recordingfile);
		
		НоваяСтрока.НомерТелефона 		= ТЗ[к].callerid;
		НоваяСтрока.ВходящийЗвонок		= ТЗ[к].ВходящийЗвонок;			
		НоваяСтрока.врChanSpy			= ТЗ[к].врChanSpy;			
		НоваяСтрока.did					= ТЗ[к].did;			

		// Попробуем заполнить контрагента и контактного лица
		// поиск по строковому представлению номера (для Skype)
		СтрокаСКонтактом =  Неопределено;
		ЭтоSkype 		  = мОбработкаДанных.ЭтоНеЧисловойНомер(НоваяСтрока.НомерТелефона);			
		Если НЕ ЭтоSkype Тогда
			// рализован поиск строки по числовому номеру
			ИскомыйНомер = мОбработкаДанных.ПреобразоватьНомерДляСохранения(НоваяСтрока.НомерТелефона, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
			Если ИскомыйНомер > 0 Тогда
				СтрокаСКонтактом = СписокКонтактов.Найти(ИскомыйНомер,"CRM_ЧисловоеПолеТелефона");
			КонецЕсли;
		Иначе
			СтрокаСКонтактом = СписокКонтактов.Найти(НоваяСтрока.НомерТелефона,"НомерТелефона");
		КонецЕсли; 
		
		Если СтрокаСКонтактом<>Неопределено Тогда
			ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияСтрокиИстории(СтрокаСКонтактом);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения);
			ОбъектКонтакта = СтрокаСКонтактом.Объект;
		КонецЕсли;
		Колонка_id = ?(НазваниеPBX = "MYPBX", "ИмяФайла", "ИдентификаторЗвонка");
		Если НЕ ЗначениеЗаполнено(НоваяСтрока[Колонка_id]) Тогда
			Продолжить;
		КонецЕсли; 
		// Попробуем заполнить событие к текущему звонку	
		СтрокаССобытием=СпиосокДокументовСобытие.Найти(НоваяСтрока[Колонка_id],"ИдентификаторЗвонка");
		Если СтрокаССобытием<>Неопределено Тогда
			НоваяСтрока.ДокументСобытие 		=	СтрокаССобытием.Ссылка;
		КонецЕсли;	
		
	КонецЦикла;			
	ИсторияЗвонков.Сортировать("Когда Убыв");
	
	Банер_ЗаполнитьИсториюЗвонков();
КонецПроцедуры // ЗаполнитьТаблицуИсторииЗвонков()

// Поиск строки по колонкам.
// 
Функция НайтиСтрокуИсторииПоКолонкам(Значение, Колонки, ИмяТаблицы = "ТЗИсторииЗвонковВременная")
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МассивКолонов = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок("" + Колонки);	
	Для каждого Звонок Из ЭтотОбъект[ИмяТаблицы] Цикл
		// обход имен колонок
		Для каждого текКолонка Из МассивКолонов Цикл
			// проверка совпадения
			Если ЗначениеЗаполнено(текКолонка) И СокрЛП(Звонок[текКолонка]) = СокрЛП(Значение) Тогда
				Возврат Звонок;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;    	
	
	Возврат Неопределено;
КонецФункции // НайтиСтрокуИсторииПоКолонкам()

// Получаем с сервера список отправленных принятных факсимильных сообщений
//
Процедура ЗаполнитьТаблицуФаксимильныхСообщений(ДатаНачала='00010101',ДатаОкончания='00010101',ТЗ=Неопределено) Экспорт
	Если ТЗ=Неопределено  
		И Метаданные.ОбщиеМодули.Найти("МИКО_Астериск_Сервер")<>Неопределено 
		Тогда  //Есть серверный модуль для прямой связи с базой данных астериска через ODBC
		ТЗ=Вычислить("МИКО_Астериск_Сервер.ВернутьЗаписиCDRПоФаксимильнымСообщениям(НачалоДня(ДатаНачала),КонецДня(ДатаОкончания))");
	ИначеЕсли ТЗ=Неопределено Тогда 	// используем последовательное чтение данных через userevent
		ТЗФаксовВременная.Очистить();
		ЗапроситьЗаписиCDRПоФаксимильнымСообщениям(НачалоДня(ДатаНачала),КонецДня(ДатаОкончания)+1);
		Состояние("Запрашиваем историю факсимильных сообщений на сервере.");
		Возврат;
	ИначеЕсли ТЗ.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	//Найдем список объектов подходящих для номеров в графах  dst и src
	Состояние("Определяем соответствие номеров телефонов и контактов из CRM.");
	
	НазначенияВызововdst=ТЗ.ВыгрузитьКолонку("dst");
	НазначенияВызововsrc=ТЗ.ВыгрузитьКолонку("src");
	
	ВремМассивНомеровЧислом = Новый Массив;
	Для каждого Вызов Из ТЗИсторииЗвонковВременная Цикл
		Номер1 = мОбработкаДанных.ПреобразоватьНомерДляСохранения(Вызов.dst, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Номер2 = мОбработкаДанных.ПреобразоватьНомерДляСохранения(Вызов.src, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Если Номер1<>0 Тогда
			ВремМассивНомеровЧислом.Добавить(Номер1);
		КонецЕсли; 
		Если Номер2<>0 Тогда
			ВремМассивНомеровЧислом.Добавить(Номер2);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьТаблицуИстории();
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НазначенияВызововdst", НазначенияВызововdst);
	Запрос.УстановитьПараметр("НазначенияВызововsrc", НазначенияВызововsrc);
	Запрос.УстановитьПараметр("ВремМассивНомеровЧислом", ВремМассивНомеровЧислом);
	
	Результат 	    = Запрос.Выполнить();
	СписокКонтактов = Результат.Выгрузить();
	
	// Найдем документы события привязанные к истории звонков по GUID
	МассивГуидов = ТЗ.ВыгрузитьКолонку("uniqueid");
	СпиосокДокументовСобытие = 	мОбщийМодуль.ПолучитьТаблицуСобытийПоGUID(МассивГуидов);
	
	ФаксимильныеСообщения.Очистить();
	
	Для к=0 по ТЗ.Количество()-1 Цикл
		Если ФаксимильныеСообщения.Найти(ТЗ[к].uniqueid,"ИдентификаторЗвонка")<> Неопределено тогда  // уже есть такая строчка
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ФаксимильныеСообщения.Добавить();
		НоваяСтрока.Когда				=	ТЗ[к].calldate;
		НоваяСтрока.ФайлФакса 			=	ТЗ[к].lastdata;  
		НоваяСтрока.ИдентификаторЗвонка	=	ТЗ[к].uniqueid;  
		Если ТЗ[к].lastapp="SendFAX" Тогда
			НоваяСтрока.ВходящийЗвонок=Ложь;	
			НоваяСтрока.НомерТелефона	=	ТЗ[к].dst;
		ИначеЕсли ТЗ[к].lastapp="ReceiveFAX"	Тогда
			НоваяСтрока.ВходящийЗвонок=Истина;
			НоваяСтрока.НомерТелефона	=	ТЗ[к].src;
		Иначе // чаще всего входящие 
			НоваяСтрока.ВходящийЗвонок=Истина;
			НоваяСтрока.НомерТелефона	=	ТЗ[к].src;
		КонецЕсли;
		
		// Попробуем заполнить контрагента и контактного лица
		СтрокаСКонтактом=СписокКонтактов.Найти(НоваяСтрока.НомерТелефона,"НомерТелефона");
		
		Если СтрокаСКонтактом<>Неопределено Тогда
			ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияСтрокиИстории(СтрокаСКонтактом);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения);
		КонецЕсли;
		
		// Попробуем заполнить событие к текущему звонку	
		СтрокаССобытием=СпиосокДокументовСобытие.Найти(НоваяСтрока.ИдентификаторЗвонка,"ИдентификаторЗвонка");
		Если СтрокаССобытием<>Неопределено Тогда
			НоваяСтрока.ДокументСобытие 		=	СтрокаССобытием.Ссылка;
		КонецЕсли;	
		
	КонецЦикла;			
	ФаксимильныеСообщения.Сортировать("Когда Убыв");
	
КонецПроцедуры //ЗаполнитьТаблицуФаксимильныхСообщений()

// В процедуре заполняется массив номеров для перевода звонков на текущего менеджера
//
Процедура ЗаполнитьСписокТелефоновДляПереводаНаОтветственного() Экспорт
	Если Не ПерехватЗвонкаОтветственным Тогда
		Возврат;	
	КонецЕсли; 
	
	мНомераТелефоновПоОтветственному = мОбщийМодуль.ПолучитьСписокНомеровДляПереводаНаОтветственного();
КонецПроцедуры	//ЗаполнитьСписокТелефоновДляПереводаНаОтветственного()

// Обработка события - оповещения о возможности перезвата
// Параметры
//   XMLУзел - тип - ЧтениеXML
// Возвращаемое значение
//   нет
Процедура ОбработатьПерехватНаОтветственного(XMLУзел)
	// Interception
	// При входящем звонке на АТС должно генерироваться пользовательское сообщение
	// UserEvent(Interception,CALLERID: ${CALLERID(num)},CHANNEL: ${CHANNEL},UNIQUEID: ${UNIQUEID},CONTEXT: ${CONTEXT}) //.
	channel = XMLУзел.ЗначениеАтрибута("channel");
	КаналВызывающегоАбонента = ?(ЗначениеЗаполнено(channel),channel,XMLУзел.ЗначениеАтрибута("chan1c"));
	Если НЕ ЗначениеЗаполнено(КаналВызывающегоАбонента) Тогда
		Возврат;
	КонецЕсли; 
	calleridnum				 = XMLУзел.ЗначениеАтрибута("callerid");
	context					 = XMLУзел.ЗначениеАтрибута("context");
	
	врНомерДляПоискаВТаблицеМаршрутизации = мОбработкаДанных.ПреобразоватьНомерДляСохранения(calleridnum, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
	врНомерДляПоискаВТаблицеМаршрутизации = ?(врНомерДляПоискаВТаблицеМаршрутизации = 0,calleridnum,врНомерДляПоискаВТаблицеМаршрутизации);
	// Сопоставлять будем по последним 9ти символам.
	НомерДляПоискаВТаблицеМаршрутизации   = врНомерДляПоискаВТаблицеМаршрутизации;
	СтрокаСотрудника=Сотрудники.Найти(мПользователь,"Сотрудник");
	
	Если СтрокаСотрудника = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СтрокаСотрудника.ВнутреннийНомер) Тогда
		Возврат;
	КонецЕсли;
	
	НомерПерехвата = ?(Звонки.Количество() = 0, СтрокаСотрудника.ВнутреннийНомер, RedirectNumber);
	Если ПерехватЗвонкаОтветственным 
		  И Найти(КаналВызывающегоАбонента,НашКаналФильтр)= 0									    	// 	
		  И ЗначениеЗаполнено(calleridnum)                            									// у звонка есть CallerID
		  И мНомераТелефоновПоОтветственному.Найти(НомерДляПоискаВТаблицеМаршрутизации)<>Неопределено  	// есть запись в личной таблице машрутизации
		  И Найти(context,КонтекстНабораПоУмолчанию)= 0													// звонок из внешнего транка	
		  И НЕ ЗначениеЗаполнено(ПолучитьПеременнуюКанала(КаналВызывающегоАбонента,"interception")) 	// пустое значение переменной перехвата
		 Тогда 
		 
		БезКонсультативныйПеревод_10000104(КаналВызывающегоАбонента, "10000104", КонтекстНабораСлужебныхКоманд);
		СообщитьОтладочнуюИнформацию("Перехват звонка из на ответственного менеджера ",calleridnum);
	КонецЕсли;	

КонецПроцедуры
 
// У текущего пользователя может быть несколько отслеживаемых номеров
//эти номера заносятся в массив и используются для отображения истории зыонков.
Процедура ЗаполнитьСписокНомеровТекущегоПользователя() Экспорт
	Запрос = мОбщийМодуль.ПолучитьЗапросЗаполнитьСписокНомеровТекущегоПользователя();
	
	Запрос.УстановитьПараметр("Объект",мПользователь);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	мСписокНомеровПользователяДляОбработки.Очистить();
	мСписокНомеровПользователяДляИстории.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(Выборка.НомерТелефона);
		Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если Выборка.Основной Тогда
			мСписокНомеровПользователяДляОбработки.Добавить(НомерТелефона);	
		КонецЕсли; 
		мСписокНомеровПользователяДляИстории.Добавить(НомерТелефона);	
	КонецЦикла; 
	
КонецПроцедуры  //ЗаполнитьСписокНомеровТекущегоПользователя()

// По переданной строке подбирает список из 20 похожих абонентов 
//
Функция НайтиСписокПодходящихОбъектовВызова(НомерАбонента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 20
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%"+НомерАбонента+"%");
	
	Результат = Запрос.Выполнить();
	ТЗ   = Результат.Выгрузить();
	
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Объект"));
	
	Возврат СписокОбъектов;
	
КонецФункции

// Сообщить отладочную информацию если включен режим отладки
//
// Параметры
//  Заголовок  - Строка - Заголовок информации для идентификации сообщения
//	Сообщение - Строка - Выводимое сообщение
//  ОписаниеОшибки  - Строка - Результат работы функции ИнформацияОбОшибке()
//
Процедура СообщитьОтладочнуюИнформацию(Заголовок,Сообщение,ОписаниеОшибки="")Экспорт
	
	Если Отладка Тогда
		Сообщить(Заголовок+" "+СокрЛП(Сообщение)+?(ЗначениеЗаполнено(ОписаниеОшибки)," ошибка: "+ОписаниеОшибки,""));		
	КонецЕсли; 
	
КонецПроцедуры // СообщитьОтладочнуюИнформацию()

// Если передан идентификатор звонка, то производится попытка поиска документа Событие с сохраненным идентификатором.
// Если событие не найдено, то по переданной структуре звонка (соответсвует табличной части история звонков) создается документ Событие.
// В любом случае, созданный или найденный документ открывается для заполнения пользователем.
//
// Параметры: 
//			 ИдентификаторЗвонка	-	Тип Строка 	- Строка с уникальным идентификатором звонка присваеваемым сервером телефонии при каждом новом 
// входящем или исходящем звонке
//           СтруктураЗвонка	-	Тип Структура 	- Соответствует одной строке из табличной части ИсторияЗвонков
//
// 
// Возвращаемое значение - НЕТ
//
Процедура ОткрытьСоздатьСобытие(ИдентификаторЗвонка,СтруктураЗвонка=Неопределено) Экспорт
	СсылкаНаДок = Неопределено;
	
	Если НЕ ИспользоватьAsterisk Тогда
		Если мОбщийМодуль.ЕстьДокументСобытие() И НЕ ИдентификаторЗвонка = Неопределено Тогда
			СсылкаНаДок = ИдентификаторЗвонка;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Событие.Ссылка
				|ИЗ
				|	Документ.Событие КАК Событие
				|ГДЕ
				|	Событие.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
			    СсылкаНаДок = Неопределено
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Запрос = мОбщийМодуль.ПолучитьЗапросСобытиеПоGUIDЗвонка();
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
			Запрос.УстановитьПараметр("CRM_GUIDЗвонка",ИдентификаторЗвонка);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
			 	СсылкаНаДок = Выборка.Ссылка;
			КонецЕсли; 
		КонецЕсли; 	
	КонецЕсли; 
	
	Если НЕ СсылкаНаДок = Неопределено Тогда
		ФормаДок=СсылкаНаДок.ПолучитьФорму();	  	  
		ФормаДок.Открыть();
	ИначеЕсли СтруктураЗвонка<>Неопределено тогда
		
		Попытка
			СтруктураТелефона = ПреобразоватьНомерСУчетомПрефиксов(СтруктураЗвонка.НомерТелефона, Истина);
			ДанныеЗаполнения  = мОбщийМодуль.ПолучитьДанныеЗаполненияСобытия(СтруктураЗвонка, ГлобальныеПеременные, СтруктураТелефона);
			
			// строго указываю 1 как входящий звонок, иначе номер не преобразуется в структуру
			СтруктураПараметров	=	ПреобразоватьНомерСУчетомПрефиксов(СтруктураЗвонка.НомерТелефона, 1);
			СтрокаПараметров	=	ПреобразоватьПараметрыВСтроку(СтруктураПараметров);
			
			ФормаСобытия = мОбщийМодуль.ПолучитьФормуСобытия(ФормаТелефон, СтрокаПараметров);
			Если мОбщийМодуль.ЕстьДокументСобытие() И ТипЗнч(ИдентификаторЗвонка) = Тип("ДокументСсылка.Событие") Тогда
				ФормаСобытия.ЭтотОбъект.УстановитьСсылкуНового(ИдентификаторЗвонка);
			КонецЕсли; 
			
			ФормаСобытия.Открыть();
			// Документ "Событие" / Начало
			Если ТипЗнч(СтруктураЗвонка) = Тип("Структура")
				И СтруктураЗвонка.Свойство("onBridge") Тогда
				СтруктураЗвонка.Канал1 = мОбработкаДанных.ОтсечьПлечоВLocal(СтруктураЗвонка.Канал1);
				СтруктураЗвонка.Канал2 = мОбработкаДанных.ОтсечьПлечоВLocal(СтруктураЗвонка.Канал2);
				КлючиУникальностиСобытий.Вставить(СтрокаПараметров, СтруктураЗвонка);
			КонецЕсли; 
			// Документ "Событие" / Конец
			ЗаполнитьЗначенияСвойств(ФормаСобытия, ДанныеЗаполнения);
			//
			ФормаСобытия.КлючУникальности = СтрокаПараметров;
			
			мОбщийМодуль.ОбновитьОтображениеФормыСобытия(ФормаСобытия);
			
		Исключение
			СообщитьОтладочнуюИнформацию("Исключение","Не удалось создать документ Событие: "+ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры //ОткрытьСоздатьСобытие()

// По переданной строке табличной части ФаксимильныеСообщения открывает на просмотр файл факсимильного сообщения
//
Процедура ПросмотретьТекущийФаксФайл(ТекущаяСтрока) Экспорт
	Если ТекущаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	СообщитьОтладочнуюИнформацию("Просматриваем файл ",ТекущаяСтрока.ФайлФакса);
	
	ЗапроситьФайлФаксаНаСкачивание(ТекущаяСтрока.ИдентификаторЗвонка);
	// результат придет в USEREVENT и если файл есть, он откроется.		
	
КонецПроцедуры //ПросмотретьТекущийФаксФайл()

// По переданной строке табличной части История звонков открывает на файл записи разговора
//
Процедура СкачатьЗаписьРазговора(ТекущаяСтрока) Экспорт
	
	Если ТекущаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	СообщитьОтладочнуюИнформацию("Просматриваем файл записи для разговора с идентификатором",ТекущаяСтрока.ИдентификаторЗвонка);
	Если НазваниеPBX = "MYPBX"
		 И ЗначениеЗаполнено(ТекущаяСтрока.ИмяФайла) Тогда
		 
		врСтроки = ЗаписиРазговоров.НайтиСтроки(Новый Структура("uniqueid", ТекущаяСтрока.ИдентификаторЗвонка));
		Если врСтроки.Количество()>1 Тогда
			ИменаФайлов = Новый Массив;
			Для каждого текСтрока Из врСтроки Цикл
				ИменаФайлов.Добавить(текСтрока.recordingfile)
			КонецЦикла; 
			
			ФормаВыбораФайлаЗаписи = ЭтотОбъект.ПолучитьФорму("ФормаВыбораФайлаЗаписи");
			ФормаВыбораФайлаЗаписи.Инициализировать(ИменаФайлов, Неопределено, "");
			Возврат;
		КонецЕсли; 
 
		ПолучитьФорму("custom_MyPBX").ПолучитьФайлЗаписи(ТекущаяСтрока.ИмяФайла);
	Иначе	
		ЗапроситьФайлЗаписиНаСкачивание(ТекущаяСтрока.ИдентификаторЗвонка);
	КонецЕсли;
	// результат придет в USEREVENT и если файл есть, он откроется.		
	
КонецПроцедуры	//СкачатьЗаписьРазговора()

// Производит заполнение всех номеров пользователей, табличной части сотрудников
// получает настройки Asterisk и устанавливает значения статусов сотрудников
Процедура ИнициализацияПанели() Экспорт
	
	Если  НЕ Компонент = Неопределено
		И НЕ Компонент.Enabled Тогда // не смогли залогиниться
		ОтключитьВК();	
	Иначе
		ПолучитьСведенияОЛицензировании();
		
		Состояние("Соединение с сервером телефнии " + Хост + ". Установлено!");
		НашКаналФильтр = "";
		
		// Узнаем с каким сервером Asterisk мы имеем дело 
		// установим контексты по умолчанию.
		УстановитьКонтекстыПоУмолчанию();
		
		// Для асинхронного получения хинтов с АТС
		ПолучитьНастройкиССервераAsterisk();
		ЗаполнитьСписокНомеровТекущегоПользователя();
		// Инициализируем список телефонов клиентов для перевода на текущего ответственного
		ЗаполнитьСписокТелефоновДляПереводаНаОтветственного();
	КонецЕсли; 
	Оповестить("ОбновитьОтображениеСтатусов");
	
КонецПроцедуры

// установка значений контекстов "по умолчанию"
// зависит от имени АТС
Процедура УстановитьКонтекстыПоУмолчанию() Экспорт
	
	НазваниеPBX =  ВРЕГ(ПолучитьПеременнуюКанала("","SYSTEMNAME"));
	Если Найти(НазваниеPBX,"ASKOZIA")>0 Тогда
		КонтекстНабораСлужебныхКоманд = "internal";
		КонтекстНабораПоУмолчанию	  = "internal";
		КонтекстДляКонсультативногоПеревода = КонтекстДляКонсультативногоПеревода;
	ИначеЕсли ВРЕГ(ПолучитьПеременнуюКанала("","MIKO_MyPBX")) = "MYPBX" Тогда
		НазваниеPBX = "MYPBX";
		КонтекстНабораСлужебныхКоманд = "miko_ajam";
		КонтекстНабораПоУмолчанию	  = "Local_Default_CallingRules";
		КонтекстДляКонсультативногоПеревода = "";
	Иначе
		КонтекстНабораСлужебныхКоманд = "miko_ajam";
		КонтекстНабораПоУмолчанию	  = "from-internal";
		КонтекстДляКонсультативногоПеревода = "from-internal-xfer";
	КонецЕсли; 
		
	врем_КонтекстДляКонсультативногоПеревода = ПолучитьПеременнуюКанала("", "TRANSFER_CONTEXT");
	Если ЗначениеЗаполнено(врем_КонтекстДляКонсультативногоПеревода) 
		 И НЕ врем_КонтекстДляКонсультативногоПеревода = "(null)" Тогда
		КонтекстДляКонсультативногоПеревода = врем_КонтекстДляКонсультативногоПеревода;
	КонецЕсли; 
	
КонецПроцедуры
 
/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВСПОМОГАТЕЛЬНЫЕ


// В конфигурации Трактиръ пользователь может быть из справочника сотрудники.
//
Функция ПолучитьИмяТекущегоПользователя() Экспорт
	
	Если Метаданные.Имя = "ТрактиръFrontOffice" И мОбщийМодуль <> Неопределено Тогда
		Возврат  Строка(мОбщийМодуль.ПолучитьТекущегоПользователя().Наименование);
	КонецЕсли;	
		
	Возврат ИмяПользователя();
		
КонецФункции

// По переданному вноутреннему номеру определяем пользователя и возвращаем, иначе Неопределено.
//
Функция ВернутьПользователяПоНомеруТелефона(НомерТелефона)
	
	Запрос = 	мОбщийМодуль.ПолучитьЗапросПользователяПоНомеруТелефона();
	Запрос.УстановитьПараметр("CRM_НомерТелефона",НомерТелефона );
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Пользователь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ВернутьПользователяПоНомеруТелефона()

// Определяем принадлежит ли указанный номер текущему пользователю системы. Номер пытаемся найти по подстроке.
//
Функция ЭтоНомерТекущегоПользователя(Знач СтрокаЗвонка,Знач СписокНомеровПользователяДляОбработки, УровеньРекурсии=0) Экспорт
	УровеньРекурсии = УровеньРекурсии + 1;
	Если УровеньРекурсии > 20 Тогда Возврат Ложь; КонецЕсли; 
	
	СтрокаЗвонка = ВРег(СтрокаЗвонка);	
	пНомер = ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(СтрокаЗвонка);
	Для каждого Номер Из СписокНомеровПользователяДляОбработки Цикл
		Если (СтрДлина(Номер) > 5 И Найти(СтрокаЗвонка,"/"+Номер)>0)
			ИЛИ Найти(Прав(СтрокаЗвонка, СтрДлина(Номер)+1), "/" + Номер) > 0
			ИЛИ ( Найти(СтрокаЗвонка, "/" + Номер + "@") > 0 И НЕ Найти(СтрокаЗвонка, "LOCAL/" + Номер + "@") > 0) 
			ИЛИ Найти(СтрокаЗвонка, "/" + Номер + "-") > 0
			ИЛИ Найти(СтрокаЗвонка,"/"+Номер+",") > 0 
			ИЛИ Найти(СтрокаЗвонка,"@@"+Номер+"@@") > 0
			Тогда
			
			Возврат Истина;
		ИначеЕсли пНомер = Номер И (Найти(СтрокаЗвонка, "SIP/" + Номер) ИЛИ Найти(СтрокаЗвонка, "IAX/" + Номер) 
					 				ИЛИ Найти(СтрокаЗвонка, "DAHDI/" + Номер) ИЛИ Найти(СтрокаЗвонка, "PJSIP/" + Номер)) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла;
	
	Если ТипЗнч(ТаблицаХинтов) <> Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	// для DAHDI особый подход
	Если ВРЕГ(Лев(СтрокаЗвонка, 6)) = "DAHDI/"  Тогда
		КаналDAHDI = Лев(СтрокаЗвонка,ПолучитьПозициюБлижнегоСимвола(СтрокаЗвонка, "@-,")-1);
	   	Хинт = ТаблицаХинтов.Найти(КаналDAHDI);
		Если НЕ Хинт = Неопределено Тогда
			Номер = Хинт.ВнутреннийНомер;
			Возврат ЭтоНомерТекущегоПользователя("@@"+Номер+"@@",СписокНомеровПользователяДляОбработки, УровеньРекурсии);
		КонецЕсли; 
	КонецЕсли; 
	
	// прочие, внутренние каналы, описанные в хинтах
	// Пример: SIP/160-32-00000ce, где SIP/160-32 - hint, 160-32 - имя учетной записи SIP 
	Для каждого Хинт Из ТаблицаХинтов Цикл
		Если НЕ ЗначениеЗаполнено(Хинт.Канал) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Найти(СтрокаЗвонка, Врег(Хинт.Канал))>0 Тогда
			Номер = Хинт.ВнутреннийНомер;
			Возврат ЭтоНомерТекущегоПользователя("@@"+Номер+"@@",СписокНомеровПользователяДляОбработки, УровеньРекурсии);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции // ЭтоНомерТекущегоПользователя()

// Определяем принадлежит ли указанный номер текущему пользователю системы. Номер пытаемся найти по подстроке.
//
Функция ЭтоЛокальныйНомерТекущегоПользователя(Знач СтрокаЗвонка,СписокНомеровПользователяДляОбработки)
	СтрокаЗвонка = ВРег(СтрокаЗвонка);	
	Для каждого Номер Из СписокНомеровПользователяДляОбработки Цикл
		Если Найти(СтрокаЗвонка, "LOCAL/" + Номер + "@") > 0 Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции // 

// Функция разбирает переданный номер телефона или структуру содержащую поля номера телефона в зависимости
//  от того какой это звонок входящий или исходящих. Если входящий звонок, то передается строка с номером телефона
//  а возвращаем структуру содержащую поля номера телефона. Так же проверяем если звонок внутренний, то сохраняем номер
//  как внутренний, иначе передаем его как есть, пользователь разберет номер в ручную.
//  Если звонок исходящий то получаем структуру в качестве номера, 
//а возвращаем преобразованную строку которую будет набирать станция.
Функция ПреобразоватьНомерСУчетомПрефиксов(Знач НомерТелефона, Знач ВходящийЗвонок) Экспорт 
	
	// Подготавливаем структуру номера телефона который будем возвращать при входящем звонке
	// при исходящем будем возвращать строку с номером телефона
	РезультатНомер = мОбработкаДанных.СформироватьСтруктуруНомераИзПолей();
	
	// Обрабатываем входящий звонок
	Если ВходящийЗвонок И ТипЗнч(НомерТелефона) = Тип("Строка") Тогда
		
		НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		// Если состояние звонка является внутренним номером, то никаких префиксов подставлять не нужно 
		//  просто сразу возвращаем номер телефона, структуру смотрим в ВидыВходящихИсходящихСобытий
		Если ОпределитьВнутреннийВнешнийЗвонок(НомерТелефона) = ТипВнутреннийВнешнийЗвонок.Внутренний Тогда
			РезультатНомер.Внутренний = НомерТелефона;
		Иначе
			// Если длина телефона не равна 7 цифрам, то номер разложим следующим
			// образом, 7 последних это телефон, остальное код.
			Если СтрДлина(НомерТелефона) <= 7 Тогда
				РезультатНомер.НомерТелефона = НомерТелефона;
			Иначе
				РезультатНомер.НомерТелефона = Прав(НомерТелефона, 7);
				РезультатНомер.КодГорода	 = Лев(НомерТелефона, СтрДлина(НомерТелефона) - 7);
				Если Лев(РезультатНомер.КодГорода,1)="7" тогда
					РезультатНомер.КодГорода	 = Прав(РезультатНомер.КодГорода, СтрДлина(РезультатНомер.КодГорода) - 1); 
				КонецЕсли;
				
				врДлинаНомера = СтрДлина(РезультатНомер.НомерТелефона + РезультатНомер.КодГорода);
				РезультатНомер.КодСтраны = Лев(НомерТелефона, СтрДлина(НомерТелефона) - врДлинаНомера);
				
				Если НЕ ЗначениеЗаполнено(РезультатНомер.КодСтраны) Тогда
					РезультатНомер.КодСтраны     = ГлобальныеПеременные.глКодСтраны;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		// Сформируем представление
		мОбработкаДанных.СформироватьПредставлениеТелефонаПоСтруктуре(РезультатНомер);
		
		// Обрабатываем исходящий звонок
	ИначеЕсли НЕ ВходящийЗвонок И ТипЗнч(НомерТелефона) = Тип("Структура") Тогда 
		// "чистый" номер телефона без префпксов и доп кодов
		врНомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона.НомерТелефона);
		// Необходимо позвонить по внутреннему номер, префиксы не нужны
		Если (ЗначениеЗаполнено(НомерТелефона.Внутренний) И НЕ ЗначениеЗаполнено(врНомерТелефона))
			Или (ЗначениеЗаполнено(врНомерТелефона) И НЕ ЗначениеЗаполнено(НомерТелефона.Внутренний) 
			И СтрДлина(врНомерТелефона) <= ГлобальныеПеременные.глМаксимальнаяДлинаВнутреннегоНомера) Тогда
			
			РезультатНомер = ?(НЕ ЗначениеЗаполнено(НомерТелефона.Внутренний), врНомерТелефона, НомерТелефона.Внутренний);
		Иначе
			Если ЗначениеЗаполнено(врНомерТелефона) Тогда
				КодСтраныНомера = ?(СокрЛП(НомерТелефона.КодСтраны) = "8", "7", СтрЗаменить(НомерТелефона.КодСтраны, "+", ""));
				КодГородаНомера = НомерТелефона.КодГорода;
				КодСтраныБезПлюса = СтрЗаменить(ГлобальныеПеременные.глКодСтраны, "+", "");
				
				// если не внутренний то необходимо использовать префиксы, либо выхода в город либо выхода на межгород
				// 1. Если это наш город и страна, то просто префикс выхода в город
				Если (КодСтраныНомера = КодСтраныБезПлюса ИЛИ ПустаяСтрока(КодСтраныНомера)) // наша страна 
					И (КодГородаНомера = ГлобальныеПеременные.глКодГорода ИЛИ ПустаяСтрока(КодГородаНомера)) // нащ город 
					Тогда
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаВГород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
					// 2. Если это не наш город, но наша страна, то выход на межгород
				ИначеЕсли (НЕ КодГородаНомера = ГлобальныеПеременные.глКодГорода И НЕ ПустаяСтрока(КодГородаНомера)) // Чужой город
					И (КодСтраныНомера = КодСтраныБезПлюса ИЛИ ПустаяСтрока(КодСтраныНомера))                  // наша страна
					Тогда
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаНаМежгород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
					// 3. Если это не наша страна, то международный звонок.
				Иначе
					РезультатНомер = ГлобальныеПеременные.глПрефиксВыходаНаМежгород + КодСтраныНомера + КодГородаНомера + врНомерТелефона;
				КонецЕсли;
			Иначе
				РезультатНомер = "";		
			КонецЕсли;
		КонецЕсли;
		
		РезультатНомер = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(РезультатНомер);
	КонецЕсли;
	Возврат РезультатНомер;
КонецФункции

// Функция определяет и возвращает какой это звонок внутренний или внешний.
//
Функция ОпределитьВнутреннийВнешнийЗвонок(НомерТелефона) Экспорт
	Если мОбработкаДанных.ОпределитьВнутреннийЗвонокПоНомеру(НомерТелефона, ГлобальныеПеременные.глМаксимальнаяДлинаВнутреннегоНомера) Тогда
		Возврат ТипВнутреннийВнешнийЗвонок.Внутренний; // 1
	Иначе
		Возврат ТипВнутреннийВнешнийЗвонок.Внешний;    // 0
	КонецЕсли; 
КонецФункции

// Анализ строки, поиск имен файлов записей разговоров.
// 
Функция ПолучитьИменаФайловИзстроки(ИмяФайлаЗаписиРазговора) Экспорт

	врИменаФайлов = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(ИмяФайлаЗаписиРазговора, "@.@");
	ИменаФайлов = Новый Массив;
	Для каждого текИмя Из врИменаФайлов Цикл
		Если ИменаФайлов.Найти(текИмя)=Неопределено Тогда
			ИменаФайлов.Добавить(текИмя);
		КонецЕсли; 
	КонецЦикла; 
	Возврат ИменаФайлов;
КонецФункции // ПолучитьИменаФайловИзстроки()
 
// Для переданного звонка определяем контрагента и контактное лицо по номеру, и заполняем
//соответсвующие строки в таблице звонков
Процедура ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(ТекущийЗвонок = Неопределено) Экспорт 
	Если ТекущийЗвонок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаКЭШ = ТЗ_КЭШ_КИ.Найти(ТекущийЗвонок.CallerID, "CallerID");
	Если НЕ СтрокаКЭШ = Неопределено И СтрокаКЭШ.ДатаАктуальности > ТекущаяДата() Тогда
		ЗаполнитьЗначенияСвойств(ТекущийЗвонок, СтрокаКЭШ);
		Возврат;	
	ИначеЕсли НЕ СтрокаКЭШ = Неопределено Тогда
		// Кэш не аткуален
		ТЗ_КЭШ_КИ.Удалить(СтрокаКЭШ);	
	КонецЕсли; 
	
	CallerID = СокрЛП(ТекущийЗвонок.CallerID);
	Если "CDR_RECORDS" = CallerID Тогда	
		ТекущийЗвонок.Контрагент		=	"Прослушивание записи";
		ТекущийЗвонок.КонтактноеЛицо	=	"";
	  	Возврат;
	КонецЕсли; 
	// Город абонента / начало
	Если НЕ ОпределитьВнутреннийВнешнийЗвонок(CallerID) = ТипВнутреннийВнешнийЗвонок.Внутренний Тогда
		СтруктураОтвета 	= ПолучитьДанныеОбАбоненте(CallerID);
		ЗаполнитьЗначенияСвойств(ТекущийЗвонок, СтруктураОтвета);
	КонецЕсли;
	// Город абонента / конец
	
	Запрос = мОбщийМодуль.ПолучитьЗапросОпределитьКонтрагентаКонтактногоЛицаПоНомеру(ТекущийЗвонок.Контрагент);
	Если Найти(ТекущийЗвонок.Контрагент, "Skype:") Тогда
		ТелДляПоиска= СтрЗаменить(CallerID,"Skype:","");
	Иначе	
		ТелДляПоиска = мОбработкаДанных.ПреобразоватьНомерДляСохранения(CallerID, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Если ТелДляПоиска = 0 Тогда Возврат; КонецЕсли; 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТелефонДляПоиска", ТелДляПоиска);
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать();
	
	РезультатНайден = Выборка.Следующий();
	Если НЕ РезультатНайден 		
		 И СтрДлина(CallerID) > 4 И СтрДлина(CallerID) < 8 
		 И ЗначениеЗаполнено(ГлобальныеПеременные.глКодГорода) Тогда
		 
		врCallerID = "" + ГлобальныеПеременные.глКодСтраны + ГлобальныеПеременные.глКодГорода + CallerID;
		ТелДляПоиска = мОбработкаДанных.ПреобразоватьНомерДляСохранения(врCallerID, ГлобальныеПеременные.глКоличествоХранимыхЦифрТелефона);
		Запрос.УстановитьПараметр("ТелефонДляПоиска", ТелДляПоиска);
		Результат 		= Запрос.Выполнить();
		Выборка 		= Результат.Выбрать();
		РезультатНайден = Выборка.Следующий();
	
	КонецЕсли; 
	
	
	ТекущийЗвонок.Контрагент		=	"Неизвестный контрагент";
	ТекущийЗвонок.КонтактноеЛицо	=	"";
	
	Если РезультатНайден Тогда 
		ДанныеЗаполнения = мОбщийМодуль.ПолучитьДанныеЗаполненияОпределитьКонтрагентаКонтактногоЛицаПоНомеру(Выборка);
		ЗаполнитьЗначенияСвойств(ТекущийЗвонок, ДанныеЗаполнения);
	Иначе
		// Для внутренних номеров поищим в таблице сотрудников
		Для каждого ТекущийСотрудник Из Сотрудники Цикл
			Если ТекущийСотрудник.ВнутреннийНомер = CallerID
				ИЛИ Найти(ТекущийСотрудник.КаналСотрудника, СокрЛП(CallerID))>0 Тогда
				ТекущийЗвонок.Контрагент		=	ТекущийСотрудник.Сотрудник;
				ТекущийЗвонок.КонтактноеЛицо	=	"-< сотрудник >-";
				Прервать;
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
	
	СтрокаКЭШ = ТЗ_КЭШ_КИ.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКЭШ, ТекущийЗвонок);
	СтрокаКЭШ.ДатаАктуальности = ТекущаяДата()+120; // Две минуты актуальность ХЭШ.
	
Конецпроцедуры	

// Поиск абонента по части наименования.
// 
Функция НайтиАбонентаПоИмени(ИмяАбонента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросПоискПоИмени();
	Запрос.УстановитьПараметр("ЗначениеОтбора", "%" + ИмяАбонента + "%");
	РезультатЗапроса = Запрос.Выполнить();
	
	Список = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.НомерТелефона <> "" Тогда
				Список.Добавить(Новый Структура("Абонент,НомерТелефона,Владелец", Выборка.Ссылка, Выборка.НомерТелефона, Выборка.Владелец));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Список;
	
КонецФункции // НайтиАбонентаПоИмени()
// Формирует текст запроса для поиска контакта по части имени абонента.
// Параметры
//   ПараметрыКонфигурации - текущие настройки / свойства конфигурации
// Возвращаемое значение
//   Текст запроса к базе данных. Тип - строка.
//
Функция ЗапросПоискПоИмени()
	ТекстОбъединить = "		
					  |ОБЪЕДИНИТЬ ВСЕ
					  |";

	ТекстЗапроса = 	"ВЫБРАТЬ ПЕРВЫЕ 5
		|	СпрКонтакт.Ссылка,
		|	"""" КАК Владелец
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Контрагенты КАК СпрКонтакт
		|ГДЕ
		|	СпрКонтакт.ПометкаУдаления = ЛОЖЬ
		|	И СпрКонтакт.Наименование ПОДОБНО &ЗначениеОтбора
		|";
	
	КонтактныеЛицаКонтрагентов = Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов");
	Если КонтактныеЛицаКонтрагентов <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда ТекстЗапроса = ТекстЗапроса+ТекстОбъединить; КонецЕсли; 
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 5
			|	СпрКонтакт.Ссылка,
			|	СпрКонтакт.Владелец КАК Владелец
			|ИЗ
			|	Справочник.КонтактныеЛицаКонтрагентов КАК СпрКонтакт
			|ГДЕ
			|	СпрКонтакт.ПометкаУдаления = ЛОЖЬ
			|	И СпрКонтакт.Наименование ПОДОБНО &ЗначениеОтбора
			|";
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Пользователи") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда ТекстЗапроса = ТекстЗапроса+ТекстОбъединить; КонецЕсли; 
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 5
			|	СпрКонтакт.Ссылка,
			|	"""" КАК Владелец
			|ИЗ
			|	Справочник.Пользователи КАК СпрКонтакт
			|ГДЕ
			|	СпрКонтакт.ПометкаУдаления = ЛОЖЬ
			|	И СпрКонтакт.Наименование ПОДОБНО &ЗначениеОтбора
			|";
	КонецЕсли;
	
	КонтактныеЛица = Метаданные.Справочники.Найти("КонтактныеЛица");
	Если КонтактныеЛица <> Неопределено 
		 И КонтактныеЛица.Реквизиты.Найти("ОбъектВладелец")<>Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда ТекстЗапроса = ТекстЗапроса+ТекстОбъединить; КонецЕсли; 
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 5
			|	СпрКонтакт.Ссылка,
			|	СпрКонтакт.ОбъектВладелец КАК Владелец
			|ИЗ
			|	Справочник.КонтактныеЛица КАК СпрКонтакт
			|ГДЕ
			|	СпрКонтакт.ПометкаУдаления = ЛОЖЬ
			|	И СпрКонтакт.Наименование ПОДОБНО &ЗначениеОтбора
			|";
	КонецЕсли;

	КонтактныеЛица = Метаданные.Справочники.Найти("Организации");
	Если КонтактныеЛица <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда ТекстЗапроса = ТекстЗапроса+ТекстОбъединить; КонецЕсли; 
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ ПЕРВЫЕ 5
			|	СпрКонтакт.Ссылка,
			|	"""" КАК Владелец
			|ИЗ
			|	Справочник.Организации КАК СпрКонтакт
			|ГДЕ
			|	СпрКонтакт.ПометкаУдаления = ЛОЖЬ
			|	И СпрКонтакт.Наименование ПОДОБНО &ЗначениеОтбора
			|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +  
		";
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка,
		|	ВТ.Владелец,
		|	"""" + КонтактнаяИнформация.Поле1 + КонтактнаяИнформация.Поле2 + КонтактнаяИнформация.Поле3 КАК НомерТелефона
		|ИЗ
		|	ВТ КАК ВТ
		|		Внутреннее СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ВТ.Ссылка = КонтактнаяИнформация.Объект
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	
	Возврат ТекстЗапроса;
КонецФункции // ЗапросПоискПоИмени()

// По номеру строки определяет текущий актривный канал абонента, пользователя 1С:CRM
//
Функция ПолучитьАктивныйКанал(НомерСтроки)
	ТекСтрокаЗвоноков=Звонки[НомерСтроки-1];
	Если ТекСтрокаЗвоноков.ВходящийЗвонок Тогда
		Возврат ТекСтрокаЗвоноков.Канал2;
	Иначе	
		Возврат ТекСтрокаЗвоноков.Канал1;
	КонецЕсли;
КонецФункции	

// По переданному уникальному идентификатору производится поиск звонков в табличной части звонки, 
// при условии, что совпадает левая часть идентификатора перед точкой.
//
// Параметры:
// 			УИД	-	Строка	-	Уникальный идентификатор звонка
//		
//Возвращаемое значение:
//			Строка из табличной части звонки или Неопределено
//
Функция ПолучитьСтрокиЗвонкаПоУникальномуИдентификатору(УИД)
	
	МассивЗвонков=Новый Массив;
	Для каждого Звонок Из Звонки Цикл
		Если 	Найти(Звонок.UniqueID1, УИД) 
			ИЛИ Найти(Звонок.UniqueID2, УИД) Тогда
			МассивЗвонков.Добавить(Звонок);
		КонецЕсли; 
	КонецЦикла;    	
	
	Возврат МассивЗвонков;
КонецФункции // ПолучитьСтрокиЗвонкаПоУникальномуИдентификатору()

// Добавляет строку в таблицу звонков, после чего оповещяет основную форму обработки 
// 
Функция ДобавитьСтрокуЗвонка() Экспорт
	СтрокаЗвонка = Звонки.Добавить();
	СтрокаЗвонка.АвтоПодъемВозможен = Истина;	
	// передаем управление в основную форму обработки
	Оповестить("ОбновитьТаблицуПропущенных");
	Возврат СтрокаЗвонка;
КонецФункции // ДобавитьСтрокуЗвонка()

// Удаляет строку из таблицы звонков, после чеого оповещает основную форму обработки
//
Процедура УдалитьСтрокуЗвонкаПоИндексу(ИндексСтроки) Экспорт
	Если ТипЗнч(ИндексСтроки) = Тип("Число") Тогда
		МаксимальныйИндекс = Звонки.Количество() - 1;
		Если ИндексСтроки > МаксимальныйИндекс Тогда
			// ошибочная ситуация
			Возврат;
		КонецЕсли;
		СтрочкаЗвонка = Звонки.Получить(ИндексСтроки);
	Иначе
		СтрочкаЗвонка = ИндексСтроки;
	КонецЕсли;
	Звонки.Удалить(СтрочкаЗвонка);
	// передаем управление в основную форму обработки
	Оповестить("ОбновитьТаблицуПропущенных");
		
КонецПроцедуры

// Добавляет, либо обновляет строку в таблице пропущенных вызовов
// 
Процедура ОбновитьСтрокуПропущенного(CDR, ВходящийЗвонок=Истина)
	
	//	CDR.src			=	XMLУзел.ЗначениеАтрибута("source");
	//	CDR.dst			=	XMLУзел.ЗначениеАтрибута("destination");
	//	CDR.channel		=	XMLУзел.ЗначениеАтрибута("channel");
	//	CDR.dstchannel	=	XMLУзел.ЗначениеАтрибута("destinationchannel");
	//	CDR.calldate	=	СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLУзел.ЗначениеАтрибута("starttime"),"-",""),":","")," ","");
	//	CDR.billsec		=	XMLУзел.ЗначениеАтрибута("billableseconds");
	//	CDR.disposition	=	XMLУзел.ЗначениеАтрибута("disposition");
	//	CDR.uniqueid	=	XMLУзел.ЗначениеАтрибута("uniqueid");
	ВхПропущенный = ВходящийЗвонок И ( НЕ CDR.disposition = "ANSWERED"
									   ИЛИ (CDR.disposition = "ANSWERED" И CDR.lastapp="VOICEMAIL"));
	Если ВхПропущенный Тогда
		
		CallerID = СокрЛП(CDR.src);
		МассивПропущенного = ПропущенныеЗвонки.НайтиСтроки(Новый Структура("НомерТелефона",CallerID));
		
		ДатаЗвонка = Формат(ТекущаяДата(), "ДФ=HH:mm");
		Если МассивПропущенного.Количество() = 0 Тогда
			СтрокаПропущенного						= ПропущенныеЗвонки.Добавить();
			СтрокаПропущенного.НомерТелефона		= CallerID;     
			СтрокаПропущенного.CallerID				= CallerID;
			// СтрокаПропущенного.Контрагент			= CallerID;
			СтрокаПропущенного.Когда 				= ДатаЗвонка;
			СтрокаПропущенного.ИдентификаторЗвонка  = мОбработкаДанных.УбратьРасширениеВФайлеЗаписи(СокрЛП(CDR.uniqueid));
			СтрокаПропущенного.Количество			= 1;
			ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрокаПропущенного);
		ИначеЕсли Найти(МассивПропущенного[0].Когда, ДатаЗвонка) = 0 Тогда
			СтрокаПропущенного = МассивПропущенного[0];
			
			uniqueid = мОбработкаДанных.УбратьРасширениеВФайлеЗаписи(CDR.uniqueid);
			ОтборUniqueid = Новый Структура("ИдентификаторЗвонка",uniqueid);
			Если ПропущенныеЗвонки.НайтиСтроки(ОтборUniqueid).Количество() = 0 Тогда
				СтрокаПропущенного.Когда 				= СтрокаПропущенного.Когда + ", " + ДатаЗвонка;
				СтрокаПропущенного.Количество			= СтрокаПропущенного.Количество + 1;
				СтрокаПропущенного.ИдентификаторЗвонка  = uniqueid;
			КонецЕсли;
			ОпределитьКонтрагентаКонтактногоЛицаПоНомеру(СтрокаПропущенного);
		КонецЕсли; 
		Если НЕ СтрокаПропущенного = Неопределено Тогда
			//                                      
			СтрокаПропущенного.ИдентификаторЗвонка = СтрокаПропущенного.ИдентификаторЗвонка + CDR.uniqueid;
		КонецЕсли; 
		Оповестить("ОбновитьТаблицуПропущенных");
	ИначеЕсли CDR.disposition = "ANSWERED" Тогда	
		мОбработкаДанных.УдалитьСтрокуПропущенного(CDR.uniqueid);
	КонецЕсли; 
	
КонецПроцедуры

// Вычисление шестнадцатиричного значения числа
//
Функция hex(Знач Значение)
	Значение=Число(Значение);
	Если Значение<=0 Тогда
		Результат="0";
	Иначе
		Значение=Цел(Значение);
		Результат="";
		Пока Значение>0 Цикл
			Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
			Значение=Цел(Значение/16) ;
		КонецЦикла;
	КонецЕсли;
	Если СтрДлина(Результат) < 2 Тогда
		
		Результат = "0" + Результат;
		
	КонецЕсли;
	Возврат "%" + Результат;
КонецФункции

// Преобразование переданной строки в URLencoded версию
//
Функция URLEncode(URL)
    Рез = "";
    Для Сч = 1 По СтрДлина(URL) Цикл

        ch = Сред(URL,Сч,1);
        vch = КодСимвола(ch);
        Если (vch = 8470)  Тогда                            //Number    
            Рез = Рез + "%E2%84%96";    
        ИначеЕсли ("A" <= ch ) И ( ch <= "Z") Тогда        // "A".."Z" 
            Рез = Рез + ch;
        ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда    // "a".."z" 
            Рез = Рез + ch;
        ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда    // "0".."9" 
            Рез = Рез + ch;
        ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда            // space
            Рез = Рез + "%20";
        ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") Тогда        // unreserved
            // ch == '.' || ch == '!'
            // ch == '~' || ch == '*'
            // ch == '\'' || ch == '('
            // ch == ')') Тогда
            Рез = Рез + ch;
        ИначеЕсли (vch <= 127) Тогда        // other ASCII
            Рез = Рез + hex(vch);
        ИначеЕсли (vch <= 2047) Тогда        // non-ASCII <= 0x7FF
            Рез = Рез + hex(192 + Цел(vch / 64));
            Рез = Рез + hex(128 + (vch % 64));
        Иначе                    // 0x7FF < ch <= 0xFFFF
            Рез = Рез + hex(224 + Цел(vch / 4096));
            Рез = Рез + hex(128 + (Цел(vch / 64) % 64));
            Рез = Рез + hex(128 + (vch % 64));
        КонецЕсли;
    КонецЦикла;

    Возврат Рез;
КонецФункции // URLEncode()

// Отправка статистической информации в МИКО
// 
Процедура SendMetrikaStat(врКомпонент) Экспорт
	Если врКомпонент = Неопределено Тогда
		SDK = Компонент;
	Иначе
		SDK = врКомпонент;
	КонецЕсли;
	Если ОтправилиМетрику = Истина ИЛИ SDK=Неопределено Тогда
	 	Возврат;
	КонецЕсли; 
	
	Metrika = Новый Структура;
    Metrika.Вставить("Конфигурация", Метаданные.Имя);
    Metrika.Вставить("РежимЗапуска", Метаданные.ОсновнойРежимЗапуска);
	
	Система = Новый СистемнаяИнформация;
    Metrika.Вставить("Платформа", 	  	Система.ВерсияПриложения);
	Metrika.Вставить("ТипПлатформы", 	Система.ТипПлатформы);
	Metrika.Вставить("ВерсияОС",  	  	Система.ВерсияОС);
	
	ДанныеСтатистики = Новый Соответствие;
	ДанныеСтатистики.Вставить("platform1c",		Metrika.Платформа);
	ДанныеСтатистики.Вставить("PBXname",		НазваниеPBX);
	ДанныеСтатистики.Вставить("DialplanVer",	ВерсияДиалплана);
	ДанныеСтатистики.Вставить("SoftPhone",  	ВидСофтфонаПользователя);
	ДанныеСтатистики.Вставить("config1c",		Metrika.Конфигурация);
	ДанныеСтатистики.Вставить("DefaultRunMode",	Metrika.РежимЗапуска);
	ДанныеСтатистики.Вставить("PlatformType",	Metrika.ТипПлатформы);
	ДанныеСтатистики.Вставить("OSVersion",		Metrika.ВерсияОС);
	ДанныеСтатистики.Вставить("pt1c_Version",	Версия());
	
	Если ИспользоватьСофтфон = Истина Тогда
		ДанныеСтатистики.Вставить("SIPMode","On");
	Иначе
		ДанныеСтатистики.Вставить("SIPMode","Off");
	КонецЕсли;
	Если ИспользоватьAsterisk Тогда
		ДанныеСтатистики.Вставить("AsteriskMode","On");
	Иначе
		ДанныеСтатистики.Вставить("AsteriskMode","Off");
	КонецЕсли;
	Если ИспользоватьБаннер = Истина Тогда
		ДанныеСтатистики.Вставить("webkit_mode","On");
	Иначе	
		ДанныеСтатистики.Вставить("webkit_mode","Off");
	КонецЕсли; 
	ДанныеСтатистики.Вставить("other","");
	
	Данные = "<metrika>";
	Для каждого ТекПараметр Из ДанныеСтатистики Цикл
		Если ЗначениеЗаполнено(ТекПараметр.Значение) Тогда
			Данные = Данные+Символы.ПС+"<param name="""+ТекПараметр.Ключ+""" value="""+ЭкранироватьСпецСимволыXML(ТекПараметр.Значение)+"""/>";
		КонецЕсли; 
	КонецЦикла; 

	Данные = Данные+"</metrika>";
	Данные = URLEncode(Данные);
	
	Попытка
		SDK.SendMetrika(Данные);
		ОтправилиМетрику = Истина;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Ищем в списке сотрудника с соответсвующим каналом и устанавливаем ему состояние
//
Процедура ОбновитьСостояниеСотрудника(Канал,Состояние) Экспорт
	Для каждого СтрочкаСотрудники Из Сотрудники Цикл
		
		Если ЗначениеЗаполнено(СтрочкаСотрудники.КаналСотрудника)
			И Найти(Канал,СтрочкаСотрудники.КаналСотрудника)>0	Тогда
			
			Если Состояние = СостояниеЭкстеншена.Свободен
				 ИЛИ Состояние = СостояниеЭкстеншена.Недоступен Тогда
				СтрочкаСотрудники.Собеседник = "";
			КонецЕсли;
			                                         
			Если НЕ ИспользоватьAsterisk И (Состояние = СостояниеЭкстеншена.ИдетВхЗвонок) Тогда
				СтрочкаСотрудники.Ringing = Истина;
				Продолжить;
			ИначеЕсли ИспользоватьAsterisk 
					  И (Состояние = СостояниеЭкстеншена.ИдетВхЗвонок ИЛИ Состояние = СостояниеЭкстеншена.Разговаривает) Тогда
				СтрочкаСотрудники.Ringing = Истина;
				Продолжить;
			КонецЕсли;
			
			СтрочкаСотрудники.Ringing = Ложь;
			СтрочкаСотрудники.Состояние=Состояние;
			
			// Оповестим формы об изменении
			Если СтрочкаСотрудники.Сотрудник = мПользователь Тогда
				// Обновление состояние нащего номера
				Оповестить("ОбновитьОтображениеСтатусов");
			КонецЕсли;

		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

// Отправить файл Источник на виртуальный принтер и 
// сохранить результат (tiff grayscale) его преобразования в Назначение
// Ждать создания файла 10 циклов.
Функция ПодготовитьPDFФайлДляОтправки(ИмяФайлаТабДок)
	
	ТекущаяДатаВФормате=Формат(ТекущаяДата(),"ДФ=ddMMyyhhmmss");
	ИмяФайла = КаталогВременныхФайлов()+СтрЗаменить(НашКаналФильтр,"/","-")+ТекущаяДатаВФормате+"-fax";
	
	Если ТипЗнч(ИмяФайлаТабДок)=Тип("Строка") Тогда
		Если Прав(ИмяФайлаТабДок, 4) = ".tif" Тогда
			// перобразование tif To pdf не требуется
			ИмяФайла = ИмяФайла+".tif";
		Иначе
			ИмяФайла = ИмяФайла+".pdf";
			ИмяФайлаДляОтправки	= ПреобразоватьPDFвTIF(ИмяФайла);                     
		КонецЕсли;
		
		КопироватьФайл(ИмяФайлаТабДок,ИмяФайла);
		Возврат ИмяФайла;
	ИначеЕсли ТипЗнч(ИмяФайлаТабДок)=Тип("ТабличныйДокумент")
		ИЛИ ТипЗнч(ИмяФайлаТабДок)=Тип("ПолеТабличногоДокумента") Тогда
		ИмяФайла = ИмяФайла+".pdf";
		ИмяФайлаТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		Возврат ИмяФайла;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции // ПодготовитьPDFФайлДляОтправки()

// При помощи библиотеки GHOSTSCRIPT конвертируем PDF в Tif 
// рекомендуется использование последней версии библиотеки ghostscript 
// программа для установки доступна по ссылке 
//  Для 32 битной системы
//  	http://downloads.ghostscript.com/public/gs905w32.exe 
//  Для 64 битной системы
//		http://downloads.ghostscript.com/public/gs905w64.exe
//
Функция ПреобразоватьPDFвTIF(ИмяФайлаPDF)
	
	Если GhostScriptУстановленНаAsterisk  Тогда  //конвертация на стороне сервера Asterisk
		Возврат ИмяФайлаPDF;
	КонецЕсли; 
	
	Система = Новый СистемнаяИнформация;
	Shell = Новый COMОбъект("WScript.Shell");
	ПапкаProgramFiles = Shell.ExpandEnvironmentStrings("%ProgramFiles%");
	
	ИмяФайлаGhostScript = ПолучитьПутьКИсполняемомуфайлуGhostScript(ПапкаProgramFiles);
	Если ИмяФайлаGhostScript = "" Тогда
		СообщитьОтладочнуюИнформацию("Отправка факсов: ", "в каталоге ""%ProgramFiles%\gs\"" найден исполняемый файл GhostScript.");
		Возврат Неопределено;
	КонецЕсли; 
	ИмяФайлаTif = мОбработкаДанных.УбратьРасширениеВФайлеЗаписи(ИмяФайлаPDF)+".tif";
	
	// При использовании КомандаСистемы и ЗапуститьПриложение уходит фокус с окна 1С,
	// WScript  позволяет выполнить все в фоне.
	Shell.Run("cmd /c """+ИмяФайлаGhostScript+""" -q -dNOPAUSE -dBATCH -dSAFER -sDEVICE=tiffg3 -sOutputFile="+ИмяФайлаTif+" -f "+ИмяФайлаPDF, 0);
	
	ФС=Новый Файл(ИмяФайлаTif);
	
	СтопКран = 0;
	Пока НЕ ФС.Существует() И СтопКран<50000  Цикл // если ваша система очень медленно создает нужный tif то можно попробовать увеличить цифру 50000
		СтопКран=СтопКран+1; 
	КонецЦикла;
	
	Если ФС.Существует() Тогда
		Возврат ИмяФайлаTif;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции //ПреобразоватьPDFвTIFF()

// Поиск исполняемого файла GhostScript в файловой системе
//
Функция ПолучитьПутьКИсполняемомуфайлуGhostScript(ПапкаProgramFiles)
	ИмяФайлаGhostScript = "";
	МассивФайлов = НайтиФайлы(ПапкаProgramFiles + "\gs", "gswin??c.exe", Истина);
	Если МассивФайлов.Количество() > 0 Тогда
		Возврат МассивФайлов[0].ПолноеИмя;
	КонецЕсли; 
	
	МассивФайлов = НайтиФайлы(СтрЗаменить(ПапкаProgramFiles," (x86)","") + "\gs", "gswin??c.exe", Истина);
	Если МассивФайлов.Количество() > 0 Тогда
		Возврат МассивФайлов[0].ПолноеИмя;
	КонецЕсли;
	
	Возврат ИмяФайлаGhostScript;
КонецФункции // ПолучитьПутьКИсполняемомуфайлуGhostScript()

// По переданному названию используемого софтфона возвращает строку автоподъема трубки.
//
Функция ВернутьСтрокуАвтоподъемаТрубки(НазваниеСофтфона, ТолькоЗаголовок=Ложь) Экспорт
	Результат = ?(ТолькоЗаголовок=Ложь, "SIPADDHEADER=", "");
	Заголовок="";
	
	Если ИспользоватьСофтфон Тогда
		Заголовок = """Call-Info:\;answer-after=0""";
	ИначеЕсли Найти(НазваниеСофтфона,"Linksys")>0
		ИЛИ Найти(НазваниеСофтфона,"Cisco")>0
		ИЛИ Найти(НазваниеСофтфона,"MIKO Lab SoftPhone")>0
		ИЛИ Найти(НазваниеСофтфона,"Telephone-PT1C")>0 
		ИЛИ Найти(НазваниеСофтфона,"Grandstream")>0 Тогда
		Заголовок = """Call-Info:\;answer-after=0""";
    ИначеЕсли Найти(НазваниеСофтфона,"Yealink")>0 ИЛИ Найти(НазваниеСофтфона,"VP530P")>0 Тогда
        Заголовок = """Call-Info:answer-after=0""";
	ИначеЕсли Найти(НазваниеСофтфона,"Aastra")>0 Тогда
		Заголовок = """Alert-Info: info=alert-autoanswer""";
	ИначеЕсли Найти(НазваниеСофтфона,"Polycom")>0 Тогда
		Заголовок = """Alert-Info: Ring Answer""";
	ИначеЕсли Найти(НазваниеСофтфона, "Jitsi") > 0 Тогда
		Заголовок = """Alert-Info:Auto Answer""";
	ИначеЕсли Найти(Нрег(НазваниеСофтфона),"microsip")>0 Тогда
		Заголовок = """Call-Info:\;answer-after=0""";
	ИначеЕсли Найти(НазваниеСофтфона,"Snom")>0 Тогда
		Заголовок = """Call-Info: sip:"+Хост+"\;answer-after=0""";
	КонецЕсли; 	
	
	Результат = ?(Заголовок="","",""+Результат+Заголовок);
	Возврат Результат;
КонецФункции // ВернутьСтрокуАвтоподъемаТрубки()

// Найти строку существующего звонка по переданным атртибутам
//
Функция НайтиСтрочкуЗвонка(XMLУзел, Знач channel1 = Неопределено, Знач channel2 = Неопределено)
	channel 	  = ВРег(ПолучитьЗначениеКнала(XMLУзел, "channel"));
	channel1 	  = ВРег(?(channel1 = Неопределено, ПолучитьЗначениеКнала(XMLУзел, "channel1"), channel1));
	channel2	  = ВРег(?(channel2 = Неопределено, ПолучитьЗначениеКнала(XMLУзел, "channel2"), channel2));
	targetchannel = ВРег(ПолучитьЗначениеКнала(XMLУзел, "targetchannel")); // Для Pickup
	destination   = ВРег(ПолучитьЗначениеКнала(XMLУзел, "destination"));
	
	destchannel   = ПолучитьЗначениеКнала(XMLУзел, "destchannel");   // Для Dial Ast13
	Если НЕ ЗначениеЗаполнено(channel2) И ЗначениеЗаполнено(destchannel) Тогда
		channel2 = ВРег(destchannel);	
	КонецЕсли; 	
	
	Результат = Неопределено;
	
	Для каждого Звонок Из Звонки Цикл
		Канал1 = ВРег(Звонок.Канал1);
		Канал2 = ВРег(Звонок.Канал2);
		
		КаналНайден = Ложь;
		
		Если Звонок.ВходящийЗвонок // входящий ищем в канале 2
			И ( (ЗначениеЗаполнено(channel1) И Найти(Канал2, channel1) > 0) 
			ИЛИ (ЗначениеЗаполнено(channel2) И Найти(Канал2, channel2) > 0)
			ИЛИ (ЗначениеЗаполнено(targetchannel) И Найти(Канал2, targetchannel) > 0)
			) Тогда	
			КаналНайден = Истина;
		ИначеЕсли НЕ Звонок.ВходящийЗвонок // исходящий ищем в канале 1
			И ( (ЗначениеЗаполнено(channel1) И Найти(Канал1, channel1) > 0) 
			ИЛИ (ЗначениеЗаполнено(channel2) И Найти(Канал1, channel2) > 0)) Тогда
			КаналНайден = Истина;
		ИначеЕсли ЗначениеЗаполнено(channel)
			И Найти(Канал1 + Канал2, channel) > 0 Тогда
			// при обратном звонке на мобильный каналы могут быть перетасованы	  
			КаналНайден = Истина;
		ИначеЕсли ЗначениеЗаполнено(destchannel)
			И Канал1 = channel2 Тогда
			// при обратном звонке на мобильный каналы могут быть перетасованы	  
			КаналНайден = Истина;
		ИначеЕсли ЗначениеЗаполнено(destination)
			И Найти(Канал1 + Канал2, destination) > 0 Тогда
			// при обратном звонке на мобильный каналы могут быть перетасованы	  
			КаналНайден = Истина;
		ИначеЕсли Звонок.ВходящийЗвонок 
			И ЭтоЛокальныйНомерТекущегоПользователя(Канал1, мСписокНомеровПользователяДляОбработки)
			И ЗначениеЗаполнено(channel2) 
			И Найти(Канал1, channel2) > 0 Тогда
			// клиент через провайдера позвонил на группу вызовов Local/04, через группу пошел dial на SIP/104
			КаналНайден = Истина;
		КонецЕсли;
		
		Если ПолучитьЗначениеКнала(XMLУзел, "event") = "DialBegin" И Найти(НашКаналФильтр, "PJSIP")=1
			 И (НЕ channel = "" И Звонки.Найти(channel) = Неопределено)
			 И Звонок.ВходящийЗвонок И КаналНайден = Истина
			 И Найти(Звонок.Канал2, НашКаналФильтр) = 1 И Звонок.Канал2 <> destchannel Тогда
			 // Звонок на PJSIP множественная регистрация. Создается несколько каналов на входящий.
			КаналНайден = Ложь;
		 	Продолжить;
		ИначеЕсли КаналНайден = Истина Тогда
			Результат = Звонок;
			Прервать;
		КонецЕсли; 
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции // НайтиСтрочкуЗвонка()
// для Local каналов отсекает значение после ";"
// возвращает модифицированное значение
Функция ПолучитьЗначениеКнала(XMLУзел, ИмяАтрибута)
	channel 	  = XMLУзел.ЗначениеАтрибута(ИмяАтрибута);
	channel = мОбработкаДанных.ОтсечьПлечоВLocal(channel, Найти(ВРег(channel), "LOCAL")>0);
	Возврат channel;
КонецФункции // ПолучитьЗначениеКнала()

// разбирает строку XML в соответсвие ключ - значение
//
Функция РазобратьОтветАстерискаБезЧтенияХМЛ(Данные)
	
	МассивПодстрок = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(Данные," ");
	
	ПараметрыОтвета=Новый Соответствие;
	Для к=0 по МассивПодстрок.Количество()-1 Цикл
		СтрокаДляРазбора	= СокрЛП(МассивПодстрок[к]);
		ПозицияРазделителя	= Найти(СтрокаДляРазбора,"=");
		ДлинаСтроки			= СтрДлина(СтрокаДляРазбора);
		Если ПозицияРазделителя<>0 Тогда
			Параметр=Лев(СтрокаДляРазбора,ПозицияРазделителя-1);
			Значение=Прав(СтрокаДляРазбора,ДлинаСтроки-ПозицияРазделителя-1);
			Значение=Лев(Значение,СтрДлина(Значение)-1);
			ПараметрыОтвета.Вставить(Параметр,Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	Возврат ПараметрыОтвета;
КонецФункции	

// Функция парсит результат команды CLICommand
// Возаращает таблицу значений с колонками : ВнутреннийНомер, Канал, Состояние
Функция РазобратьCoreShowHints(ИсходныйТекст)
	
	// Пример команды
	//<ajax-response>
	//<response type='object' id='unknown'><generic response='Follows' privilege='Command' actionid='118' /></response>
	//<response type='object' id='unknown'><generic opaque_data='    -= Registered Asterisk Dial Plan Hints =-
	//					 40@ext-local           : SIP/40                State:Idle            Watchers  0
	//					126@ext-local           : DAHDI/22              State:Idle            Watchers  0
	//					 04@ext-local           : SIP/04                State:Idle            Watchers  0
	//					 06@ext-local           : SIP/06                State:Unavailable     Watchers  0
	//					 02@ext-local           : SIP/02                State:Unavailable     Watchers  0
	//					 17@ext-local           : SIP/17                State:Unavailable     Watchers  0
	//					 10@ext-local           : SIP/10                State:Unavailable     Watchers  0
	//					 12@ext-local           : SIP/12                State:Idle            Watchers  0
	//					 13@ext-local           : SIP/13                State:Unavailable     Watchers  0
	//					 26@ext-local           : SIP/26                State:Unavailable     Watchers  0
	//					 29@ext-local           : SIP/29                State:Unavailable     Watchers  0
	//					 32@ext-local           : SIP/32                State:Idle            Watchers  0
	//					326@ext-local           : DAHDI/24              State:Idle            Watchers  0
	//					226@ext-local           : IAX2/226              State:Unavailable     Watchers  0
	//----------------
	//- 14 hints registered
	//--END COMMAND--' /></response>
	//</ajax-response>
	
	ТаблицаХинтов = Новый ТаблицаЗначений;
	ТаблицаХинтов.Колонки.Добавить("ВнутреннийНомер",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(32)));
	ТаблицаХинтов.Колонки.Добавить("Канал",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаХинтов.Колонки.Добавить("Состояние",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаХинтов.Колонки.Добавить("Контекст",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТаблицаХинтов.Колонки.Добавить("UserAgent",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	
	// 1_hints_hint_state='Idle' 
	// 1_hints_hint_extension='102' 
	// 1_hints_hint_application='DAHDI/22' 
	Для Х = 1 по СтрЧислоСтрок(ИсходныйТекст) Цикл
		СтрокаДляРазбора = ВРЕГ(СокрЛП(СтрПолучитьСтроку(ИсходныйТекст, Х)));
		
		// 1. Получим внутрений номер
		ВнутреннийНомер = Лев(СтрокаДляРазбора, Найти(СтрокаДляРазбора,"@") - 1);
		
		// 2. Получим канал пользователя
		Канал = "";
		// необходимо отсеч все буквы справа после добавочного
		длинаВремКанала = СтрДлина(СтрокаДляРазбора); ЧислоСимволовКанала = 0;
		ПозицияСпецСимволаSIP 	= Найти(СтрокаДляРазбора, "SIP/");
		ПозицияСпецСимволаIAX 	= Найти(СтрокаДляРазбора, "IAX/");
		ПозицияСпецСимволаIAX2 	= Найти(СтрокаДляРазбора, "IAX2/");
		ПозицияСпецСимволаDAHDI = Найти(СтрокаДляРазбора, "DAHDI/");
		
		Если НЕ ПозицияСпецСимволаSIP = 0 Тогда
			ЧислоСимволовКанала = ПозицияСпецСимволаSIP + 4;
			Канал = "SIP/"
		ИначеЕсли НЕ ПозицияСпецСимволаDAHDI = 0 Тогда 	
			ЧислоСимволовКанала = ПозицияСпецСимволаDAHDI + 6;
			Канал = "DAHDI/"
		ИначеЕсли НЕ ПозицияСпецСимволаIAX = 0 Тогда 	
			ЧислоСимволовКанала = ПозицияСпецСимволаIAX + 4;
			Канал = "IAX/"
		ИначеЕсли НЕ ПозицияСпецСимволаIAX2 = 0 Тогда 	
			ЧислоСимволовКанала = ПозицияСпецСимволаIAX2 + 5;
			Канал = "IAX2/"
		КонецЕсли; 
		
		сч = ЧислоСимволовКанала;
		Пока сч <= длинаВремКанала Цикл
			ОчереднойСимвол = Сред(СтрокаДляРазбора, сч, 1);
			Если СтрЧислоВхождений("1234567890",ОчереднойСимвол) > 0 Тогда
				Канал = Канал + ОчереднойСимвол;
			Иначе
				Прервать;
			КонецЕсли;
			
			сч = сч + 1;	
		КонецЦикла;
		
		// 3. Получим состояние канала
		Если Найти(СтрокаДляРазбора, "Idle") Тогда
			Состояние = "Idle";
		ИначеЕсли Найти(СтрокаДляРазбора, "Unavailable") Тогда	
			Состояние = "Unavailable";
		ИначеЕсли Найти(СтрокаДляРазбора, "In Use") Тогда	
			Состояние = "In Use"
		Иначе 
			Состояние = "---";
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВнутреннийНомер) И ЗначениеЗаполнено(Канал) Тогда
			СтрокаHint = ТаблицаХинтов.Добавить();
			СтрокаHint.ВнутреннийНомер = ВнутреннийНомер;
			СтрокаHint.Канал = Канал;
			СтрокаHint.Состояние = Состояние;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаХинтов;
КонецФункции

// Разбор ответа Asterisk по команде DAHDIShowChannels
// функция возвращает массив каналов DAHDI (числовой номер канала)
// 
//<ajax-response>
//<response type='object' id='unknown'><generic response='Follows' privilege='Command' actionid='dd294' opaque_data='   
//   Chan Extension  Context         Language   MOH Interpret        Blocked    State' 
//  pseudo         default                    default                         In Service
//	  2            ANALOG-PHONE-11 en-us      default                         In Service
//	  3            ANALOG-PHONE-11 en-us      default                         In Service
//	  4            ANALOG-PHONE-60 en-us      default                         In Service
//--END COMMAND--
//' /></response>
//</ajax-response>
Функция РазобратьDAHDIShowChannels(ИсходныйТекст)
	МассивНомеровКаналов = Новый Массив;
	
	// предварительно обрежем лишнее из исходного текста
	СпецСимвол = "State";
	ПозицияСпецСимвола = Найти(ИсходныйТекст, СпецСимвол) + СтрДлина(СпецСимвол);
	Если ПозицияСпецСимвола = СтрДлина(СпецСимвол) Тогда
		// это ошибочная ситуация, ответ со стороны АТС возвращен не корректный
		Возврат МассивНомеровКаналов;
	КонецЕсли; 
	ИсходныйТекст = Прав(ИсходныйТекст, СтрДлина(ИсходныйТекст) - ПозицияСпецСимвола);
	
	// парсинг результата
	ЧислоСтрок = СтрЧислоСтрок(ИсходныйТекст);
	Для Х = 1 по ЧислоСтрок Цикл
		СтрокаДляРазбора = СокрЛП(СтрПолучитьСтроку(ИсходныйТекст, Х));
		Если Найти(СтрокаДляРазбора, "END COMMAND")  Тогда
			Прервать;
		КонецЕсли; 
		
		// в номере канала нет пробелов, нас интересует только первая колонка
		МассивПодстрок = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаДляРазбора, " ");
		Если МассивПодстрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		// нас интересует значение первого элемента массивы - номер канала
		НомерКанала  = мОбработкаДанных.УбратьИзНомераТелефонаВсеБуквы(МассивПодстрок[0]);
		Если НЕ НомерКанала = "" 
			И МассивНомеровКаналов.Найти(НомерКанала) = Неопределено Тогда
			// добавляем номер канала во временный массив 
			МассивНомеровКаналов.Добавить(НомерКанала);
		КонецЕсли; 
	КонецЦикла;	
	
	Возврат МассивНомеровКаналов;
КонецФункции // РазобратьОтвет(Результат)

// Разбор ответа Asterisk по команде DAHDIShowChannel
// функция возвращает структуру с полями "ВнутреннийНомер,Канал,Состояние,Контекст" тип полей "Строка"
Функция РазобратьDAHDIShowChannel(ИсходныйТекст)
	ОписаниеНомера = Новый Структура("ВнутреннийНомер,Канал,Состояние,Контекст","","","","");
	//<ajax-response>
	//<response type='object' id='unknown'><generic response='Follows' privilege='Command' actionid='727e8' channel='2' file_descriptor='12' span='1' extension='' dialing='no' context='ANALOG-PHONE-11772858565051fbbd422ee' caller_id='101' calling_ton='0' caller_id_subaddress='' caller_id_name='101' mailbox='none' destroy='0' inalarm='0' signalling_type='FXO Kewlstart' radio='0' owner='&lt;None&gt;' real='&lt;None&gt;' callwait='&lt;None&gt;' threeway='&lt;None&gt;' confno='-1' propagated_conference='-1' real_in_conference='0' dsp='no' busy_detection='yes' ____busy_count='3' ____busy_pattern='0,0' tdd='no' relax_dtmf='no' dialing_callwaitcas='0/0' default_law='ulaw' fax_handled='no' pulse_phone='no' gains__rx_tx_='0.00/0.00' dynamic_range_compression__rx_tx_='0.00/0.00' dnd='no' echo_cancellation='' opaque_data='	128 taps'	(unless TDM bridged) currently OFF
	//Wait for dialtone: 0ms
	//Actual Confinfo: Num/0, Mode/0x0000
	//Actual Confmute: No
	//Hookstate (FXS only): Onhook
	//--END COMMAND--
	//' /></response>
	//</ajax-response>
	
	ЧислоСтрок = СтрЧислоСтрок(ИсходныйТекст);
	Для Х = 1 по ЧислоСтрок Цикл
		СтрокаДляРазбора = СокрЛП(СтрПолучитьСтроку(ИсходныйТекст, Х));
		Если Найти(СтрокаДляРазбора, "Follows") = 0 Тогда
			Продолжить;
		КонецЕсли;
		МассивПодстрок = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(СтрокаДляРазбора, "' ");
		Для каждого СтрокаПараметра Из МассивПодстрок Цикл
			Если НЕ Найти(СтрокаПараметра, "context=")=0 Тогда
				context = СтрЗаменить(СтрокаПараметра,"context=", "");
				ОписаниеНомера.Контекст = СокрЛП(СтрЗаменить(context,"'", ""));
				Продолжить;
			КонецЕсли; 
			Если НЕ Найти(СтрокаПараметра, "caller_id=")=0 Тогда
				caller_id = СтрЗаменить(СтрокаПараметра, "caller_id=", "");
				ОписаниеНомера.ВнутреннийНомер = СокрЛП(СтрЗаменить(caller_id, "'", ""));
				Продолжить;
			КонецЕсли; 
			Если НЕ Найти(СтрокаПараметра, "channel=")=0 Тогда
				channel = СтрЗаменить(СтрокаПараметра, "channel=", "");
				ОписаниеНомера.Канал = "DAHDI/" + СокрЛП(СтрЗаменить(channel, "'", ""));
				Продолжить;
			КонецЕсли;
			Если НЕ Найти(СтрокаПараметра, "dialing=")=0 Тогда
				dialing = СтрЗаменить(СтрокаПараметра, "dialing=", "");
				ОписаниеНомера.Состояние = ?(СокрЛП(СтрЗаменить(dialing, "'", "")) = "no", "", "InUse");
				Продолжить;
			КонецЕсли;
		КонецЦикла; 
		
		Прервать;
	КонецЦикла;
	Если ЗначениеЗаполнено(ОписаниеНомера.ВнутреннийНомер) Тогда
		Возврат ОписаниеНомера;
	Иначе	
		Возврат Неопределено;
	КонецЕсли; 	
КонецФункции // РазобратьDAHDIShowChannel()

//Получаем параметры пира по внутреннему номеру с сервера Asterisk для заполнения настроек панели
//
Процедура ПолучитьПараметрыDAHDIПира(ТаблицаХинтов)
	МассивСтрок = ТаблицаХинтов.НайтиСтроки(Новый Структура("Канал", НашКаналФильтр));
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстНабораПоУмолчанию = МассивСтрок[0].Контекст; 	
КонецПроцедуры

// Проверка прав доступа для текущего пользователя к ключевым объектам
// 
Процедура ВыполнитьПроверкуПравПользователя()
	Если НЕ ЗначениеЗаполнено(ИмяТекущегоПользователя) Тогда
		Сообщить("Для использования панели телефонии необходимо авторизоваться.", СтатусСообщения.ОченьВажное);	
	КонецЕсли; 	
	
	ИнформацияПоПравамДоступа = "";
	Права = Новый Массив;
	Права.Добавить("Чтение");
	Права.Добавить("Добавление");
	Права.Добавить("Проведение");
	Права.Добавить("Использование");
	Права.Добавить("Просмотр");
	Права.Добавить("Редактирование");
		
	Если НЕ ИнформацияПоПравамДоступа = "" Тогда
		Сообщить("У пользователя не хватает прав доступа для использования модуля ""Панель телефонии для 1С"".");
		СообщитьОтладочнуюИнформацию("Права доступа:", ИнформацияПоПравамДоступа);
	КонецЕсли; 
КонецПроцедуры

// Инициализация переменных модуля объекта обработки.
// 
Процедура ИнициализироватьВспомагательныеПеременные()
	
	НашDAHDIПорт = "";
	ИмяТекущейКонфигурации	= Метаданные.Имя;
	ИмяТекущегоПользователя = ПолучитьИмяТекущегоПользователя();
	
	Супервизор = Ложь;
	НаборНомераРазрешен 	= Истина;
	СоответствиеАвтоподъем  = Новый Соответствие;
	ИнформацияПоЛицензиям   = Новый Структура;
	
	ОтправилиМетрику = Ложь;
	//Инициируем тип строка 38 символов фиксированаая
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(38,ДопустимаяДлина.Фиксированная));
	
	// Определяем структуру внутреннего или внешнего звонка
	ТипВнутреннийВнешнийЗвонок = Новый Структура();
	ТипВнутреннийВнешнийЗвонок.Вставить("Внешний",	    0);
	ТипВнутреннийВнешнийЗвонок.Вставить("Внутренний",	1);
	
	
	СостояниеЭкстеншена 		= Новый Структура();
	СостояниеЭкстеншена.Вставить("Недоступен",0);
	СостояниеЭкстеншена.Вставить("Свободен",1);
	СостояниеЭкстеншена.Вставить("Разговаривает",2);
	СостояниеЭкстеншена.Вставить("ИдетВхЗвонок",3);
	ТЗ_КЭШ_КИ = Новый ТаблицаЗначений;
	ТЗ_КЭШ_КИ.Колонки.Добавить("ДатаАктуальности", 		Новый ОписаниеТипов("Дата"));
	ТЗ_КЭШ_КИ.Колонки.Добавить("CallerID", 				Новый ОписаниеТипов("Строка"));
	ТЗ_КЭШ_КИ.Колонки.Добавить("Контрагент");
	ТЗ_КЭШ_КИ.Колонки.Добавить("КонтактноеЛицо");
	ТЗ_КЭШ_КИ.Колонки.Добавить("Город",					Новый ОписаниеТипов("Строка"));
	
	ТЗИсторииЗвонковВременная = Новый ТаблицаЗначений;
	ТЗИсторииЗвонковВременная.Колонки.Добавить("calldate", 		Новый ОписаниеТипов("Дата"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("src", 			Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("dst", 			Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("channel", 		Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("dstchannel",	Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("billsec", 		Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("disposition", 	Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("callerid", 		Новый ОписаниеТипов("Строка"));
	// информация по списку участников звонка
	ТЗИсторииЗвонковВременная.Колонки.Добавить("ArrayDialers");
	ТЗИсторииЗвонковВременная.Колонки.Добавить("uniqueid", 		Новый ОписаниеТипов("Строка")); //TODO
	// инфа о имени файла записи разговоров               
	ТЗИсторииЗвонковВременная.Колонки.Добавить("recordingfile", Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("СекундДлился", Новый ОписаниеТипов("Число"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("ВходящийЗвонок", Новый ОписаниеТипов("Булево"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("ПропущенныйЗвонок", Новый ОписаниеТипов("Булево"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("did", Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("uid", Новый ОписаниеТипов("Строка"));
	ТЗИсторииЗвонковВременная.Колонки.Добавить("врChanSpy", Новый ОписаниеТипов("Булево"));
	                                                   
	ТЗФаксовВременная = Новый ТаблицаЗначений;
	ТЗФаксовВременная.Колонки.Добавить("calldate", 		Новый ОписаниеТипов("Дата"));
	ТЗФаксовВременная.Колонки.Добавить("src", 			Новый ОписаниеТипов("Строка"));
	ТЗФаксовВременная.Колонки.Добавить("dst", 			Новый ОписаниеТипов("Строка"));
	ТЗФаксовВременная.Колонки.Добавить("lastdata", 		Новый ОписаниеТипов("Строка"));
	ТЗФаксовВременная.Колонки.Добавить("lastapp",		Новый ОписаниеТипов("Строка"));
	ТЗФаксовВременная.Колонки.Добавить("uniqueid", 		ОписаниеТиповС);
	
	//Оптимизация GetVar
	ПеремКаналовСтруктура = Новый Соответствие();
	
	ТаблицаПользователей = Новый ТаблицаЗначений;
	ТаблицаПользователей.Колонки.Добавить("ПользовательСсылка",	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаПользователей.Колонки.Добавить("Код",				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	
	ЗапланированныйДонабор = Новый Соответствие();
	
	мНомераТелефоновПоОтветственному = Новый Массив;
	
	КоличествоАварийныйхРеконнектов = 0;
	КоличествоПоследовательныхСбоевПриLogin = 0;
	ПортGetVar = 0;
	
	мСписокНомеровПользователяДляОбработки = Новый Массив;
	мСписокНомеровПользователяДляИстории   = Новый Массив;
	
	БезИнтеграционныйРежим = (Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С") = Неопределено);
	КлючУникальности = Прав(Новый УникальныйИдентификатор,5);
	
	МинимальнаяВерсияДиалплана = "1.0.0.6"; 
	
	// Документ "Событие" / Начало
	КлючиУникальностиСобытий = Новый Соответствие;
	// Документ "Событие" / Конец
	
	ТаблицаХинтов = Новый ТаблицаЗначений;
	ТаблицаХинтов.Колонки.Добавить("ВнутреннийНомер",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	ТаблицаХинтов.Колонки.Добавить("Канал",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(256)));
	ТаблицаХинтов.Колонки.Добавить("Состояние",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаХинтов.Колонки.Добавить("Контекст",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТаблицаХинтов.Колонки.Добавить("UserAgent",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		
	РаботаСФаксамиВозможна  = Ложь;
	ПользовательСтатистики  = "";
	ПарольПользователяСтатистики = "";
	КаналыКПарковке 		= Новый Соответствие;
	ЗаписиДляВнешнейПанели  = Новый Массив;
	
	ЕстьМодульМаршрутизации = Метаданные.ОбщиеМодули.Найти("МИКО_мвМаршрутизацияЗвонков")<>Неопределено;
	ЕстьМодульОптимизации 	= Метаданные.ОбщиеМодули.Найти("МИКО_опЗаписьКИ")<>Неопределено;
	
	ХранениеНастроекВРегистре = Метаданные.РегистрыСведений.Найти("МИКО_НастройкиПанелиТелефонии") <> Неопределено;
	
	ИспользоватьОптимизацию = ЕстьМодульОптимизации И ИмяТекущейКонфигурации <> "ТрактиръFrontOffice";
	Если ИспользоватьОптимизацию 
		 И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МИКО_опИндексНомераТелефонов)
		 И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные) Тогда
		ИспользоватьОптимизацию = Истина;
	Иначе
		ИспользоватьОптимизацию = Ложь;
	КонецЕсли; 
	
	КоличествоЦифрАК = 0;
	Если ИспользоватьОптимизацию Тогда
		Попытка
		врМИКО_опЗаписьКИ = Вычислить("МИКО_опЗаписьКИ");
		КоличествоЦифрАК  = врМИКО_опЗаписьКИ.ПолучитьКоличествоХранимыхЦифрТелефона();
		Исключение
		КонецПопытки; 
	КонецЕсли; 	

	Если НЕ ИспользоватьОптимизацию Тогда
		ЗагрузитьКодыГородов();
	КонецЕсли; 

КонецПроцедуры

// Инициируем таблицу кодов городов для расбора номера
// 
Функция ЗагрузитьКодыГородов()
	// Загрузим список городов
	КодыГородовВСтр = ПолучитьМакет("КодыГородовТаблица").ПолучитьТекст();
	ТЗ_КодыГородов = ЗначениеИзСтрокиВнутр(КодыГородовВСтр);
	АдресТЗКодыГородов = ПоместитьВоВременноеХранилище(ТЗ_КодыГородов);
	Возврат ТЗ_КодыГородов;
КонецФункции	
// Определяет информацию об абоненте по номеру телфона.
//
//  НомерТелефона   [Строка]           Номер телефона абонента в формате URI.
//  ТелефоннаяКнига [ТабличнаяЧасть]   Таблица номеров телефонной книги.
//  КодСтраны       [Строка]           Телефонный код страны.
//  КодГорода       [Строка]           Телефонный код города.
//
//  Возвращаемое значение [Структура]   Содержит информацию об абоненте.
//
//&НаКлиенте
Функция ПолучитьДанныеОбАбоненте(Знач НомерТелефона) Экспорт
	// поиск среди городских номеров
	ПервыйСимвол = Лев(НомерТелефона, 1);
	Если ПервыйСимвол="8" И СтрДлина(НомерТелефона) = 11 Тогда
	  	НомерТелефона = "7" + Прав(НомерТелефона, СтрДлина(НомерТелефона)-1); 	
	КонецЕсли; 
	
	НомерТелефона = мОбработкаДанных.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
	
	Результат = Новый Структура("Город,Область,Страна,НомерТелефона,КодСтраны,КодГорода,Номер");
	Результат.Вставить("НомерТелефона", НомерТелефона);
	Если ИспользоватьОптимизацию Тогда
	
		Попытка
			врМодуль = Вычислить("МИКО_опЗаписьКИ");
		Исключение
		    врМодуль = Неопределено;
		КонецПопытки; 
		
		врНомерТелефона = НомерТелефона;
		
		ВыборкаКодГорода = врМодуль.РазложитьНомерТелефона(НомерТелефона);
		
		Если НЕ ВыборкаКодГорода = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Результат, ВыборкаКодГорода);
			Страна = "";
			Если Найти(Врег(ВыборкаКодГорода.Страна), "УКРАИНА")>0  Тогда
			 	Страна = "Украина";	
			ИначеЕсли ВыборкаКодГорода.Страна = "РФ" ИЛИ Найти(Врег(ВыборкаКодГорода.Страна), "РОСС")>0 Тогда	
			 	Страна = "Россия";
			ИначеЕсли Врег(ВыборкаКодГорода.Страна) = "БЕЛАРУСЬ" Тогда
				Страна = "Беларусь";
			КонецЕсли; 
			врНомерТелефона 	= ""+ВыборкаКодГорода.КодСтраны + " (" + ВыборкаКодГорода.КодГорода + ") " 
							  + Сред(НомерТелефона, СтрДлина(""+ВыборкаКодГорода.КодСтраны + ВыборкаКодГорода.КодГорода) + 1);
			ДлинаНомера 	= СтрДлина(НомерТелефона) - СтрДлина(""+ВыборкаКодГорода.КодСтраны+ВыборкаКодГорода.КодГорода);
			
			Результат.Страна 		= Страна;
			Результат.НомерТелефона = врНомерТелефона;
			Результат.КодСтраны 	= ВыборкаКодГорода.КодСтраны;
			Результат.КодГорода 	= ВыборкаКодГорода.КодГорода;
			Результат.Номер 		= Прав(НомерТелефона,ДлинаНомера);
			Результат.Город 		= ?(ЗначениеЗаполнено(Результат.Город),Результат.Город,Результат.Область);
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли; 
	// поиск среди мобильных 	
	Запрос = Новый Запрос();
	// Найдем информацию о номере по базе кодов городов
	Запрос.Текст = "ВЫБРАТЬ
                  |	ТабКодыГородов.ШаблонПоиска КАК ШаблонПоиска,
                  |	ТабКодыГородов.КодСтраны,
                  |	ТабКодыГородов.КодГорода,
                  |	ТабКодыГородов.Город,
                  |	ТабКодыГородов.Область,
                  |	ТабКодыГородов.Страна
                  |ПОМЕСТИТЬ втКодыГородов
                  |ИЗ
                  |	&ТабКодыГородов КАК ТабКодыГородов
                  |
                  |ИНДЕКСИРОВАТЬ ПО
                  |	ШаблонПоиска
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ ПЕРВЫЕ 1
                  |	КодыГородов.ШаблонПоиска,
                  |	КодыГородов.Город,
                  |	КодыГородов.Область,
                  |	КодыГородов.Страна,
                  |	КодыГородов.КодГорода,
                  |	КодыГородов.КодСтраны
                  |ИЗ
                  |	втКодыГородов КАК КодыГородов
                  |ГДЕ
                  |	&НомерДляПоискаГорода ПОДОБНО КодыГородов.ШаблонПоиска
                  |
                  |УПОРЯДОЧИТЬ ПО
                  |	КодыГородов.ШаблонПоиска УБЫВ";
	ТЗ_КодыГородов = ПолучитьИзВременногоХранилища(АдресТЗКодыГородов);
	Если ТЗ_КодыГородов = Неопределено Тогда
	 	ТЗ_КодыГородов = ЗагрузитьКодыГородов();   
	КонецЕсли; 
	Запрос.УстановитьПараметр("ТабКодыГородов", ТЗ_КодыГородов);
	Запрос.УстановитьПараметр("НомерДляПоискаГорода", НомерТелефона);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		
		Номер = Сред(НомерТелефона, СтрДлина(Выборка.КодСтраны + Выборка.КодГорода) + 1);
		Результат.КодСтраны = Выборка.КодСтраны;
		Результат.КодГорода = Выборка.КодГорода;
		Результат.Номер 	= Сред(НомерТелефона, СтрДлина(Выборка.КодСтраны + Выборка.КодГорода) + 1);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Если Не ЗначениеЗаполнено(Результат.Город) Тогда
			Результат.Город   = Результат.Область;
			Результат.Область = "";
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПолучитьДанныеОбАбоненте()

// Из строки вида XXXXXXXXXX@Context или Provider/XXXXXXXXXX или Provider/SIP_namber/XXXXXXXXXX, выделяет номер
// Параметры 
//   СтрокаНабораНомера - тип значения "строка" передается по значению, строка: содержащая номер телефона
// Возвращаемое значение
//   НомерТелефона - тип значения "строка"
Функция ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(Знач СтрокаНабораНомера) Экспорт
	Если Найти(ВРЕГ(СтрокаНабораНомера),"LOCAL")>0 Тогда
		СтрокаНабораНомера = СтрЗаменить(СтрокаНабораНомера,"/n", "");	
	КонецЕсли; 
	// Получим позицию начала номера
	НачалоНомера = ПолучитьПозициюДальнегоСимвола(СтрокаНабораНомера,"/") + 1; // если > 0 то начало номера найдено
	
	// учтем формат DIAL
	Если СтрЧислоВхождений(СтрокаНабораНомера,"@")=1 Тогда
		СимволыПоиска = "@";
	ИначеЕсли СтрЧислоВхождений(СтрокаНабораНомера,"/")=2 Тогда	
	 	СимволыПоиска = ",";
	Иначе
		СимволыПоиска = "-,";
	КонецЕсли;
	
	// Получим позицию конца номера
	ДальнийСимвол = ПолучитьПозициюБлижнегоСимвола(СтрокаНабораНомера, СимволыПоиска);
	
	// НачалоНомера - если < 0, то Сред воспринимает параметр как "НачалоСтроки") 
	НачалоНомера = ?(НачалоНомера<=0,0,НачалоНомера);
	// ДлинаНомера  - Если < 0, то Сред воспринимает параметр как "ДоКонцаСтроки"
	КонецНомера  = ?(ДальнийСимвол<=0,СтрДлина(СтрокаНабораНомера)+1,ДальнийСимвол);
	
	НачалоНомера = ?(НачалоНомера<=0,1,НачалоНомера);
	ДлинаНомера  = КонецНомера - НачалоНомера ;
	НомерТелефона = Сред(СтрокаНабораНомера, НачалоНомера, ДлинаНомера);
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "sip:", "");
	Возврат НомерТелефона;
КонецФункции

// Поиск позиции ближнего символа с строке.
// 
Функция ПолучитьПозициюБлижнегоСимвола(Знач ИсхСтрока, СтрокаСимволов) Экспорт
	Позиция = 0;

	Для а=1 По СтрДлина(СтрокаСимволов) Цикл
		ТекПоз = Найти(ИсхСтрока,Сред(СтрокаСимволов,а,1));
		// не учитываем нулевые позиции
		Если ТекПоз = 0 Тогда Продолжить; КонецЕсли;
		Позиция = ?( Позиция = 0,ТекПоз,МИН(Позиция, ТекПоз) );		
	КонецЦикла;
	Возврат Позиция;
КонецФункции

// Поиск позиции дальнего символа с строке.
// 
Функция ПолучитьПозициюДальнегоСимвола(Знач ИсхСтрока, СтрокаСимволов) Экспорт
	
	ДлинаСтроки = СтрДлина(ИсхСтрока);
	Для к=0 по ДлинаСтроки Цикл 
		НомерСимвола = ДлинаСтроки-к; 
		Символ = Сред(ИсхСтрока,НомерСимвола,1);
		
		Если Найти(СтрокаСимволов,Символ)>0 Тогда 
			Возврат НомерСимвола; 
		КонецЕсли; 
	КонецЦикла;	

	Возврат -1;	
КонецФункции // ПолучитьПозициюДальнегоСимвола()

// Находит первое вхождение одного из искомых символов в исходной строке.
// Поиск осуществлюяется справа.
//
Функция НайтиСправаОдинИзСимволов(Знач Строка, Знач Символы)
	
	ДлинаСтроки = СтрДлина(Строка);
	Позиция = ДлинаСтроки;
	Пока Позиция > 0 Цикл
		Если Найти(Символы, Сред(Строка, Позиция, 1)) > 0 Тогда
			Возврат Позиция;
		КонецЕсли;
		Позиция = Позиция - 1;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // НайтиСправаОдинИзСимволов()

// хинт может прийти в формате, Custom:busystate132&amp;SIP/132
// функция анализирует строку hint, отсекает из нее лишнее
// возвращает ИСТИНА: если хинт найден
Функция ПолучитьЗначениеХинта(hint, Знач НомерТелефона)
    Перем КаналНайден, МассивКаналов, ТекКанал;
    hint = СтрЗаменить(hint, "&amp;", "&");
    hint = СтрЗаменить(hint, ",", "&");
	Если Найти(hint, "&")<=0 Тогда
		Возврат	Истина;
	КонецЕсли;	
		
	КаналНайден = Ложь;
    
    МассивКаналов = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(hint,"&");
    Для каждого ТекКанал Из МассивКаналов Цикл
        ТекКанал = Врег(ТекКанал);
        Если Найти(ТекКанал, "/" + НомерТелефона)>0
            ИЛИ  Найти(ТекКанал, "DAHDI/")>0 Тогда
            hint = ТекКанал;
            КаналНайден = Истина;
            Прервать;
        КонецЕсли; 
    КонецЦикла;
    Возврат КаналНайден;

КонецФункции

Функция ЭтоСлужебныйКанал(Знач Канал)
	Канал = ВРег(Канал);	
	Результат = Ложь;
	
	Если Лев(Канал, 11) = "LOCAL/10000" Тогда
		Результат = Истина;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

// Является ли ОС Ubuntu
// проверка 
Функция ЭтоUbuntu() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияОС = НРег(СисИнфо.ВерсияОС);
	ЭтоUbuntu = Найти(ВерсияОС, "ubuntu")>0;
	
	Возврат ЭтоUbuntu;
КонецФункции // ЭтоUbuntu()

// Смена режима при смене схемы рабоыт панели телефонии.
// 
Процедура ИзменитьРежимРаботы(РежимРаботы) Экспорт
	Режим = ПолучитьРежимРаботы(РежимРаботы);
	ИспользоватьСофтфон  = Режим.ИспользоватьСофтфон;
	ИспользоватьAsterisk = Режим.ИспользоватьAsterisk;
КонецПроцедуры

// Получаем значения режима работы панели телефонии
// 
Функция ПолучитьРежимРаботы(РежимРаботы) Экспорт
	
	Если РежимРаботы = 0 Тогда	
		врИспользоватьСофтфон  = Истина;
		врИспользоватьAsterisk = Ложь;
	ИначеЕсли РежимРаботы = 1 Тогда	
		врИспользоватьСофтфон  = Ложь;
		врИспользоватьAsterisk = Истина;
	ИначеЕсли РежимРаботы = 2 Тогда	
		врИспользоватьСофтфон  = Истина;
		врИспользоватьAsterisk = Истина;
	КонецЕсли;
	
	Режим = Новый Структура("ИспользоватьСофтфон,ИспользоватьAsterisk",врИспользоватьСофтфон, врИспользоватьAsterisk);
	Возврат Режим;
КонецФункции

// Назначает / снимает права доступа на использование панели телефонии.
// 
Процедура НазначитьСнятьРольИспользоватьСофтфон(КодПользователя, Использовать) Экспорт

	// установим роль для пользователя
	Если НЕ БезИнтеграционныйРежим
		И Метаданные.Роли.Найти("МИКО_ИспользованиеСофтфона")<>Неопределено Тогда
		РольМИКО_ИспользованиеСофтфона = Метаданные.Роли.МИКО_ИспользованиеСофтфона;
		
		Пользователь1С = ПользователиИнформационнойБазы.НайтиПоИмени(КодПользователя);
		// если такой пользователь сущействует, то установим/удалим для него роль "МИКО_ИспользованиеСофтфона"
		Если НЕ Пользователь1С = Неопределено Тогда
			// редактирование списка ролей пользователя ИБ
			РолиПользователя1С = Пользователь1С.Роли; ЗаписатьДаныеПользователя = Истина;
			Если Использовать И НЕ РолиПользователя1С.Содержит(РольМИКО_ИспользованиеСофтфона) Тогда
				РолиПользователя1С.Добавить(РольМИКО_ИспользованиеСофтфона);
			ИначеЕсли НЕ Использовать И РолиПользователя1С.Содержит(РольМИКО_ИспользованиеСофтфона)Тогда
				РолиПользователя1С.Удалить(РольМИКО_ИспользованиеСофтфона);
			Иначе
				ЗаписатьДаныеПользователя = Ложь;
			КонецЕсли; 
			// перезапись пользователя ИБ
			Если ЗаписатьДаныеПользователя = Истина Тогда
				Попытка
					Пользователь1С.Записать();
				Исключение 
					СообщитьОтладочнуюИнформацию("Панель телефонии Asterisk:", "Не вышло установить пользователю " + Пользователь1С + " роль ""МИКО_ИспользованиеСофтфона"", " + ИнформацияОбОшибке());	
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

// Возвращает имя текущего пользователя.
// 
Функция ПолучитьИмяПользователя(СсылкаНаПользователя) Экспорт
    
	КодПользователя = СокрЛП(СсылкаНаПользователя.Код);
	Если ТипЗнч(СсылкаНаПользователя) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат КодПользователя;
	КонецЕсли;
	
	Если СсылкаНаПользователя.Метаданные().Реквизиты.Найти("ИдентификаторПользователяИБ")<>Неопределено Тогда
		Попытка
			ПользотвательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(СсылкаНаПользователя.ИдентификаторПользователяИБ);
			Если ПользотвательИБ <> Неопределено Тогда
				КодПользователя = ПользотвательИБ.Имя;
			КонецЕсли; 
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Возврат КодПользователя;
	
КонецФункции // ПолучитьИмяПользователя()

// Возвращает текущую версию панели телефонии
// 
Функция Версия() Экспорт
	Возврат "1.2.24.26";		
КонецФункции // Версия()

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Объекты для оповещения 

// Подключает вненюю компоненту банера
// Комопнента должна быть зарегистрирована в операционной системе как COM объект
Процедура Банер_ПодключитьКомпонент(ЗакрыватьФормуПриДействии = Истина, Opacity = 1) Экспорт
	
	Если Не ИспользоватьБаннер Тогда
		мВнешняяПанель = Неопределено;
		Возврат;
	КонецЕсли;	
	
	Если мВнешняяПанель = Неопределено Тогда		
		Попытка
			мВнешняяПанель = ЭтотОбъект.ПолучитьФорму("ВнешняяПанель");
		Исключение
			СообщитьОтладочнуюИнформацию("Банер", "Не вышло установить значения свойств компонента банера!");
			Возврат;
		КонецПопытки;		
	КонецЕсли;
	мВнешняяПанель.ВП_ВывестиНаЭкран();
	
КонецПроцедуры

// Инициализация банера.
// 
Процедура Банер_УстановитьПараметрыТП() Экспорт
	Если НЕ ИспользоватьБаннер ИЛИ мВнешняяПанель = Неопределено Тогда		
		Возврат;	
	КонецЕсли;	
	
	НастройкиВП = Новый Соответствие;
	НастройкиВП.Вставить("Пользователь", 		 мПользователь);
	НастройкиВП.Вставить("URI", 				 НашНомерТелефона+"@"+?(ЗначениеЗаполнено(ХостAsterisk),ХостAsterisk, Хост));
	НастройкиВП.Вставить("РежимСупервизора", 	 Супервизор=Истина);
	НастройкиВП.Вставить("ВозможенАвтоподъем",   ИспользоватьАвтоподъем);
	НастройкиВП.Вставить("number", 	 		 	 НашНомерТелефона);
	
	//TODO
	НастройкиВП.Вставить("Статус",				 0);
	НастройкиВП.Вставить("coference_exists", 	 Ложь);
	НастройкиВП.Вставить("ИгровойРежим", 	 	 Ложь);
	НастройкиВП.Вставить("АктивизироватьИзТрея", Ложь);
	мВнешняяПанель.ВП_УстановитьПараметрыТекущегоПользователя(НастройкиВП);

КонецПроцедуры
 
// Открывает окно банера, окно содержит поле HTML документа. Отображается всегда поверх всех окон
// При нажатии на гиперссылки в поле HTML в 1С возвращается внешнее событие 
Процедура Банер_ДобавитьСтрокуЗвонка(СтрочкаЗвонка) Экспорт
	Если мВнешняяПанель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	UID = ПолучитьНашКанал(СтрочкаЗвонка);
	Если НЕ ЗначениеЗаполнено(UID) Тогда
	  	Возврат;
	КонецЕсли; 
	UID = СтрЗаменить(UID, "_", "$");						
	UID = СтрЗаменить(UID, "/","_");						
	Вызов = Новый Структура;
	Вызов.Вставить("НомерТелефона", 	СтрочкаЗвонка.CallerID);
	Вызов.Вставить("Партнер", 			СтрочкаЗвонка.Контрагент);
	Вызов.Вставить("Абонент", 			СтрочкаЗвонка.КонтактноеЛицо);
	Вызов.Вставить("НомерЛинии", 		UID);
	Вызов.Вставить("Город", 			СтрочкаЗвонка.Город);
	Вызов.Вставить("ChanSpyКанал", 		СтрочкаЗвонка.ChanSpyКанал);
	Вызов.Вставить("our_cidname", 		СтрочкаЗвонка.our_cidname);
	
	Вызов.Вставить("ЗвонокНаМобильный", Ложь); //TODO
	Вызов.Вставить("ЭтоКонференция", 	Ложь); //TODO
	
	Если СтрочкаЗвонка.СейчасРазговаривают Тогда
		Вызов.Вставить("Статус", 		"current");
	ИначеЕсли СтрочкаЗвонка.ВходящийЗвонок Тогда
		Вызов.Вставить("Статус", 		"ringing");
	Иначе
		Вызов.Вставить("Статус", 		"calling");
	КонецЕсли; 	
	Вызов.Вставить("Входящий", 		СтрочкаЗвонка.ВходящийЗвонок);
	Попытка
		мВнешняяПанель.ВП_ДобавитьСтрокуЗвонка(Вызов);		
	Исключение
		СообщитьОтладочнуюИнформацию("Банер", ИнформацияОбОшибке());	
	КонецПопытки;  
КонецПроцедуры

// По переданному униклаьному идентификатору производится поиск формы. 
// Если форма найдена, то производится ее закрытие
Процедура Банер_УдалитьСтрочкуЗвонка(КаналHangup) Экспорт
	Если мВнешняяПанель = Неопределено
		 ИЛИ Найти(КаналHangup, НашКаналФильтр)=0 Тогда
		Возврат;
	КонецЕсли;
	UID = СтрЗаменить(КаналHangup, "/","_");						
	UID = СтрЗаменить(UID, "&lt;ZOMBIE&gt;","");						
	Вызов = Новый Структура;
	Вызов.Вставить("НомерЛинии", 	UID);
	Попытка
		мВнешняяПанель.ВП_УдалитьСтрокуЗвонка(Вызов);
	Исключение
		СообщитьОтладочнуюИнформацию("Банер", ИнформацияОбОшибке());	
	КонецПопытки;  
КонецПроцедуры

// Заполнение таблицы сотрудников во внешней панели.
// 
Процедура Банер_ЗаполнитьТаблицуСотрудинков() Экспорт
	Если Не ИспользоватьБаннер Тогда
		мВнешняяПанель = Неопределено;
		Возврат;
	КонецЕсли;	
	
	врСписок = Новый Массив; врНомера = Новый Массив;
	Для каждого текСотрудник Из Сотрудники Цикл
		Если врНомера.Найти(текСотрудник.ВнутреннийНомер)<>Неопределено Тогда
		 	Продолжить;
		КонецЕсли; 
		врНомера.Добавить(текСотрудник.ВнутреннийНомер);
		
		нЭлемент = Новый Структура;
		нЭлемент.Вставить("НомерТелефона",	текСотрудник.ВнутреннийНомер);
		нЭлемент.Вставить("Абонент",		""+текСотрудник.Сотрудник);
		нЭлемент.Вставить("АбонентСсылка",	текСотрудник.Сотрудник);
		нЭлемент.Вставить("Видимость",		текСотрудник.ВнутреннийНомер <> НашНомерТелефона);
		нЭлемент.Вставить("Собеседник",		текСотрудник.Собеседник);
		нЭлемент.Вставить("МобильныйНомер",	текСотрудник.МобильныйНомер);
		нЭлемент.Вставить("СтатусКод",		текСотрудник.Состояние); //TODO
		врСписок.Добавить(нЭлемент);
		
	КонецЦикла; 

	Попытка
		мВнешняяПанель.ВП_ЗаполнитьСписокСотрудников(врСписок);
	Исключение
	КонецПопытки; 
КонецПроцедуры

// Смена статуса пользователя во внешней панели.
// 
Процедура Банер_УстановитьСтатусПользователя(НомерТелефона, Статус, Собеседник) Экспорт
	Если Не ИспользоватьБаннер Тогда
		Возврат;
	КонецЕсли;	
	//if(_status==4){
	//	// не доступен
	//	j_el.addClass('black');
	//}else if(_status==0){
	//	// доступен
	//	j_el.addClass('green');
	//}else if(_status==2){
	//	// занят
	//	j_el.addClass('red');
	//}else{
	//	// на линии
	//	j_el.addClass('orange');
	//}
	
	Если НЕ мВнешняяПанель = Неопределено Тогда
		мВнешняяПанель.ВП_УстановитьСтатусПользователя(НомерТелефона, Статус, Собеседник);
	КонецЕсли;
КонецПроцедуры

Процедура Банер_ДобавитьЗапаркованныйВызов(СлотПарковки)
	#Если ВебКлиент Тогда
	// баннер не работает в веб клиенте	
	Возврат;	
	#КонецЕсли 	
	Если НЕ мВнешняяПанель = Неопределено Тогда
		// СлотПарковки.Слот, СлотПарковки.calleridnum, СлотПарковки.Контакт
		мВнешняяПанель.ВП_ДобавитьЗапаркованныйВызов(СлотПарковки);	
	КонецЕсли;
КонецПроцедуры

Процедура Банер_УдалитьЗапаркованныйВызов(СлотПарковки)
	#Если ВебКлиент Тогда
	// баннер не работает в веб клиенте	
	Возврат;	
	#КонецЕсли 	
	Если НЕ мВнешняяПанель = Неопределено Тогда
		мВнешняяПанель.ВП_УдалитьЗапаркованныйВызов(СлотПарковки);	
	КонецЕсли;
КонецПроцедуры

// Заполняет историю звонков во внешней панеле - дублере.
// 
Процедура Банер_ЗаполнитьИсториюЗвонков() Экспорт
	Если мВнешняяПанель = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	Если ИсторияЗвонков.Количество()=0 Тогда
		мВнешняяПанель.ВП_ОчиститьИсториюЗвонков();
		Возврат;
	КонецЕсли; 

	врИстория = Новый Массив;
	Для каждого ТекСтрокаИстории Из ИсторияЗвонков Цикл
	    врЗапись = Новый Структура;
		врЗапись.Вставить("НомерТелефона", 	ТекСтрокаИстории.НомерТелефона);
		врЗапись.Вставить("Id", 		    СокрЛП(ТекСтрокаИстории.ИдентификаторЗвонка));
		
		пДанныеЗаписи = ЗаписиРазговоров.Найти(СокрЛП(ТекСтрокаИстории.ИдентификаторЗвонка), "recordingfile");
		Если НЕ пДанныеЗаписи = Неопределено Тогда
			врЗапись.Вставить("Id", 		пДанныеЗаписи.uniqueid);
		КонецЕсли; 
		
		врЗапись.Вставить("Начало", 		ТекСтрокаИстории.Когда);
		врЗапись.Вставить("Входящий", 		ТекСтрокаИстории.ВходящийЗвонок);
		врЗапись.Вставить("Организация", 	ТекСтрокаИстории.Контрагент);
		врЗапись.Вставить("Абонент", 		ТекСтрокаИстории.КонтактноеЛицо);
		врЗапись.Вставить("ЕстьЗапись", 	ЗначениеЗаполнено(ТекСтрокаИстории.ИмяФайла));
		врЗапись.Вставить("Пропущен", 		ТекСтрокаИстории.ПропущенныйЗвонок И ТекСтрокаИстории.ВходящийЗвонок);
		врЗапись.Вставить("ПродолжительностьРазговора", ТекСтрокаИстории.СекундДлился);
		
		врИстория.Добавить(врЗапись);
	КонецЦикла; 
	
	мВнешняяПанель.ВП_ЗаполнитьТаблицуЗвонковНаСегодня(врИстория);
КонецПроцедуры
 

// Обрабатываем нажатие на кнопки банера
// 
Процедура onОбработкаКомандБанера(Источник, Событие, Данные)
	Перем ДанныеСобытия, Действие;
	// Выполним разбор данных
	// Пример данных: "new Structure("action","reloadcallhistory")";
	Если мВнешняяПанель = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	мВнешняяПанель.ДобавитьТекстОтладки("// " + Событие + ": " + Данные);
	Если "HASP_ERROR" = Событие Тогда
		Возврат;	
	КонецЕсли; 
	Попытка
	ДанныеСобытия = Вычислить(Данные);
	Исключение
	КонецПопытки; 
	
	Если Событие = "LoadFinished" Тогда
		мВнешняяПанель.hВыполнитьОчередьСкриптов();
	  	Возврат;
	ИначеЕсли НЕ ТипЗнч(ДанныеСобытия) = Тип("Структура") Тогда		
	  	Возврат;
	КонецЕсли;
	
	ДанныеСобытия.Свойство("action", Действие);
	Если НЕ ЗначениеЗаполнено(Действие) Тогда
		Возврат;	
	КонецЕсли;
	
	// Найдем данные звонка с указанным id
	Если ДанныеСобытия.Свойство("id") Тогда
		UID = СтрЗаменить(ДанныеСобытия.id, "_", "/");						
		UID = СтрЗаменить(UID, "$", "_");						
		
		Отбор = Новый Структура("НомерЛинии", UID);
		РезультатОтбора = Звонки.Найти(UID, "Канал1,Канал2,Канал");
		Если РезультатОтбора<>Неопределено Тогда
			ТекущийВызов = РезультатОтбора;
		ИначеЕсли НЕ (ИспользоватьAsterisk И Действие = "unhold") Тогда
			// Нет такого звонка, обрабатывать дальше нечего
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Действие "позвонить на номер"
	Если Действие = "dial" Тогда
		Если Звонки.Количество()=0 Тогда
			НабратьНомер(ДанныеСобытия.Number);
		Иначе	
			врСотрудник = Сотрудники.Найти(ДанныеСобытия.Number, "ВнутреннийНомер"); 
			Если врСотрудник <> Неопределено И врСотрудник.Состояние=СостояниеЭкстеншена.Свободен Тогда
				ПереводЗвонка(Звонки[Звонки.Количество() - 1],врСотрудник.ВнутреннийНомер);
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли Действие = "openpanelsettings" Тогда
		ФормаНастройки=мОбщийМодуль.ПолучитьФормуНастройки();
		Если ФормаНастройки.Открыта() Тогда
			ФормаНастройки.Активизировать();
		Иначе
			ФормаНастройки.Открыть();
		КонецЕсли; 
	// Действие "овтетить на звонок"
	ИначеЕсли Действие = "answer" Тогда
		Если ИмяТекущейКонфигурации = "ТрактиръFrontOffice" И ОтветитьНаЗвонок(ТекущийВызов) Тогда
			мОбщийМодуль.ОтветилиНаЗвонок(ТекущийВызов);
		Иначе	
			ОтветитьНаЗвонок(ТекущийВызов);
		КонецЕсли; 
	// Действие "завершить звонок"
	ИначеЕсли Действие = "hangup" Тогда
		ОтбойЗвонка(ТекущийВызов);
	// Действие "Удержать вызов"	
	ИначеЕсли Действие = "hold" Тогда
		ПоставитьНаУдежание(ТекущийВызов);
	// Действие "Вернуть с удержания вызов с id="	
	ИначеЕсли Действие = "unhold" Тогда
		врЗапаркованныйВызов = Парковка.Найти(ДанныеСобытия.id, "Слот");
		Если ИспользоватьAsterisk И НЕ врЗапаркованныйВызов = Неопределено Тогда			
			НабратьНомер(ДанныеСобытия.id,, врЗапаркованныйВызов.calleridnum);
		ИначеЕсли ИспользоватьСофтфон И НЕ ТекущийВызов = Неопределено Тогда	
			ПоставитьНаУдежание(ТекущийВызов);
		КонецЕсли; 
	// Смена режима SPY.	
	ИначеЕсли Действие = "changechanspymode" Тогда
		number = ТекущийВызов.CallerID;     
		Канал  = ТекущийВызов.ChanSpyКанал;
		ОтбойЗвонка(ТекущийВызов);
		Если ДанныеСобытия.mode = "conference" Тогда
			ВмешатьсяВРазговор(Канал, number);
		ИначеЕсли ДанныеСобытия.mode = "whisper" Тогда 	
			ШепнутьКоллеге(Канал 	, number);
		ИначеЕсли ДанныеСобытия.mode = "listen" Тогда 	
			ПодслушатьРазговор(Канал, number);
		КонецЕсли; 
	ИначеЕсли Действие = "transfercall" Тогда
		ПереводЗвонка(ТекущийВызов, ДанныеСобытия.Number);
	// Действие "Отправить DTMF команду в переменной symbol, которая урлэнкодится, проблема с символом #"	
	ИначеЕсли Действие = "senddtmf" И Звонки.Количество()>0 Тогда					
		врТекущийВызов = Звонки[0];
		symbol = ?(ДанныеСобытия.symbol = "%23","#",ДанныеСобытия.symbol);
		ДонаборНомера(врТекущийВызов, symbol, Истина);
	// Действие "подслушать разговор"
	ИначеЕсли Супервизор И Действие = "listencall" Тогда
		Хинт = Сотрудники.найти(ДанныеСобытия.number, "ВнутреннийНомер");
		Если Хинт = Неопределено Тогда Возврат; КонецЕсли; 
		ПодслушатьРазговор(Хинт.КаналСотрудника, ДанныеСобытия.number);
	// Действие "вмешаться в разговор"
	ИначеЕсли Супервизор И Действие = "join2call" Тогда
		Хинт = Сотрудники.найти(ДанныеСобытия.number, "ВнутреннийНомер");
		Если Хинт = Неопределено Тогда Возврат; КонецЕсли; 
		ВмешатьсяВРазговор(Хинт.КаналСотрудника, ДанныеСобытия.number);
	// Действие "шепнуть коллеге"
	ИначеЕсли Супервизор И Действие = "wisper2call" Тогда
		Хинт = Сотрудники.найти(ДанныеСобытия.number, "ВнутреннийНомер");
		Если Хинт = Неопределено Тогда Возврат; КонецЕсли; 
		ШепнутьКоллеге(Хинт.КаналСотрудника, ДанныеСобытия.number);
	ИначеЕсли Действие = "reloadcallhistory" Тогда	
		ЗаполнитьТаблицуИсторииЗвонков(ТекущаяДата());
	ИначеЕсли Действие = "getcallrecordsfiles" Тогда
		historyid = СокрЛП(ДанныеСобытия.historyid);
		ЗаписиДляВнешнейПанели.Добавить(historyid);
		Если НазваниеPBX = "MYPBX" Тогда
			пДанныеЗаписи = ЗаписиРазговоров.Найти(historyid, "uniqueid");
			Если НЕ пДанныеЗаписи = Неопределено Тогда
				historyid = пДанныеЗаписи.recordingfile; 
			КонецЕсли; 
			ИменаФайлов = ПолучитьИменаФайловИзстроки(historyid);		
		  	ПолучитьФорму("custom_MyPBX").ПолучитьФайлЗаписи(ИменаФайлов, ДанныеСобытия.historyid);
		Иначе	
			ЗапроситьИмяФайлаЗаписиCDRПоИдентификатору(historyid);
		КонецЕсли;
	// Действие "Скачать запись разговоров для записи истории с id="
	ИначеЕсли Действие = "downloadcallrecord" Тогда
		мВнешняяПанель.ВП_ОткрытьЗагруженныйФайл(ДанныеСобытия.historyid);
	// Действие "Прослушать запись разговоров обратным вызовом для записи истории с id="
	ИначеЕсли Действие = "callbackcallrecord" Тогда
		мВнешняяПанель.ВП_ПрослушатьЗаписьОбратнымЗвонком(ДанныеСобытия.historyid);
	ИначеЕсли Действие = "searchclientsbystring"
			  И СтрДлина(ДанныеСобытия.value)>3 Тогда
		// WebKitEvent:new Structure("action, value","searchclientsbystring", "МИКО")
		РезультатПоиска = НайтиАбонентаПоИмени(""+ДанныеСобытия.value);
		мВнешняяПанель.ВП_ОтобразитьНайденныеКонтакты(РезультатПоиска);
	// Действие "Сохранить положение кнопки вызова панели телефонии, передаются параметры top и left"	
	ИначеЕсли Действие = "storemenubuttonposition" Тогда 
		врНастройки = Новый Структура("ПикселейСлева,ПикселейСверху", ДанныеСобытия.left, ДанныеСобытия.top);
		мВнешняяПанель.ВП_СохранитьНастройки(врНастройки);
	ИначеЕсли Действие = "storelasthistorybrowse" Тогда 
		врНастройки = Новый Структура("lasthistoryviewed", ТекущаяДата());
		мВнешняяПанель.ВП_СохранитьНастройки(врНастройки);
	ИначеЕсли Действие = "storepanelwindowstate" Тогда 
		врНастройки = Новый Структура("visible,width,pinned", ДанныеСобытия.visible, ДанныеСобытия.width, ДанныеСобытия.pinned);
		мВнешняяПанель.ВП_СохранитьНастройки(врНастройки);
	КонецЕсли;	
КонецПроцедуры

Процедура РазобратьСобытиеHWindow(Данные, Результат_Данные)
	
	Результат_Данные = Новый Структура;
	
	МассивПараметровСобытия = мОбработкаДанных.мРазложитьСтрокуВМассивПодстрок(Данные, "&");
	Для Каждого ПараметрЗначение Из МассивПараметровСобытия Цикл
		ПозицияРазделителя = Найти(ПараметрЗначение, "=");
		Если ПозицияРазделителя > 0 Тогда
			Параметр = Лев(ПараметрЗначение, ПозицияРазделителя - 1);
			Значение = Сред(ПараметрЗначение, ПозицияРазделителя + 1);
		
			Результат_Данные.Вставить(Параметр, Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Установка вызова на удержание или его парковка
// Параметры
//   СтрочкаЗвонка - активный вызов, строка таблицы "Звонки"
// 
Процедура ПоставитьНаУдежание(СтрочкаЗвонка) Экспорт

	Если НЕ ИспользоватьAsterisk
		 И ДопМодули.Свойство("НаборНомера")
		 И НЕ (ДопМодули.НаборНомера = Неопределено) Тогда
		ДопМодули.НаборНомера.ВыполнитьДействиеНадЗвонком(СтрочкаЗвонка, "Удержание");
		Возврат;	
	КонецЕсли;
	
	// перед парковой требется ответить на звонок
	Если СтрочкаЗвонка.СейчасРазговаривают = Истина Тогда
		ЗапарковатьНаСвободныйСлот(СтрочкаЗвонка);
	ИначеЕсли ОтветитьНаЗвонок(СтрочкаЗвонка) Тогда
		// при ответе на звонок средствами пикапа изменяется имя нашего канал
		// необходимо дождаться бридж (соединения двух абонентов) и запарковать вызов
		Канал = ?(СтрочкаЗвонка.ВходящийЗвонок = Истина, СтрочкаЗвонка.Канал1, СтрочкаЗвонка.Канал2);
		КаналыКПарковке.Вставить(Канал,СтрочкаЗвонка.CallerID);
	Иначе	
	   	// нет возможности запарковать вызов
		Сообщить("Нет возможности запарковать этот вызов!");
	КонецЕсли; 	

КонецПроцедуры 

// Ищем нащ канал вызова в связях каналов.
// 
Функция ПолучитьНашКанал(СтрочкаЗвонка)
	КаналСвязи = "";
	Если НЕ ИспользоватьAsterisk И ИспользоватьСофтфон И НЕ СтрочкаЗвонка = Неопределено  Тогда
		Возврат СтрочкаЗвонка.Канал;
	ИначеЕсли Не ЗначениеЗаполнено(НашКаналФильтр) ИЛИ СтрочкаЗвонка = Неопределено Тогда
	 	Возврат КаналСвязи;
	КонецЕсли; 
	
	Если Найти(СтрочкаЗвонка.Канал1, НашКаналФильтр)>0 Тогда
		Возврат СтрочкаЗвонка.Канал1;
	ИначеЕсли Найти(СтрочкаЗвонка.Канал2, НашКаналФильтр)>0 Тогда	
		Возврат СтрочкаЗвонка.Канал2;
	КонецЕсли; 
	
	Связь = мОбработкаДанных.НайтиСвязьКанала(СтрочкаЗвонка.Канал1);
	Если НЕ Связь = Неопределено
		 И Связь.Свойство("КаналСвязи", КаналСвязи) 
		 И Найти(КаналСвязи, НашКаналФильтр)>0 Тогда
		 
		Возврат КаналСвязи;	
	КонецЕсли;
	Связь = мОбработкаДанных.НайтиСвязьКанала(СтрочкаЗвонка.Канал2);
	Если НЕ Связь = Неопределено
		 И Связь.Свойство("КаналСвязи", КаналСвязи) 
		 И Найти(КаналСвязи, НашКаналФильтр)>0 Тогда
		 
		Возврат КаналСвязи;	
	КонецЕсли;
	
	Возврат КаналСвязи;
КонецФункции // ПолучитьНашКанал()
 

//------------ Банер ------------------------------------- Конец //
//////////////////////////////////////////////////////////////////

// Функция разбирает строку на параметры
//  возвращает структура вида Параметр1, Параметр2, и т.д.
Функция ПреобразоватьСтрокуВПараметры(Знач ТекущаяСтрока) Экспорт
	КолОткрывающих = СтрЧислоВхождений(ТекущаяСтрока, "[");
	КолЗакрывающих = СтрЧислоВхождений(ТекущаяСтрока, "]");
	
	// Если открывающих меньше чем закрывающий то выходим
	Если НЕ КолОткрывающих = КолЗакрывающих Тогда Возврат Неопределено КонецЕсли;
	
	Результат = Новый Структура();
	Для Ном = 1 По КолОткрывающих Цикл
		НомНачала = Найти(ТекущаяСтрока, "[");
		НомКонца  = Найти(ТекущаяСтрока, "]");
		Значение = Сред(ТекущаяСтрока, НомНачала+1, НомКонца-НомНачала-1);
		Результат.Вставить("Параметр"+Строка(Ном), Значение);
		
		ТекущаяСтрока = Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-НомКонца);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Дополнительные модули

// Инициализация вспомогательных модулей панели телефонии.
// 
Процедура ИнициализироватьОсновныеДопМодули() Экспорт
	// общий для всех модуль
	мОбработкаДанных = ЭтотОбъект.ПолучитьФорму("мОбработкаДанных");
	
	// 
	// подключение дополнительных модулей
	Если ДопМодули = Неопределено Тогда
		ДопМодули = Новый Структура;
		ДопМодули.Вставить("НаборНомера", ЭтотОбъект.ПолучитьФорму("МодульSIP"));
	КонецЕсли; 
	
	// Этап 1: подключаем первичные доп модули
	ИмяОбщегоМодуля = ПолучитьИмяОбщегоМодуля();
	Если ИмяОбщегоМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ИнициализироватьОбщийМодуль(ИмяОбщегоМодуля);
	
	// первоначальное заполнение глобальных переменных	
	ГлобальныеПеременные = мОбщийМодуль.ПолучитьГлобальныеПеременные();
	ГлобальныеПеременные.Вставить("глИспользоватьПанельТелефонии", БезИнтеграционныйРежим);	
	
КонецПроцедуры

// Инициализация общего модуля - специфичного для конкретной кофнигурации
// 
Функция ИнициализироватьОбщийМодуль(ИмяОбщегоМодуля) Экспорт
	Попытка
		мОбщийМодуль 	 = ЭтотОбъект.ПолучитьФорму(ИмяОбщегоМодуля);
	    мПользователь 	 = мОбщийМодуль.ПолучитьТекущегоПользователя();
	 	Возврат Истина;
	Исключение
	 	Возврат Ложь;
	КонецПопытки; 
КонецФункции

// Получение имени основного вспомогательного модуля панели телефонии.
// 
Функция ПолучитьИмяОбщегоМодуля() Экспорт
	ИмяМодуля = Неопределено; 
	
	тмпИмяКонфигурации = мОбработкаДанных.ПолучитьНастройкиИзХранилища("MIKO","ИмяКонфигурации",,ИмяТекущегоПользователя);
	ИмяТекущейКонфигурации = ?(ЗначениеЗаполнено(тмпИмяКонфигурации),тмпИмяКонфигурации,Метаданные.Имя); 
	ВерсияК = Метаданные.Версия;
	
	Если ИмяТекущейКонфигурации = "Автосалон5" Тогда
		ИмяМодуля = "мОбщийМодуль_АльфаАвто";
	ИначеЕсли ИмяТекущейКонфигурации = "Автоматизация_1СФранчайзи"
		ИЛИ ИмяТекущейКонфигурации = "УправлениеТорговлей_CRMПроф"
		ИЛИ ИмяТекущейКонфигурации = "CRM"
		ИЛИ ЭтоCRMКонфигурация() Тогда
		ИмяМодуля = "мОбщийМодуль_CRM";
	ИначеЕсли (ИмяТекущейКонфигурации = "УправлениеТорговлей" И Лев(ВерсияК, 4) = "10.3")
		ИЛИ ИмяТекущейКонфигурации = "УправлениеПроизводственнымПредприятием"
		ИЛИ ИмяТекущейКонфигурации = "КомплекснаяАвтоматизация"
		ИЛИ ИмяТекущейКонфигурации = "УправлениеТорговымПредприятиемДляУкраины"
		ИЛИ ИмяТекущейКонфигурации = "УправлениеТорговымПредприятиемДляКазахстана"
		ИЛИ (ИмяТекущейКонфигурации = "УправлениеТорговлейДляУкраины" И Лев(ВерсияК, 3) = "2.3") 
		ИЛИ ИмяТекущейКонфигурации = "УправлениеПроизводственнымПредприятиемДляУкраины" Тогда
		ИмяМодуля = "мОбщийМодуль_УТ10_3";
	ИначеЕсли ИмяТекущейКонфигурации = "УправлениеТорговлей" И Лев(ВерсияК, 4) = "10.2" Тогда	
		ИмяМодуля = "мОбщийМодуль_УТ10_2";
	ИначеЕсли ИмяТекущейКонфигурации = "БухгалтерияПредприятия"
		ИЛИ ИмяТекущейКонфигурации = "БухгалтерияДляУкраины" Тогда
		ИмяМодуля = "мОбщийМодуль_БП2_0";
	ИначеЕсли ИмяТекущейКонфигурации = "ТрактиръFrontOffice" Тогда
		ИмяМодуля = "мОбщийМодуль_ТрактиръFrontOffice";					
	Иначе
		// Это не известная конфигурация
		// следует запустить стартовый помощник
		// и определить параметры запуска
		Если КонтрольПервогоЗапуска() Тогда
			ПолучитьИмяОбщегоМодуля();
		
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяМодуля;
КонецФункции // ПолучитьИмяОбщегоМодуля()
// Является ли текущая конфигурация CRM от Рарус.
// 
Функция ЭтоCRMКонфигурация() Экспорт
	ЭтоCRM = (НЕ Метаданные.Константы.Найти("CRM_ИспользуемыйСофтФон") = Неопределено);	
	Возврат ЭтоCRM;
КонецФункции // ЭтоCRMКонфигурация()

// Удаление временных фалов дополнительных модулей
// 
Процедура ОсвободитьДопМодули() Экспорт
	Если НЕ ТипЗнч(ДопМодули) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;  
	
	// чистим временные файлы
	Для каждого Модуль Из ДопМодули Цикл
		Если НЕ ДопМодули[Модуль.Ключ] = Неопределено
			И НЕ ТипЗнч(ДопМодули[Модуль.Ключ]) = Тип("Строка") Тогда
			ДопМодули[Модуль.Ключ].Деструктор();
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

// Поиск исходного канала. Если имеется локальный канал, то необходимо найти действительный.
// С локальным каналом можно производить не все операции AMI.
// Поиск производится по таблице связей каналов.
// 
// Параметры 
//   ИмяКанала - <Строка>, имя локального канала
// 
Функция ПоискРеальногоКанала(ИмяКанала, cid_chan=Неопределено, cid_sob=Неопределено, БезDial=Истина)
	врИсхКанал = ИмяКанала;
	
	КоличествоИтераций = 10;
	сч = 0;
	
	Пока сч < КоличествоИтераций И ИмяКанала <> Неопределено Цикл
		
		ИмяКанала = ПоискПоСвязямКаналов(ИмяКанала, cid_chan, cid_sob, БезDial);
		
		Если Найти(ВРЕГ(ИмяКанала), "LOCAL") <> 0 Тогда
			сч = сч+1;
			Продолжить;
		Иначе
			Возврат Истина;
		КонецЕсли;

	КонецЦикла;
	
	// ничего не нашли
	ИмяКанала = врИсхКанал;
	cid_chan  = "";
	cid_sob   = "";
	
	Возврат Ложь;
КонецФункции // ПоискРеальногоКанала()

// Поиск нашего канала.
Функция НайтиИсходныеКаналы(Channel)
	вр_Каналы = Новый Структура("chan1,chan2",Неопределено, Неопределено);
	// Ищем СВОЙ Канал
	Если Найти(ВРЕГ(Channel), "LOCAL")>0 Тогда
		врChannel  = мОбработкаДанных.ОтсечьПлечоВLocal(Channel, Ложь);
		п1_Channel = врChannel + ";2";
		п2_Channel = врChannel + ";1";
		
		ПоискРеальногоКанала(п1_Channel, Неопределено, Неопределено, Ложь);
		ПоискРеальногоКанала(п2_Channel, Неопределено, Неопределено, Ложь);
		// НАШ канал
		Если Найти(ВРЕГ(п1_Channel), "LOCAL")=0 Тогда
			вр_Каналы.chan1 = п1_Channel;			
		КонецЕсли; 
		Если Найти(ВРЕГ(п2_Channel), "LOCAL")=0 Тогда
			вр_Каналы.chan2 = п2_Channel;			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат вр_Каналы;
КонецФункции // НайтиНашКанал()
 

// <Описание процедуры>
//
Функция ПоискПоСвязямКаналов(Знач ИмяКанала, cid_chan=Неопределено, cid_sob=Неопределено, БезDial=Истина)

	// допустим имеем канал  Local/04@internal-caller-transfer-000001f0;2
	Если Найти(ВРЕГ(ИмяКанала), "LOCAL")=0 Тогда
	 	Возврат Неопределено;
	КонецЕсли; 
	
	// базовое имя канала  Local/04@internal-caller-transfer-000001f0
	LocalКанал = мОбработкаДанных.ОтсечьПлечоВLocal(ИмяКанала, Ложь);
	
	// нам надо найти, с каким каналом связано его второе плечо
	// Local/04@internal-caller-transfer-000001f0;1
	ИмяПлеча = ?(Найти(ИмяКанала, ";2"), ";1", ";2");
	КаналДляПоиска = ""+LocalКанал+ИмяПлеча;
	
	Если БезDial = Истина Тогда
		// найдем связь канала
		МассивСтрок  = СвязиКаналов.НайтиСтроки(Новый Структура("Канал1,Dial", КаналДляПоиска, Ложь));
		МассивСтрок2 = СвязиКаналов.НайтиСтроки(Новый Структура("Канал2,Dial", КаналДляПоиска, Ложь));
		Для Каждого Элм Из МассивСтрок2 Цикл
			МассивСтрок.Добавить(Элм);
		КонецЦикла;
		Если МассивСтрок.Количество() = 0 Тогда
		 	Возврат Неопределено;
		Иначе
			СтрокаСвязи = МассивСтрок[0];
		КонецЕсли; 

	Иначе	
		СтрокаСвязи = СвязиКаналов.Найти(КаналДляПоиска, "Канал1,Канал2");
		
		Если СтрокаСвязи = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	Если СтрокаСвязи.Канал1 = КаналДляПоиска Тогда
		cid_chan = СтрокаСвязи.cid1;
		cid_sob =  СтрокаСвязи.cid2;
		Возврат СтрокаСвязи.Канал2;
	Иначе
		cid_chan = СтрокаСвязи.cid2;
		cid_sob =  СтрокаСвязи.cid1;
		Возврат СтрокаСвязи.Канал1;
	КонецЕсли;

КонецФункции // ПоискПоСвязямКаналов()

// Необходима для интеграции с конфигурацией Трактиръ.
//
Процедура УстановкаНачальныхЗначений() Экспорт
	ИнициализироватьВспомагательныеПеременные();	
КонецПроцедуры	

// Очистка кэш
// 
Процедура ОчиститьКешПеременныхКанала(ИмяКанала = "")

	Если ЗначениеЗаполнено(ИмяКанала) Тогда
		УдалитьЗаписьПеременнойПоКлючу(ИмяКанала+"_MIXMONITOR_FILENAME");
		УдалитьЗаписьПеременнойПоКлючу(ИмяКанала+"_CDR(linkedid)");
		УдалитьЗаписьПеременнойПоКлючу(ИмяКанала+"_extenfrom1c");
		УдалитьЗаписьПеременнойПоКлючу(ИмяКанала+"_DIALEDPEERNUMBER");		
	Иначе
		ПеремКаналовСтруктура.Очистить();
	КонецЕсли; 

КонецПроцедуры // ОчиститьКешПеременныхКанала()

// Очистка кэш
//
Процедура УдалитьЗаписьПеременнойПоКлючу(КлючПерменной)

	ЗначениеПеремКанала = ПеремКаналовСтруктура.Получить(КлючПерменной);
	Если ЗначениеПеремКанала <> Неопределено Тогда
		ПеремКаналовСтруктура.Удалить(КлючПерменной);
	КонецЕсли; 

КонецПроцедуры // УдалитьЗаписьПеременнойПоКлючу()


/////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ИнициализироватьВспомагательныеПеременные();
