//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет обновление информационной базы до требуемой версии.
// Предназначена для вызова при начале работы системы в случае, если значение
// константы НомерВерсииКонфигурации не соответствует свойству Метаданные.Версия.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьОбновление() Экспорт

	// Подготовка к выводу формы описания обновлений.
	МакетОписаниеОбновлений = Неопределено;
	ДокументОписаниеОбновлений = Неопределено;
	#Если Клиент Тогда				
	ФормаОписаниеОбновлений    = ПолучитьФорму("ОписаниеОбновлений");
	МакетОписаниеОбновлений    = ПодготовитьМакетОписаниеОбновлений(ФормаОписаниеОбновлений);
	ДокументОписаниеОбновлений = ФормаОписаниеОбновлений.ЭлементыФормы.ДокументОписаниеОбновлений;
	ДокументОписаниеОбновлений.Очистить();
	#КонецЕсли
	
	// Перед обновлением требуется снять дату запрета изменения данных
	ПараметрыСеанса.ГраницыЗапретаИзмененияДанных = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(0));
	
	ТребуетсяЗапускПакетаОбработокОбновленияКонфигурации = Ложь;
	
	// Обновление информационной базы.
	// Последовательно вызываются функции для обновления с соответствующей версии.
	ПервыйЗапуск = (Константы.НомерВерсииКонфигурации.Получить() = "");
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	ИсходнаяВерсияИБ = ТекущаяВерсияИБ;
	ТекущийНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ);
	Если ПервыйЗапуск Тогда
		
		#Если Клиент Тогда				
		ФормаСтартовогоПомощника = Обработки.СтартовыйПомощник.ПолучитьФорму("Форма");
		ФормаСтартовогоПомощника.ПервыйЗапуск = Истина;
		ФормаСтартовогоПомощника.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
		ФормаСтартовогоПомощника.Открыть();
		Если ФормаСтартовогоПомощника.Открыта() Тогда
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапуск.Видимость = Истина;
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапуск.Значение = 
				"Пожалуйста, подождите...";
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапускДополнительная.Видимость = Истина;
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапускДополнительная.Значение = 
				"Выполняется начальное заполнение информационной базы.
				|Это может занять несколько минут.";
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьВперед.Доступность = Ложь;
		КонецЕсли;
		#КонецЕсли

		НачатьТранзакцию();

		Если НЕ ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда 
			                                                       		
			ЗаполнитьПустуюИБ(ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
			
		КонецЕсли;		
				
		Константы.НомерВерсииКонфигурации.Установить(Метаданные.Версия); // после заполнения пустой ИБ установим последний номер версии
		ЗафиксироватьТранзакцию();

		Если Константы.НомерВерсииКонфигурации.Получить() = Метаданные.Версия Тогда
			#Если Клиент Тогда				
			Если ФормаСтартовогоПомощника.Открыта() Тогда
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапускДополнительная.Видимость = Ложь;
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьПервыйЗапуск.Значение = 
				"Начальное заполнение информационной базы выполнено успешно. 
				|Для продолжения работы нажмите кнопку ""Далее"".";
				ФормаСтартовогоПомощника.ЭлементыФормы.НадписьВперед.Доступность = Истина;
			КонецЕсли;
			#КонецЕсли
		КонецЕсли;

		#Если Клиент Тогда				
		Если ДокументОписаниеОбновлений.ВысотаТаблицы > 0 Тогда
			ФормаОписаниеОбновлений.Открыть(); // для заполнения справочников при первом запуске.
		КонецЕсли;
		#КонецЕсли

		Возврат;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.1.3";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.1.19.1") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.1") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		
		СостояниеОбновления("");
		НачальноеЗаполнение =Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "ВидыНалоговойДеятельности");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "НалоговыеНазначенияАктивовИЗатрат");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СхемыНалоговогоУчетаПоДоговорамКонтрагентов");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "НаборыСтатейНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиОтсроченныхНалоговыхАктивовИОбязательств");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "НалоговыеГруппыОсновныхСредств");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНалогаНаПрибыль");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиЗатрат");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНеоперационныхРасходов");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиДоходов");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СхемыРеализации");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СпособыОтраженияРасходовПоАмортизации");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		ЗаполнитьНалоговыеНазначенияНКУСправочниковРегистров();
		
		
		НачисленияПоУмолчаниюКопия = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию.Скопировать();
		УдержанияПоУмолчаниюКопия = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеУдержанийПоУмолчанию.Скопировать();
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СпособыОтраженияЗарплатыВРеглУчете");
		НачисленияПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(НачисленияПоУмолчанию,НачисленияПоУмолчаниюКопия,"Наименование,НалоговоеНазначениеДоходовИЗатрат,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,ВзносыОсновногоНачисления");
		НачисленияПоУмолчанию.Записать();
		УдержанияПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеУдержанийПоУмолчанию.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УдержанияПоУмолчанию,УдержанияПоУмолчаниюКопия,"Наименование,НалоговоеНазначениеДоходовИЗатрат,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,ВзносыОсновногоНачисления");
		УдержанияПоУмолчанию.Записать();
		
		ОбновитьОтражениеВзносовФОТВРеглУчете();
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		ПерезаполнитьПроводкиПоЗарплатнымДокументамНалоговымиНазначениямиНКУ();
		
		ЗаполнитьНастройкуПользователейОсновнойПредставительОрганизации();
		
		УстановитьКоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли();
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		Если НЕ (ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.1") Тогда
			Константы.ЗапретИзмененияДанныхДо01042011.Установить(Истина);
		КонецЕсли;
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	ИначеЕсли Лев(ТекущаяВерсияИБ,3) = "1.1" Тогда
		
		Сообщить(Локализация.СтрШаблон1(НСтр("ru = 'Обновление конфигурации с версии  ¤1¤ на версию ¤2¤ не предусмотрено! Необходимо вначале оновить версию до ¤3¤!'; uk = 'Оновлення конфігурації з версії  ¤1¤ на версію ¤2¤ не передбачено! Необхідно спочатку оновити версію до ¤3¤!'"),
				 ТекущаяВерсияИБ, НоваяВерсияИБ, "1.1.19.1"));
		
	КонецЕсли;
			 
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.2.3";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.1.3") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.2") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		
		СостояниеОбновления("");
		НачальноеЗаполнение =Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНалогаНаПрибыль");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", 		"СтатьиДоходов");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", 		"СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", 		"ОсновныеСредства");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "ПричиныНетрудоспособности");
		
		Если ИсходнаяВерсияИБ = "1.2.1.3" Тогда
			НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СхемыНалоговогоУчетаПоДоговорамКонтрагентов");
			НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "НаборыСтатейНалоговыхДеклараций");
			ОбновитьВхожденияПредопределенныхЭлементовСправочников();
		КонецЕсли;
		
		//Обработка изменений в плане счетов
		ОбработатьИзмененияВПланеСчетовХозрасчетныйВерсия1_2_2();
		
		СпособОтраженияУстарело = Справочники.СпособыОтраженияЗарплатыВРеглУчете.УстарелоОтражениеБольничныхЗаСчетФСС.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(СпособОтраженияУстарело.СчетДт) Тогда
			СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетФСС.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СпособОтраженияУстарело,СпособОтражения,"НалоговоеНазначениеДоходовИЗатрат,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,ВзносыОсновногоНачисления");
			СпособОтраженияУстарело.Наименование = "(устарело) Отражение больничных за счет ФСС";
			СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами;
			СпособОтражения.СубконтоДт1 = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудосп;
			СпособОтражения.СубконтоДт2 = Неопределено;
			СпособОтраженияУстарело.Записать();
			СпособОтражения.Записать();
		КонецЕсли;	

		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.3.1";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.2.3") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.3") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.4.2";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.3.1") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.4") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		
		ПроверитьКонстантуЗапретИзмененияДанныхДо01042011();
		
		СостояниеОбновления("");
		НачальноеЗаполнение =Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
        НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "НаборыСтатейНалоговыхДеклараций");
		ОбновитьПроводкиНастройкиЗПпоОПЗ();
		
		//Установка учета ЕСВ для дохода по ГПХ
		ДоходГПХ = Справочники.ВидыДоходовНДФЛ.Код01ГПХ.ПолучитьОбъект();
		Если НЕ ДоходГПХ.ЭтоМесячныйДоход Тогда
			ДоходГПХ.ЭтоМесячныйДоход = Истина;
			ДоходГПХ.Записать();
		КонецЕсли;
		ДоходГПХ = Справочники.ВидыДоходовНДФЛ.Код42.ПолучитьОбъект();
		Если НЕ ДоходГПХ.ЭтоМесячныйДоход Тогда
			ДоходГПХ.ЭтоМесячныйДоход = Истина;
			ДоходГПХ.Записать();
		КонецЕсли;
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.5.2";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.4.2") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.5") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		НачальноеЗаполнение =Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "ВидыДоговоровПоГК");
		ЗаполнитьНепредопределенныеСтатьи("ВидыДоговоровПоГК");
		ЗаполнитьВидДоговораПоГК();
		
		ЗаполнитьОснованиеКорректировкиНалоговыхДокументов();
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.6.1";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.5.2") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.6") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "Праздники");
		//Изменения по ЕСВ
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "Налоги");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ВидыРасчетовВзносовВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СведенияОВзносахВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ШкалаСтавокНалогов");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СводОтчисленийВФондыНастройкиОтчета");
		//Бюджет
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "МинимальнаяОплатаТруда");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ПрожиточныеМинимумы");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "РазмерыЛьготНДФЛ");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНДФЛ");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		ЗаполнитьМетодРаспределенияРБП();
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);

		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.7.4";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.6.1") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.7") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ПараметрыНалоговогоУчета");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНалогаНаПрибыль");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");
		
		ЗаполнениеДатыОплаты("Приложение2КНалоговойНакладной", глЗначениеПеременной("ДатаВступленияВСилуПриказа1379"));
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
        НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);
								 
		ОбработатьИзмененияВПланеСчетовХозрасчетныйВерсия1_2_7();
		ИсправитьНачальноеЗаполнениеСчетаУчетаРасчетовСКонтрагентами();
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.8.7";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.7.4") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.8") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("ПланСчетов", "Хозрасчетный");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "НаборыСтатейНалоговыхДеклараций");
		
		УдалитьСубконтоДокументыРасчетов(ПланыСчетов.Хозрасчетный.РасчетыПоГарантийномуОбеспечению); //364
		
		ЗаполнитьФлагПризнаватьЗатратыВНУОприходованиеТоваров();

		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		
		//отражение больничных
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия.ПолучитьОбъект();
		СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
		СпособОтражения.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам;
		СпособОтражения.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
		СтатьяНД = Справочники.СтатьиНалоговыхДеклараций.НПНК_ИВ_Другие_;
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоРеквизиту("СтатьяДекларацииПоНалогуНаПрибыль",СтатьяНД);
		Если СтатьяЗатрат.Пустая() Тогда
			Структура = ЗаполнитьНепредопределенныеСтатьи("СтатьиЗатрат",84);
			СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоРеквизиту("СтатьяДекларацииПоНалогуНаПрибыль",СтатьяНД);
		КонецЕсли;
		СпособОтражения.СубконтоДт1 = СтатьяЗатрат;
		СпособОтражения.Записать();
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетФСС.ПолучитьОбъект();
		СпособОтражения.СпособОтраженияЕСВФОТ = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия;
		СпособОтражения.Записать();
		ВР = ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛОрганизации.ПолучитьОбъект();
		ВР.СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия;
		ВР.Записать();
		
		//резерв отпусков
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ИспользованиеРезерваОтпусков.ПолучитьОбъект();
		СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.ОбеспечениеВыплатОтпусков;
		СпособОтражения.Записать();
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		ЗаполнитьЕдиницыИзмеренияСправочникаСпецификацииНоменклатуры();
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);
								 
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;

	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.9.1";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.8.7") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.9") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		СоздатьНоменклатуруГТД();
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);
								 
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.10.1";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.9.1") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.10") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		
		ЗаполнитьНормыДляПятойИШестойГруппЕН();
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);
								 
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	ТекущаяВерсияИБ = Константы.НомерВерсииКонфигурации.Получить();
	НоваяВерсияИБ ="1.2.11.1";
	
	НовыйНомерРелиза = ОбщегоНазначения.ПолучитьНомерРелиза(НоваяВерсияИБ);
	СтрокаВерсии     = "Версия" + СтрЗаменить(НовыйНомерРелиза, ".", "");
	СтрокаШапки      = "Шапка"  + СтрЗаменить(НовыйНомерРелиза, ".", "");
	
	Если (ТекущаяВерсияИБ = "1.2.10.1") ИЛИ
		((ОбщегоНазначения.ПолучитьНомерРелиза(ТекущаяВерсияИБ) = "1.2.11") И ТекущаяВерсияИБ <> НоваяВерсияИБ) Тогда

		СтрСообщения = "обновление информационной базы с версии " + ТекущаяВерсияИБ + " на версию " + НоваяВерсияИБ;
		Сообщить("Выполняется " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);		
		НачатьТранзакцию();
		
		СостояниеОбновления("");
		
		ЗаполнитьСписокРегламентированныхОтчетов(Ложь, Истина);
		
		// Установка номера версии информационной базы
		Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
		ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, , ,
								 НСтр("ru='Выполнено ';uk='Виконано '") + СтрСообщения);
								 
		ЗафиксироватьТранзакцию();

		#Если Клиент Тогда
		ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		#КонецЕсли
	
		Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
			// Если удалось зафиксировать транзакцию, то
			// сообщение об успешном обновлении информационной базы.
			Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);
		КонецЕсли;

	КонецЕсли;
	
	// Вернуть дату запрета изменения данных
	ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	
	#Если Клиент Тогда
	// Вывод формы дополнительной обработки.
	Если ДокументОписаниеОбновлений.ВысотаТаблицы > 0 Тогда
		ФормаОписаниеОбновлений.Открыть();
	КонецЕсли;
	#КонецЕсли

	#Если Клиент Тогда
	Если Найти("""1.1.19""", ТекущийНомерРелиза) <> 0 Тогда
		ТребуетсяЗапускПакетаОбработокОбновленияКонфигурации = Истина;
	КонецЕсли;		
		
	Если ТребуетсяЗапускПакетаОбработокОбновленияКонфигурации Тогда
		
		ТекстВопроса = "При обновлении версии конфигурации " + 
		"для обеспечения корректной работы системы необходимо выполнение ряда дополнительных действий. " + 
		"Автоматический последовательный запуск этих действий может быть осуществлен при помощи обработки ""Запуск пакета обработок обновления конфигурации"". " +
		"Перед запуском этой обработки рекомендуется ознакомиться с описанием во встроенной справке обработки." +
		"
		|
		|Выполнение действий в пакетном режиме может занять продолжительное время, поэтому предоставляется возможность выполнить дополнительные действия позже: 
		| 1) Вызов обработки ""Запуск пакета обработок обновления конфигурации"" производится из формы обработки "+
		"""Обновление информационной базы"" (меню ""Справка - Дополнения к описанию""), по нажатию кнопки командной панели.
		| 2) Интерактивный запуск каждой отдельной процедуры. Ссылки на эти процедуры находятся в окне описания обновлений (меню ""Справка - Дополнения к описанию""). " +
		"
		|
		|Открыть обработку   ""Запуск пакета обработок обновления конфигурации""  сейчас?";	

		Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма = ПолучитьФорму("ЗапускПакетаОбработокОбновленияКонфигурации");
			Форма.Открыть();
			
			Если ТекущаяВерсияИБ <> "1.1.19.1" Тогда
				Корень = Форма.ЭлементыФормы.СписокОбработок.Значение.Строки[0];
				Корень.Пометка = Ложь;
				МассивПомеченных = Корень.Строки.НайтиСтроки(Новый Структура("Пометка", Истина),Истина);
				Для Каждого Строка Из МассивПомеченных Цикл
					Строка.Пометка = Ложь;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	#КонецЕсли
	
КонецПроцедуры // ВыполнитьОбновление

// Функция получает макет описания обновлений и заполняет его параметры расшифровок.
//
// Параметры:
//  ФормаОписаниеОбновлений - форма обработки "ОписаниеОбновлений", 
//                            назначается владельцем открываемых из нее форм.
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет "ОписаниеОбновлений" с заполненными параметрами расшифровок.
//
Функция ПодготовитьМакетОписаниеОбновлений(ФормаОписаниеОбновлений) Экспорт

	МакетОписаниеОбновлений = ПолучитьМакет("ОписаниеОбновлений");
	Параметры               = МакетОписаниеОбновлений.Параметры;
	
	Параметры.ПереходНКУ_КорректировкаОстатковНКУна01042011		 = Документы.КорректировкаОстатковНКУна01042011.ПолучитьФормуСписка();
	
	Параметры.ПереходНКУ_ПреобразованиеНалоговыхНазначенийВДокументах = ПолучитьФорму("ПреобразованиеНалоговыхНазначенийВДокументах");
	Параметры.ПереходНКУ_ИнструкцияПоНачальномуЗаполнениюСтатей		  = ПолучитьФорму("ИнструкцияПоНачальномуЗаполнениюСтатей");
	Параметры.ПереходНКУ_НачальноеЗаполнениеСтатей 					  = ПолучитьФорму("НачальноеЗаполнениеСтатей");
	
	Параметры.ПереходНКУ_СхемыРеализации						= Справочники.СхемыРеализации.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_СпособыОтраженияРасходовПоАмортизации  = Справочники.СпособыОтраженияРасходовПоАмортизации.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_СпособыОтраженияЗарплатыВРеглУчете		= Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_Контрагенты 							= Справочники.Контрагенты.ПолучитьФормуСписка();
	
	Параметры.ПереходНКУ_УчетнаяПолитикаОрганизаций 		= РегистрыСведений.УчетнаяПолитикаБухгалтерскийУчет.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_СчетаУчетаНоменклатуры 			= РегистрыСведений.СчетаУчетаНоменклатуры.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_СчетаУчетаРасчетовСКонтрагентами	= РегистрыСведений.СчетаУчетаРасчетовСКонтрагентами.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_ОтражениеВзносовФОТВРеглУчете		= РегистрыСведений.ОтражениеВзносовФОТВРеглУчете.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_ПараметрыУчетаКурсовыхРазниц		= РегистрыСведений.ПараметрыУчетаКурсовыхРазниц.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_СчетаУчетаПрочие					= РегистрыСведений.СчетаУчетаПрочие.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_МетодыРаспределенияКосвенныхРасходовОрганизаций = РегистрыСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.ПолучитьФормуСписка();
	Параметры.ПереходНКУ_ПоказателиПриНормальнойМощности 	= РегистрыСведений.ПоказателиПриНормальнойМощности.ПолучитьФормуСписка();
	Параметры.ПерепроведениеДокументовОПЗ 	= ПолучитьФорму("ПерепроведениеДокументовПоСчетуОПЗ");
	
	Параметры.ПерепроведениеРВНДпоПропорциоанльнымОФ 	= ПолучитьФорму("ПерепроведениеРВНДпоПропорциоанльнымОФ");
	
	Параметры.ПерерасчетЕСВ126 	= ПолучитьФорму("ПерерасчетЕСВ126");
	Параметры.ВариантыАлгоритмов	= РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты.ПолучитьФорму("ФормаСписка");
	
	Возврат МакетОписаниеОбновлений;

КонецФункции

// Функция создает элемент справочника Валюты, если такого нет.
//
// Параметры:
//  Код -                     - значение соответствующего реквизита справочника,
//  Наименование              - значение соответствующего реквизита справочника,
//  НаименованиеПолное        - значение соответствующего реквизита справочника,
//  ПараметрыПрописиНаРусском - значение соответствующего реквизита справочника.
//
// Возвращаемое значение:
//  Ссылка на добавленный или существующий элемент.
//
Функция НайтиСоздатьВалюту(Код, Наименование, НаименованиеПолное, ПараметрыПрописиНаУкраинском, ПараметрыПрописиНаРусском) Экспорт

	Ссылка = Справочники.Валюты.НайтиПоКоду(Код);

	Если Ссылка.Пустая() Тогда
		СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();

		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;
		СправочникОбъект.ПараметрыПрописиНаУкраинском = ПараметрыПрописиНаУкраинском;
		СправочникОбъект.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском;
		

		ЗаписатьСправочникОбъект(СправочникОбъект);

		Ссылка = СправочникОбъект.Ссылка;

		// установим курс и кратность = 1 на 1 января 1980
		МодульВалютногоУчета.ПроверитьКорректностьКурсаНа01_01_1980(Ссылка);

	КонецЕсли;

	Возврат Ссылка;

КонецФункции // НайтиСоздатьВалюту()

// Функция создает элемент справочника КлассификаторЕдиницИзмерения, если такого нет.
//
// Параметры:
//  Код -                     - значение соответствующего реквизита справочника,
//  Наименование              - значение соответствующего реквизита справочника,
//  НаименованиеПолное        - значение соответствующего реквизита справочника,
//
// Возвращаемое значение:
//  Ссылка на добавленный или существующий элемент.
//
Функция НайтиСоздатьЕдиницу(Код, Наименование, НаименованиеПолное) Экспорт

	Ссылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Код);

	Если Ссылка.Пустая() Тогда
		СправочникОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();

		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;

		ЗаписатьСправочникОбъект(СправочникОбъект);

		Ссылка = СправочникОбъект.Ссылка;
	КонецЕсли;

	Возврат Ссылка;

КонецФункции

// Процедура устанавливает указанное значение указанной константы и выводит сообщение.
// Предназначена для вызова из процедур заполнения и обработки справочников информационной базы.
//
// Параметры:
//  ИмяКонстанты      - имя константы, которую требуется установить.
//  ЗначениеКонстанты - значение константы.
//
Процедура УстановитьКонстанту(ИмяКонстанты, ЗначениеКонстанты) Экспорт

	Если Константы[ИмяКонстанты].Получить() = ЗначениеКонстанты Тогда
		Возврат;
	КонецЕсли;

	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);

	СтрСообщения = "Константе """ + Метаданные.Константы[ИмяКонстанты].Синоним + """ "
	             + "назначено значение """ + ЗначениеКонстанты + """";

	Сообщить(СтрСообщения, СтатусСообщения.Обычное);

КонецПроцедуры

// Процедура записывает переданный справочник объект и выводит сообщение.
// Предназначена для вызова из процедур заполнения и обработки справочников информационной базы.
//
// Параметры:
//  СправочникОбъект - объект, который требуется записать.
//
Процедура ЗаписатьСправочникОбъект(СправочникОбъект) Экспорт

	Если НЕ СправочникОбъект.Модифицированность() Тогда
		Возврат;
	КонецЕсли;

	Если СправочникОбъект.ЭтоНовый() Тогда
		СтрСообщения1 = "Создан";
	Иначе
		СтрСообщения1 = "Обработан";
	КонецЕсли;

	Если СправочникОбъект.ЭтоГруппа Тогда
		СтрСообщения2 = "а группа";
	Иначе
		СтрСообщения2 = " элемент";
	КонецЕсли;

	СтрСообщения2 = СтрСообщения2 + " справочника """ + СправочникОбъект.Метаданные().Синоним + """: ";
	СтрСообщения3 = "наименование """ + СправочникОбъект.Наименование + """";

	Попытка
		СправочникОбъект.Записать();
		Сообщить(СтрСообщения1 + СтрСообщения2 + "код """ + СправочникОбъект.ПолныйКод() + """, " + СтрСообщения3, СтатусСообщения.Обычное);
	Исключение
		Сообщить("Не записан"  + СтрСообщения2 + СтрСообщения3 +
		         Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;

КонецПроцедуры

// Процедура записывает переданный план видов характеристик и выводит сообщение.
// Предназначена для вызова из процедур заполнения и обработки информационной базы.
//
// Параметры:
//  ПланВидовХарактеристикОбъект - объект, который требуется записать.
//
Процедура ЗаписатьПланВидовХарактеристикОбъект(ПланВидовХарактеристикОбъект) Экспорт

	Если НЕ ПланВидовХарактеристикОбъект.Модифицированность() Тогда
		Возврат;
	КонецЕсли;

	Если ПланВидовХарактеристикОбъект.ЭтоНовый() Тогда
		СтрСообщения1 = "Создан";
	Иначе
		СтрСообщения1 = "Обработан";
	КонецЕсли;

	Если ПланВидовХарактеристикОбъект.ЭтоГруппа Тогда
		СтрСообщения2 = "а группа";
	Иначе
		СтрСообщения2 = " элемент";
	КонецЕсли;

	СтрСообщения2 = СтрСообщения2 + " плана видов характеристик """ + ПланВидовХарактеристикОбъект.Метаданные().Синоним + """: ";
	СтрСообщения3 = "наименование """ + ПланВидовХарактеристикОбъект.Наименование + """";

	Попытка
		ПланВидовХарактеристикОбъект.Записать();
		Сообщить(СтрСообщения1 + СтрСообщения2 + "код """ + ПланВидовХарактеристикОбъект.Код + """, " + СтрСообщения3, СтатусСообщения.Обычное);
	Исключение
		Сообщить("Не записан"  + СтрСообщения2 + СтрСообщения3 +
		         Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;

КонецПроцедуры

// Процедура выводит описания изменений в указанном релизе
//
// Параметры
//  НомерРелиза  – Строка - номер релиза, для которого выводится описание
//
Процедура ВывестиОписаниеИзменений(СтрокаВерсии, СтрокаШапки, ДокументОписаниеОбновлений, МакетОписаниеОбновлений)

	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть(СтрокаШапки));
	ДокументОписаниеОбновлений.НачатьГруппуСтрок(СтрокаВерсии);
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть(СтрокаВерсии));
	ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));

КонецПроцедуры // ВывестиОписаниеИзменений()


////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ОБНОВЛЕНИЯ ИНФОРМАЦИОННОЙ БАЗЫ

// Процедура заполняет по умолчанию необходимые данные
// для отправки сообщений в службу технической поддержки.
//
Процедура ЗаполнитьПараметрыКонстантыОбращенияВОтделТехническойПоддержки()

	Перем СтруктураЗначения;

	Если ТипЗнч(Константы.ПараметрыСообщенияПриОбращенииВОтделТехническойПоддержки.Получить().Получить()) <> Тип("ТаблицаЗначений") Тогда

		ОбщегоНазначения.ЗаполнитьСтруктуруДанныхНастройкиОбращенияВОтделТехподдержкиПоУмолчанию(СтруктураЗначения);

		СтрокаПараметровОтправки = СтруктураЗначения.Найти("ПараметрыОтправкиЭлектронногоСообщения", "ИмяРаздела");

		Если СтрокаПараметровОтправки <> Неопределено Тогда

			СтрокаПараметровОтправки.ДанныеРаздела.ПараметрыОтправкиЭлектронногоСообщения_АдресЭлектроннойПочтыОтделаТехническойПоддержки[1] = "hotline@1c.ua";

			Константы.ПараметрыСообщенияПриОбращенииВОтделТехническойПоддержки.Установить(Новый ХранилищеЗначения(СтруктураЗначения, Новый СжатиеДанных));

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Функция выполняет начальное заполнение информационной базы.
//
// Параметры:
//  ДокументОписаниеОбновлений - табличный документ, в который выводится описание обновлений.
//  МакетОписаниеОбновлений    - макет "ОписаниеОбновлений" с заполненными параметрами.
//
// Возвращаемое значение:
//  Функция возвращает номер первой коммерческой версии конфигурации.
//
Функция ЗаполнитьПустуюИБ(ДокументОписаниеОбновлений, МакетОписаниеОбновлений) Экспорт
	
	// Установка значений по умолчанию прав пользователей
	УправлениеПользователями.УстановитьЗначенияПравПоУмолчанию();

	// Заполнение справочника Валюты.
	ВалютаРегламентированногоУчета = 
	НайтиСоздатьВалюту("980", "грн", "Гривна", 		"гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2",	"гривна, гривны, гривен, ж, копейка, копейки, копеек, ж, 2");
	ВалютаУправленческогоУчета = 
	НайтиСоздатьВалюту("840", "USD", "Доллар США", 	"долар, долари, доларів, м, цент, центи, центів, м, 2",			"доллар, доллара, долларов, м, цент, цента, центов, м, 2");
	ВалютаМеждународногоУчета = 
	НайтиСоздатьВалюту("978", "EUR", "Евро", 		"євро, євро, євро, м, цент, центи, центів, м, 2", 				"евро, евро, евро, м, цент, цента, центов, м, 2");
	
	// Обязательное начальное заполнение информационной базы.
	// Автоматический поиск и заполнение необходимых объектов
	ОбработкаНЗ = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
	ОбработкаНЗ.ЗаполнитьВсеОбъекты();
	
	// Создадим одну организацию
	Организация = Справочники.Организации.НайтиПоНаименованию("Наша организация");

	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда

		Организация = Справочники.Организации.СоздатьЭлемент();
		Организация.Наименование		= "Наша организация";
		Организация.Записать();

	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Отбор.Пользователь.Значение      = глЗначениеПеременной("глТекущийПользователь");

	Запись = Набор.Добавить();

	Запись.Пользователь = глЗначениеПеременной("глТекущийПользователь");
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ПоказыватьВДокументахСчетаУчета;
	Запись.Значение     = Истина;
	
	Набор.Записать();
	
	// Заполнение сведений бухгалтерского и налогового учета.
	УстановитьСуммовойУчетНаСкладах();
	УстановитьАналитикуРозницыПоПродажнымЦенам();
	УстановитьПараметрыСчетовБУиНУ();
	// Установка субконто "Статьи движения денежных средств" на счете "Касса" и его субсчетах						 
	УстановитьСубконтоСтатьяДвиженияДенежныхСредств();
	// Установка параметров классов счетов. По умолчанию счета-классы не используем как группы.
	УстановитьПараметрыКлассовСчетов();
	// Установка субконто на неавтоматизированных счетах
	ЗаполнениеСубконтоНеавтоматизированныхСчетов(Истина);
	// Граница запрета изменения данных
	УстановитьДатуЗапретаРедактирования('19800101');	
	
	ЗаполнитьСписокРегламентированныхОтчетов();
	
	// Заполнение настроек упр. учета
	Набор  = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(НачалоМесяца('19800101'));
	Запись = Набор.Добавить();
	Запись.Период                                   = НачалоМесяца('19800101');
	Запись.СпособОценкиМПЗ = Перечисления.СпособыОценки.ФИФО;
	Запись.СтратегияСписанияПартийТоваровПоСтатусам = Перечисления.СтретегииСписанияПартийТоваровПоСтатусам.СначалаСобственныеПотомПринятые;
	Запись.ВестиПартионныйУчетПоСкладам = Истина;
	Набор.Записать();
	
	ЗаполнитьПараметрыКонстантыОбращенияВОтделТехническойПоддержки();
	
	НачальноеЗаполнениеСправочникаСобытияОС();
	
	ЗаполнитьСправочникВидыКонтактнойИнформации();
	
	ВключитьРежимПолнотекстовогоПоиска();
	
	// Заполнение данных для механизма контактной информации.
	ЗаполнитьШаблоныТелефонныхНомеровПоУмолчанию();
	
	// Заполняем ПВХ ВопросыДляАнкетирования, а именно предопределенные вопросы.
	ЗаполнитьРеквизитыВопросов();
	
	// Заполняем предопределенный элемент справочника "Виды оплат чека ККМ".
	ЗаполнитьСправочникВидыОплатЧекаККМ();
	
	// Заполним константы.
	УстановитьКонстанту("ИнтервалПроверкиНапоминанийВСекундах"    , 60);
	УстановитьКонстанту("ИспользованиеВстроенногоПочтовогоКлиента", Истина);
	УстановитьКонстанту("ИспользоватьСерииНоменклатуры"           , Истина);
	УстановитьКонстанту("ИспользоватьВнутренниеЗаказы"            , Истина);
	УстановитьКонстанту("ПрефиксВесовогоТовара"                   , "1");
	УстановитьКонстанту("ПрефиксШтучногоТовара"                   , "0");
	УстановитьКонстанту("ДлинаКодаВесовогоТовара"                 , 5);
	УстановитьКонстанту("ПорядокПрисвоенияPLU"                    , Перечисления.ПорядокПрисвоенияPLU.ПоПорядку);
	
	ПроверкаРазницыВремени.ИнициализироватьПроверкуРазницыВремениССервером();
	
	ЗаполнитьСтажВДняхСтажВЧасах();
	
	ЗаполнитьНачисленияДляПредварительногоРасчета();
	ЗаполнитьВариантыАлгоритмов();
	
	НовыеСтатьи = ЗаполнитьНепредопределенныеСтатьи();
	ЗаполнитьРСПараметрыКурсовыхРазниц(НовыеСтатьи);
	ЗаполнитьРССчетаУчетаПрочие(НовыеСтатьи);

	ЗаполнитьНепредопределенныеСтатьи("ВидыДоговоровПоГК");
	
#Если Клиент Тогда
	// Заполнение справочника "Типовые операции".
	ФормаОбмена = Обработки.УниверсальныйОбменДаннымиXML.ПолучитьФорму("Форма");
	УникальныйИдентификатор        = Новый УникальныйИдентификатор();
	ИмяВременногоФайлаОбмена = КаталогВременныхФайлов() + УникальныйИдентификатор + ".xml";
	МакетФайлаОбмена = Справочники.ТиповыеОперации.ПолучитьМакет("ТиповыеОперации");
	МакетФайлаОбмена.Записать(ИмяВременногоФайлаОбмена);
	ФормаОбмена.ИмяФайлаОбмена = ИмяВременногоФайлаОбмена;
	ФормаОбмена.РежимОбмена    = "Загрузка";
	ФормаОбмена.ФлагКомментироватьОбработкуОбъектов = Ложь;
	ФормаОбмена.ВыполнитьЗагрузку();
	
	ТекстВопроса = "Произвести первоначальное заполнение информационной базы?
	               |Начальное заполнение не рекомендуется производить в том случае,
	               |если вы ранее вели учет в другой конфигурации
	               |и хотите перенести накопленные данные.
	               |";

	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		// заполнение счетов учета номенклатуры
		ОбработкаНЗ.ЗаполнитьОбъект("РегистрСведений","СчетаУчетаНоменклатуры");

		// Заполнение справочника КлассификаторЕдиницИзмерения.
		ЕдиницаИзмеренияВеса =
		НайтиСоздатьЕдиницу("166", "кг", "Килограмм");
		НайтиСоздатьЕдиницу("796", "шт", "Штука");

		// Заполнение констант.
		УстановитьКонстанту("ВалютаРегламентированногоУчета"          , ВалютаРегламентированногоУчета);
		УстановитьКонстанту("ВалютаУправленческогоУчета"              , ВалютаУправленческогоУчета);
		УстановитьКонстанту("ЕдиницаИзмеренияВеса"                    , ЕдиницаИзмеренияВеса);

		// Вывод строк описания обновлений.
		ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("ШапкаЗаполнениеПустойИБ"));
		ДокументОписаниеОбновлений.НачатьГруппуСтрок("Заполнение пустой ИБ");
		ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("ЗаполнениеПустойИБ"));
		ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
		ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));

	КонецЕсли;
#КонецЕсли

	Возврат "";

КонецФункции

Процедура УстановитьАналитикуРозницыПоПродажнымЦенам()
	
	// устанавливает субконто Склады для счетов учета в продажных ценах
	
	// бухгалтерский учет
	ВидСубконто = "ВидыСубконтоХозрасчетные";
	
	Счета = Новый СписокЗначений();
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
	
	Попытка
		
		Для Каждого Счет Из Счета Цикл
			Объект   = Счет.Значение.ПолучитьОбъект();
			КодСчета = Объект.Код;

			Субконто = Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик[ВидСубконто].Склады, "ВидСубконто");
			Если Субконто = Неопределено Тогда
				НовыйВид = Объект.ВидыСубконто.Добавить();
				НовыйВид.ВидСубконто = ПланыВидовХарактеристик[ВидСубконто].Склады;
			КонецЕсли;
					
			Субконто = Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик[ВидСубконто].Склады, "ВидСубконто");
			Если НЕ Субконто.Суммовой Тогда
				Субконто.Суммовой = Истина;
			КонецЕсли;
			Если Счет.Значение = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ Тогда
				// для счета АТТ в продажных ценах устанавливаем также и количественный учет по складам
				Если НЕ Субконто.Количественный Тогда
					Субконто.Количественный = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Объект.Записать();
			
		КонецЦикла;
				
	Исключение
		
		Сообщить("Счет """ + Строка(КодСчета) + """:");
		Сообщить(ОписаниеОшибки());

	КонецПопытки;
		
КонецПроцедуры

// Устанавливает субконто "Номенклатура" и "Контрагент" у указанного счета.
//
Процедура УстановитьСубконтоНоменклатура(ИмяСчета, ИмяПланаСчетов, ЕстьКоличество, ЕстьКонтрагент)

	ВидСубконто = "ВидыСубконтоХозрасчетные";

	Попытка

		Счет  = ПланыСчетов[ИмяПланаСчетов][ИмяСчета];
		Счета = Новый СписокЗначений();
		Счета.Добавить(Счет);

		ВыборкаСчетов = ПланыСчетов[ИмяПланаСчетов].ВыбратьИерархически(Счет);
		Пока ВыборкаСчетов.Следующий() Цикл
			// счета исключения
			Если (НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВТорговле)) И
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ)) И
				(НЕ (ВыборкаСчетов.Ссылка= ПланыСчетов.Хозрасчетный.ТорговаяНаценка)) И 
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ)) И 
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.НеоборотныеАктивыИГруппыВыбытияУдерживаемыеДляПродажи)) И 
				(НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы)) И
                (НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходы)) И
                (НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары)) И
                (НЕ (ВыборкаСчетов.Ссылка = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет))
				 Тогда
				Счета.Добавить(ВыборкаСчетов.Ссылка);
			КонецЕсли;
		КонецЦикла;

		Для каждого Счет Из Счета Цикл

			Объект = Счет.Значение.ПолучитьОбъект();

			Если ЕстьКонтрагент Тогда

				Если Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик[ВидСубконто].Контрагенты, "ВидСубконто") = Неопределено Тогда

					НовыйВид = Объект.ВидыСубконто.Вставить(0);

					НовыйВид.ВидСубконто = ПланыВидовХарактеристик[ВидСубконто].Контрагенты;
					НовыйВид.Суммовой    = Истина;

					Если ЕстьКоличество Тогда
						НовыйВид.Количественный = Истина;
					КонецЕсли;

					Объект.Записать();
					СостояниеОбновления(Локализация.СтрШаблон1("Добавлен вид субконто ""Номенклатура"" на счете ¤1¤ плана счетов ""¤2¤""...", Объект.Код, ИмяПланаСчетов));

				КонецЕсли;

			КонецЕсли;

			Если Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик[ВидСубконто].Номенклатура, "ВидСубконто") = Неопределено Тогда

				НовыйВид = Объект.ВидыСубконто.Добавить();

				НовыйВид.ВидСубконто = ПланыВидовХарактеристик[ВидСубконто].Номенклатура;
				НовыйВид.Суммовой    = Истина;

				Если ЕстьКоличество Тогда
					НовыйВид.Количественный = Истина;
				КонецЕсли;

				Объект.Записать();
				СостояниеОбновления(Локализация.СтрШаблон1("Добавлен вид субконто ""Номенклатура"" на счете ¤1¤ плана счетов ""¤2¤""...", Объект.Код, ИмяПланаСчетов));

			КонецЕсли;

		КонецЦикла;

	Исключение

	КонецПопытки;

КонецПроцедуры // УстановитьСубконтоНоменклатура()

// Выполняет заполнение регистра сведений "УчетнаяПолитикаОбщаяДляРегламентированногоУчета"
// и устанавливает субконто "Склады" в счетах.
Процедура УстановитьСуммовойУчетНаСкладах()

	// бухгалтерский учет
	Счета = Новый СписокЗначений();
	Счета.Добавить("ПриобретениеОсновныхСредств");
	Счета.Добавить("ПриобретениеДругихНеоборотныхМатериальныхАктивов");
	Счета.Добавить("ПроизводственныеЗапасы");
	Счета.Добавить("Полуфабрикаты");
	Счета.Добавить("ГотоваяПродукция");
	Счета.Добавить("ПродукцияСельскохозяйственногоПроизводства");
	Счета.Добавить("Товары");
	Счета.Добавить("ТоварыПринятыеНаКомиссиюВсего");
	Счета.Добавить("МалоценныеИБыстроизнашивающиесяПредметыНаСкладе");

	НачатьТранзакцию();

	Для каждого Счет Из Счета Цикл
		УстановитьСубконтоНоменклатура(Счет.Значение, "Хозрасчетный", Истина, Ложь);
	КонецЦикла;
	
	УстановитьСубконтоНоменклатура("УценкиЗапасов", "Хозрасчетный", Ложь, Ложь);

	Счета = Новый СписокЗначений();
	Счета.Добавить("МатериалыПереданныеВПереработку");
	Счета.Добавить("ТоварыНаКомиссии");

	Для каждого Счет Из Счета Цикл
		УстановитьСубконтоНоменклатура(Счет.Значение, "Хозрасчетный", Истина, Истина);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры // УправлениеСуммовымУчетомНаСкладах()

// Устанавливает флаг "Запретить использовать в проводках"
// хозрасчетным счетам 
//
Процедура УстановитьПараметрыСчетовБУиНУ()

	НачатьТранзакцию();

	СостояниеОбновления("Установка запрета использования в проводках групп счетов...");

	ВыборкаСчетов = ПланыСчетов.Хозрасчетный.ВыбратьИерархически();
	Пока ВыборкаСчетов.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСчетов.Ссылка.Родитель) Тогда
			Продолжить;
		КонецЕсли;

		Объект = ВыборкаСчетов.Ссылка.Родитель.ПолучитьОбъект();
		Если Объект.ЗапретитьИспользоватьВПроводках Тогда
			Продолжить;
		КонецЕсли;

		Объект.ЗапретитьИспользоватьВПроводках = Истина;
		Объект.Записать();

	КонецЦикла;

	ВыборкаСчетов = ПланыСчетов.Налоговый.ВыбратьИерархически();
	Пока ВыборкаСчетов.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСчетов.Ссылка.Родитель) Тогда
			Продолжить;
		КонецЕсли;

		Объект = ВыборкаСчетов.Ссылка.Родитель.ПолучитьОбъект();
		Если Объект.ЗапретитьИспользоватьВПроводках Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаСчетов.Ссылка.Родитель = ПланыСчетов.Налоговый.Запасы Тогда
			Продолжить;
		КонецЕсли;

		Объект.ЗапретитьИспользоватьВПроводках = Истина;
		Объект.Записать();

	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

// Устанавливает субконто статья движения денежных средств
//
Процедура УстановитьСубконтоСтатьяДвиженияДенежныхСредств()
	
	Попытка

		Счет  = ПланыСчетов.Хозрасчетный.Касса;
		Счета = Новый СписокЗначений();
		Счета.Добавить(Счет);

		ВыборкаСчетов = ПланыСчетов.Хозрасчетный.ВыбратьИерархически(Счет);
		Пока ВыборкаСчетов.Следующий() Цикл

			Счета.Добавить(ВыборкаСчетов.Ссылка);

		КонецЦикла;

		Для каждого Счет Из Счета Цикл

			Объект   = Счет.Значение.ПолучитьОбъект();
			КодСчета = Объект.Код;

			Если Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств, "ВидСубконто") = Неопределено Тогда
				
				НовыйВид = Объект.ВидыСубконто.Добавить();

				НовыйВид.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств;
				НовыйВид.Суммовой    = Истина;
	      		НовыйВид.ТолькоОбороты = Истина;
				НовыйВид.Количественный = Истина;
				НовыйВид.Валютный = Истина;
			
				Сообщение = Локализация.СтрШаблон1("План счетов ""Хозрасчетный"", счет ""¤1¤"" установлено субконто ""Статьи движения денежных средств""", Строка(Объект));
							
				Если Прав(Сообщение, 1) = "," Тогда
					Сообщение = Лев(Сообщение, СтрДлина(Сообщение)-1);
				КонецЕсли;

				Объект.Записать();
				Сообщить(Сообщение);

			КонецЕсли;
			
		КонецЦикла;

	Исключение

		Сообщить("Счет """ + Строка(КодСчета) + """:");
		Сообщить(ОписаниеОшибки());

	КонецПопытки
	
КонецПроцедуры

// Устанавливает начальные параметры счетов-классов
//
Процедура УстановитьПараметрыКлассовСчетов()
	
	Счета = Новый СписокЗначений();
	Счета.Добавить("НеоборотныеАктивы");
	Счета.Добавить("Запасы");
	Счета.Добавить("ДенежныеСредстваРасчетыИДругиеАктивы");
	Счета.Добавить("СобственныйКапиталИОбеспечениеОбязательств");
	Счета.Добавить("ДолгосрочныеОбязательства");
	Счета.Добавить("ТекущиеОбязательства");
	Счета.Добавить("ДоходыИРезультатыДеятельности");
	Счета.Добавить("ЗатратыПоЭлементам");
	Счета.Добавить("ЗатратыДеятельности");
	Счета.Добавить("ЗабалансовыеСчета");
	
	Для каждого СчетИмя из Счета Цикл
		Счет  = ПланыСчетов.Хозрасчетный[СчетИмя.Значение];
		ЗапросКлассыСчетов = Новый Запрос;
		ЗапросКлассыСчетов.Текст = "ВЫБРАТЬ
								   |	Хозрасчетный.Ссылка
								   |ИЗ
								   |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
								   |ГДЕ
								   |	Хозрасчетный.Родитель = &Родитель";
		ЗапросКлассыСчетов.УстановитьПараметр("Родитель",Счет);
		ВыборкаСчетов = ЗапросКлассыСчетов.Выполнить().Выбрать();
		Пока ВыборкаСчетов.Следующий() Цикл
			ОбъектСчет = ВыборкаСчетов.Ссылка.ПолучитьОбъект();
			ОбъектСчет.Родитель = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			ОбъектСчет.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьВозможностьДобавленияСубконто(СчетДляСубконто)

	Счета = Новый СписокЗначений();
	Счета.Добавить(СчетДляСубконто);

	ВыборкаСчетов = ПланыСчетов.Хозрасчетный.ВыбратьИерархически(СчетДляСубконто);
	Пока ВыборкаСчетов.Следующий() Цикл

		Счета.Добавить(ВыборкаСчетов.Ссылка);

	КонецЦикла;
	
	УжеЕстьСубконто = Ложь;

	Для каждого Счет Из Счета Цикл
		Объект   = Счет.Значение.ПолучитьОбъект();
		Если Объект.ВидыСубконто.Количество()>0 Тогда
			УжеЕстьСубконто = Истина;
			Сообщение = Локализация.СтрШаблон1("План счетов ""Хозрасчетный"", счет ""¤1¤"" уже имеет субконто. Новые виды субконто добавлены не будут.", Строка(Объект));
			Сообщить(Сообщение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НЕ УжеЕстьСубконто;

КонецФункции // ПроверитьВозможностьДобавленияСубконто(()

Процедура ЗаполнениеСубконтоНеавтоматизированныхСчетов(ЭтоНачальноеЗаполнение)
	
	СостояниеОбновления("Заполнение субконто для неавтоматизированных счетов.");
	//14
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеФинансовыеИнвестиции) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеФинансовыеИнвестиции, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ФинансовыеИнвестиции);
	КонецЕсли; 
	//155
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ПриобретениеВыращиваниеДолгосрочныхБиологическихАктивов) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПриобретениеВыращиваниеДолгосрочныхБиологическихАктивов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БиологическиеАктивы);
	КонецЕсли; 
	//16
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеБиологическиеАктивы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеБиологическиеАктивы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БиологическиеАктивы);
	КонецЕсли; 
	//181
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ЗадолженностьЗаИмуществоПереданноеВФинансовуюАренду) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ЗадолженностьЗаИмуществоПереданноеВФинансовуюАренду, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ЗадолженностьЗаИмуществоПереданноеВФинансовуюАренду, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//182
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеВекселяПолученные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеВекселяПолученные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеВекселяПолученные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//183
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДругаяДебиторскаяЗадолженность) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДругаяДебиторскаяЗадолженность, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДругаяДебиторскаяЗадолженность, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//184
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ПрочиеНеоборотныеАктивы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПрочиеНеоборотныеАктивы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеНеоборотныеАктивы);
	КонецЕсли; 
	//21
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ТекущиеБиологическиеАктивы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ТекущиеБиологическиеАктивы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БиологическиеАктивы);
	КонецЕсли; 
	//34
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.КраткосрочныеВекселяПолученные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.КраткосрочныеВекселяПолученные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//35
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ТекущиеФинансовыеИнвестиции) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ТекущиеФинансовыеИнвестиции, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ФинансовыеИнвестиции);
	КонецЕсли; 
	//373
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДоходам) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДоходам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДоходам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//374
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//376
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыПоСсудамЧленамКредитныхСоюзов) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоСсудамЧленамКредитныхСоюзов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоСсудамЧленамКредитныхСоюзов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//40
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.УставныйКапитал) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.УставныйКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.УставныйКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//41
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ПаевойКапитал) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПаевойКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПаевойКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//45
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ИзъятыйКапитал) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ИзъятыйКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//46
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.НеоплаченныйКапитал) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.НеоплаченныйКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.НеоплаченныйКапитал, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//47
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ОбеспечениеБудущихЗатратИПлатежей) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ОбеспечениеБудущихЗатратИПлатежей, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат, Истина);
	КонецЕсли; 
	//48
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ЦелевоеФинансированиеИЦелевыеПоступления) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ЦелевоеФинансированиеИЦелевыеПоступления, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	КонецЕсли; 
	//49
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.СтраховыеРезервы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.СтраховыеРезервы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Резервы);
	КонецЕсли; 
	//50
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//51
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеВекселяВыданные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеВекселяВыданные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//52
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеОбязательстваПоОблигациям) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеОбязательстваПоОблигациям, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//53
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДолгосрочныеОбязательстваПоАренде) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДолгосрочныеОбязательстваПоАренде, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	КонецЕсли; 
	//55
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//60
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//61
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствам) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//62
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.КраткосрочныеВекселяВыданные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.КраткосрочныеВекселяВыданные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	КонецЕсли; 
	//654
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыПоИндивидуальномуСтрахованию) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоИндивидуальномуСтрахованию, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	КонецЕсли; 
	//67
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыСУчастниками) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыСУчастниками, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	КонецЕсли; 
	//682
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ВнутренниеРасчеты) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ВнутренниеРасчеты, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ВнутренниеРасчеты, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//683
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ВнутрихозяйственныеРасчеты) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ВнутрихозяйственныеРасчеты, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ВнутрихозяйственныеРасчеты, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//684
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентам) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентам, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	КонецЕсли; 
	//69
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ДоходыБудущихПериодов) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ДоходыБудущихПериодов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДоходыБудущихПериодов);
	КонецЕсли; 
	//03
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.КонтрактныеОбязательства) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.КонтрактныеОбязательства, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.КонтрактныеОбязательства);
	КонецЕсли; 
	//05
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ГарантииИОбеспечениеПредоставленные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ГарантииИОбеспечениеПредоставленные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Гарантии);
	КонецЕсли; 
	//06
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ГарантииИОбеспечениеПолученные) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ГарантииИОбеспечениеПолученные, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Гарантии);
	КонецЕсли; 
	//07
	Если ЭтоНачальноеЗаполнение ИЛИ ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.СписанныеАктивы) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.СписанныеАктивы, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);	
	КонецЕсли; 
КонецПроцедуры	

// Устанавливает субконто на неавтоматизированных счетах
//
Процедура УстановитьСубконтоНеавтоматизированныхСчетов(СчетДляСубконто, ВидСубконто, ТолькоОбороты = Ложь)
	
	Попытка

		Счета = Новый СписокЗначений();
		Счета.Добавить(СчетДляСубконто);

		ВыборкаСчетов = ПланыСчетов.Хозрасчетный.ВыбратьИерархически(СчетДляСубконто);
		Пока ВыборкаСчетов.Следующий() Цикл

			Счета.Добавить(ВыборкаСчетов.Ссылка);

		КонецЦикла;

		Для каждого Счет Из Счета Цикл

			Объект   = Счет.Значение.ПолучитьОбъект();
			КодСчета = Объект.Код;

			Если Объект.ВидыСубконто.Найти(ВидСубконто, "ВидСубконто") = Неопределено Тогда
				
				НовыйВид = Объект.ВидыСубконто.Добавить();

				НовыйВид.ВидСубконто = ВидСубконто;
				НовыйВид.ТолькоОбороты = ТолькоОбороты;
				НовыйВид.Суммовой    = Истина;
				НовыйВид.Количественный = Истина;
				НовыйВид.Валютный = Истина;
			
				Сообщение = Локализация.СтрШаблон1("План счетов ""Хозрасчетный"", счет ""¤1¤"" установлено субконто ""¤2¤""", Строка(Объект),Строка(ВидСубконто));
							
				Если Прав(Сообщение, 1) = "," Тогда
					Сообщение = Лев(Сообщение, СтрДлина(Сообщение)-1);
				КонецЕсли;

				Объект.Записать();
				Сообщить(Сообщение);

			КонецЕсли;
			
		КонецЦикла;

	Исключение

		Сообщить("Счет """ + Строка(КодСчета) + """:");
		Сообщить(ОписаниеОшибки());

	КонецПопытки
	
КонецПроцедуры

// Процедура заполняет константу шаблонов телефонов.
// 
Процедура ЗаполнитьШаблоныТелефонныхНомеровПоУмолчанию()

	ТаблицаСоответствий = Новый Соответствие;
	ТаблицаСоответствий.Вставить(7,"999-99-99");
	ТаблицаСоответствий.Вставить(6,"99-99-99");
	ТаблицаСоответствий.Вставить(5,"9-99-99");
	ТаблицаСоответствий.Вставить(4,"99-99");

	ХранилищеШаблоновТелефонов = Новый ХранилищеЗначения(ТаблицаСоответствий);

	Константы.ШаблоныТелефонныхНомеров.Установить(ХранилищеШаблоновТелефонов);

КонецПроцедуры // ЗаполнитьШаблоныТелефонныхНомеровПоУмолчанию()

Процедура ЗаполнитьСправочникВидыКонтактнойИнформации()

	СостояниеОбновления("Обновление справочника ""Виды контаткной информации""");





	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Предопределенный = Истина
	|	И (ВидыКонтактнойИнформации.Тип = &ПустойТип 
	|		ИЛИ ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ПустойВидОбъектаКонтактнойИнформации)
	|";
	
	Запрос.УстановитьПараметр("ПустойТип"                           , Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
									
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.АдресИнострОрганизацииУчред Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.АдресОрганизацииПочтовый Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ИнострАдресФизЛица Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ИнформАдресФизЛица Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.КонтактнТелефонКандидата Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛицаКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.РабочийТелефонКонтактногоЛицаКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов);
					
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
			
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ТелефонПоЮрАдресуОрганизации Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
			
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
			
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);
						
		ИначеЕсли Выборка.Ссылка = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица Тогда
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица);
		ИначеЕсли Выборка.ссылка = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента Тогда				
			
			УстановитьпараметрыВидаКонтаткнойИнформации(Выборка.Ссылка, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов);
		КонецЕсли; 
	
	КонецЦикла; 
	
	СостояниеОбновления("");

КонецПроцедуры

// Начальное заполнение справочника "События ОС".
Процедура НачальноеЗаполнениеСправочникаСобытияОС()
	 
	Попытка 
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию;
		СпрСобытияОС.Наименование = "Ввод в эксплуатацию";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВнутреннееПеремещение;
		СпрСобытияОС.Наименование = "Внутреннее перемещение";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.Списание;
		СпрСобытияОС.Наименование = "Списание";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.Модернизация;
		СпрСобытияОС.Наименование = "Модернизация и ремонт";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.Ремонт;
		СпрСобытияОС.Наименование = "Ремонт";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПодготовкаКПередаче;
		СпрСобытияОС.Наименование = "Подготовка к передаче";
		СпрСобытияОС.Записать();
		
		СпрСобытияОС = Справочники.СобытияОС.СоздатьЭлемент();
		СпрСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.Передача;
		СпрСобытияОС.Наименование = "Передача";
		СпрСобытияОС.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Заполнение реквизитов справочника "Виды контактной информации"
//
Процедура ЗаполнитьРеквизитВидУчетаВремениДляСредней()

	
	//////////////////////////////////////////////////////////
	// Документы НачислениеОтпускаРаботникамОрганизаций
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Основной.Ссылка              	Как Док 
	|	ИЗ Документ.НачислениеОтпускаРаботникамОрганизаций КАК Основной
	|";
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.Док.ПолучитьОбъект();
		ЭтоКомпенсацияОтпуска = Док.ВидДокументаОтпуск = Перечисления.ВидыДокументаОтпуск.КомпенсацияОтпуска;
		
		Для каждого Строка Из Док.Начисления Цикл
			
			Строка.ВидУчетаВремениДляСредней = Док.ВидУчетаВремениДляСредней;
			Строка.Показатель1 = Док.СуммаСредней;
			
			Если ЭтоКомпенсацияОтпуска Тогда
				Строка.Показатель2 = Док.ДнейЧасовКомпенсацииОтпуска;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЦикла;
		
	
	//////////////////////////////////////////////////////////
	// Документы НачислениеПоБольничномуЛисту
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Основной.Ссылка              	Как Док 
	|	ИЗ Документ.НачислениеПоБольничномуЛисту КАК Основной
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.Док.ПолучитьОбъект();
		Для каждого Строка Из Док.Начисления Цикл
			
			Строка.ВидУчетаВремениДляСредней = Док.ВидУчетаВремениДляСредней;
			Строка.Показатель1 = Мин(Док.СуммаСредней, Док.СуммаПределаСредней);
			Строка.Показатель2 = Док.ПроцентОплаты;
			
		КонецЦикла;
		
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЦикла;
		
	
	//////////////////////////////////////////////////////////
	// Документы ОплатаПоСреднемуЗаработку
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Основной.Ссылка              	Как Док 
	|	ИЗ Документ.ОплатаПоСреднемуЗаработку КАК Основной
	|";
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.Док.ПолучитьОбъект();
		Для каждого Строка Из Док.Начисления Цикл
			
			Строка.ВидУчетаВремениДляСредней = Док.ВидУчетаВремениДляСредней;
			Строка.Показатель1 = Док.СуммаСредней;
			
		КонецЦикла;
		
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСправочникВидыКонтактнойИнформации()

// Установка границы запрета изменения данных
//
Процедура УстановитьДатуЗапретаРедактирования(ОбщаяДатаЗапрета)
	
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Организации.Ссылка КАК Организация,
					|	&ПустойПользователь КАК Пользователь,
					|	&ОбщаяДата КАК ГраницаЗапретаИзменений
					|ИЗ
					|	Справочник.Организации КАК Организации";
						
	Запрос.УстановитьПараметр("ПустойПользователь", Неопределено);
	Запрос.УстановитьПараметр("ОбщаяДата", ОбщаяДатаЗапрета);
		
	Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
	Набор.Загрузить(Запрос.Выполнить().Выгрузить());
	СтрокаНабора = Набор.Добавить();
	СтрокаНабора.ГраницаЗапретаИзменений = ОбщаяДатаЗапрета;
	Набор.Записать();
	
КонецПроцедуры

// Выполняет первоначальное заполнение справочника РегламентированныеОтчеты
// списком регламентированных отчетов. 
//  Процедура должна вызываться при первоначальном заполнении пустой 
// информационной базы. Предполагается, что перед запуском процедуры справочник
// РегламентированныеОтчеты - пустой.
//
Процедура ЗаполнитьСписокРегламентированныхОтчетов(ПервоеЗаполнение = Истина, ИзменятьПризнакИспользованияВнешнегоОтчета = Истина)

	Перем ДеревоОтчетов;
	Перем ОбработкаОбновлениеОтчетов;

	Если ИзменятьПризнакИспользованияВнешнегоОтчета И НЕ ПервоеЗаполнение Тогда
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РегламентированныеОтчеты.Ссылка КАК Ссылка,
							  |	РегламентированныеОтчеты.ИсточникОтчета КАК ИсточникОтчета
		                      |ИЗ
		                      |	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
		                      |ГДЕ
		                      |	РегламентированныеОтчеты.ВнешнийОтчетИспользовать = &ПризнакИспользованияВнешнегоОтчета");
		Запрос.УстановитьПараметр("ПризнакИспользованияВнешнегоОтчета", Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Метаданные.Документы.Найти(Выборка.ИсточникОтчета) <> Неопределено ИЛИ	Метаданные.Отчеты.Найти(Выборка.ИсточникОтчета) <> Неопределено Тогда
				ОбъектРеглОтчет = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектРеглОтчет.ВнешнийОтчетИспользовать = Ложь;
				ОбъектРеглОтчет.Записать();
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	// Заполнением списка отчетов выполняется путем вызова экспортных процедур
	// основной формы обработки ОбновлениеРегламентированнойОтчетности.
	ОбработкаОбновлениеОтчетов = Обработки.ОбновлениеРегламентированнойОтчетности.Создать();
	
	// Получаем список регламентированных отчетов в виде дерева.
	ДеревоОтчетов = ОбработкаОбновлениеОтчетов.ПолучитьСписокОтчетов();

	Если ДеревоОтчетов.Строки.Количество() = 0 Тогда
		// нет обновлений
		Возврат;
	КонецЕсли;
	
	// Заполняем списко отчетов.
	ОбработкаОбновлениеОтчетов.ЗаполнитьСписокОтчетов(ДеревоОтчетов, ПервоеЗаполнение);

КонецПроцедуры // ЗаполнитьСписокРегламентированныхОтчетов()

Процедура ОчиститьСправочникТорговоеОборудование()

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТорговоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТорговоеОборудование КАК ТорговоеОборудование
	|ГДЕ
	|	ТорговоеОборудование.ОбработкаОбслуживания = ЗНАЧЕНИЕ(Справочник.ОбработкиОбслуживанияТО.ПустаяСсылка)
	|	И ТорговоеОборудование.Модель = """"
	|");

	УдалитьОбъекты(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры // ОчиститьСправочникТорговоеОборудование()

Процедура ОбновлениеСубконтоСчета27()

	Счет27 = ПланыСчетов.Хозрасчетный.ПродукцияСельскохозяйственногоПроизводства.ПолучитьОбъект();
	Счет26 = ПланыСчетов.Хозрасчетный.ГотоваяПродукция;
			
	// приведем состав субконто на счете 27 к составу субконто на счете 26			
	// удалим лишние субконто
	Инд = 0;
	Пока Инд < Счет27.ВидыСубконто.Количество() Цикл
		ВидСубконто27 = Счет27.ВидыСубконто[Инд].ВидСубконто;
		Если Счет26.ВидыСубконто.Найти(ВидСубконто27) = Неопределено Тогда
			Счет27.ВидыСубконто.Удалить(Инд);
		Иначе
			Инд = Инд + 1;
		КонецЕсли;
	КонецЦикла;			
	
	// добавим субконто со счета 26
	Для каждого СтрокаВидСубконто26 Из Счет26.ВидыСубконто Цикл
		
		ВидСубконто26 = СтрокаВидСубконто26.ВидСубконто;
		СтрокаВидСубконто27 = Счет27.ВидыСубконто.Найти(ВидСубконто26);
		Если СтрокаВидСубконто27 = Неопределено Тогда
			СтрокаВидСубконто27 = Счет27.ВидыСубконто.Добавить();	
		КонецЕсли;	
		
		СтрокаВидСубконто27.ВидСубконто   = ВидСубконто26;
		СтрокаВидСубконто27.ТолькоОбороты = СтрокаВидСубконто26.ТолькоОбороты;
		СтрокаВидСубконто27.Суммовой      = СтрокаВидСубконто26.Суммовой;
		СтрокаВидСубконто27.Количественный= СтрокаВидСубконто26.Количественный;
	
	КонецЦикла;
	
	Счет27.Записать();
	
КонецПроцедуры
 
Процедура ЗаполнитьТип(Строка)
	
	Если (Строка.Имя = "Контрагенты") или (Строка.Имя = "Контрагент")Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		ОписаниеТиповКонтрагенты = Новый ОписаниеТипов(Массив);
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповКонтрагенты);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Договор") или (Строка.Имя = "Договоры") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
		ОписаниеТиповДоговорыКонтрагентов = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповДоговорыКонтрагентов);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Документы_расчетов_с_контрагентами") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		Массив.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
		Массив.Добавить(Тип("ДокументСсылка.ГТДИмпорт"));
		Массив.Добавить(Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолга"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеНМА"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.ПередачаНМА"));
		Массив.Добавить(Тип("ДокументСсылка.ПередачаОС"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств"));
		Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
		Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
		Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.СписаниеТоваров"));
		ОписаниеТиповДокументыРасчетов = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповДокументыРасчетов);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Статья_движения_денежных_средств") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
		ОписаниеТиповСтатьяДвиженияДС = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСтатьяДвиженияДС);
		Строка.Тип = ХранилищеТип;	
		
	ИначеЕсли (Строка.Имя = "Сумма") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,2);
		ОписаниеТиповСумма = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСумма);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Номенклатура") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		ОписаниеТиповНоменклатура = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповНоменклатура);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Статьи_доходов") или (Строка.Имя = "Статья_доходов") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.СтатьиДоходов"));
		ОписаниеТиповСтатьиДоходов = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСтатьиДоходов);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "СтавкаНДС") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ПеречислениеСсылка.СтавкиНДС"));
		ОписаниеТиповСтатьиДоходов = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСтатьиДоходов);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "СуммаНДС") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,2);
		ОписаниеТиповСуммаНДС = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСуммаНДС);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "НалоговоеНазначение") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
		ОписаниеТиповНалоговоеНазначение = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповНалоговоеНазначение);
		Строка.Тип = ХранилищеТип;	
		
	ИначеЕсли (Строка.Имя = "Статьи_налогового_учета") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.СтатьиНалоговыхДеклараций"));
		ОписаниеТиповСтатьиНал = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСтатьиНал);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Валюта") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Валюты"));
		ОписаниеТиповВалюта = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповВалюта);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "ВалютнаяСумма") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,2);
		ОписаниеТиповВалютнаяСумма = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповВалютнаяСумма);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Курс") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,4);
		ОписаниеТиповКурс = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповКурс);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "СуммаНУ") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,2);
		ОписаниеТиповСуммаНУ = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСуммаНУ);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Банковские_счета") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
		ОписаниеТиповБанковскиеСчета = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповБанковскиеСчета);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Партии") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
		Массив.Добавить(Тип("ДокументСсылка.ОприходованиеТоваров"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену"));
		Массив.Добавить(Тип("ДокументСсылка.Партия"));
		Массив.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеИзПереработки"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
		ОписаниеТиповПартии = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповПартии);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Склады") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Склады"));
		ОписаниеТиповСклады = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСклады);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Количество") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,3);
		ОписаниеТиповКоличество = Новый ОписаниеТипов(Массив,,,КЧ); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповКоличество);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "СтатьяПриростаУбыли") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.СтатьиНалоговыхДеклараций"));
		ОписаниеТиповСтатьяПриростаУбыли = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповСтатьяПриростаУбыли);
		Строка.Тип = ХранилищеТип;
	КонецЕсли;
	
КонецПроцедуры 
 
Процедура ЗаполнитьТип11(Строка)
	
	Если (Строка.Имя = "Документы_расчетов_с_контрагентами") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		Массив.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
		Массив.Добавить(Тип("ДокументСсылка.ГТДИмпорт"));
		Массив.Добавить(Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом"));
		Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолга"));
		Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре"));
		Массив.Добавить(Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
		Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолга"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеНМА"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
		Массив.Добавить(Тип("ДокументСсылка.ПередачаНМА"));
		Массив.Добавить(Тип("ДокументСсылка.ПередачаОС"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"));
		Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств"));
		Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
		Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
		Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.СписаниеТоваров"));
		ОписаниеТиповДокументыРасчетов = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповДокументыРасчетов);
		Строка.Тип = ХранилищеТип;
		
	ИначеЕсли (Строка.Имя = "Партии") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
		Массив.Добавить(Тип("ДокументСсылка.ОприходованиеТоваров"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену"));
		Массив.Добавить(Тип("ДокументСсылка.Партия"));
		Массив.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
		Массив.Добавить(Тип("ДокументСсылка.КомплектацияНоменклатуры"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеИзПереработки"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
		Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
		ОписаниеТиповПартии = Новый ОписаниеТипов(Массив); 
		ХранилищеТип = Новый ХранилищеЗначения(ОписаниеТиповПартии);
		Строка.Тип = ХранилищеТип;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПерезаполнитьПараметрыНочныхВечерних()Экспорт
	
	// Для кадровых документов
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	 Начисления.Организация,
	|	 Начисления.Регистратор,
	|	 Начисления.НомерСтроки
	|
	|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
	|ГДЕ Начисления.ВидРасчета.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)
	|								,ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы))
	|
	|ИТОГИ
	|ПО Организация, Регистратор
	|";
	Запрос.Текст = ТекстЗапроса;
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыборкаОрганизация.Следующий() Цикл
		СтавкаВечерних = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", ВыборкаОрганизация.Организация)).КоэффициентВечерних;
		СтавкаНочных = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", ВыборкаОрганизация.Организация)).КоэффициентНочных;
		
		ВыборкаРегистратор = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
		Пока ВыборкаРегистратор.Следующий() Цикл
			
			Регистратор = ВыборкаРегистратор.Регистратор.ПолучитьОбъект();
			
			НаборНачисления = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей(); 
			НаборНачисления.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
			НаборНачисления.Прочитать(); 
			
			Выборка = ВыборкаРегистратор.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НаборНачисления[Выборка.НомерСтроки-1].ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
					НаборНачисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаВечерних;
				ИначеЕсли  НаборНачисления[Выборка.НомерСтроки-1].ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					НаборНачисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаНочных;
				КонецЕсли;
			КонецЦикла;
			
			Начисления = Регистратор.Метаданные().ТабличныеЧасти.Найти("ОсновныеНачисления");
			Если Начисления = Неопределено Тогда
				Начисления = Регистратор.Метаданные().ТабличныеЧасти.Найти("Начисления");
			КонецЕсли;
			Если Начисления <> Неопределено Тогда
				Для каждого СтрокаНачислений Из Регистратор[Начисления.Имя] Цикл
					Если СтрокаНачислений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
						СтрокаНачислений.Показатель2 = СтавкаВечерних;
					ИначеЕсли  СтрокаНачислений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
						СтрокаНачислений.Показатель2 = СтавкаНочных;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
			Регистратор.Записать();
			НаборНачисления.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	// для расчетных документов
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧНачисления.Ссылка.Организация КАК Организация,
	|	ТЧНачисления.Ссылка КАК Ссылка,
	|	Начисления.Регистратор КАК Регистратор,
	|	ТЧНачисления.НомерСтроки,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц КАК НормаЧасовЗаМесяц,
	|	Оклады.ОкладТариф КАК Оклад,
	|	ВЫБОР	КОГДА 		(Оклады.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
	|					ИЛИ Оклады.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
	|					И  ДанныеКалендаря.НормаЧасовЗаМесяц > 0

	|					 	
	|				ТОГДА Оклады.ОкладТариф/ДанныеКалендаря.НормаЧасовЗаМесяц
	|					
	|			КОГДА 	ТЧНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
	|				ТОГДА Оклады.ОкладТариф/8
	|			ИНАЧЕ Оклады.ОкладТариф
	|			КОНЕЦ
	|	  КАК ЧасовойТариф
	|
	|ИЗ Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК ТЧНачисления
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
	|ПО		ТЧНачисления.Ссылка = Начисления.Регистратор
	|	И	ТЧНачисления.НомерСтроки = Начисления.НомерСтроки
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ( 
	|	ВЫБРАТЬ
	|		ВсеНачисления.Регистратор КАК Регистратор,
	|		ВсеНачисления.НомерСтроки,
	|		ВсеНачисления.ВидРасчета,
	|		Плановые.Показатель1 КАК ОкладТариф,
	|		Плановые.Валюта1 КАК Валюта
	|	ИЗ (
	|		ВЫБРАТЬ
	|			Начисления.Ссылка КАК Регистратор,
	|			Начисления.НомерСтроки,
	|			Начисления.Назначение,
	|			Начисления.ВидРасчета,
	|			МАКСИМУМ(Плановые.Период)	КАК Период
	|		ИЗ Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК Начисления
	|       
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Плановые
	|  		ПО		Начисления.Назначение = Плановые.Сотрудник
	|  			И	Плановые.ВидРасчетаИзмерение <> Плановые.ВидРасчета
	|      
	|		ГДЕ Начисления.ВидРасчета.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)
	|							,ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы))
	|		СГРУППИРОВАТЬ ПО
	|			Начисления.Ссылка,
	|			Начисления.НомерСтроки,
	|			Начисления.Назначение,
	|			Начисления.ВидРасчета
	|
	|	) КАК ВсеНачисления
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Плановые
	|	ПО		ВсеНачисления.Назначение = Плановые.Сотрудник
	|  		И	Плановые.ВидРасчетаИзмерение <> Плановые.ВидРасчета
	|  		И	ВсеНачисления.Период = Плановые.Период
	|       
	|) КАК Оклады
	|ПО 	Оклады.Регистратор = ТЧНачисления.Ссылка 
	|	И	Оклады.НомерСтроки = ТЧНачисления.НомерСтроки 
	|
	|//-----------------------
	|// данные нормы календаря
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ )	КАК Период,
	|		ГрафикиРаботы.ГрафикРаботы	КАК ГрафикРаботы,
	|		СУММА( ГрафикиРаботы.ОсновноеЗначение  )		КАК НормаДнейЗаМесяц,
	|		СУММА( ГрафикиРаботы.ДополнительноеЗначение )	КАК НормаЧасовЗаМесяц
	|	ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|	ГДЕ		ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ ),
	|		ГрафикиРаботы.ГрафикРаботы
	|) КАК ДанныеКалендаря
	|ПО		ДанныеКалендаря.Период = НАЧАЛОПЕРИОДА(ТЧНачисления.ДатаНачала, МЕСЯЦ) 
	|	И	ВЫБОР	КОГДА ТЧНачисления.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику	
	|		     		ТОГДА ДанныеКалендаря.ГрафикРаботы = ТЧНачисления.ГрафикРаботы.ГрафикРаботыНормыВремени
	|				ИНАЧЕ ДанныеКалендаря.ГрафикРаботы = ТЧНачисления.ГрафикРаботы
	|		КОНЕЦ 
	|
	|ГДЕ ТЧНачисления.ВидРасчета.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)
	|								,ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы))
	|ИТОГИ
	|ПО Организация, Ссылка
	|";
	Запрос.Текст = ТекстЗапроса;
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыборкаОрганизация.Следующий() Цикл
		СтавкаВечерних = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", ВыборкаОрганизация.Организация)).КоэффициентВечерних;
		СтавкаНочных = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", ВыборкаОрганизация.Организация)).КоэффициентНочных;
		
		ВыборкаРегистратор = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		Пока ВыборкаРегистратор.Следующий() Цикл
			
			Регистратор = ВыборкаРегистратор.Ссылка.ПолучитьОбъект();
			РегистраторПроведен = Регистратор.Проведен;
			
			Если РегистраторПроведен Тогда
				НаборНачисления = РегистрыРасчета.Начисления.СоздатьНаборЗаписей(); 
				НаборНачисления.Отбор.Регистратор.Установить(ВыборкаРегистратор.Ссылка);
				НаборНачисления.Прочитать();
			КонецЕсли;
			
			Начисления = Регистратор.Метаданные().ТабличныеЧасти.Найти("Начисления");
			Если Начисления = Неопределено Тогда
				Начисления = Регистратор.Метаданные().ТабличныеЧасти.Найти("ОсновныеНачисления");
			КонецЕсли;
			Если Начисления <> Неопределено Тогда
				Начисления = Регистратор[Начисления.Имя];
					
				Выборка = ВыборкаРегистратор.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Начисления[Выборка.НомерСтроки-1].ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
						Начисления[Выборка.НомерСтроки-1].Показатель1 = Выборка.ЧасовойТариф;
						Начисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаВечерних;
						Если РегистраторПроведен Тогда
							НаборНачисления[Выборка.НомерСтроки-1].Показатель1 = Выборка.ЧасовойТариф;
							НаборНачисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаВечерних;
						КонецЕсли;
					ИначеЕсли  Начисления[Выборка.НомерСтроки-1].ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
						Начисления[Выборка.НомерСтроки-1].Показатель1 = Выборка.ЧасовойТариф;
						Начисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаНочных;
						Если РегистраторПроведен Тогда
							НаборНачисления[Выборка.НомерСтроки-1].Показатель1 = Выборка.ЧасовойТариф;
							НаборНачисления[Выборка.НомерСтроки-1].Показатель2 = СтавкаНочных;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
			Регистратор.Записать();
			НаборНачисления.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	 Надбавки.ПодразделениеОрганизации.Владелец КАК Организация,
	|	 Надбавки.Регистратор
	|
	|ИЗ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК Надбавки
	|ГДЕ Надбавки.ВидНадбавки.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)
	|								,ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы))
	|";
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтавкаВечерних = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Выборка.Организация)).КоэффициентВечерних;
		СтавкаНочных = 100*РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Выборка.Организация)).КоэффициентНочных;
		
		НаборНадбавки = РегистрыСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СоздатьНаборЗаписей(); 
		НаборНадбавки.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборНадбавки.Прочитать(); 
		
		Регистратор = Выборка.Регистратор.ПолучитьОбъект();
		
		Для Каждого Надбавка из НаборНадбавки Цикл
			Если Надбавка.Показатель1 = 0 И Надбавка.Показатель2 = 0 Тогда
				Если Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
					Надбавка.Показатель2 = СтавкаВечерних;
				ИначеЕсли  Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					Надбавка.Показатель2 = СтавкаНочных;
				КонецЕсли;
			ИначеЕсли Надбавка.Показатель2 = 0 Тогда
				Если Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы ИЛИ  Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					Надбавка.Показатель2 = Надбавка.Показатель1*100;
				КонецЕсли;
			КонецЕсли;
			Надбавка.Показатель1 = 0;
		КонецЦикла;
			
		Для каждого Надбавка Из Регистратор.Надбавки Цикл
			Если Надбавка.Показатель1 = 0 И Надбавка.Показатель2 = 0 Тогда
				Если Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
					Надбавка.Показатель2 = СтавкаВечерних;
				ИначеЕсли  Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					Надбавка.Показатель2 = СтавкаНочных;
				КонецЕсли;
			ИначеЕсли Надбавка.Показатель2 = 0 Тогда
				Если Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы ИЛИ  Надбавка.ВидНадбавки.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					Надбавка.Показатель2 = Надбавка.Показатель1*100;
				КонецЕсли;
			КонецЕсли;
			Надбавка.Показатель1 = 0;
		КонецЦикла;
			
		Регистратор.Записать();
		НаборНадбавки.Записать();
			
	КонецЦикла;


	
КонецПроцедуры

Функция ПолучитьНовыйВидвремени(ВидВремени)
	
	Если ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СверхурочныеСдельщиков 
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПочасовкаСдельщиков 
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПочасовкаСдельщиковВнутреннесменная
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СдельнаяРаботаПочасовыхРаботников
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаСельхозРаботы 
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаСельхозРаботы75
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации 
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение;	
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности 
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДопризывнаяПодготовка
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ВоенныеСборы
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДетиДо18
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ЖенщинамНаКормлениеДетей
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Карантин
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.НеотработанноеВремяПоЗаконодательству;
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростоиПоВинеРаботников 
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростоиПоВинеРаботниковВнутрисменные
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателяВнутрисменный
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.Простой;
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Опоздания 
		или ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПреждевременноеОкончаниеРаботы
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.Прогул;	
	ИначеЕсли ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.УчебаБезСохраненияЗП 
		Тогда
		Возврат Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый;
	Иначе
		Возврат ВидВремени;
	КонецЕсли;	
		
КонецФункции	

Процедура ОбновитьКлассификаторВремени()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияОрганизаций.Ссылка,
	               |	ОсновныеНачисленияОрганизаций.Предопределенный,
	               |	ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК ОсновныеНачисленияОрганизаций
				   |ГДЕ
				   |	НЕ ОсновныеНачисленияОрганизаций.Предопределенный
				   |	И ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени.Предопределенный
				   |";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОбозначениеВТабелеУчетаРабочегоВремени.ЦифровойКод) Тогда
			Продолжить;
		КонецЕсли;
		ВР = Выборка.Ссылка.ПолучитьОбъект();
		ВР.ОбозначениеВТабелеУчетаРабочегоВремени = ПолучитьНовыйВидвремени(Выборка.ОбозначениеВТабелеУчетаРабочегоВремени);
		
		Попытка
			ВР.Записать();
		Исключение
			Сообщить("Не удалось обновить вид времени у вида расчета "+Выборка.Ссылка.Наименование);
		КонецПопытки;
		
	КонецЦикла;	
	
	Возврат;
	
КонецПроцедуры	

Процедура КонвертацияРегистраОтражениеВзносовФОТВРеглУчете()
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтражениеВзносовФОТВРеглУчете.Период,
	|	ОтражениеВзносовФОТВРеглУчете.Налог,
	|	ОтражениеВзносовФОТВРеглУчете.УдалитьСтатьяЗатратНачисления.ХарактерЗатрат КАК ХарактерЗатрат,
	|	ОтражениеВзносовФОТВРеглУчете.СтатьяЗатрат,
	|	ОтражениеВзносовФОТВРеглУчете.СтатьяВаловыхРасходов
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	РегистрСведений.ОтражениеВзносовФОТВРеглУчете КАК ОтражениеВзносовФОТВРеглУчете
	|ГДЕ
	|	ОтражениеВзносовФОТВРеглУчете.УдалитьСтатьяЗатратНачисления <> ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ 
	|	Таблица.Период,
	|	Таблица.Налог,
	|	Таблица.ХарактерЗатрат,
	|	МАКСИМУМ(Таблица.СтатьяЗатрат) КАК СтатьяЗатрат,
	|	МАКСИМУМ(Таблица.СтатьяВаловыхРасходов) КАК СтатьяВаловыхРасходов
	|ПОМЕСТИТЬ ТаблицаСвернутая
	|ИЗ
	|	Таблица КАК Таблица
	|СГРУППИРОВАТЬ ПО Период, Налог, ХарактерЗатрат 
	|";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСвернутая.Период,
	|	ТаблицаСвернутая.Налог,
	|	ТаблицаСвернутая.ХарактерЗатрат,
	|	ТаблицаСвернутая.СтатьяЗатрат,
	|	ТаблицаСвернутая.СтатьяВаловыхРасходов,
	|   ВЫБОР КОГДА Таблица.Период ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ФлагДубли
	|ИЗ
	|	ТаблицаСвернутая КАК ТаблицаСвернутая
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   Таблица КАК Таблица
    |   ПО (ТаблицаСвернутая.Период = Таблица.Период И ТаблицаСвернутая.Налог = Таблица.Налог И ТаблицаСвернутая.ХарактерЗатрат = Таблица.ХарактерЗатрат)
	|    И (ТаблицаСвернутая.СтатьяЗатрат <> Таблица.СтатьяЗатрат ИЛИ ТаблицаСвернутая.СтатьяВаловыхРасходов <> Таблица.СтатьяВаловыхРасходов)
	|";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	НаборЗаписей = РегистрыСведений.ОтражениеВзносовФОТВРеглУчете.СоздатьНаборЗаписей(); 
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать();
	
	СтрДубли = "";
	Для Каждого СтрЗапись из ТЗ Цикл
		Если СтрЗапись.ФлагДубли Тогда
			СтрДубли = СтрДубли + "Период = """+Строка(СтрЗапись.Период)+ """ Налог = """+Строка(СтрЗапись.Налог)+""" Характер затрат = """+Строка(СтрЗапись.ХарактерЗатрат)+""""+Символы.ПС;
		КонецЕсли;	
	КонецЦикла;
	Если СтрДубли <> "" Тогда
		Сообщить("При реструктуризации регистра сведений ""Отражение Взносов на ФОТ в регл. учете"" обнаружены неоднозначные записи.",СтатусСообщения.Важное);
		Сообщить("Проверьте настройку следующих строк в регистре:");
		Сообщить(СтрДубли);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыРегистраВзаиморасчетыПоНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаиморасчетыПоНДФЛ.Регистратор КАК Регистратор
	|ИЗ РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК ВзаиморасчетыПоНДФЛ
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Взаиморасчеты = РегистрыНакопления.ВзаиморасчетыПоНДФЛ;
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = Взаиморасчеты.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для каждого ТекущаяЗапись Из НаборЗаписей Цикл
			Если ТекущаяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
				Если ЗначениеЗаполнено(ТекущаяЗапись.УдалитьЛьгота) Тогда
					ТекущаяЗапись.Льгота = ТекущаяЗапись.УдалитьЛьгота;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекущаяЗапись.УдалитьВидСтавки) Тогда
					ТекущаяЗапись.ВидСтавки = ТекущаяЗапись.УдалитьВидСтавки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// Переход на редакцию 1.1

Процедура ВыполнитьЗаполнениеРеквизитаВидНоменклатурыВСправочникеНоменклатура() Экспорт

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.Набор КАК Набор,
	|	СпрНоменклатура.Услуга КАК Услуга
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	Не СпрНоменклатура.ЭтоГруппа
	|	И СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|");

	КэшВидовНоменклатуры = Новый Соответствие;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Услуга Тогда
			НаименованиеВидаНоменклатуры = "Услуга";
			ТипВидаНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
		ИначеЕсли Выборка.Набор Тогда
			НаименованиеВидаНоменклатуры = "Набор-пакет";
			ТипВидаНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;
		Иначе
			НаименованиеВидаНоменклатуры = "Товар";
			ТипВидаНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		КонецЕсли;

		ТекВидНоменклатуры = КэшВидовНоменклатуры[НаименованиеВидаНоменклатуры];
		Если ТекВидНоменклатуры = Неопределено Тогда
			ТекВидНоменклатуры = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
			ТекВидНоменклатуры.Наименование = НаименованиеВидаНоменклатуры;
			ТекВидНоменклатуры.ТипНоменклатуры = ТипВидаНоменклатуры;
			ТекВидНоменклатуры.Записать();
			ТекВидНоменклатуры = ТекВидНоменклатуры.Ссылка;

			КэшВидовНоменклатуры.Вставить(НаименованиеВидаНоменклатуры, ТекВидНоменклатуры);
		КонецЕсли;

		ОбъектНоменклатуры = Выборка.Номенклатура.ПолучитьОбъект();
		ОбъектНоменклатуры.ВидНоменклатуры = ТекВидНоменклатуры;
		ОбъектНоменклатуры.ОбменДанными.Загрузка = Истина;
		ОбъектНоменклатуры.Записать();
	КонецЦикла;

КонецПроцедуры


// Заполнить задачи из данных документов о напоминаниях
//
Процедура ЗаполнитьЗадачиНапоминаниями()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВнутреннийЗаказ.Ссылка                  КАК Объект,
	|	ВнутреннийЗаказ.Ответственный           КАК Ответственный,
	|	ВнутреннийЗаказ.УдалитьВремяНапоминания КАК ВремяНапоминания
	|ИЗ
	|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ГДЕ
	|	ВнутреннийЗаказ.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И ВнутреннийЗаказ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Ответственный,
	|	ЗаказПокупателя.УдалитьВремяНапоминания
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И ЗаказПокупателя.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Ответственный,
	|	ЗаказПоставщику.УдалитьВремяНапоминания
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И ЗаказПоставщику.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Событие.Ссылка,
	|	Событие.Ответственный,
	|	Событие.УдалитьВремяНапоминания
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И Событие.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетПокупателю.Ссылка,
	|	СчетПокупателю.Ответственный,
	|	СчетПокупателю.УдалитьВремяНапоминания
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетПокупателю
	|ГДЕ
	|	СчетПокупателю.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И СчетПокупателю.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетПоставщика.Ссылка,
	|	СчетПоставщика.Ответственный,
	|	СчетПоставщика.УдалитьВремяНапоминания
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетПоставщика
	|ГДЕ
	|	СчетПоставщика.УдалитьНапомнитьОСобытии = ИСТИНА
	|	И СчетПоставщика.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Проверим есть ли задачи: если хотя бы одна запись-задача существует, то
	// нужно принимать решение о том, что обновление ИБ ранее производилось. 
	
	ЗапросЗадачи = Новый Запрос;
	ЗапросЗадачи.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 *
	|ИЗ
	|	Задача.ЗадачиПользователя
	|";
	
	СписокЗадач = ЗапросЗадачи.Выполнить();
	
	Если (НЕ РезультатЗапроса.Пустой())
		И (СписокЗадач.Пустой()) Тогда
		
		// Для записи задач применяем транзакцию: если при записи хотя бы одной из задач
		// возникнет ошибка - отменяем запись всех задач без исключения.
		НачатьТранзакцию();
		
		ДанныеНапоминаний = РезультатЗапроса.Выбрать();
		Пока ДанныеНапоминаний.Следующий() Цикл
	
			НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
			
			НоваяЗадача.Исполнитель    = ДанныеНапоминаний.Ответственный;
			НоваяЗадача.Дата           = ТекущаяДата();
			НоваяЗадача.Наименование   = Строка(ДанныеНапоминаний.Объект);
			НоваяЗадача.СрокИсполнения = ДанныеНапоминаний.ВремяНапоминания;
			НоваяЗадача.Объект         = ДанныеНапоминаний.Объект;
			
			Попытка
				НоваяЗадача.Записать();
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
	
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнить контактные лица в документах
//
Процедура ЗаполнитьКонтактныеЛица()
	
	// шапка документы Событие
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Событие.Ссылка КАК Событие,
	|	КонтактныеЛицаКонтрагентов.Ссылка КАК КонтактноеЛицоКонтрагента
	|ИЗ
	|	Документ.Событие КАК Событие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|		ПО Событие.КонтактноеЛицо = КонтактныеЛицаКонтрагентов.КонтактноеЛицо
	|		И  Событие.Контрагент = КонтактныеЛицаКонтрагентов.Владелец
	|ГДЕ
	|	Событие.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛица";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Событие.ПолучитьОбъект();
		Объект.КонтактноеЛицоБезКонтрагента = Объект.КонтактноеЛицо;
		Объект.КонтактноеЛицо = Выборка.КонтактноеЛицоКонтрагента;
		
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Не записано контактное лицо, " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапросПоКЛК = Новый Запрос;
	
	// таблица контактных лиц контрагентов
	ЗапросПоКЛК.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаКонтрагентов.Ссылка,
	|   КонтактныеЛицаКонтрагентов.Владелец КАК Контрагент,
	|   КонтактныеЛицаКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов";

	КонтактныеЛицаКонтрагентов = ЗапросПоКЛК.Выполнить().Выгрузить();
	
	// ТЧ СторонниеЛица документа Событие
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеСторонниеЛица.Ссылка КАК Событие
	|ИЗ
	|	Документ.Событие.СторонниеЛица КАК СобытиеСторонниеЛица
	|ГДЕ
	|	СобытиеСторонниеЛица.Лицо ССЫЛКА Справочник.КонтактныеЛица
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Событие.ПолучитьОбъект();
		
		Для каждого Строка из Объект.СторонниеЛица Цикл
			
			Если Не ЗначениеЗаполнено(Строка.Контрагент) ИЛИ Не ЗначениеЗаполнено(Строка.Лицо) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗапросПоКЛК = Новый Запрос;
			ЗапросПоКЛК.УстановитьПараметр("Контрагент",Строка.Контрагент);
			ЗапросПоКЛК.УстановитьПараметр("КонтактноеЛицо",Строка.Лицо);
			
			Структура = Новый Структура("Контрагент,КонтактноеЛицо",Строка.Контрагент,Строка.Лицо);
			Строки = КонтактныеЛицаКонтрагентов.НайтиСтроки(Структура);
			
			Если Строки.Количество()>0 И ЗначениеЗаполнено(Строки[0].Ссылка) Тогда
				Строка.Лицо = Строки[0].Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Не записан документ событие, " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	//Шапки документов  ЗаказПокупателя, ЗаказПоставщику, СчетНаОплатуПокупателю, СчетНаОплатуПоставщика
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустоеКонтактноеЛицо",Справочники.КонтактныеЛица.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документы.Ссылка,
	|	КонтактныеЛицаКонтрагентов.Ссылка КАК КонтактноеЛицоКонтрагента
	|ИЗ
	|	(
	|	ВЫБРАТЬ 
	|		ЗаказПокупателя.Ссылка                КАК Ссылка,
	|		ЗаказПокупателя.УдалитьКонтактноеЛицо КАК УдалитьКонтактноеЛицо,
	|		ЗаказПокупателя.Контрагент            КАК Контрагент
	|	ИЗ 
	|		Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 
	|		ЗаказПоставщику.Ссылка                КАК Ссылка,
	|		ЗаказПоставщику.УдалитьКонтактноеЛицо КАК УдалитьКонтактноеЛицо,
	|		ЗаказПоставщику.Контрагент            КАК Контрагент
	|	ИЗ 
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 
	|		СчетНаОплатуПокупателю.Ссылка                КАК Ссылка,
	|		СчетНаОплатуПокупателю.УдалитьКонтактноеЛицо КАК УдалитьКонтактноеЛицо,
	|		СчетНаОплатуПокупателю.Контрагент            КАК Контрагент
	|	ИЗ 
	|		Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 
	|		СчетНаОплатуПоставщика.Ссылка                КАК Ссылка,
	|		СчетНаОплатуПоставщика.УдалитьКонтактноеЛицо КАК УдалитьКонтактноеЛицо,
	|		СчетНаОплатуПоставщика.Контрагент            КАК Контрагент
	|	ИЗ 
	|		Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 
	|		АктСверкиВзаиморасчетов.Ссылка                КАК Ссылка,
	|		АктСверкиВзаиморасчетов.УдалитьПредставительКонтрагентаСтарый КАК УдалитьПредставительКонтрагентаСтарый,
	|		АктСверкиВзаиморасчетов.Контрагент            КАК Контрагент
	|	ИЗ 
	|		Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|	) КАК Документы
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|ПО 
	|	Документы.УдалитьКонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛица
	|	И Документы.УдалитьКонтактноеЛицо = КонтактныеЛицаКонтрагентов.КонтактноеЛицо
	|	И Документы.Контрагент ССЫЛКА Справочник.Контрагенты
	|	И Документы.Контрагент = КонтактныеЛицаКонтрагентов.Владелец
	|	И Документы.УдалитьКонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если ТипЗнч(объект) = Тип("ДокументОБъект.АктСверкиВзаиморасчетов") Тогда
		    Объект.ПредставительКонтрагента = Выборка.КонтактноеЛицоКонтрагента;
		Иначе	
			Объект.КонтактноеЛицоКонтрагента = Выборка.КонтактноеЛицоКонтрагента;
		КонецЕсли;
		
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Не записан документ (" + Строка(Объект) + "), " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет новый регистр сведений КонтактныеЛицаКонтрагентов на основании данных
// из справочника КонтактныеЛица
Процедура ЗаполнитьКонтактныеЛицаКонтрагентов()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидКонтактногоЛицаЛичный", Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт);	
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КонтактныеЛица.Ссылка                    КАК КонтактноеЛицо,
	|	КонтактныеЛица.УдалитьВидКонтактногоЛица КАК УдалитьВидКонтактногоЛица,
	|	КонтактныеЛица.УдалитьОбъектВладелец     КАК УдалитьОбъектВладелец,
	|	КонтактныеЛица.УдалитьДолжность          КАК УдалитьДолжность,
	|	КонтактныеЛица.УдалитьРоль               КАК УдалитьРоль,
	|	КонтактныеЛицаКонтрагентов.Ссылка        КАК КонтактноеЛицоКонтрагента
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|		ПО КонтактныеЛицаКонтрагентов.КонтактноеЛицо = КонтактныеЛица.Ссылка
	|			И КонтактныеЛицаКонтрагентов.Владелец = КонтактныеЛица.УдалитьОбъектВладелец
	|ГДЕ
	|	КонтактныеЛица.УдалитьВидКонтактногоЛица <> &ВидКонтактногоЛицаЛичный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.УдалитьВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента
			И ТипЗнч(Выборка.УдалитьОбъектВладелец) =  Тип("СправочникСсылка.Контрагенты") Тогда
			
			СостояниеОбновления(Выборка.КонтактноеЛицо);
			
			Если Не ЗначениеЗаполнено(Выборка.КонтактноеЛицоКонтрагента) Тогда
				КонтактноеЛицоКонтрагента = Справочники.КонтактныеЛицаКонтрагентов.СоздатьЭлемент();
			Иначе
				КонтактноеЛицоКонтрагента = Выборка.КонтактноеЛицоКонтрагента.ПолучитьОбъект(); 
			КонецЕсли;
			
			КонтактноеЛицоКонтрагента.Владелец            = Выборка.УдалитьОбъектВладелец;
			КонтактноеЛицоКонтрагента.КонтактноеЛицо      = Выборка.КонтактноеЛицо; 
			КонтактноеЛицоКонтрагента.Наименование        = Выборка.КонтактноеЛицо;
			КонтактноеЛицоКонтрагента.Должность           = Выборка.УдалитьДолжность;
			КонтактноеЛицоКонтрагента.РольКонтактногоЛица = Выборка.УдалитьРоль;
			КонтактноеЛицоКонтрагента.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



// Управление денежными средствами и бюджетирование

// Процедура заполняет новую табличную часть Менеджеры справочника Контрагенты
//
Процедура ЗаполнитьМенеджеровПокупателя()
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПустойМенеджер", Справочники.Пользователи.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджерПокупателя
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.Покупатель = ИСТИНА И Контрагенты.ОсновнойМенеджерПокупателя <> &ПустойМенеджер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Контрагент.ПолучитьОбъект();
		
		Если Объект.МенеджерыПокупателя.Найти(Объект.ОсновнойМенеджерПокупателя) = Неопределено Тогда
			Строка = Объект.МенеджерыПокупателя.Добавить();
			Строка.МенеджерПокупателя = Объект.ОсновнойМенеджерПокупателя;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// Процедура заполняет у документа ЭлектронноеПисьмо новую табличную часть
// ОбъектыПисем по адресам электронной почты
Процедура ЗаполнитьОбъектыПисем()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЭлектронноеПисьмо.Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СостояниеОбновления(Выборка.Ссылка);

		Письмо = Выборка.Ссылка.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		
		Если ЗначениеЗаполнено(Письмо.УдалитьПредмет) И Не ЗначениеЗаполнено(Письмо.ПредметКонтакта) Тогда
			Письмо.ПредметКонтакта = Строка(Письмо.УдалитьПредмет);
			ЕстьИзменения = Истина;
		КонецЕсли; 
		
		// если предмет был физическое лицо - добавим в объекты
		Если ТипЗнч(Письмо.УдалитьПредмет) = Тип("СправочникСсылка.ФизическиеЛица") И Письмо.УдалитьПредмет <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			СтрокаПисьма = Письмо.ОбъектыПисем.Найти(Письмо.УдалитьПредмет);
			Если СтрокаПисьма = Неопределено Тогда
				СтрокаПисьма = Письмо.ОбъектыПисем.Добавить();
				СтрокаПисьма.Объект = Письмо.УдалитьПредмет;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьИзменения  Тогда
			Письмо.Записать();
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет включение режима полнотекстового поиска.
//
Процедура ВключитьРежимПолнотекстовогоПоиска()

	флПоискВключен = Ложь;
	Попытка
		ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
		флПоискВключен = Истина;
	Исключение
	КонецПопытки;

#Если Клиент Тогда
	Пока Не флПоискВключен Цикл
		ТекстВопроса =
		"Обнаружено два соединения с информационной базой, от чего не удалось подключить средства полнотекстового поиска.
		|Закройте связанный с этой информационной базой Конфигуратор и повторите попытку подключения.
		|
		|Включить полнотекстовый поиск еще раз?";

		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка
				ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
				флПоискВключен = Истина;
			Исключение
			КонецПопытки;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
#КонецЕсли

КонецПроцедуры // ВключитьРежимПолнотекстовогоПоиска()

// Процедура заполняет новый регистр сведений ИсточникИнформацииПриОбращении на основании данных
// из документа Событие
Процедура ЗаполнитьРегистрСведенийИсточникИнформацииПриОбращении()
	
	События = Документы.Событие;
	Выборка = События.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИсточникИнформацииПриОбращении) И ТипЗнч(Выборка.Контрагент)= Тип("СправочникСсылка.Контрагенты") Тогда
			
			НаборЗаписей = РегистрыСведений.ИсточникИнформацииПриОбращении.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Ссылка;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Движение = НаборЗаписей.Добавить();
			Движение.Период             = Выборка.Дата;
			Движение.Контрагент         = Выборка.Контрагент;
			Движение.ИсточникИнформации = Выборка.ИсточникИнформацииПриОбращении;
			Движение.Регистратор        = Выборка.Ссылка;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// Записываем реквизиты предопределенных вопросов
//
// Параметры
//  нет
//
Процедура ЗаполнитьРеквизитыВопросов(ЗаполнятьТабличныеВопросы = Истина)

	Менеджер		= ПланыВидовХарактеристик.ВопросыДляАнкетирования;
	ВВидеЧисла		= Перечисления.ТипыОтветаНаВопросАнкеты.Число;
	ВВидеСтроки		= Перечисления.ТипыОтветаНаВопросАнкеты.Строка;
	ВВидеДаты		= Перечисления.ТипыОтветаНаВопросАнкеты.Дата;
	ТабличныйВопрос	= Перечисления.ТипыОтветаНаВопросАнкеты.Табличный;
	ВВидеБулево		= Перечисления.ТипыОтветаНаВопросАнкеты.Булево;
	ВВидеКИ			= Перечисления.ТипыОтветаНаВопросАнкеты.КонтактнаяИнформация;
	ВВидеСсылки		= Перечисления.ТипыОтветаНаВопросАнкеты.Ссылка;
	
	// Описание типов
	КЧ = Новый КвалификаторыЧисла(15, 2);
	КС = Новый КвалификаторыСтроки(1000);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	
	ОписаниеТиповЧисло	= Новый ОписаниеТипов("Число", КЧ);
	ОписаниеТиповСтрока	= Новый ОписаниеТипов("Строка", , КС);
	ОписаниеТиповДата	= Новый ОписаниеТипов("Дата", , , КД);
	ОписаниеТиповБулево	= Новый ОписаниеТипов("Булево");
	ОписаниеТиповВОТ	= Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовОпросов");
	
	// Общие вопросы
	УстановитьРеквизитыВопроса(Менеджер.Имя,			"Имя",			ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.Отчество,		"Отчество",		ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.Фамилия,		"Фамилия",		ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.ДатаРождения,	"Дата рождения",ВВидеДаты,,,,	ОписаниеТиповДата);

	// Контактное лицо
	УстановитьРеквизитыВопроса(Менеджер.Должность,		"Должность",	ВВидеСтроки,,,, ОписаниеТиповСтрока, 100);
	УстановитьРеквизитыВопроса(Менеджер.Роль,			"Роль",			ВВидеСсылки,,,,	Новый ОписаниеТипов("СправочникСсылка.РолиКонтактныхЛиц"));

	// Контрагент
	УстановитьРеквизитыВопроса(Менеджер.НаименованиеКонтрагента,	"Наименование",				ВВидеСтроки,,,, ОписаниеТиповСтрока, 100);
	УстановитьРеквизитыВопроса(Менеджер.ТипКонтрагента,				"Тип",						ВВидеСсылки,,,,	Новый ОписаниеТипов("ПеречислениеСсылка.ЮрФизЛицо"));
	УстановитьРеквизитыВопроса(Менеджер.ВидДеятельностиКонтрагента,	"Вид деятельности",			ВВидеСсылки,,,,	Новый ОписаниеТипов("СправочникСсылка.ВидыДеятельностиКонтрагентов"));
	
	// табличные вопросы
	УстановитьРеквизитыВопроса(Менеджер.ТВидыДеятельностиКонтрагента,	"Виды деятельности контрагента",	ТабличныйВопрос,, 4,, ОписаниеТиповСтрока, 200);
	
	Если ЗаполнятьТабличныеВопросы Тогда
		// табличный вопрос трудовая деятельность
		ОбъектПВХВопросыДляАнкетирования = ПланыВидовХарактеристик.ВопросыДляАнкетирования.ТВидыДеятельностиКонтрагента.ПолучитьОбъект();
		НоваяКолонка = ОбъектПВХВопросыДляАнкетирования.КолонкиТаблицы.Добавить();
		НоваяКолонка.КолонкаТаблицы = ПланыВидовХарактеристик.ВопросыДляАнкетирования.ВидДеятельностиКонтрагента;
		ОбъектПВХВопросыДляАнкетирования.КоличествоСтрокТаблицы = 4;
		ОбъектПВХВопросыДляАнкетирования.Записать();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРеквизитыВопросов()

// Заполнение реквизитов справочника "Виды оплат чека ККМ"
//
Процедура ЗаполнитьСправочникВидыОплатЧекаККМ()

	ОбъектВидОплатыЧекаККМ           = Справочники.ВидыОплатЧекаККМ.Наличные.ПолучитьОбъект();
	ОбъектВидОплатыЧекаККМ.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные;
	ОбъектВидОплатыЧекаККМ.Записать();

КонецПроцедуры // ЗаполнитьСправочникВидыОплатЧекаККМ()

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОБНОВЛЕНИЯ ИНФОРМАЦИОННОЙ БАЗЫ

Процедура ОбновитьПредметыЭлектронныхПисем()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЭлектронноеПисьмо.Ссылка) КАК Количество
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ВсегоПисем = Выборка.Количество;
	
	ВыборкаПисем = Документы.ЭлектронноеПисьмо.Выбрать();
	Счетчик = 0;
	Пока ВыборкаПисем.Следующий() Цикл
		Счетчик = Счетчик + 1;
		СостояниеОбновления("Обрабатывается " + Счетчик + " из " + ВсегоПисем);
		Объект = ВыборкаПисем.ПолучитьОбъект();
		Если ТипЗнч(Объект.УдалитьПредмет) = Тип("Строка") Тогда
			Объект.Предмет = Объект.УдалитьПредмет;
		ИначеЕсли ТипЗнч(Объект.УдалитьПредмет) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Объект.Предмет = Строка(Объект.УдалитьПредмет);
		Иначе
			Продолжить;
		КонецЕсли;
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

// Процедура очищает регистр сведений НастройкиПользователя по переданной настройке
// 
Процедура ОчиститьНастройкиПользователяПоПараметру(Настройка)
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

// Процедура переносит личные контакты и связанную информацию
// из справочника КонтактныеЛица в новый справочник ЛичныеКонтакты
Процедура ПеренестиЛичныеКонтакты()
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо
	|ИЗ
   	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
   	|
   	|ГДЕ
   	|	КонтактныеЛица.УдалитьВидКонтактногоЛица = &ВидКонтактногоЛица";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КонтактноеЛицо = Выборка.КонтактноеЛицо;
		
		Если Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		Если КонтактноеЛицо.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		
		Объект = Справочники.ЛичныеКонтакты.СоздатьЭлемент();
		Объект.Наименование 							= КонтактноеЛицо.Наименование;
		Объект.ДатаРождения 							= КонтактноеЛицо.ДатаРождения;
		Объект.Имя 										= КонтактноеЛицо.Имя;
		Объект.КоличествоДнейДоНапоминания 				= КонтактноеЛицо.КоличествоДнейДоНапоминания;
		Объект.НапоминатьОДнеРождения 					= КонтактноеЛицо.НапоминатьОДнеРождения;
		Объект.Описание 								= КонтактноеЛицо.Описание;
		Объект.Отчество 								= КонтактноеЛицо.Отчество;
		Объект.Фамилия = КонтактноеЛицо.Фамилия;
		Объект.Записать();
		
		// СВОЙСТВА
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(КонтактноеЛицо);
		НаборЗаписей.Прочитать();
		
		НаборДляКопирования = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборДляКопирования.Прочитать();
		
		Если НаборЗаписей.Количество()>0 Тогда
			Для каждого Запись из НаборЗаписей Цикл
				
				 НоваяЗапись = НаборДляКопирования.Добавить();
				 НоваяЗапись.Объект 	= Объект.Ссылка;
				 НоваяЗапись.Свойство 	= Запись.Свойство;
				 НоваяЗапись.Значение 	= Запись.Значение;
				
			КонецЦикла;
			
			НаборДляКопирования.Записать();
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли; 
		
		// КАТЕГОРИИ
		НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(КонтактноеЛицо);
		НаборЗаписей.Прочитать();
		
		НаборДляКопирования = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
		НаборДляКопирования.Прочитать();
		
		Если НаборЗаписей.Количество()>0 Тогда
			Для каждого Запись из НаборЗаписей Цикл
				
				 НоваяЗапись = НаборДляКопирования.Добавить();
				 НоваяЗапись.Объект 	= Объект.Ссылка;
				 НоваяЗапись.Категория 	= Запись.Категория;
				
			КонецЦикла;
			
			НаборДляКопирования.Записать();
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли; 

		// КОНТАКТНАЯ ИНФОРМАЦИЯ
		НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(КонтактноеЛицо);
		НаборЗаписей.Прочитать();
		
		НаборДляКопирования = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборДляКопирования.Прочитать();
		
		Если НаборЗаписей.Количество()>0 Тогда
			Для каждого Запись из НаборЗаписей Цикл
				
				НоваяЗапись = НаборДляКопирования.Добавить();
				НоваяЗапись.Объект 	= Объект.Ссылка;
				НоваяЗапись.Тип 	= Запись.Тип;
				НоваяЗапись.Вид 	= Запись.Вид;
				
				НоваяЗапись.Представление 	= Запись.Представление;
				НоваяЗапись.Поле1 	= Запись.Поле1;
				НоваяЗапись.Поле2 	= Запись.Поле2;
				НоваяЗапись.Поле3 	= Запись.Поле3;
				НоваяЗапись.Поле4 	= Запись.Поле4;
				НоваяЗапись.Поле5 	= Запись.Поле5;
				НоваяЗапись.Поле6 	= Запись.Поле6;
				НоваяЗапись.Поле7 	= Запись.Поле7;
				НоваяЗапись.Поле8 	= Запись.Поле8;
				НоваяЗапись.Поле9 	= Запись.Поле9;
				НоваяЗапись.Поле10 	= Запись.Поле10;
				НоваяЗапись.Комментарий 	= Запись.Комментарий;
				НоваяЗапись.ЗначениеПоУмолчанию 	= Запись.ЗначениеПоУмолчанию;

			КонецЦикла;
			
			НаборДляКопирования.Записать();
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли; 

		// ГРУППА РАССЫЛКИ
		НаборЗаписей = РегистрыСведений.СоставГруппРассылкиЭлектроннойПочты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРассылки.Установить(КонтактноеЛицо);
		НаборЗаписей.Прочитать();
		
		НаборДляКопирования = РегистрыСведений.СоставГруппРассылкиЭлектроннойПочты.СоздатьНаборЗаписей();
		НаборДляКопирования.Прочитать();
		
		Если НаборЗаписей.Количество()>0 Тогда
			Для каждого Запись из НаборЗаписей Цикл
				
				 НоваяЗапись = НаборДляКопирования.Добавить();
				 НоваяЗапись.ОбъектРассылки 	= Объект.Ссылка;
				 НоваяЗапись.ГруппаРассылки 	= Запись.ГруппаРассылки;
				
			КонецЦикла;
			
			НаборДляКопирования.Записать();
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли; 

		// СОБЫТИЯ
		ВыборкаСобытий = Документы.Событие.Выбрать(,,Новый Структура("КонтактноеЛицо",КонтактноеЛицо));
		Пока ВыборкаСобытий.Следующий() Цикл
			ОбъектСобытие = ВыборкаСобытий.ПолучитьОбъект();
			ОбъектСобытие.КонтактноеЛицо = Объект.Ссылка;
			ОбъектСобытие.Записать();
		КонецЦикла;
		
		ОбъектКонтактноеЛицо = КонтактноеЛицо.ПолучитьОбъект();
		ОбъектКонтактноеЛицо.УстановитьПометкуУдаления(Истина,Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиПраваДоступаКУчетнымЗаписям()
	
	Выборка = Справочники.УчетныеЗаписиЭлектроннойПочты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Для каждого СтрокаТЧ Из Объект.ДоступКУчетнойЗаписи Цикл
			СтрокаТЧ.Запись = СтрокаТЧ.УдалитьОтправка ИЛИ СтрокаТЧ.УдалитьТранспорт;
		КонецЦикла;
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Функция для проверки возможности открытия форм - обработчиков обновления
//
Функция ПолучитьРазрешениеНаОткрытиеФормы() Экспорт

	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Истина;
	КонецЕсли;
#Если Клиент Тогда
	Предупреждение("Форму обработки может открывать только пользователь с ролью ""Полные права""");
#КонецЕсли

	Возврат Ложь;

КонецФункции

Процедура СообщитьОСостоянииОбновления(Подсистема, Действие, Комментарий="", Уровень=0) Экспорт

	СтрокаТабуляций = "";
	Для ш = 1 По Уровень Цикл
		СтрокаТабуляций = СтрокаТабуляций + Символы.Таб;
	КонецЦикла;

	Сообщить(СтрокаТабуляций + Подсистема + ": " + Действие + ?(Комментарий = "","","(" + Комментарий + ")"),СтатусСообщения.Информация);
	ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ."+Подсистема, УровеньЖурналаРегистрации.Информация, , ,
	                         Действие + ?(Комментарий = "","","(" + Комментарий + ")"));

КонецПроцедуры	

Процедура УдалитьЛишниеНастройкиПользователей()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Ссылка КАК НастройкиПользователей
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.ПометкаУдаления
	|	И (НЕ НастройкиПользователей.ЭтоГруппа)";
	
	МассивСсылок = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.НастройкиПользователей);
	КонецЦикла;
	
	ТаблицаПоиска = НайтиПоСсылкам(МассивСсылок);
	
	СписокИсключений = Новый СписокЗначений;
	
	// Поищем, нет ли где ссылок кроме регистра сведений НастройкиПользователей
	Для каждого СтрокаТаблицы Из ТаблицаПоиска Цикл
		Если ТипЗнч(СтрокаТаблицы[1]) <> Тип("РегистрСведенийКлючЗаписи.НастройкиПользователей") Тогда
			СписокИсключений.Добавить(СтрокаТаблицы[0]);
		КонецЕсли; 
	КонецЦикла;
	
	Для а=0 По МассивСсылок.ВГраница() Цикл
		Если СписокИсключений.НайтиПоЗначению(МассивСсылок[а]) = Неопределено Тогда
			Попытка
				ОбъектДляУдаления = МассивСсылок[а].ПолучитьОбъект();
				ОбъектДляУдаления.Удалить();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось удалить элемент ПВХ настроек пользователя - " + СокрЛП(МассивСсылок[а]));
			КонецПопытки;
		Иначе
			Сообщить("Не удалился элемент ПВХ настроек пользователя - " + СокрЛП(МассивСсылок[а]));
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

// процедура производит обновление элемента справочника виды контактной информации
Процедура УстановитьпараметрыВидаКонтаткнойИнформации(СсылкаВидыКонтактнойИнформации, Знач Тип, Знач ВидОбъектаКонтактнойИнформации)
	
	Если Не ЗначениеЗаполнено(СсылкаВидыКонтактнойИнформации) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ОбъектВидКонтактнойИнформации = СсылкаВидыКонтактнойИнформации.ПолучитьОбъект();
		ОбъектВидКонтактнойИнформации.Тип = Тип;
		ОбъектВидКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = ВидОбъектаКонтактнойИнформации;
	
		ОбъектВидКонтактнойИнформации.Записать();
		
	Исключение
		Сообщить("Ошибка при записи реквизитов элемента " + ОбъектВидКонтактнойИнформации.Наименование + " справочника ""Виды контактной информации""");
	КонецПопытки;

	
КонецПроцедуры

// Процедура находит документы События у которых есть вложенные файлы
// у устанавливает им реквизит ЕстьВложения в ИСТИНА
Процедура УстановитьРеквизитНаличияФайловУСобытий()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Объект
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект ССЫЛКА Документ.Событие";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Объект.ПолучитьОбъект();
		Объект.ЕстьВложения = Истина;
		Объект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает реквизиты элемента ПВХ "ВопросыДляАнкетирования"
//
Процедура УстановитьРеквизитыВопроса(Вопрос, ПолнаяФормулировка, ТипОтветаНаВопросАнкеты, БолееОдногоОтвета = Ложь, КоличествоСтрок = 0, ВидКонтактнойИнформации = 0, ТипЗначения = Неопределено, Длина = 0)
	
	Объект = Вопрос.ПолучитьОбъект();
	
	Объект.ПолнаяФормулировка			= ПолнаяФормулировка;
	Объект.ТипОтветаНаВопрос			= ТипОтветаНаВопросАнкеты;
	Объект.КоличествоСтрокТаблицы		= КоличествоСтрок;
	Объект.ВидКонтактнойИнформации		= ВидКонтактнойИнформации;
	Объект.Длина						= Длина;
	
	Объект.Записать();
	
КонецПроцедуры

// Процедура изменяет ставшие неуникальными коды предопределенных элементов
//
Процедура УстановитьЗначениеКодаПредопределенныхЭлементов(СписокПредопределенныхЭлементов)
	
	МассивЭлементов = Новый Массив;
	
	Пока СписокПредопределенныхЭлементов.Количество()>0 Цикл
		
		МассивЭлементов.Очистить();
		КолвоЭлементовВСписке = СписокПредопределенныхЭлементов.Количество();
		ТекушийТипЗначения = ТипЗнч(СписокПредопределенныхЭлементов [КолвоЭлементовВСписке-1].Значение);
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТекушийТипЗначения);		
		Если Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
			МенеджерТекущегоТипа = Справочники[МетаданныеТипа.Имя];
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеТипа) Тогда
			МенеджерТекущегоТипа = ПланыВидовХарактеристик[МетаданныеТипа.Имя];
		ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеТипа) Тогда
			МенеджерТекущегоТипа = ПланыСчетов[МетаданныеТипа.Имя];	
		ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеТипа) Тогда
			МенеджерТекущегоТипа = ПланыВидовРасчета[МетаданныеТипа.Имя];
		Иначе
			МенеджерТекущегоТипа = Неопределено;
		КонецЕсли;
		
		Для ОбратныйИндекс = 1 По КолвоЭлементовВСписке Цикл
			ЭлементСписка = СписокПредопределенныхЭлементов [КолвоЭлементовВСписке - ОбратныйИндекс];
			
			Если ТипЗнч(ЭлементСписка.Значение) = ТекушийТипЗначения Тогда				
				ЕСли МетаданныеТипа.ДлинаКода <> 0 И МенеджерТекущегоТипа <> Неопределено Тогда
					МассивЭлементов.Добавить(ЭлементСписка.Значение);
				КонецЕсли;				
				СписокПредопределенныхЭлементов.Удалить(ЭлементСписка);				
			КонецЕсли;			
		КонецЦикла;
		
		Если МассивЭлементов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Предопределенные.Ссылка
		|ИЗ
		|	" + МетаданныеТипа.ПолноеИмя() + " КАК Предопределенные
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + МетаданныеТипа.ПолноеИмя() + " КАК Пользовательские
		|		ПО Предопределенные.Код = Пользовательские.Код
		|
		|ГДЕ
		|	Предопределенные.Ссылка В(&СписокЭлементов)
		|    И Пользовательские.Ссылка НЕ В(&СписокЭлементов)";
		
		Запрос.УстановитьПараметр("СписокЭлементов", МассивЭлементов);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Объект = Выборка.Ссылка.ПолучитьОбъект();			
			Объект.УстановитьНовыйКод();			
			Если МенеджерТекущегоТипа.НайтиПоКоду(Объект.Код).Пустая() Тогда
				
				// Поскольку меняем только код элемента, проверку корректности заполнения
				// дополнительных реквизитов объекта не выполняем.
				Объект.ОбменДанными.Загрузка = Истина;
				
				Объект.Записать();
			КонецЕсли;			
		КонецЦикла;	
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьСчетаУчетаНоменклатуры()
	// заполним сразу весь регистр сведений
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	         |	СчетаУчетаНоменклатуры.Организация,
	         |	СчетаУчетаНоменклатуры.Номенклатура,
			 //заполняем вид номенуклатуры
			 |	СчетаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			 //заполняем вид номенуклатуры
			 |	СчетаУчетаНоменклатуры.Склад,
	         |	СчетаУчетаНоменклатуры.ТипСклада,
	         |	СчетаУчетаНоменклатуры.СчетУчетаБУ,
	         |	СчетаУчетаНоменклатуры.СчетУчетаЗабалансовыйБУ,
	         |	СчетаУчетаНоменклатуры.СчетУчетаПередачиБУ,
	         |	СчетаУчетаНоменклатуры.СчетУчетаПередачиЗабалансовыйБУ,
	         |	СчетаУчетаНоменклатуры.СхемаРеализации,
	         |	СчетаУчетаНоменклатуры.СтатьяПриростаУбылиЗапасов,
	         |	СчетаУчетаНоменклатуры.НалоговоеНазначение,
	         |	СчетаУчетаНоменклатуры.УчитыватьКакЗапасНУ
	         |ИЗ
	         |	РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры";
	
	ОбновленнаяТаблицаРегистраЗаписей = Запрос.Выполнить().Выгрузить();
	
	СчетаУчета = РегистрыСведений.СчетаУчетаНоменклатуры.СоздатьНаборЗаписей();	
	СчетаУчета.Загрузить(ОбновленнаяТаблицаРегистраЗаписей);
	СчетаУчета.Записать(Истина);
	
КонецПроцедуры


Функция ПолучитьТаблицуДокументовПринятиеКУчетуНМА(СсылкаНач)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПринятиеКУчетуНМА КАК Док
	|ГДЕ
	|		Док.ВидОперации = &ПустойВидОперации"
	+?(СсылкаНач = Неопределено,""," И Док.Ссылка > &СсылкаНач ")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 			СсылкаНач);
	Запрос.УстановитьПараметр("ПустойВидОперации",	Перечисления.ВидыОперацийПринятияКУчетуНМА.ПустаяСсылка());

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ПолучитьТаблицуДокументовПринятиеКУчетуНМА()

//Процедура заполняет новый реквизит ВидОперации в документе "ПринятиеКУчетуНМА"
//Запускается при обновлении на 1.2
Процедура ЗаполнитьРеквизитВидОперацииДокументаПринятиеКУчетуНМА() Экспорт
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	Пока ЕстьДокументы Цикл
			
		ВыборкаДокументов = ПолучитьТаблицуДокументовПринятиеКУчетуНМА(ДокументСсылка);
			
		ЕстьДокументы = ВыборкаДокументов.Количество()>0;
			
		Пока ВыборкаДокументов.Следующий() цикл
	
			ДокументСсылка = ВыборкаДокументов.ссылка;
			ДокументОбъект = ВыборкаДокументов.ссылка.ПолучитьОбъект();	
			Если ДокументОбъект.ВводНачальныхОстатков Тогда
				ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ВводНачальныхОстатков;
			Иначе	
				ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.НематериальныеАктивы;
			КонецЕсли;	
			ДокументОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры



Функция ПолучитьТаблицуДокументовПередачаМалоценкиВЭксплуатацию(СсылкаНач)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПередачаМалоценкиВЭксплуатацию КАК Док
	|ГДЕ
	|	Док.МалоценныеАктивы.Качество = &ПустоеКачество"
	+?(СсылкаНач = Неопределено,""," И Док.Ссылка > &СсылкаНач ")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 		СсылкаНач);
	Запрос.УстановитьПараметр("ПустоеКачество",	Справочники.Качество.ПустаяСсылка());

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ПолучитьТаблицуДокументовПринятиеКУчетуНМА()

//Процедура заполняет новый реквизит табличной части Качество в документе "ПередачаМалоценкиВЭксплуатацию"
Процедура ЗаполнитьКачествоДокументаПередачаМалоценкиВЭксплуатацию()

	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	Пока ЕстьДокументы Цикл
			
		ВыборкаДокументов = ПолучитьТаблицуДокументовПередачаМалоценкиВЭксплуатацию(ДокументСсылка);
			
		ЕстьДокументы = ВыборкаДокументов.Количество()>0;
			
		Пока ВыборкаДокументов.Следующий() цикл
	
			ДокументСсылка = ВыборкаДокументов.ссылка;
			ДокументОбъект = ВыборкаДокументов.ссылка.ПолучитьОбъект();	

			Для Каждого СтрокаТЧ Из ДокументОбъект.МалоценныеАктивы Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Качество) Тогда
					СтрокаТЧ.Качество = Справочники.Качество.Новый;
				КонецЕсли;	
			КонецЦикла;	
			
			ДокументОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры	

// В документе "Требование-накладная" аналитика затрат по УУ перенесена из таблчиной части в шапку
// Если аналитика во всей табличной части одинакова - заполним шапку этой одинаковой аналитикой
Процедура ПереносТребованиеНакладнаяАналитикаЗатратПоУУ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТребованиеНакладнаяМатериалы.Ссылка КАК Ссылка,
	|	ТребованиеНакладнаяМатериалы.Ссылка.Представление КАК ПредставлениеДокумента,
	|	ТребованиеНакладнаяМатериалы.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ТребованиеНакладнаяМатериалы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТребованиеНакладнаяМатериалы.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
	|ИТОГИ ПО
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	ВыборкаПоДокументам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		Выборка = ВыборкаПоДокументам.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			// все необходимые реквизиты в табличной части одинаковы, можно заполнить шапку
			Выборка.Следующий();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.СтатьяЗатрат = Выборка.СтатьяЗатрат;
			ДокументОбъект.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
			ДокументОбъект.ОбъектСтроительства = Выборка.ОбъектСтроительства;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить(НСтр("ru='Невозможно записать документ <';uk='Неможливо записати документ <'")+Выборка.ПредставлениеДокумента+">!", СтатусСообщения.Внимание);
			КонецПопытки;

		Иначе
			Продолжить;
		КонецЕсли; 		
	КонецЦикла;
	 

КонецПроцедуры // ПереносТребованиеНакладнаяАналитикаЗатратПоУУ()
 
Процедура УдалениеСубконтоНоменклатураНаСчетахТЗР()
	
	СчетТЗР200 =  ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы.ПолучитьОбъект();
	
	Если СчетТЗР200.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура) <> Неопределено Тогда
		СчетТЗР200.ВидыСубконто.Удалить(СчетТЗР200.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)); 
		СчетТЗР200.Записать();
	КонецЕсли;  	
	
	СчетТЗР280  = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходы.ПолучитьОбъект();   
	
	Если СчетТЗР280.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура) <> Неопределено Тогда
		СчетТЗР280.ВидыСубконто.Удалить(СчетТЗР280.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)); 
		СчетТЗР280.Записать();
	КонецЕсли;  
	
	СчетТЗР2801 = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары.ПолучитьОбъект();

	Если СчетТЗР2801.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура) <> Неопределено Тогда
		СчетТЗР2801.ВидыСубконто.Удалить(СчетТЗР2801.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)); 
		СчетТЗР2801.Записать();
	КонецЕсли;  
	
	СчетТЗР2802 = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет.ПолучитьОбъект();
	
	Если СчетТЗР2802.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура) <> Неопределено Тогда
		СчетТЗР2802.ВидыСубконто.Удалить(СчетТЗР2802.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)); 
		СчетТЗР2802.Записать();
	КонецЕсли;  
	
КонецПроцедуры

Процедура СостояниеОбновления(Текст)
#Если Клиент Тогда
	Состояние(Текст);
#КонецЕсли
КонецПроцедуры

// Во всех элементах спр. "ВидыВыплат",
// вид расчета переносим в табличную часть
Процедура ЗаполнениеПараметровВидыВыплат()Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|		ВидыВыплат.Ссылка		КАК ВидВыплаты,
	|		ВидыВыплат.УдалитьВидРасчета	КАК ВидРасчета
	|	ИЗ Справочник.ВидыВыплат КАК ВидыВыплат
	|	ГДЕ ВидыВыплат.УдалитьВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидВыплаты = Выборка.ВидВыплаты.ПолучитьОбъект();
		СтрокаРасчета = ВидВыплаты.ВидыРасчета.Добавить();
		СтрокаРасчета.ВидРасчета = Выборка.ВидРасчета;
		ВидВыплаты.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Для вечерних и ночных предопределенных заполним ТЧ Параметры
// 
Процедура ЗаполнениеДоплат()Экспорт
	
	// ДоплатаЗаВечерниеЧасы
	Доплата = ПланыВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы.ПолучитьОбъект();
	Если Доплата.Показатели.Количество() > 0 Тогда
		Доплата.Показатели.Очистить();
	КонецЕсли;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.Процент;
	СтрПоказателя.ЗапрашиватьПриКадровыхПеремещениях = Истина;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.ВечерниеВЧасах;
	
	Доплата.Записать();
	
	
	// ДоплатаЗаНочныеЧасы
	Доплата = ПланыВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы.ПолучитьОбъект();
	Если Доплата.Показатели.Количество() > 0 Тогда
		Доплата.Показатели.Очистить();
	КонецЕсли;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.Процент;
	СтрПоказателя.ЗапрашиватьПриКадровыхПеремещениях = Истина;
	
	СтрПоказателя = Доплата.Показатели.Добавить();
	СтрПоказателя.Показатель = Справочники.ПоказателиСхемМотивации.НочныеВЧасах;
	
	Доплата.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСтажВДняхСтажВЧасах()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
	               |	ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК ОсновныеНачисленияОрганизаций
				   |ГДЕ ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени";
				   
	ТаблицаРабочеговремени = Запрос.Выполнить().Выгрузить();			   
	
	
	ВР = ПланыВидовРасчета.Начисления.СтажВДнях.ПолучитьОбъект();
	
	ВР.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	ВР.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	ВР.ФормулаРасчета = "ИсходныеДанные.Показатель1";
	ВР.БазаПоНазначению = Истина;
	
	Показатель = ВР.Показатели.Добавить();
	Показатель.Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза;
	
	ВР.БазовыеВидыРасчета.Очистить();
	ВР.БазовыеВидыРасчета.Загрузить(ТаблицаРабочеговремени);
	
	ВР.Записать();
	
	ВР = ПланыВидовРасчета.Начисления.СтажВЧасах.ПолучитьОбъект();
	
	ВР.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	ВР.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	ВР.ФормулаРасчета = "ИсходныеДанные.Показатель1";
	ВР.БазаПоНазначению = Истина;
	
	Показатель = ВР.Показатели.Добавить();
	Показатель.Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза;
	
	ВР.БазовыеВидыРасчета.Очистить();
	ВР.БазовыеВидыРасчета.Загрузить(ТаблицаРабочеговремени);
	
	ВР.Записать();

	
КонецПроцедуры

Процедура ЗаполнитьНачисленияДляПредварительногоРасчета()
	
	НаборЗаписей = РегистрыСведений.НачисленияДляПредварительногоРасчета.СоздатьНаборЗаписей(); 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы; 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы; 
	
	НаборЗаписей.Записать();

	
КонецПроцедуры

Процедура ЗаполнитьВариантыАлгоритмов()
	
	НаборЗаписей = РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей(); 
	Запись = НаборЗаписей.Добавить();
	Запись.РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьВидыДоходовНДФЛ()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыДоходовНДФЛ.Ссылка
	               |ИЗ
	               |	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	               |ГДЕ
	               |	НЕ ВидыДоходовНДФЛ.Предопределенный
	               |	И НЕ ВидыДоходовНДФЛ.ПометкаУдаления";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.КодДо2011 = СпрОбъект.Код;
        СпрОбъект.Записать();
	КонецЦикла;	
				   
				   
КонецПроцедуры

Процедура ОбновитьОтражениеВзносовФОТВРеглУчете()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаСреза", Дата(2011,4,1));
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОтражениеВзносовФОТВРеглУчетеСрезПоследних.Налог,
				   |	ОтражениеВзносовФОТВРеглУчетеСрезПоследних.УДАЛИТЬХарактерЗатрат КАК ХарактерЗатрат,
	               |	ОтражениеВзносовФОТВРеглУчетеСрезПоследних.СтатьяЗатрат
	               |ИЗ
	               |	РегистрСведений.ОтражениеВзносовФОТВРеглУчете.СрезПоследних(&ДатаСреза, Налог.Актуальность и СчетЗатрат = ЗНАЧЕНИЕ(Плансчетов.Хозрасчетный.ПустаяСсылка)) КАК ОтражениеВзносовФОТВРеглУчетеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ОтражениеВзносовФОТВРеглУчете.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Период.Установить(Дата(2011,4,1)); 
    НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата(2011,4,1);
		НоваяЗапись.Налог = Выборка.Налог;
		Если Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.БракВПроизводстве; //24
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ИзготовлениеОсновныхСредств; //1522
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.РасходыНаСбыт; //93
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ОбщепроизводственныеРасходы; //91
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.АдминистративныеРасходы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.АдминистративныеРасходы; //92
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ОсновноеПроизводство; //231
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности; //949
		ИначеЕсли Выборка.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы Тогда
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы; //200	
		Иначе
			//На всякий случай
			НоваяЗапись.СчетЗатрат = Планысчетов.Хозрасчетный.ОбщепроизводственныеРасходы; //91
		КонецЕсли;	
			
		НоваяЗапись.СтатьяЗатрат = Выборка.СтатьяЗатрат;
		
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры	

Процедура ПерезаполнитьПроводкиПоЗарплатнымДокументамНалоговымиНазначениямиНКУ()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНач", '20110401');
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачислениеЗарплатыРаботникамОрганизаций.Ссылка,
	               |	НачислениеЗарплатыРаботникамОрганизаций.Проведен
	               |ИЗ
	               |	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
	               |ГДЕ
	               |	НачислениеЗарплатыРаботникамОрганизаций.Дата >= &ДатаНач
	               |	И НачислениеЗарплатыРаботникамОрганизаций.Проведен";
				   
	Выборка = Запрос.Выполнить().Выбрать();				   
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.Ссылка.ПолучитьОбъект();
		
	    Сотрудники = Док.РаботникиОрганизации.ВыгрузитьКолонку("Сотрудник");
		
		Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Если Док.НачисленияПроводки.Количество() = 0 И 
			 Док.УдержанияПроводки.Количество() = 0 И 
			 Док.ВзносыПроводки.Количество() = 0 И 
			 Док.ВзносыФОТПроводки.Количество() = 0 И 
			 Док.НДФЛПроводки.Количество() = 0 
			Тогда
			Сообщить(Локализация.СтрШаблон1(НСТР("ru='Не удалось автоматически обработать документ: ¤1¤"
"    Перезаполните бухгалтерские проводки вручную!';uk='Не вдалося автоматично обробити документ: ¤1¤"
"    Перезаповніть бухгалтерські проведення вручну!'"), Док));	
			Продолжить;
		КонецЕсли;
		
	    Док.НачисленияПроводки.Очистить();
	    Док.ВзносыФОТПроводки.Очистить();
		Док.Записать(РежимЗаписиДокумента.Запись);
	    Док.РассчитатьНачисленияПроводки( Сотрудники );
	    Док.РассчитатьВзносыФОТПроводки( Сотрудники );
	    Док.АвтозаполнениеПроводок();
		
		Попытка
			Если Выборка.Проведен = Истина Тогда
			    Док.Записать(РежимЗаписиДокумента.Проведение);
			Иначе	
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
			Сообщить(Локализация.СтрШаблон1(НСТР("ru='Не удалось обработать документ: ¤1¤"
"    Перезаполните бухгалтерские проводки вручную!';uk='Не вдалося обробити документ: ¤1¤"
"    Перезаповніть бухгалтерські проведення вручну!'"), Док));	
		КонецПопытки	
	
	КонецЦикла;
	
КонецПроцедуры	


Функция ПолучитьВыборкуДокументов(ТипДокумента, ДатаНач, СсылкаНач)
	
	
	УсловиеСсылка = " Ссылка > &СсылкаНач ";
	УсловиеДата = " ВыборкаДокументы.Дата >= &ДатаНач ";
	
	Условие = "";
	
	Если СсылкаНач = Неопределено Тогда
		Если ЗначениеЗаполнено(ДатаНач) Тогда
			Условие = " ГДЕ " + УсловиеДата;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ДатаНач) Тогда
			Условие = " ГДЕ " + УсловиеСсылка + " И " + УсловиеДата;
		Иначе
			Условие = " ГДЕ " + УсловиеСсылка;
		КонецЕсли;
	КонецЕсли; 	
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СсылкаНач", СсылкаНач);
	Запрос.УстановитьПараметр("ДатаНач",   ДатаНач);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	ВыборкаДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ТипДокумента + " КАК ВыборкаДокументы 
	| " +
	Условие + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
    Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура УвеличениеДлиныНомеровДокументов(ТипДокумента, ДатаНач) Экспорт
	
	НоваяДлинаНомера = Метаданные.Документы[ТипДокумента].ДлинаНомера;
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	Пока ЕстьДокументы Цикл
		
		Выборка = ПолучитьВыборкуДокументов(ТипДокумента, ДатаНач, ДокументСсылка);
		ЕстьДокументы = Выборка.Количество() > 0;
		
		Пока Выборка.Следующий() Цикл
			
			ДокументСсылка = Выборка.Ссылка;
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			СтарыйНомер = СокрЛП(ДокументОбъект.Номер);
			
			// ищем с конца до начала первую не цифру - то что нашли - числовая часть номера 
			// ее дополняем 0-ми до новой длины, остальное префикс - оставляем неизменным и затем дополняем
			ДлинаСтарогоНомера = СтрДлина(СтарыйНомер);
			
			ДополняющихНулей = НоваяДлинаНомера - ДлинаСтарогоНомера;
			Если ДополняющихНулей <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для н = 0 по ДлинаСтарогоНомера - 1 Цикл
				Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(Сред(СтарыйНомер, ДлинаСтарогоНомера - н, 1), Истина, Ложь) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДлинаЧисловойЧастиНомера = н;
			
			Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда
				ОбособленноеПодразделение = ДокументОбъект.ОбособленноеПодразделение;
			ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Приложение2КНалоговойНакладной") Тогда
				ОбособленноеПодразделение = ДокументОбъект.НалоговаяНакладная.ОбособленноеПодразделение;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
				
				ПрефиксОбособленногоПодразделения = ОбособленноеПодразделение.Префикс;
				ДлинаПрефиксаОбособленногоПодразделения = СтрДлина(ПрефиксОбособленногоПодразделения);
				Если ДлинаПрефиксаОбособленногоПодразделения > 0 Тогда
					
					ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения = 0;
					Для к = 0 по СтрДлина(ПрефиксОбособленногоПодразделения) - 1 Цикл
						Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Сред(ПрефиксОбособленногоПодразделения, ДлинаПрефиксаОбособленногоПодразделения - к, 1), Истина, Ложь) Тогда
							ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения = ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения + 1;
						Иначе
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения > 0 Тогда
						ЧисловаяЧастьПрефиксаОбособленногоПодразделения = Сред(ПрефиксОбособленногоПодразделения, ДлинаПрефиксаОбособленногоПодразделения -
							ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения + 1, ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения);
							
						ЧисловаяЧастьНомера = Сред(СтарыйНомер, ДлинаСтарогоНомера - н + 1);
						Если ЧисловаяЧастьПрефиксаОбособленногоПодразделения = Лев(ЧисловаяЧастьНомера, ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения) Тогда
							ДлинаЧисловойЧастиНомера = ДлинаЧисловойЧастиНомера - ДлинаЧисловойЧастиПрефиксаОбособленногоПодразделения;
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
			
			Префикс = Сред(СтарыйНомер, 1, ДлинаСтарогоНомера - ДлинаЧисловойЧастиНомера);
			ЧисловаяЧастьНомера = Сред(СтарыйНомер, ДлинаСтарогоНомера - ДлинаЧисловойЧастиНомера + 1);
			
			Для к = 1 По ДополняющихНулей Цикл
				ЧисловаяЧастьНомера = "0" + ЧисловаяЧастьНомера;
			КонецЦикла;
			
			НовыйНомер = Префикс + ЧисловаяЧастьНомера;
			
			ДокументОбъект.Номер = НовыйНомер;

			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РЕДАКЦИЯ 1.2

Процедура ЗаполнитьНастройкуПользователейОсновнойПредставительОрганизации()
	
	Настройки = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	Пользователь = Справочники.Пользователи.Выбрать();
	
	Пока Пользователь.Следующий() Цикл
		
		Если Пользователь.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Пользователь.ФизЛицо.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		// проверим, нет ли такой записи.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиПользователей.Значение
		               |ИЗ
		               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		               |ГДЕ
		               |	НастройкиПользователей.Пользователь = &Пользователь
		               |	И НастройкиПользователей.Настройка = &Настройка";
		Запрос.УстановитьПараметр("Пользователь",Пользователь.Ссылка);
		Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойПредставительОрганизации);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Настройка = Настройки.Добавить();
			Настройка.Пользователь = Пользователь.Ссылка;
			Настройка.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойПредставительОрганизации;
			Настройка.Значение     = Пользователь.ФизЛицо;
		КонецЕсли;
		
	КонецЦикла;

	Настройки.Записать(Ложь);
	
КонецПроцедуры

Процедура УстановитьКоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли()
	
	ЗапросПоОрганизациямПлательщикамНП = Новый Запрос();
	ЗапросПоОрганизациямПлательщикамНП.УстановитьПараметр("Дата", '20110331');
	
	// все организации-плательщики, для которых на 01.04 не установлены коэффициенты
	ЗапросПоОрганизациямПлательщикамНП.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                                           |	Организации.Ссылка  КАК Организация
	                                           |ИЗ
	                                           |	Справочник.Организации КАК Организации
	                                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(&Дата, ) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	                                           |		ПО (УчетнаяПолитикаОрганизацийСрезПоследних.Организация = Организации.Ссылка)
	                                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли.СрезПоследних(&Дата, ) КАК КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибылиСрезПоследних
	                                           |		ПО (КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибылиСрезПоследних.Организация = Организации.Ссылка)
	                                           |ГДЕ
	                                           |	УчетнаяПолитикаОрганизацийСрезПоследних.СхемаНалогообложения.НалогНаПрибыль
	                                           |	И КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибылиСрезПоследних.Статья ЕСТЬ NULL ";
	
	Выборка = ЗапросПоОрганизациямПлательщикамНП.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Док = Документы.РасчетКоэффициентовДляЗаполненияПриложенияСВДекларацииПоПрибыли.СоздатьДокумент();	
		
		Док.Дата = '201103311200';
		
		Док.Организация = Выборка.Организация;
		Док.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		Док.Комментарий = НСТР("ru='#Обновление на редакцию 1.2. Установка коэффициентов на 01.04.2011#';uk='#Оновлення на редакцію 1.2. Встановлення коеффіцієнтів на 01.04.2011#'");
		
		Строка = Док.Статьи.Добавить();
		
		Строка.Статья = Справочники.СтатьиНалоговыхДеклараций.НПНК_ПЗ_Материалы_;
		Строка.КоэффициентНаКонец = 1;
		
		Док.УстановитьНовыйНомер();
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВхожденияПредопределенныхЭлементов(ВидОбъекта, ТаблицаВхождений)
	
	МетаданныеСправочника = Метаданные.НайтиПоПолномуИмени(ВидОбъекта);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновнаяТаблица.Ссылка КАК ЗаменяемаяСсылка,
	|	ОсновнаяТаблица.СсылкаПредопределенный КАК ЗаменяющаяСсылка,
	|	ТаблицаВхождений.ИмяРеквизита КАК ИмяРеквизита,
	|	ТаблицаВхождений.Ссылка КАК Вхождение";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаСправочника.Ссылка КАК Ссылка,
	|		ТаблицаСправочникаПредопределенные.Ссылка КАК СсылкаПредопределенный
	|	ИЗ
	|		" + ВидОбъекта + " КАК ТаблицаСправочника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ВидОбъекта + " КАК ТаблицаСправочникаПредопределенные
	|			ПО ТаблицаСправочника.Наименование = ТаблицаСправочникаПредопределенные.Наименование";
	
	Для каждого Реквизит из МетаданныеСправочника.Реквизиты Цикл
		Если ВРег(Лев(Реквизит.Имя, 7)) = "УДАЛИТЬ" Тогда
			Продолжить;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|			И ТаблицаСправочника." + Реквизит.Имя + " = ТаблицаСправочникаПредопределенные." + Реквизит.Имя;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	ГДЕ
	|		ТаблицаСправочника.ПометкаУдаления
	|		И ТаблицаСправочникаПредопределенные.Предопределенный) КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ(";
	
	НужноОбъединение = Ложь;
	Для каждого СтрокаВхождений из ТаблицаВхождений Цикл
		Если НужноОбъединение Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|		ВЫБРАТЬ
		|			ТаблицаОбъектаПоиска.Ссылка КАК Ссылка,
		|			ТаблицаОбъектаПоиска." + СтрокаВхождений.ИмяРеквизита + " КАК Реквизит,
		|			""" + СтрокаВхождений.ИмяРеквизита + """ КАК ИмяРеквизита
		|		ИЗ
		|			" + СтрокаВхождений.ВидОбъекта + "  КАК ТаблицаОбъектаПоиска
		|		ГДЕ
		|			ТаблицаОбъектаПоиска." + СтрокаВхождений.ИмяРеквизита + ".ПометкаУдаления";
		Если НЕ НужноОбъединение Тогда
			НужноОбъединение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|		) КАК ТаблицаВхождений
	|			ПО ОсновнаяТаблица.Ссылка = ТаблицаВхождений.Реквизит";	

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	МассивЗаменяемыхСсылок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если МассивЗаменяемыхСсылок.Найти(Выборка.ЗаменяемаяСсылка) = Неопределено Тогда
			МассивЗаменяемыхСсылок.Добавить(Выборка.ЗаменяемаяСсылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Вхождение) Тогда
			
			Объект = Выборка.Вхождение.ПолучитьОбъект();
			Объект[Выборка.ИмяРеквизита] = Выборка.ЗаменяющаяСсылка;
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
		
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Ссылка из МассивЗаменяемыхСсылок Цикл
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВхожденияПредопределенныхЭлементовНаборыСтатейНалоговыхДеклараций()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОсновнаяТаблица.Ссылка КАК ЗаменяемаяСсылка,
	|	ОсновнаяТаблица.СсылкаПредопределенный КАК ЗаменяющаяСсылка,
	|	ТаблицаВхождений.Набор,
	|	ТаблицаВхождений.Статья
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаСправочника.Ссылка КАК Ссылка,
	|		ТаблицаСправочникаПредопределенные.Ссылка КАК СсылкаПредопределенный
	|	ИЗ
	|		Справочник.НаборыСтатейНалоговыхДеклараций КАК ТаблицаСправочника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыСтатейНалоговыхДеклараций КАК ТаблицаСправочникаПредопределенные
	|			ПО ТаблицаСправочника.Наименование = ТаблицаСправочникаПредопределенные.Наименование
	|	ГДЕ
	|		ТаблицаСправочника.ПометкаУдаления
	|		И ТаблицаСправочникаПредопределенные.Предопределенный) КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаОбъектовПоиска.Набор КАК Набор,
	|			ТаблицаОбъектовПоиска.Статья КАК Статья
	|		ИЗ
	|			РегистрСведений.НаборыСтатейНалоговыхДеклараций КАК ТаблицаОбъектовПоиска
	|		ГДЕ
	|			ТаблицаОбъектовПоиска.Набор.ПометкаУдаления) КАК ТаблицаВхождений
	|		ПО ОсновнаяТаблица.Ссылка = ТаблицаВхождений.Набор";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	МассивЗаменяемыхСсылок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если МассивЗаменяемыхСсылок.Найти(Выборка.ЗаменяемаяСсылка) = Неопределено Тогда
			МассивЗаменяемыхСсылок.Добавить(Выборка.ЗаменяемаяСсылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Статья) Тогда
			
			НаборЗаписей = РегистрыСведений.НаборыСтатейНалоговыхДеклараций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Набор.Установить(Выборка.ЗаменяемаяСсылка);
			НаборЗаписей.Отбор.Статья.Установить(Выборка.Статья);
			НаборЗаписей.Прочитать();
			Запись = НаборЗаписей[0];
			Запись.Набор = Выборка.ЗаменяющаяСсылка;
			НаборЗаписей.Отбор.Набор.Установить(Выборка.ЗаменяющаяСсылка);
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Ссылка из МассивЗаменяемыхСсылок Цикл
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВхожденияПредопределенныхЭлементовСправочников()
	
	ТаблицаВхождений = Новый ТаблицаЗначений;
	ТаблицаВхождений.Колонки.Добавить("ВидОбъекта");
	ТаблицаВхождений.Колонки.Добавить("ИмяРеквизита");
	
	НоваяСтрока = ТаблицаВхождений.Добавить();
	НоваяСтрока.ВидОбъекта = "Справочник.ДоговорыКонтрагентов";
	НоваяСтрока.ИмяРеквизита = "СхемаНалоговогоУчета";
	НоваяСтрока = ТаблицаВхождений.Добавить();
	НоваяСтрока.ВидОбъекта = "Справочник.ДоговорыКонтрагентов";
	НоваяСтрока.ИмяРеквизита = "СхемаНалоговогоУчетаПоТаре";
	ОбновитьВхожденияПредопределенныхЭлементов("Справочник.СхемыНалоговогоУчетаПоДоговорамКонтрагентов", ТаблицаВхождений);
	ОбновитьВхожденияПредопределенныхЭлементовНаборыСтатейНалоговыхДеклараций();
	
КонецПроцедуры

Процедура ПроверитьКонстантуЗапретИзмененияДанныхДо01042011()
	
	Если Константы.ЗапретИзмененияДанныхДо01042011.Получить() Тогда
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		Набор.Прочитать();
		Если Набор.Количество() = 0 Тогда
			Набор.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
			Запись = Набор.Добавить();
			Запись.Организация = Справочники.Организации.ПустаяСсылка();
   			Запись.Пользователь = Неопределено;
			Запись.ГраницаЗапретаИзменений = Дата('00010101');
			Набор.Записать();
			
		    Запрос = Новый Запрос;
		    Запрос.Текст  = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			    |	Организации.Ссылка КАК Организация
			    |ИЗ
			    |	Справочник.Организации КАК Организации";
		    
		    Выборка = Запрос.Выполнить().Выбрать();
		    Пока Выборка.Следующий() Цикл		
		        
		        Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		        Набор.Отбор.Организация.Установить(Выборка.Организация);
		        
		        Запись = Набор.Добавить();
		        Запись.Организация = Выборка.Организация;
		        Запись.Пользователь = Неопределено;
		        
		        Запись.ГраницаЗапретаИзменений = Дата('00010101');
			    Набор.Записать();
				
		    КонецЦикла;
		КонецЕсли; 
		ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	КонецЕсли;
	

КонецПроцедуры

Процедура ЗаполнитьЕдиницыИзмеренияСправочникаСпецификацииНоменклатуры()
	
	Спр = Справочники.СпецификацииНоменклатуры.Выбрать();
	Пока Спр.Следующий() Цикл
		
		Если Спр.ЭтоГруппа Тогда
			Продолжить;	
		КонецЕсли;
		
		Объект =  Спр.ПолучитьОбъект();
		
		Объект.ЕдиницаИзмерения = Объект.Владелец.ЕдиницаХраненияОстатков;
		
		ТЧ = Объект.ИсходныеКомплектующие;
		Для каждого СтрокаТЧ Из ТЧ Цикл
		
			СтрокаТЧ.ЕдиницаИзмерения = СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
		
		КонецЦикла;
		
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ по обновлению реквизитов НалоговоеНазначение(ДоходовИЗатрат)

Процедура ЗаполнитьНалоговыеНазначения(ЗаполнятьДокументы = Ложь, ДатаНачалаОбработки = '20110401') ЭКСПОРТ
	
	СтруктураНН = Новый Структура;
	
	СписокНалоговыхНазначенийНКУ_НП = Неопределено;
	СписокНалоговыхНазначенийНКУ_НДС = Неопределено;
	ПолучитьСпискиНовыхНалоговыхНазначений(СписокНалоговыхНазначенийНКУ_НП, СписокНалоговыхНазначенийНКУ_НДС);
	СтруктураНН.Вставить("СписокНалоговыхНазначенийНКУ_НП",  СписокНалоговыхНазначенийНКУ_НП);
	СтруктураНН.Вставить("СписокНалоговыхНазначенийНКУ_НДС", СписокНалоговыхНазначенийНКУ_НДС);
	
	СоответствиеНалоговыхНазначений_НП = Неопределено;
	СоответствиеНалоговыхНазначений_НДС = Неопределено;
	ПолучитьСоответствиеСтарыхИНовыхНалоговыхНазначений(СоответствиеНалоговыхНазначений_НП, СоответствиеНалоговыхНазначений_НДС);
	СтруктураНН.Вставить("СоответствиеНалоговыхНазначений_НП",  СоответствиеНалоговыхНазначений_НП);
	СтруктураНН.Вставить("СоответствиеНалоговыхНазначений_НДС", СоответствиеНалоговыхНазначений_НДС);
	
	Если ЗаполнятьДокументы = Ложь Тогда
		ТаблицаОбъектов = ЗаполнитьТаблицуОбъектовНалоговыеНазначенияСправочники();
	Иначе	
		ТаблицаОбъектов = ЗаполнитьТаблицуОбъектовНалоговыеНазначенияДокументы();
	КонецЕсли;
	
	ПредИмяОбъекта = "";
	ПредВидОбъекта = "";
	МассивСтруктурРеквизитов = Новый Массив;
	
	Для Каждого СтрокаОбъект Из ТаблицаОбъектов Цикл
		
		ИмяОбъекта = СтрокаОбъект.ИмяОбъекта;
		Если ПредИмяОбъекта <> ИмяОбъекта Тогда
			Если НЕ ПредИмяОбъекта = "" Тогда
				ОбработатьОбъектНалоговыеНазначения(ПредВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки);	
			КонецЕсли; 
			МассивСтруктурРеквизитов = Новый Массив;
		КонецЕсли; 
		
		СтруктураРеквизитов = Новый Структура(
			"ИмяОбъекта, 
			|ИмяТабличнойЧасти, 
			|ИмяРеквизитНалоговоеНазначение, 
			|ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат",
			СтрокаОбъект.ИмяОбъекта, 
			СтрокаОбъект.ИмяТабличнойЧасти,
			СтрокаОбъект.ИмяРеквизитНалоговоеНазначение, 
			СтрокаОбъект.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат
			);
		МассивСтруктурРеквизитов.Добавить(СтруктураРеквизитов);
		
		
		ПредИмяОбъекта = ИмяОбъекта;
		ПредВидОбъекта = СтрокаОбъект.ВидОбъекта;
		
	КонецЦикла; 
	
	Если НЕ ПредИмяОбъекта = "" Тогда
		ОбработатьОбъектНалоговыеНазначения(ПредВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки);	
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗаполнитьТаблицуОбъектовНалоговыеНазначенияСправочники() 

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ТаблицаОбъектов.Колонки.Добавить("ВидОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТабличнойЧасти"); // пустая строка - шапка или нет тч
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначение"); // 
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат"); // 
	
	// СПРАВОЧНИКИ 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "НематериальныеАктивы", "" ,"НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "ОбъектыСтроительства", "" ,"НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "НоменклатурныеГруппы", "" ,"НалоговоеНазначениеВПроизводстве");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "РасходыБудущихПериодов", "" ,"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "СпособыОтраженияЗарплатыВРеглУчете", "" ,"", "НалоговоеНазначениеДоходовИЗатрат");
	// не заполняем этот реквизит значением по-умолчанию, пользователь должен вручную определиться с ним
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "СпособыОтраженияРасходовПоАмортизации", "Способы" ,"", "НалоговоеНазначениеДоходовИЗатрат");
	
	// РЕГИСТРЫ СВЕДЕНИЙ 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаРасчетовСКонтрагентами", "" ,"НалоговоеНазначениеПриобретений", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаРасчетовСКонтрагентами", "" ,"НалоговоеНазначениеПриобретенийПоТаре", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаРасчетовСКонтрагентами", "" ,"НалоговоеНазначениеПродаж", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаРасчетовСКонтрагентами", "" ,"НалоговоеНазначениеПродажПоТаре", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаНоменклатуры", "" ,"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	Возврат ТаблицаОбъектов;

КонецФункции // ЗаполнитьТаблицуОбъектовНалоговыеНазначения()

Функция ЗаполнитьТаблицуОбъектовНалоговыеНазначенияДокументы() 

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ТаблицаОбъектов.Колонки.Добавить("ВидОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТабличнойЧасти"); // пустая строка - шапка или нет тч
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначение"); // 
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат"); // 
	
	// ДОКУМЕНТЫ
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"ВозвратнаяТара",			"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"ОплатаПоставщикам",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"Прочее",					"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"Товары",					"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"Услуги", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	//ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	
	// НалоговоеНазначениеОборудования - заполняется по-умолчанию отдельно
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВводВЭксплуатациюОС", "", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВводНачальныхОстатковОС", "ОС", "НалоговоеНазначение", "");
	
	// НН заполняется для малоценки по умолчанию отдельно
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВводНачальныхОстатковМалоценкиВЭксплуатации", "МалоценныеАктивы", "", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровОтПокупателя", 	"Товары", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровОтПокупателя", 	"ВозвратнаяТара", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику", 	"Товары", 		  "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику", 	"Оборудование",   "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику", 	"ВозвратнаяТара", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщикуИзНТТ", 	"Товары", 		  "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщикуИзНТТ", 	"ВозвратнаяТара", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщикуИзНТТ", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");

    // НН доходов и затрат устанавливается по-умолчанию из первой строки
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ГТДИмпорт", 	"Товары", 		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ГТДИмпорт", 	"Оборудование", "НалоговоеНазначение", "");

    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияЗапасов", 	"", "", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияЗапасов", 	"Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияЗапасов", 	"Товары", "НалоговоеНазначениеНовое", "");
	
    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияОС", 	"", "", "");
	// НН в строках ТЧ заполняются особым образом
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияОС", 	"ОС", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КомплектацияНоменклатуры", 	"", "НалоговоеНазначение", "");
	
    // НН доходов и затрат устанавливается по-умолчанию из первой строки
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаДолга", 	"СуммыДолга", "НалоговоеНазначение", "");
	
	// НН доходов и затрат устанавливается по-умолчанию из первой строки
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаДолгаПоВозвратнойТаре", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаКачестваТоваров", "Товары", "НалоговоеНазначение", "");

    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС", 	"", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаСерийИХарактеристикТоваров", "Товары", "НалоговоеНазначение", "");
	
    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОплатаОтПокупателяПлатежнойКартой", 	"РасшифровкаПлатежа", "НалоговоеНазначение", "");
	
	// НН доходов и затрат устанавливается по-умолчанию по первой строке
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеТоваров", 	"Товары", 			   "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеТоваров", 	"БланкиСтрогогоУчета", "НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомиссионераОПродажах", 	"", 				   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомиссионераОПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомитентуОПродажах", 	"", 				   "", 					  "НалоговоеНазначениеДоходовИЗатратПоВознаграждению");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомитентуОПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомитентуОПродажах", 	"ДокументыРасчетовСКонтрагентом", 			  "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетОРозничныхПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"Услуги", "", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"Материалы", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	// НН для МЦ будет заполнено значением по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаМалоценкиВЭксплуатацию", 	"МалоценныеАктивы", "", "");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаНМА", "НМА", "", "");

	// НН устанавливается из объекта строительства
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаОборудованияВМонтаж", "Оборудование", "", "");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаОС", 	"ОС", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаТоваров", 	"Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаТоваров", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	// НН для тары будут заполнены по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаТоваров", 	"ВозвратнаяТара", "", "");
	
	// НН заполняется для малоценки по умолчанию отдельно
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеМалоценкиВЭксплуатации", "МалоценныеАктивы", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"Товары", 				"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"ВозвратнаяТара", 		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"БланкиСтрогогоУчета", 	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПереоценкаТоваровВРознице", 	"Товары", 	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеВходящее", 	"", 	"", "НалоговоеНазначениеПриПрочемПоступлении");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеВходящее", 	"", 	"", "НалоговоеНазначениеПлатежныеКартыУслуги");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеВходящее", 	"РасшифровкаПлатежа", 	"НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеИсходящее", 	"", 	"", "НалоговоеНазначениеПриПрочемСписании");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеИсходящее", 	"РасшифровкаПлатежа", 	"НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерПоступлениеДенежныхСредств", 	"", 	"", "НалоговоеНазначениеПриПрочемПоступлении");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерПоступлениеДенежныхСредств", 	"", 	"", "НалоговоеНазначениеПлатежныеКартыУслуги");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерПоступлениеДенежныхСредств", 	"РасшифровкаПлатежа", 	"НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерСписаниеДенежныхСредств", 	"", 	"", "НалоговоеНазначениеПриПрочемСписании");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерСписаниеДенежныхСредств", 	"РасшифровкаПлатежа", 	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеДопРасходов", 	"Товары", 			   "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеДопРасходов", 	"Оборудование",			"НалоговоеНазначение", "");
    ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеДопРасходов", 	"ДокументыРасчетовСКонтрагентом",			"НалоговоеНазначение", "");
		
    // НН по НДС будет взято из НГ
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеИзПереработки", 	"ИспользованныеМатериалы", 		 "", "");
    // НН по НДС будет взято из НГ, по прибыли будет заполнено по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеИзПереработки", 	"Услуги", 		 "", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеИзПереработки", 	"ВозвратнаяТара", 		 "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеИзПереработки", 	"ВозвращенныеМатериалы", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеИзПереработки", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	
	// НН по НДС в ДокументыРасчетовСКонтрагентом будет заполнено по умолчанию из первой строки документа
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеНМА", 	"", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Товары",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"ВозвратнаяТара",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Оборудование",			"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"ОбъектыСтроительства",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"БланкиСтрогогоУчета",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Услуги",				"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"Товары",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"ДокументыРасчетовСКонтрагентом", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"ВозвратнаяТара",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"Услуги",				"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПринятиеКУчетуНМА", 	"",	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПриходныйКассовыйОрдер", 	"", 						"", 				   "НалоговоеНазначениеПриПрочемПоступлении");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПриходныйКассовыйОрдер", 	"РасшифровкаПлатежа", 		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПриходныйКассовыйОрдер", 	"ПриемРозничнойВыручки", 	"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РасходныйКассовыйОрдер", 	"", 					"", 				   "НалоговоеНазначениеПриПрочемСписании");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РасходныйКассовыйОрдер", 	"РасшифровкаПлатежа", 	"НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"Товары",			"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"ВозвратнаяТара",	"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"Услуги",			"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияУслугПоПереработке", 	"Услуги",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РегистрацияАвансовВНалоговомУчете", 	"Приобретения",  "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеДепонентовВДоходыОрганизаций", 	"",  		"", "НалоговоеНазначениеДоходовИЗатрат");

    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеНМА",	"",  	"", "");
	
    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеОС", 	"",  	"", "");
	
	// НН по прибыли в шапке будет заполнено по первой строке доукмента
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"Товары",  				"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"ВозвратнаяТара",  		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"БланкиСтрогогоУчета",  "НалоговоеНазначение", "");
	
	// НН по прибыли в шапке будет заполнено по первой строке доукмента
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ТребованиеНакладная", 	"Материалы",  		"НалоговоеНазначение", "");
	
	
	Возврат ТаблицаОбъектов;

КонецФункции // ЗаполнитьТаблицуОбъектовНалоговыеНазначения()

Процедура ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, ВидОбъекта, ИмяОбъекта, ИмяТабличнойЧасти = "", ИмяРеквизитНалоговоеНазначение = "", ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = "")

	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ВидОбъекта = ВидОбъекта;
	НоваяСтрока.ИмяОбъекта = ИмяОбъекта;
	НоваяСтрока.ИмяТабличнойЧасти 							 = ИмяТабличнойЧасти;
	НоваяСтрока.ИмяРеквизитНалоговоеНазначение 				 = ИмяРеквизитНалоговоеНазначение;
	НоваяСтрока.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат;

КонецПроцедуры 

Процедура ОбработатьОбъектНалоговыеНазначения(ВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки)
	
	Если ВидОбъекта = "Справочник" Тогда
		ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, 1, СтруктураНН, ДатаНачалаОбработки);
	ИначеЕсли ВидОбъекта = "Документ" Тогда
		ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, 2, СтруктураНН, ДатаНачалаОбработки);
	ИначеЕсли ВидОбъекта = "РегистрСведений" Тогда
		ОбработатьРегистрСведенийНалоговыеНазначения(МассивСтруктурРеквизитов, 2, СтруктураНН);
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ОбработатьРегистрСведенийНалоговыеНазначения(МассивСтруктурРеквизитов, ВидРегистра, СтруктураНН)
	
	ИмяРегистра = МассивСтруктурРеквизитов[0].ИмяОбъекта;

	НаборДвижений = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			
	НаборДвижений.Прочитать();

	ИзмененыДвижения = Ложь;
	Для Каждого Движение Из НаборДвижений Цикл
		
		Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
			
			// определим реквизит, который необходимо использовать как источник данных для преобразования
			ННИсточник 			= ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
			ЗначениеННИсточника = Движение[ННИсточник];
			
			// пустой реквизит - преобразовывать нечего
			Если НЕ ЗначениеЗаполнено(ЗначениеННИсточника) Тогда
				Продолжить;
			КонецЕсли;
			
			// реквизит уже преобразован
			Если    НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(ЗначениеННИсточника) = Неопределено
				ИЛИ НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НП.НайтиПоЗначению(ЗначениеННИсточника)  = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// выполняем преобразование
			Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение) Тогда
				Движение[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение] = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ЗначениеННИсточника);
				ИзмененыДвижения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
				Движение[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = СтруктураНН.СоответствиеНалоговыхНазначений_НП.Получить(ЗначениеННИсточника);
				ИзмененыДвижения = Истина;
			КонецЕсли;
			
		КонецЦикла; 
			
	КонецЦикла; 	
		
	Если ИзмененыДвижения Тогда
		НаборДвижений.ОбменДанными.Загрузка = Истина;
		НаборДвижений.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, Вид, СтруктураНН, ДатаНачалаОбработки)
	
	ИмяОбъекта = МассивСтруктурРеквизитов[0].ИмяОбъекта;
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	МассивТабЧастей = Новый Массив;
	Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
		Если СтруктураРеквизитов.ИмяТабличнойЧасти <> "" Тогда
			Если МассивТабЧастей.Найти(СтруктураРеквизитов.ИмяТабличнойЧасти) = Неопределено Тогда
				МассивТабЧастей.Добавить(СтруктураРеквизитов.ИмяТабличнойЧасти)
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;	
	
	Пока ЕстьДокументы Цикл
		
		ТаблицаДокументов = ПолучитьТаблицуСправочниковДокументов(ДокументСсылка, ИмяОбъекта, Вид, ДатаНачалаОбработки);
		
		ЕстьДокументы = ТаблицаДокументов.Количество() > 0;
		
		Для Каждого Строка Из ТаблицаДокументов Цикл
			
			ДокументСсылка = Строка.Ссылка;
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			ОбъектИзменен = Ложь;
			
			// обрабатываем шапку
			Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
				
				Если СтруктураРеквизитов.ИмяТабличнойЧасти <> "" Тогда
					Продолжить;
				КонецЕсли; 
				
				Если Вид = 1 И ДокументОбъект.ЭтоГруппа Тогда // Вид = 1 - Справочник
					Продолжить;
				КонецЕсли;	
				
				Если ИмяОбъекта = "РасходыБудущихПериодов" Тогда
					// заполняем отсутствующие в предыдущей редакции реквизиты
					
					// особый справочник, НН в нем не было в ред. 1.1
					Если    ЗначениеЗаполнено(ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение])
						ИЛИ ЗначениеЗаполнено(ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) Тогда
						
						// обновлен ранее
						Продолжить;	
					
					КонецЕсли;
					
					ОбъектИзменен = Истина;
					ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					
					ХарактерЗатрат = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(ДокументОбъект.СчетБУ, Неопределено);
					ТипОбъектСтроительста = Тип("СправочникСсылка.ОбъектыСтроительства");
					ТипНМА                = Тип("СправочникСсылка.НематериальныеАктивы");
					ТипНГ                 = Тип("СправочникСсылка.НоменклатурныеГруппы");
					
					Если    ХарактерЗатрат = "Производство"
						ИЛИ ХарактерЗатрат = "Строительство" Тогда
						
						ЦелевоеНалоговоеНазначение = Неопределено;
						
						Для Н = 1 По 3 Цикл
							
							ЗначениеСубконто = ДокументОбъект["СубконтоБУ" + Н];
							
							Если ТипЗнч(ЗначениеСубконто) = ТипНГ Тогда
								
								ЦелевоеНалоговоеНазначение = ДокументОбъект["СубконтоБУ" +Н].НалоговоеНазначениеВПроизводстве;
								Прервать;
								
							ИначеЕсли ТипЗнч(ЗначениеСубконто) = ТипОбъектСтроительста
								ИЛИ ТипЗнч(ЗначениеСубконто) = ТипНМА Тогда
								
								ЦелевоеНалоговоеНазначение = ДокументОбъект["СубконтоБУ" +Н].НалоговоеНазначение;
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
						
						ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение] = ЦелевоеНалоговоеНазначение;
						
					КонецЕсли;						
					
				ИначеЕсли  ИмяОбъекта = "ИзменениеНалоговогоНазначенияЗапасов"
					   ИЛИ ИмяОбъекта = "ИзменениеНалоговогоНазначенияОС" 
					   ИЛИ ИмяОбъекта = "КорректировкаОжидаемогоИПодтвержденногоНДС"
					   ИЛИ ИмяОбъекта = "НалоговаяНакладная"
					   ИЛИ ИмяОбъекта = "СписаниеНМА"
					   ИЛИ ИмяОбъекта = "СписаниеОС"
					   
					   Тогда	
					   
					// заполняем по-умолчанию для прибыли
					Если НЕ ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат) Тогда
						ОбъектИзменен = Истина;
						ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					КонецЕсли;	
						
				ИначеЕсли  ИмяОбъекта = "ПоступлениеНМА"
					Тогда	
					   
					// заполняем по-умолчанию в ТЧ ДокументыРасчетовСКонтрагентом из НН НМА из первой строки док
					Если  ДокументОбъект.ДокументыРасчетовСКонтрагентом.Количество() > 0
						И НЕ ЗначениеЗаполнено(ДокументОбъект.ДокументыРасчетовСКонтрагентом[0].НалоговоеНазначение)
						И ДокументОбъект.НМА.Количество() > 0 Тогда
						
						ОбъектИзменен = Истина;
						ЗначениеННИсточника = ДокументОбъект.НМА[0].НематериальныйАктив.НалоговоеНазначение;
						НовоеЗначениеНН = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ЗначениеННИсточника);
						Для каждого СтрОб Из ДокументОбъект.ДокументыРасчетовСКонтрагентом Цикл
						
							СтрОб.НалоговоеНазначение = НовоеЗначениеНН;
						
						КонецЦикла;
						
					КонецЕсли;	
						
				Иначе	
					
					// определим реквизит, который необходимо использовать как источник данных для преобразования
					ННИсточник 			= ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
					ЗначениеННИсточника = ДокументОбъект[ННИсточник];
					
					// пустой реквизит - преобразовывать нечего
					Если НЕ ЗначениеЗаполнено(ЗначениеННИсточника) Тогда
						Продолжить;
					КонецЕсли;
					
					// реквизит уже преобразован
					Если    НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(ЗначениеННИсточника) = Неопределено
						ИЛИ НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НП.НайтиПоЗначению(ЗначениеННИсточника)  = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					// выполняем преобразование
					Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение) Тогда
						ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение] = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ЗначениеННИсточника);
						ОбъектИзменен = Истина;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
						ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = СтруктураНН.СоответствиеНалоговыхНазначений_НП.Получить(ЗначениеННИсточника);
						ОбъектИзменен = Истина;
					КонецЕсли;
					
					// заполняем зависимые реквизиты шапки
					Если ИмяОбъекта = "ВводВЭксплуатациюОС" Тогда
						ДокументОбъект.НалоговоеНазначениеОборудования = ДокументОбъект.НалоговоеНазначение;
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла; 
			
			// обрабатываем таб. части
			Для Каждого ИмяТабЧасти Из МассивТабЧастей Цикл
				Для Каждого СтрокаТабЧасти Из ДокументОбъект[ИмяТабЧасти] Цикл
					
					ЕстьУдалитьПропорциональныйНДС = НЕ ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабЧасти].Реквизиты.Найти("УдалитьПропорциональныйНДС") = Неопределено;					
					
					Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
				
						Если СтруктураРеквизитов.ИмяТабличнойЧасти <> ИмяТабЧасти Тогда
							Продолжить;
						КонецЕсли; 
						
						Если    (ИмяОбъекта  = "ВводНачальныхОстатков" И ИмяТабЧасти = "МалоценныеАктивы")
							ИЛИ ИмяОбъекта = "ВводНачальныхОстатковМалоценкиВЭксплуатации"
							ИЛИ ИмяОбъекта = "ПеремещениеМалоценкиВЭксплуатации"
							ИЛИ ИмяОбъекта = "ПередачаМалоценкиВЭксплуатацию"
							Тогда
							 
							// заполняем отсутствующие в предыдущей редакции реквизиты
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
							
							КонецЕсли;
							
						ИначеЕсли  (ИмяОбъекта = "ОтчетПроизводстваЗаСмену" И ИмяТабЧасти = "Услуги")
							   ИЛИ ИмяОбъекта = "ПередачаНМА" 
							   ИЛИ ИмяОбъекта = "ПередачаОС" 
							Тогда     
							 
							// заполняем отсутствующие в предыдущей редакции реквизиты
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначениеДоходовИЗатрат) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
								
							КонецЕсли;
	
						ИначеЕсли ИмяОбъекта = "ИзменениеНалоговогоНазначенияОС" Тогда	
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначениеНовое = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ДокументОбъект.УдалитьНалоговоеНазначение);
								
								ДанныеПоСтаромуНН =РегистрыСведений.НалоговыеНазначенияОС.СрезПоследних(ДокументОбъект.МоментВремени(), Новый Структура("Организация, ОсновноеСредство", ДокументОбъект.Организация, СтрокаТабЧасти.ОсновноеСредство));
								Если ДанныеПоСтаромуНН.Количество() > 0  Тогда
									СтароеНН = ДанныеПоСтаромуНН[0].НалоговоеНазначение;	
									Если СтруктураНН.СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(СтароеНН) = Неопределено Тогда
									    СтрокаТабЧасти.НалоговоеНазначение = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(СтароеНН);
									Иначе	
										СтрокаТабЧасти.НалоговоеНазначение = СтароеНН;
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли ИмяОбъекта = "ПередачаОборудованияВМонтаж" Тогда	
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение = ДокументОбъект.ОбъектСтроительства.НалоговоеНазначение;
							КонецЕсли;				
							
						ИначеЕсли (ИмяОбъекта = "ПередачаТоваров" И ИмяТабЧасти = "ВозвратнаяТара")
							
							Тогда
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
								СтрокаТабЧасти.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
								
							КонецЕсли;
							
						//ИначеЕсли (ИмяОбъекта = "ПоступлениеИзПереработки" И ИмяТабЧасти = "ВозвратнаяТара")
						//	
						//	Тогда
						//	
						//	Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
						//	
						//		ОбъектИзменен = Истина;
						//		СтрокаТабЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
						//		
						//	КонецЕсли;
							
						ИначеЕсли (ИмяОбъекта = "ПоступлениеИзПереработки" И ИмяТабЧасти = "ИспользованныеМатериалы")
							  ИЛИ (ИмяОбъекта = "ПоступлениеИзПереработки" И ИмяТабЧасти = "Услуги")	
							Тогда
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение 				 = ДокументОбъект.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве;
								//Если ИмяТабЧасти = "Услуги" Тогда
								//	СтрокаТабЧасти.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;	
								//КонецЕсли;
								
							КонецЕсли;
							
						Иначе
							
							// определим реквизит, который необходимо использовать как источник данных для преобразования
							ННИсточник 			= ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
							ЗначениеННИсточника = СтрокаТабЧасти[ННИсточник];
							
							// пустой реквизит - преобразовывать нечего
							Если НЕ ЗначениеЗаполнено(ЗначениеННИсточника) Тогда
								Продолжить;
							КонецЕсли;
							
							// реквизит уже преобразован
							Если    НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(ЗначениеННИсточника) = Неопределено
								ИЛИ НЕ СтруктураНН.СписокНалоговыхНазначенийНКУ_НП.НайтиПоЗначению(ЗначениеННИсточника)  = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							
							// выполняем преобразование
							Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение) Тогда
								Если  ЕстьУдалитьПропорциональныйНДС
									И СтрокаТабЧасти["УдалитьПропорциональныйНДС"] = Истина Тогда
									СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение] = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально;
								Иначе
									СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение] = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ЗначениеННИсточника);
									ОбъектИзменен = Истина;
								КонецЕсли;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
								СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = СтруктураНН.СоответствиеНалоговыхНазначений_НП.Получить(ЗначениеННИсточника);
								ОбъектИзменен = Истина;
							КонецЕсли;
							
							// заполняем зависимые реквизиты шапки по первой обработанной строке документа
							// налоговое назначение по прибыли берем из первой строки ТЧ
							Если    ИмяОбъекта = "ГТДИмпорт"
								ИЛИ ИмяОбъекта = "СписаниеТоваров"
								ИЛИ ИмяОбъекта = "ТребованиеНакладная"
								ИЛИ ИмяОбъекта = "ОприходованиеТоваров" 
							    ИЛИ ИмяОбъекта = "КорректировкаДолга" Тогда
								Если НЕ ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат)
									И ОбъектИзменен = Истина Тогда
									ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = СтруктураНН.СоответствиеНалоговыхНазначений_НП.Получить(ЗначениеННИсточника);
								КонецЕсли;
							КонецЕсли;
							
							// Признак Амортизируется в платежных документах установим исходя из старого НН
							Если    ИмяТабЧасти = "РасшифрокаПлатежа"
								ИЛИ ИмяТабЧасти = "ОплатаПоставщикам" Тогда
							
								СтрокаТабЧасти.Амортизируется = ЗначениеННИсточника.Амортизируется;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла; 
			КонецЦикла;	
			
			Если ОбъектИзменен Тогда
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать();
			КонецЕсли; 
				
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры // 

Функция ПолучитьТаблицуРегистраторов(СсылкаНач, ИмяРегистра, ВидРегистра)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	РегистрУчета.Регистратор КАК Регистратор
	|ИЗ 	
	|	Регистр"+?(ВидРегистра=1,"Накопления","Сведений")+"." + ИмяРегистра + " КАК РегистрУчета "
	+ ?(СсылкаНач = Неопределено,""," ГДЕ РегистрУчета.Регистратор > &СсылкаНач ") + "
	|
	|УПОРЯДОЧИТЬ ПО Регистратор
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 				СсылкаНач);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуРегистраторов()

Функция ПолучитьТаблицуСправочниковДокументов(СсылкаНач, ИмяСправочникаДокумента, Вид, ДатаНачалаОбработки)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ 	
	|	"+?(Вид = 1, "Справочник", "Документ")+"." + ИмяСправочникаДокумента + " КАК Таблица 
	| ГДЕ "
	+ ?(СсылкаНач = Неопределено,"ИСТИНА "," Таблица.Ссылка > &СсылкаНач ")  
	+ ?(Вид = 1, "", " И  Дата >= &ДатаНачалаОбработки ") + "
	|
	|УПОРЯДОЧИТЬ ПО Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 				СсылкаНач);
	Запрос.УстановитьПараметр("ДатаНачалаОбработки", 				ДатаНачалаОбработки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуСправочниковДокументов()

Процедура ПолучитьСпискиНовыхНалоговыхНазначений(ПоПрибыли = Неопределено, ПоНДС = Неопределено)

	ПоНДС = Новый СписокЗначений();
	ПоНДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально);

	ПоПрибыли = Новый СписокЗначений();
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_Освобожденная);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_Распределяемая);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);

КонецПроцедуры

Процедура ПолучитьСоответствиеСтарыхИНовыхНалоговыхНазначений(ПоПрибыли = Неопределено, ПоНДС = Неопределено) 
	
	ПоНДС = Новый Соответствие;
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельность				   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАморт            , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАмортНеОблагНДС  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьНеОблагНДС       , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельность                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАморт              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАмортНеОблагНДС    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельность                  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАморт             , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАмортНеОблагНДС   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьНеОблагНДС        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслуги                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалюты                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнес                        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАморт                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАмортНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесНеОблагНДС              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	
	ПоПрибыли = Новый Соответствие;
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельность				   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАморт            , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАмортНеОблагНДС  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьНеОблагНДС       , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельность                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАморт              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАмортНеОблагНДС    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельность                  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАморт             , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАмортНеОблагНДС   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьНеОблагНДС        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслуги                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалюты                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнес                        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАморт                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАмортНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесНеОблагНДС              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// НАЛОГОВЫЙ УЧЕТ

Процедура ЗаполнитьНалоговыеНазначенияНКУСправочниковРегистров()
	
	ЗаполнитьНалоговыеНазначения();
	
КонецПроцедуры

Функция ЗаполнитьНепредопределенныеСтатьи(ИмяЗаполняемогоСправочника = Неопределено, НомерСоздаваемойСтроки = 0) Экспорт
	
	СтруктураСозданныхСтатей = Новый Структура;
	
	ЗаполняемыеСправочники = Новый Структура;
	Если НЕ ИмяЗаполняемогоСправочника = Неопределено Тогда
		ЗаполняемыеСправочники.Вставить(ИмяЗаполняемогоСправочника);
	Иначе	
		ЗаполняемыеСправочники.Вставить("СтатьиЗатрат");
		ЗаполняемыеСправочники.Вставить("СтатьиДоходов");
		ЗаполняемыеСправочники.Вставить("СтатьиНеоперационныхРасходов");
	КонецЕсли;
	
	Для каждого ЗаполняемыйСправочник Из ЗаполняемыеСправочники Цикл
		
		ИмяСправочника = ЗаполняемыйСправочник.Ключ;
		Попытка
			Макет = Справочники[ИмяСправочника].ПолучитьМакет("НачальноеЗаполнениеНепредопределенных");
		Исключение
			Сообщить("Невозможно заполнить справочник: " + ИмяСправочника);
			Продолжить;
		КонецПопытки;
		
		КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		
		ЧислоРеквизитов = Макет.ШиринаТаблицы; 

		КоличествоЗаписей = Макет.ВысотаТаблицы;
		ТекСправочник = Справочники[ИмяСправочника];
		
		ДлинаНаименования = Метаданные.Справочники[ИмяСправочника].ДлинаНаименования;
		
		Если НомерСоздаваемойСтроки = 0 тогда
			//все
			ПервыйНомер = 2;
			ПоследнийНомер = КоличествоЗаписей;
		Иначе
			ПервыйНомер = НомерСоздаваемойСтроки;
			ПоследнийНомер = НомерСоздаваемойСтроки;
		КонецЕсли;	
		
		//Заполняем справочник
		Для СчЭлементы = ПервыйНомер По ПоследнийНомер Цикл

			
			// или имя предопределенного элемента или некий код, для того
			// чтобы можно было создать иерархию элементов
			// созданная группа сохраняется в списке 
			ВнутрКодГруппы = Макет.Область(СчЭлементы, 1).Текст;
			
			// см. выше - ссылка на родителя
			Родитель     = Макет.Область(СчЭлементы, 2).Текст;
			
			Наименование = Макет.Область(СчЭлементы, 3).Текст;
			
			// если заполнен внутренний код группы - значит мы создаем не предопределенную группу
			ЭтоГруппа 	 = ЗначениеЗаполнено(ВнутрКодГруппы);
			
			НовыйОбъект = ?(ЭтоГруппа, ТекСправочник.СоздатьГруппу(), ТекСправочник.СоздатьЭлемент());
			НовыйОбъект.Наименование = Наименование;
			
			Если ЗначениеЗаполнено(Родитель) Тогда
			
				Если СтруктураСозданныхСтатей.Свойство(ИмяСправочника + "_группа_" + Родитель) Тогда
					// группой является созданный в процессе элемент
					НовыйОбъект.Родитель = СтруктураСозданныхСтатей[ИмяСправочника + "_группа_" + Родитель]; 
				Иначе
					// предопределенная группа должна быть
					НовыйОбъект.Родитель = ТекСправочник[Родитель];
				КонецЕсли;
				
			КонецЕсли;
			
			// попытка не пересоздавать существующие элементы.
			СуществующийЭлемент = ТекСправочник.НайтиПоНаименованию(ЛЕВ(Наименование,ДлинаНаименования),Истина,НовыйОбъект.Родитель); 
			Если ЗначениеЗаполнено(СуществующийЭлемент) Тогда
				НовыйОбъект = СуществующийЭлемент.ПолучитьОбъект();
			КонецЕсли;
			
			Если ЭтоГруппа Тогда
				
				Если НЕ ЗначениеЗаполнено(НовыйОбъект.Код) Тогда
					НовыйОбъект.УстановитьНовыйКод();
				КонецЕсли;
				
				НовыйОбъект.ОбменДанными.Загрузка = Истина;
				НовыйОбъект.Записать();
				// сохраняем ссылку для создания иерархии
				СтруктураСозданныхСтатей.Вставить(ИмяСправочника + "_группа_" + ВнутрКодГруппы, НовыйОбъект.Ссылка);
				
			Иначе
				
				Для СчРеквизиты = 3 По ЧислоРеквизитов Цикл
					
					ИмяРеквизита      = Макет.Область(1, 		  СчРеквизиты).Текст;
					ЗначениеРеквизита = Макет.Область(СчЭлементы, СчРеквизиты).Текст;
					
					Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяРеквизита = "СтатьяДекларацииПоНалогуНаПрибыль" Тогда
					
						НовыйОбъект[ИмяРеквизита] = Справочники.СтатьиНалоговыхДеклараций[ЗначениеРеквизита];
						Если НЕ ЗначениеЗаполнено(НовыйОбъект.Код) Тогда
							НовыйОбъект.УстановитьНовыйКод();
						КонецЕсли;
						// нам нужна ссылка, запишем
						НовыйОбъект.ОбменДанными.Загрузка = Истина;
						НовыйОбъект.Записать();
						СтруктураСозданныхСтатей.Вставить(ИмяСправочника + "_" + ЗначениеРеквизита, НовыйОбъект.Ссылка);
						
					ИначеЕсли ИмяРеквизита = "Счет8Класса" Тогда

						НовыйОбъект[ИмяРеквизита] = ПланыСчетов.Хозрасчетный.НайтиПоКоду(ЗначениеРеквизита);
						
					ИначеЕсли ИмяРеквизита = "ВидЗатрат" Тогда

						НовыйОбъект[ИмяРеквизита] = Перечисления.ВидыЗатрат[ЗначениеРеквизита];
						
					ИначеЕсли ИмяРеквизита = "ХарактерЗатрат" Тогда
						
						НовыйОбъект[ИмяРеквизита] = Перечисления.ХарактерЗатрат[ЗначениеРеквизита];
						
					КонецЕсли;
				
				КонецЦикла;	
				
				Если НовыйОбъект.Модифицированность() Тогда
					Если НЕ ЗначениеЗаполнено(НовыйОбъект.Код) Тогда
						НовыйОбъект.УстановитьНовыйКод();
					КонецЕсли;
					НовыйОбъект.ОбменДанными.Загрузка = Истина;
					НовыйОбъект.Записать();
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Возврат СтруктураСозданныхСтатей;
	
КонецФункции

Функция ПереопределитьСтатьиЗатратПоНалоговомуКодексу() Экспорт
	
	// заполняем непредопределенные статьи затрат
	// и подменяем их в разных объектах конфигурации
	НовыеСтатьи = ЗаполнитьНепредопределенныеСтатьи();
	
	////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////
	Спр = Справочники.СпособыОтраженияЗарплатыВРеглУчете.Выбрать();
	
	ЗП_Производство     = НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_Зарплата;
	ЗП_ОПЗ 				= НовыеСтатьи.СтатьиЗатрат_НПНК_ЗВ_Управление_Зарплата;
	ЗП_АЗ  				= НовыеСтатьи.СтатьиЗатрат_НПНК_АВ_Зарплата;
	ЗП_ЗС 				= НовыеСтатьи.СтатьиЗатрат_НПНК_ВЗ_Зарплата;
	
	ЗП_Строительство 	= НовыеСтатьи.СтатьиЗатрат_НПНК_НеУчитывать;
	
	Пока Спр.Следующий() Цикл
		
		ЭлементСправочника = Спр.ПолучитьОбъект();
		
		СчетЗатрат = ЭлементСправочника.СчетДт;
		
		ЕстьСубконтоСтатьяЗатрат = Ложь;
		Для НомСубконто = 1 По 3 Цикл
			Если СчетЗатрат.ВидыСубконто.Количество()<НомСубконто Тогда
				Прервать;
			КонецЕсли;
			
			ВидСубконто = СчетЗатрат.ВидыСубконто[НомСубконто-1].ВидСубконто;
			Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				ЕстьСубконтоСтатьяЗатрат = Истина;
				Прервать;
			КонецЕсли;

		КонецЦикла;
		
		Если ЕстьСубконтоСтатьяЗатрат = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ХарактерЗатрат = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат);
		Если ХарактерЗатрат = "Производство" Тогда
			
			ЭлементСправочника["СубконтоДт" + НомСубконто] = ЗП_Производство;
			
		ИначеЕсли ХарактерЗатрат = "Строительство" Тогда		
			
			ЭлементСправочника["СубконтоДт" + НомСубконто] = ЗП_Строительство;
			
		ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы 
				ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы) Тогда	
				
			ЭлементСправочника["СубконтоДт" + НомСубконто] = ЗП_ОПЗ;
				
		ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы 
				ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы) Тогда	
				
			ЭлементСправочника["СубконтоДт" + НомСубконто] = ЗП_АЗ;
			 
		ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.РасходыНаСбыт 
				ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаСбыт) Тогда	
				
			ЭлементСправочника["СубконтоДт" + НомСубконто] = ЗП_ЗС;
			
		ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа 
				ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа) Тогда	
				
			//Сообщить(Локализация.СтрШаблон1(НСтр("ru='В способе отражения расходов по ЗП ""¤1¤"" указан субсчет 94 счета - определить статью затрат в классификации налогового кодекса невозможно. Укажите статью вручную!';uk='У способі відображення витрат по ЗП ""¤1¤"" зазначений 94 рахунок - визначити статтю витрат у класифікації податкового кодекса неможливо. Вкажіть статтю власноруч!'"), ЭлементСправочника));
			
		КонецЕсли;
		
		Если ЭлементСправочника.Модифицированность() Тогда
			ЭлементСправочника.ОбменДанными.Загрузка = Истина;
			ЭлементСправочника.Записать();
		КонецЕсли;
	
	КонецЦикла;
	
	////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////
	РС = РегистрыСведений.ОтражениеВзносовФОТВРеглУчете;
	
	СписокНалогов = РС.СрезПоследних('20110401').ВыгрузитьКолонку("Налог");
	
	Для каждого Налог Из СписокНалогов Цикл
		
		Если    Налог = Справочники.Налоги.ЕСВФОТБольничные
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТБюджетники
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТГПХ 
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТИнвалиды 
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТИнвалиды50 
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТЛетчики 
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТРаботники 
			ИЛИ Налог = Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС
			Тогда
		Иначе
			Продолжить;	
		КонецЕсли;
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность = Истина;		
		Запись.Период = '20110401';		
		Запись.Налог = Налог;		
		Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы;
		Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_ЗВ_Управление_Взносы;
        Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность = Истина;		
		Запись.Период= '20110401';		
		Запись.Налог = Налог;		
		Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы;
		Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_АВ_Взносы;
	    Запись.Записать();

		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность = Истина;		
		Запись.Период= '20110401';		
		Запись.Налог = Налог;		
		Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.РасходыНаСбыт;
		Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_ВЗ_Взносы;
		Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность = Истина;		
		Запись.Период= '20110401';		
		Запись.Налог = Налог;		
		Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
		Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_Взносы;
		Запись.Записать();

		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность = Истина;		
		Запись.Период= '20110401';		
		Запись.Налог = Налог;		
		Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства;
		Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_Взносы;
		Запись.Записать();

		//Запись = РС.СоздатьМенеджерЗаписи();		
		//Запись.Активность = Истина;		
		//Запись.Период= '20110401';		
		//Запись.Налог = Налог;		
		//Запись.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства;
		//Запись.СтатьяЗатрат = НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_Взносы;
		//Запись.Записать();

	КонецЦикла;
	
	// еще раз перезаполним документы
	ПерезаполнитьПроводкиПоЗарплатнымДокументамНалоговымиНазначениямиНКУ();
	
	////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////
	Спр = Справочники.СпособыОтраженияРасходовПоАмортизации.Выбрать();
	
	СпособыДляОС  = ПолучитьИспользуемыеСпособыАмортизации("СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет");
	СпособыДляОС.Свернуть("Способ");
	СпособыДляНМА = ПолучитьИспользуемыеСпособыАмортизации("СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет");
	СпособыДляНМА.Свернуть("Способ");
	ОбщиеСпособы = Новый Массив();
	
	// амортизация
	АМ_ОС_91 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_ОС_ЗВ;
	АМ_НМА_91 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_НА_ЗВ;
	
	АМ_ОС_92 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_ОС_АВ;
	АМ_НМА_92 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_НА_АВ;

	АМ_ОС_93  			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_ОС_ВЗ;
	АМ_НМА_93 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_НА_ВЗ;
	
	АМ_ОФ_94 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_ОС_ИВ;
	
	АМ_ОС_231 			= НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_АмортизацияОС;
	АМ_НМА_231			= НовыеСтатьи.СтатьиЗатрат_НПНК_ПЗ_АмортизацияНА;
	
	// ремонты
	РМ_ОС_91 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_Ремонт_ЗВ;
	
	РМ_ОС_92 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_Ремонт_АВ;

	РМ_ОС_93  			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_Ремонт_ВЗ;
	
	РМ_ОФ_94 			= НовыеСтатьи.СтатьиЗатрат_НПНК_АМ_Ремонт_ИВ;
	
	ОФ_Строительство 	= НовыеСтатьи.СтатьиЗатрат_НПНК_НеУчитывать;	
	
	Пока Спр.Следующий() Цикл
		
		ЭлементСправочника = Спр.ПолучитьОбъект();
		
		Если ЭлементСправочника.Ссылка = Справочники.СпособыОтраженияРасходовПоАмортизации.ВременнаяРазницаОСНа01042011 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СпособыДляНМА.Найти(ЭлементСправочника.Ссылка) = Неопределено Тогда
			// только для ОС
			СпособДляОС = Истина;
		Иначе
			Если СпособыДляОС.Найти(ЭлементСправочника.Ссылка) = Неопределено Тогда
				// только для НМА
				СпособДляОС = Ложь;
			Иначе
				// способ общий, для текущего справочника заполним как для ОС
				СпособДляОС = Истина;
				ОбщиеСпособы.Добавить(ЭлементСправочника.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Способ Из ЭлементСправочника.Способы Цикл
		
			СчетЗатрат = Способ.СчетЗатрат;
			
			ЕстьСубконтоСтатьяЗатрат = Ложь;
			Для НомСубконто = 1 По 3 Цикл
				Если СчетЗатрат.ВидыСубконто.Количество()<НомСубконто Тогда
					Прервать;
				КонецЕсли;
				
				ВидСубконто = СчетЗатрат.ВидыСубконто[НомСубконто-1].ВидСубконто;
				Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					ЕстьСубконтоСтатьяЗатрат = Истина;
					Прервать;
				КонецЕсли;

			КонецЦикла;
			
			
			ХарактерЗатрат = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат);
			Если ХарактерЗатрат = "Производство" Тогда
				
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОС_231;
					КонецЕсли;	
					Способ.СтатьяЗатрат   				 = АМ_ОС_231;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_НМА_231;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_НМА_231;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			ИначеЕсли ХарактерЗатрат = "Строительство" Тогда		
				
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = ОФ_Строительство;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= ОФ_Строительство;
					Способ.СтатьяЗатратНаУлучшениеОС   = ОФ_Строительство;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = ОФ_Строительство;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= ОФ_Строительство;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы) Тогда	
					
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОС_91;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_ОС_91;
					Способ.СтатьяЗатратНаУлучшениеОС   = РМ_ОС_91;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_НМА_91;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_НМА_91;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы) Тогда	
					
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОС_92;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_ОС_92;
					Способ.СтатьяЗатратНаУлучшениеОС   = РМ_ОС_92;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_НМА_92;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_НМА_92;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				 
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.РасходыНаСбыт 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаСбыт) Тогда	
					
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОС_93;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_ОС_93;
					Способ.СтатьяЗатратНаУлучшениеОС   = РМ_ОС_93;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_НМА_93;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_НМА_93;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа) Тогда	
					
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОФ_94;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_ОФ_94;
					Способ.СтатьяЗатратНаУлучшениеОС   = РМ_ОФ_94;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = АМ_ОФ_94;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= АМ_ОФ_94;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			Иначе
					
				Если СпособДляОС Тогда
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = ОФ_Строительство;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= ОФ_Строительство;
					Способ.СтатьяЗатратНаУлучшениеОС   = ОФ_Строительство;
				Иначе	
					Если ЕстьСубконтоСтатьяЗатрат Тогда
						Способ["Субконто" + НомСубконто] = ОФ_Строительство;
					КонецЕсли;	
					Способ.СтатьяЗатрат 				= ОФ_Строительство;
					Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		Если ЭлементСправочника.Модифицированность() Тогда
			ЭлементСправочника.ОбменДанными.Загрузка = Истина;
			ЭлементСправочника.Записать();
		КонецЕсли;
	
	КонецЦикла;
	
	// теперь создадим новые способы для НМА, т.к. в декларации это разные статьи, а у нас справочник способов
	// один для ОС и для НМА
	СоответствиеСпособов = Новый Соответствие;
	Для каждого ОбщийСпособ Из ОбщиеСпособы Цикл
		
		НовыйСпособ = Справочники.СпособыОтраженияРасходовПоАмортизации.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НовыйСпособ, ОбщийСпособ,,"Владелец,Родитель");
		НовыйСпособ.Наименование = НовыйСпособ.Наименование + " (для НМА)";
		
		НовыйСпособ.Код = "";
		НовыйСпособ.УстановитьНовыйКод();
		
		Для каждого СпособОС Из ОбщийСпособ.Способы Цикл
			Способ = НовыйСпособ.Способы.Добавить();
			ЗаполнитьЗначенияСвойств(Способ, СпособОС);
			
			СчетЗатрат = Способ.СчетЗатрат;
			
			ХарактерЗатрат = УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат);
			Если ХарактерЗатрат = "Производство" Тогда
				
				Способ["Субконто" + НомСубконто] = АМ_НМА_231;
				Способ.СтатьяЗатрат 			 = АМ_НМА_231;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				
			ИначеЕсли ХарактерЗатрат = "Строительство" Тогда		
				
				Способ["Субконто" + НомСубконто] = ОФ_Строительство;
				Способ.СтатьяЗатрат 			 = ОФ_Строительство;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы) Тогда	
					
				Способ["Субконто" + НомСубконто] = АМ_НМА_91;
				Способ.СтатьяЗатрат 			 = АМ_НМА_91;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы) Тогда	
					
				Способ["Субконто" + НомСубконто] = АМ_НМА_92;
				Способ.СтатьяЗатрат 			 = АМ_НМА_92;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				 
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.РасходыНаСбыт 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаСбыт) Тогда	
					
				Способ["Субконто" + НомСубконто] = АМ_НМА_93;
				Способ.СтатьяЗатрат 			 = АМ_НМА_93;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
					
			ИначеЕсли   СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа 
					ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа) Тогда	
					
				Способ["Субконто" + НомСубконто] = АМ_ОФ_94;
				Способ.СтатьяЗатрат 			 = АМ_ОФ_94;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				
			Иначе
					
				Способ["Субконто" + НомСубконто] = ОФ_Строительство;
				Способ.СтатьяЗатрат 			 = ОФ_Строительство;
				Способ.СтатьяЗатратНаУлучшениеОС   = Неопределено;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НовыйСпособ.ОбменДанными.Загрузка = Истина;
		НовыйСпособ.Записать();
		
		СоответствиеСпособов.Вставить(ОбщийСпособ, НовыйСпособ.Ссылка);
		
	КонецЦикла;
	
	// пеперь подменяем в доукментах
	
	ТекЗначениеКонстантыЗапретИзмененияДанныхДо01042011 = Константы.ЗапретИзмененияДанныхДо01042011.Получить();
	Константы.ЗапретИзмененияДанныхДо01042011.Установить(Ложь);
	ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	
	СпособыДляНМА = ПолучитьИспользуемыеСпособыАмортизации("СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет");	
	СпособыДляНМА.Свернуть("Ссылка");
	Для каждого СтрокаРегистраторов Из СпособыДляНМА Цикл
		
		Регистратор = СтрокаРегистраторов.Ссылка;
        Объект = Регистратор.ПолучитьОбъект();
		
		// подменим реквизиты шапки
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ИзменениеПараметровНачисленияАмортизацииНМА") Тогда
			
			Если НЕ ОбщиеСпособы.Найти(Объект.СпособОтраженияРасходовПоАмортизации) = Неопределено Тогда
				Объект.СпособОтраженияРасходовПоАмортизации = СоответствиеСпособов.Получить(Объект.СпособОтраженияРасходовПоАмортизации);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаЗаписейРегистров")
			  ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОперацияБух") 
			  ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаОстатковНКУна01042011") Тогда
			  // у этих регистраторов только движения.
			  
		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПринятиеКУчетуНМА") Тогда
			
			Если НЕ ОбщиеСпособы.Найти(Объект.СпособОтраженияРасходов) = Неопределено Тогда
				Объект.СпособОтраженияРасходов = СоответствиеСпособов.Получить(Объект.СпособОтраженияРасходов);
			КонецЕсли;
			
		КонецЕсли;
		
		// подменим движения
		Движения = Объект.Движения.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет;
		Движения.Прочитать();
		
		Для каждого Движение Из Движения Цикл
		
			Если НЕ ОбщиеСпособы.Найти(Движение.СпособОтраженияРасходов) = Неопределено Тогда
				Движение.СпособОтраженияРасходов = СоответствиеСпособов.Получить(Движение.СпособОтраженияРасходов);
			КонецЕсли;
		
		КонецЦикла;
		
		Если Объект.Модифицированность() Тогда
		
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Объект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Константы.ЗапретИзмененияДанныхДо01042011.Установить(ТекЗначениеКонстантыЗапретИзмененияДанныхДо01042011);
	ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	
	////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////
	ЗаполнитьРСПараметрыКурсовыхРазниц(НовыеСтатьи);
	
	
	////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////
	ЗаполнитьРССчетаУчетаПрочие(НовыеСтатьи);

КонецФункции 

Функция ПолучитьИспользуемыеСпособыАмортизации(ИмяРегистра)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНач", '20110401');
	
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
                   |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации КАК Способ,
                   |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.Регистратор КАК Ссылка
                   |ИЗ
                   |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаНач, ) КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации КАК Способ,
                   |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.Регистратор КАК Ссылка
                   |ИЗ
                   |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
                   |ГДЕ
                   |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.Период >= &ДатаНач";
				   
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет", ИмяРегистра);				   
	
	Если ИмяРегистра = "СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет" Тогда
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СпособыОтраженияРасходовПоАмортизации КАК Способ", "СпособОтраженияРасходов КАК Способ");				   	
	
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //

Процедура ЗаполнитьРСПараметрыКурсовыхРазниц(НовыеСтатьи)
	
	НаборЗаписей = РегистрыСведений.ПараметрыУчетаКурсовыхРазниц.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		СчетДоходов = Запись.СчетДоходов;
		Для НомСубконто = 1 По 3 Цикл
			
			Если СчетДоходов.ВидыСубконто.Количество()<НомСубконто Тогда
				Прервать;
			КонецЕсли;
			
			ВидСубконто = СчетДоходов.ВидыСубконто[НомСубконто-1].ВидСубконто;
			Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов Тогда
				Запись["Субконто" + НомСубконто + "Доходов"] = НовыеСтатьи.СтатьиДоходов_НПНК_ИД_КурсРазницы;
				Прервать;
			КонецЕсли;

		КонецЦикла;
		
		СчетЗатрат = Запись.СчетЗатрат;
		Для НомСубконто = 1 По 3 Цикл
			
			Если СчетЗатрат.ВидыСубконто.Количество()<НомСубконто Тогда
				Прервать;
			КонецЕсли;
			
			ВидСубконто = СчетЗатрат.ВидыСубконто[НомСубконто-1].ВидСубконто;
			Если      ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				Запись["Субконто" + НомСубконто + "Затрат"] = НовыеСтатьи.СтатьиЗатрат_НПНК_ИВ_КурсРазницы;
				Прервать;
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
				Запись["Субконто" + НомСубконто + "Затрат"] = НовыеСтатьи.СтатьиНеоперационныхРасходов_НПНК_ИВ_КурсРазницы;
				Прервать;
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьРССчетаУчетаПрочие(НовыеСтатьи, ПервыйЗапуск = Ложь)
	
	РС = РегистрыСведений.СчетаУчетаПрочие;

	МассивОрганизаций = Новый Массив();
	МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
	Если НЕ ПервыйЗапуск Тогда
		НаборЗаписей = РС.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		СписокИспользуемыхОрганизаций = НаборЗаписей.ВыгрузитьКолонку("Организация");
		Для каждого Организация Из СписокИспользуемыхОрганизаций Цикл
			
			Если МассивОрганизаций.Найти(Организация) = Неопределено Тогда
				МассивОрганизаций.Добавить(Организация); 
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Организация Из МассивОрганизаций Цикл
		
		Только8Класс = Ложь;
		Если ЗначениеЗаполнено(Организация) Тогда
			УчетнаяПолитикаНеЗадана = Ложь;
			УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ОбщегоНазначения.ПолучитьРабочуюДату(), УчетнаяПолитикаНеЗадана, Организация, "Бух");
			Если НЕ УчетнаяПолитикаНеЗадана Тогда
				Только8Класс = УчетнаяПолитика.ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8;				
			КонецЕсли;
		КонецЕсли;
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетЗатратОтчетКомиссионераОПродажах;		
		Если Только8Класс Тогда
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.РасходыНаСбыт;
		КонецЕсли;
		Запись.Субконто1     			= НовыеСтатьи.СтатьиЗатрат_НПНК_ВЗ_Комиссионные;
	    Запись.Записать();
		        
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКурсоваяРазницаПокупкаПродажаВалюты;		
		Если Только8Класс Тогда
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ЗатратыОтОперационнойКурсовойРазницы;
		КонецЕсли;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиЗатрат_НПНК_ИВ_КурсРазницы;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетДоходовКурсоваяРазницаПокупкаПродажаВалюты;		
	    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДоходОтОперационнойКурсовойРазницы;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиДоходов_НПНК_ИД_КурсРазницы;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКомиссионныеПокупкаПродажаВалюты;		
		Если Только8Класс Тогда                    
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
			Запись.Субконто1     		= НовыеСтатьи.СтатьиЗатрат_НПНК_АВ_Банк;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.АдминистративныеРасходы;
			Запись.Субконто1     		= Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Запись.Субконто2     		= НовыеСтатьи.СтатьиЗатрат_НПНК_АВ_Банк;
		КонецЕсли;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетЗатратПенсионныйПродажаВалюты;		
		Если Только8Класс Тогда
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
		КонецЕсли;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиЗатрат_НПНК_ИВ_Налоги;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетЗатратСебестоимостьПродажаВалюты;		
		Если Только8Класс Тогда
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойИностраннойВалюты;
		КонецЕсли;
		Запись.Субконто1     			= НовыеСтатьи.СтатьиЗатрат_НПНК_ИВ_КурсРазницы;
	    Запись.Записать();

		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетДоходовСебестоимостьПродажаВалюты;		
	    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДоходОтРеализацииИностраннойВалюты;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиДоходов_НПНК_ИД_КурсРазницы;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетДтСписаниеЗадолженностиКорректировкаДолга;		
		Если Только8Класс Тогда
		    Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе	
			Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.СомнительныеИБезнадежныеДолги;
		КонецЕсли;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиЗатрат_НПНК_ИВ_БезнадежнаяЗадолженность;
	    Запись.Записать();
		
		Запись = РС.СоздатьМенеджерЗаписи();		
		Запись.Активность 			= Истина;		
		Запись.ВидПрочегоСчетаУчета = Перечисления.ВидыПрочихСчетовУчета.СчетКтСписаниеЗадолженностиКорректировкаДолга;		
		Запись.СчетУчетаБУ   		= ПланыСчетов.Хозрасчетный.ДоходОтСписанияКредиторскойЗадолженности;
		Запись.Субконто1     		= НовыеСтатьи.СтатьиДоходов_НПНК_ИД_БезнадежКредиторская;
	    Запись.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзмененияВПланеСчетовХозрасчетныйВерсия1_2_2()
	
	КодЯзыкаЗаполнения = "ru";
	
	//378
	ОбъектСчет = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Расчеты с государственными целевыми фондами';uk='Розрахунки з державними цільовими фондами'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//48
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ЦелевоеФинансированиеИЦелевыеПоступленияОперационнаяДеятельность.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Целевое финансирование и целевые поступления операционной деятельности (не используется)';uk='Цільове фінансування і цільові надходження операційної діяльності (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ЦелевоеФинансированиеИЦелевыеПоступленияИнвестиционнаяДеятельность.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Целевое финансирование и целевые поступления инвестиционной деятельности (не используется)';uk='Цільове фінансування і цільові надходження інвестиційної діяльності (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ЦелевоеФинансированиеИЦелевыеПоступленияФинансоваяДеятельность.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Целевое финансирование и целевые поступления финансовой деятельности (не используется)';uk='Цільове фінансування і цільові надходження фінансової діяльності (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	ОбъектСчет = ПланыСчетов.Хозрасчетный.СредстваВысвобожденныеОтНалогообложения.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Средства, высвобожденные от налогообложения';uk='Кошти, вивільнені від оподаткування'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.СредстваИзБюджетаИГосударственныхЦелевыхФондов.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Средства из бюджета и государственных целевых фондов';uk='Кошти з бюджету та державних цільових фондів'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ГуманитарнаяПомощь.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Гуманитарная помощь';uk='Гуманітарна допомога'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ПрочиеСредстваЦелевогоФинансированияИЦелевыхПоступлений.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Прочие средства целевого финансирования и целевых поступлений';uk='Інші кошти цільового фінансування і цільових надходжень'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//65
	ОбъектСчет = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Расчеты по общеобязательному государственному социальному страхованию';uk='За розрахунками із загальнообов''язкового державного соціального страхування'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюНаСлучайБезработицы.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Расчеты по страхованию на случай безработицы (не используется)';uk='За страхуванням на випадок безробіття (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//82
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ОтчисленияНаПенсионноеОбеспечение.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Отчисления на общеобязательное государственное социальное страхование';uk='Відрахування на загальнообов''язкове державне соціальне страхування'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальноеСтрахование.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Отчисления на социальное страхование (не используется)';uk='Відрахування на соціальне страхування (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	ОбъектСчет = ПланыСчетов.Хозрасчетный.СтрахованиеНаСлучайБезработицы.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Страхование на случай безработицы (не используется)';uk='Страхування на випадок безробіття (не використовується)'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
		
	//Заполняем "ручную" аналитику
	Если ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.СредстваВысвобожденныеОтНалогообложения) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.СредстваВысвобожденныеОтНалогообложения, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	КонецЕсли; 
	Если ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.СредстваИзБюджетаИГосударственныхЦелевыхФондов) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.СредстваИзБюджетаИГосударственныхЦелевыхФондов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	КонецЕсли; 
	Если ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ГуманитарнаяПомощь) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ГуманитарнаяПомощь, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	КонецЕсли; 
	Если ПроверитьВозможностьДобавленияСубконто(ПланыСчетов.Хозрасчетный.ПрочиеСредстваЦелевогоФинансированияИЦелевыхПоступлений) Тогда
		УстановитьСубконтоНеавтоматизированныхСчетов(ПланыСчетов.Хозрасчетный.ПрочиеСредстваЦелевогоФинансированияИЦелевыхПоступлений, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ОбработатьИзмененияВПланеСчетовХозрасчетныйВерсия1_2_7()
	
	КодЯзыкаЗаполнения = "ru";
	
	//364
	ОбъектСчет = ПланыСчетов.Хозрасчетный.РасчетыПоГарантийномуОбеспечению.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Расчеты по гарантийному обеспечению';uk='Розрахунки за гарантійним забезпеченням'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//379
	ОбъектСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОперациямСДеривативами.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Расчеты по операциям с деривативами';uk='Розрахунки за операціями з деривативами'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//4231
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ДооценкаОсновныхСредств.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Дооценка основных средств';uk='Дооцінка основних засобів'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//483
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ГуманитарнаяПомощь.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Благотворительная помощь';uk='Благодійна допомога'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//711
	ОбъектСчет = ПланыСчетов.Хозрасчетный.ДоходОтРеализацииИностраннойВалюты.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Доход от покупки-продажи иностранной валюты';uk='Дохід від купівлі-продажу іноземної валюти'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
	//942
	ОбъектСчет = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойИностраннойВалюты.ПолучитьОбъект();
	ОбъектСчет.Наименование = НСтр("ru='Затраты на покупку-продажу иностранной валюты';uk='Витрати на купівлю-продаж іноземної валюти'", КодЯзыкаЗаполнения);
	ОбъектСчет.Записать();
	
КонецПроцедуры

Процедура ОбновитьПроводкиНастройкиЗПпоОПЗ()

	// установим во всех настройках и документах после 01.08 для 91-го счета пропорциональный НДС
	// документы нужно будет перепровести пользователям самостоятельно
	
	СчетОПЗ 	  = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы;
	НН_ПропорцНДС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально;
	
	// 1. Спр. способы отражения ЗП в регл. учете.
	Выборка = Справочники.СпособыОтраженияЗарплатыВРеглУчете.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписыватьОбъект = Ложь;
		Объект = Выборка.ПолучитьОбъект();
		
		
		Если ЗначениеЗаполнено(Объект.СчетДт) И (Объект.СчетДт = СчетОПЗ ИЛИ Объект.СчетДт.ПринадлежитЭлементу(СчетОПЗ)) Тогда		
			ЗаписыватьОбъект = Истина;		
		 	Объект.НалоговоеНазначение = НН_ПропорцНДС;
		КонецЕсли;
		
		Если ЗаписыватьОбъект Тогда
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. Док. НачислениеЗП
	Выборка = Документы.НачислениеЗарплатыРаботникамОрганизаций.Выбрать(глЗначениеПеременной("ДатаНачалаРаспределенияОПЗвНУ"));
	Пока Выборка.Следующий() Цикл
		
		ЗаписыватьОбъект = Ложь;
		Объект = Выборка.ПолучитьОбъект();
		
		Для каждого Строка Из Объект.НачисленияПроводки Цикл
		
			Если ЗначениеЗаполнено(Строка.СчетДт) И (Строка.СчетДт = СчетОПЗ ИЛИ Строка.СчетДт.ПринадлежитЭлементу(СчетОПЗ)) Тогда		
				ЗаписыватьОбъект = Истина;		
			 	Строка.НалоговоеНазначение = НН_ПропорцНДС;
			КонецЕсли;
		
		КонецЦикла;
		
		Для каждого Строка Из Объект.ВзносыФОТПроводки Цикл
		
			Если ЗначениеЗаполнено(Строка.СчетДт) И (Строка.СчетДт = СчетОПЗ ИЛИ Строка.СчетДт.ПринадлежитЭлементу(СчетОПЗ)) Тогда		
				ЗаписыватьОбъект = Истина;		
			 	Строка.НалоговоеНазначение = НН_ПропорцНДС;
			КонецЕсли;
		
		КонецЦикла;
		
		Для каждого Строка Из Объект.ОтражениеВРеглУчете Цикл
		
			Если ЗначениеЗаполнено(Строка.СчетДт) И (Строка.СчетДт = СчетОПЗ ИЛИ Строка.СчетДт.ПринадлежитЭлементу(СчетОПЗ)) Тогда		
				ЗаписыватьОбъект = Истина;		
			 	Строка.НалоговоеНазначение = НН_ПропорцНДС;
			КонецЕсли;
		
		КонецЦикла;
		
		Если ЗаписыватьОбъект Тогда
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМетодРаспределенияРБП()
	#Если Клиент Тогда				
	СостояниеОбновления(НСтр("ru='Обновление справочника ""Расходы будущих периодов""';uk='Оновлення довідника ""Витрати майбутніх періодів""'"));
	#КонецЕсли

	Выборка = Справочники.РасходыБудущихПериодов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;	
		
		РБП = Выборка.ПолучитьОбъект();
		РБП.МетодРаспределения = Перечисления.МетодыРаспределенияРБП.ПоДням;
		РБП.ОбменДанными.Загрузка = Истина;
		Попытка
			РБП.Записать();
		Исключение
			Сообщить(НСтр("ru='Не удалось обновить элемент справочника ""Расходы будущих периодов"": ';uk='Не вдалося оновити елемент довідника ""Витрати майбутніх періодів"": '") + РБП, СтатусСообщения.Важное);	
		КонецПопытки;
			
	КонецЦикла;
	
	#Если Клиент Тогда				
	СостояниеОбновления("");
	#КонецЕсли

КонецПроцедуры

Процедура ЗаполнитьВидДоговораПоГК()
	
	#Если Клиент Тогда				
	СостояниеОбновления(НСтр("ru='Обновление справочника ""Договоры контрагентов""';uk='Оновлення довідника ""Договори контрагентів""'"));
	#КонецЕсли

	ВидБартер 	= Справочники.ВидыДоговоровПоГК.Бартер;
	ВидКомиссии = Справочники.ВидыДоговоровПоГК.Комиссия;
	ВидПрочее 	= Справочники.ВидыДоговоровПоГК.Поставка;
	
	
	Выборка = Справочники.ДоговорыКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;	
		
		Дог = Выборка.ПолучитьОбъект();
		
		Если Дог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			Дог.ВидДоговораПоГК = ВидБартер;
		ИначеЕсли Дог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
			  ИЛИ Дог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		    Дог.ВидДоговораПоГК = ВидКомиссии;
		Иначе
			Дог.ВидДоговораПоГК = ВидПрочее;
		КонецЕсли;
		
		Дог.ОбменДанными.Загрузка = Истина;
		Попытка
			Дог.Записать();
		Исключение
			Сообщить(НСтр("ru='Не удалось обновить элемент справочника ""Договоры контрагентов"": ';uk='Не вдалося оновити елемент довідника ""Договори контрагентів"": '") + Дог, СтатусСообщения.Важное);	
		КонецПопытки;
			
	КонецЦикла;
	
	#Если Клиент Тогда				
	СостояниеОбновления("");
	#КонецЕсли

КонецПроцедуры

Процедура ЗаполнитьОснованиеКорректировкиНалоговыхДокументов()

	// заполнять новый реквизит будем только за последний квартал 2011 года	
	
	СостояниеОбновления(НСтр("ru='Обновление документов Приложение 2 к Налоговой накладной и Запись книги приобретений';uk='Оновлення документів Додаток 2 до Податкової накладної та Запис книги придбання'"));

	Док = Документы.Приложение2КНалоговойНакладной.Выбрать('20111001');
	Пока Док.Следующий() Цикл
		Объект = Док.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
			Объект.ОснованиеКорректировки = Объект.Комментарий;
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
			    Объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить(НСтр("ru='Не удалось обновить документ:  ';uk='Не вдалося оновити документ: '") + Док, СтатусСообщения.Важное);	
			КонецПопытки;
		
		КонецЕсли;
	КонецЦикла;
	
	ОбрабатываемыеВидыОпераций = Новый СписокЗначений;
	ОбрабатываемыеВидыОпераций.Добавить(Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат);
	ОбрабатываемыеВидыОпераций.Добавить(Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка);
	
	Док = Документы.РегистрацияВходящегоНалоговогоДокумента.Выбрать('20111001');
	Пока Док.Следующий() Цикл
		Объект = Док.ПолучитьОбъект();
		Если НЕ ОбрабатываемыеВидыОпераций.НайтиПоЗначению(Объект.ВидОперации) = Неопределено			
			  И ЗначениеЗаполнено(Объект.Комментарий) Тогда
			  
			Объект.ОснованиеКорректировки = Объект.Комментарий;
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
			    Объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить(НСтр("ru='Не удалось обновить документ:  ';uk='Не вдалося оновити документ: '") + Док, СтатусСообщения.Важное);	
			КонецПопытки;
		
		КонецЕсли;
	КонецЦикла;
	
	СостояниеОбновления("");

КонецПроцедуры

Процедура ИсправитьНачальноеЗаполнениеСчетаУчетаРасчетовСКонтрагентами()
	
	МассивРесурсовНННДС = Новый Массив; 	
	МассивРесурсовНННДС.Добавить("НалоговоеНазначениеПриобретений");
	МассивРесурсовНННДС.Добавить("НалоговоеНазначениеПродаж");
	МассивРесурсовНННДС.Добавить("НалоговоеНазначениеПриобретенийПоТаре");
	МассивРесурсовНННДС.Добавить("НалоговоеНазначениеПродажПоТаре");
	
	СписокНалоговыхНазначенийНКУ_НДС = Новый СписокЗначений();
	СписокНалоговыхНазначенийНКУ_НДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	СписокНалоговыхНазначенийНКУ_НДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	СписокНалоговыхНазначенийНКУ_НДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	СписокНалоговыхНазначенийНКУ_НДС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально);
	
	НаборДвижений = РегистрыСведений.СчетаУчетаРасчетовСКонтрагентами.СоздатьНаборЗаписей();
	
	НаборДвижений.Прочитать();

	ИзмененыДвижения = Ложь;
	Для Каждого Движение Из НаборДвижений Цикл
		
		Для Каждого ИмяРесурсаНН Из МассивРесурсовНННДС Цикл
			
			ЗначениеРесурсаНН = Движение[ИмяРесурсаНН];
			
			// пустой ресурс - преобразовывать нечего
			Если НЕ ЗначениеЗаполнено(ЗначениеРесурсаНН) Тогда
				Продолжить;
			КонецЕсли;
			
			// ресурс заполнен нормально 
			Если НЕ СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(ЗначениеРесурсаНН) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Прав(ИмяРесурсаНН,6) = "ПоТаре" Тогда
				Движение[ИмяРесурсаНН] = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
			Иначе
				Движение[ИмяРесурсаНН] = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
			КонецЕсли;
			ИзмененыДвижения = Истина;
		КонецЦикла; 
			
	КонецЦикла; 	
		
	Если ИзмененыДвижения Тогда
		НаборДвижений.ОбменДанными.Загрузка = Истина;
		НаборДвижений.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры //ИсправитьНачальноеЗаполнениеСчетаУчетаРасчетовСКонтрагентами()

Процедура ЗаполнениеДатыОплаты(ТипДокумента, ДатаНач) Экспорт
	
	НоваяДлинаНомера = Метаданные.Документы[ТипДокумента].ДлинаНомера;
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	Пока ЕстьДокументы Цикл
		
		Выборка = ПолучитьВыборкуДокументов(ТипДокумента, ДатаНач, ДокументСсылка);
		ЕстьДокументы = Выборка.Количество() > 0;
		
		Пока Выборка.Следующий() Цикл
			
			ДокументСсылка = Выборка.Ссылка;
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			ЗаписыватьОбъект = Ложь;
			
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаОплаты) Тогда
				ДокументОбъект.ДатаОплаты = ДокументОбъект.НалоговаяНакладная.Дата;
				ЗаписыватьОбъект = Истина;
			КонецЕсли;
			
			Если ЗаписыватьОбъект = Истина Тогда
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСубконтоДокументыРасчетов(Счет)
	
	СчетОбъект = Счет.ПолучитьОбъект();
	
	ВидСубконтоДокументыРасчетов = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами;
	Субконто = СчетОбъект.ВидыСубконто.Найти(ВидСубконтоДокументыРасчетов, "ВидСубконто");	
	
	Если Субконто = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (&Счет), &ВидСубконто, Субконто1 <> &ПустСубконто) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("Счет", Счет); 
	Запрос.УстановитьПараметр("ВидСубконто", ВидСубконтоДокументыРасчетов);
	Запрос.УстановитьПараметр("ПустСубконто", Неопределено);
	
	Выборка = Запрос.Выполнить();
	
	Если Выборка.Пустой() Тогда
		СчетОбъект.ВидыСубконто.Удалить(Субконто);
		СчетОбъект.Записать();
		Сообщить(Локализация.СтрШаблон1(НСтр("ru='План счетов ""Хозрасчетный"", счет ""¤1¤"" удалено субконто ""¤2¤""';uk='План рахунків ""Госпрозрахунковий"", рахунок ""¤1¤"" вилучене субконто ""¤2¤""'"), Строка(СчетОбъект),ВидСубконтоДокументыРасчетов.Наименование));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьФлагПризнаватьЗатратыВНУОприходованиеТоваров()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", глЗначениеПеременной("ДатаНачалаУчетаНКУ"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Дата >= &ДатаНач
	|	И ОприходованиеТоваров.ИнвентаризацияТоваровНаСкладе = ЗНАЧЕНИЕ(Документ.ИнвентаризацияТоваровНаСкладе.ПустаяСсылка)
	|	И (ОприходованиеТоваров.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Вспомогательный)
	|			ИЛИ ОприходованиеТоваров.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НеоплаченныйКапитал))
	|	И ОприходованиеТоваров.ПризнаватьЗатратыВНУ = ЛОЖЬ
	|	И ОприходованиеТоваров.ОтражатьВБухгалтерскомУчете = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ПризнаватьЗатратыВНУ = Истина;
		Объект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНормыДляПятойИШестойГруппЕН()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыНалоговогоУчета.Период
	|ИЗ
	|	РегистрСведений.ПараметрыНалоговогоУчета КАК ПараметрыНалоговогоУчета
	|ГДЕ
	|	ПараметрыНалоговогоУчета.Период > &Период";
	
	Запрос.УстановитьПараметр("Период", Дата('20111231235959')); 
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПараметрыНалоговогоУчета.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Выборка.Период;
		
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ОбъемДоходаЕНПятаяГруппа  = 20000000;
		МенеджерЗаписи.ОбъемДоходаЕНШестаяГруппа = 20000000;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение
			// Сообщаем только, если не удалось создать запись при "замещении"
			Сообщить(НСтр("ru='В регистре сведений ""Параметры налогового учета"" не удалось записать объем дохода для плательщиков Единого налога';uk='У регістрі відомостей ""Параметри податкового обліку"" не вдалося записати обсяг доходу для платників Єдиного податку'"));
			Продолжить;
		КонецПопытки;	

	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНоменклатуруГТД()

	СостояниеОбновления("Заполнеятся справочник ""Номенклатура ГТД""");
	
	// пройдемся по справочнику Номенклатура. Будем создавать элементы подчиненного справочника "Номенклатура ГТД" по данным удаленного реквизита КодУКТВЭД.
	// если уже имеется такой элемент - новый не создаем.
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.УДАЛИТЬКодУКТВЭД КАК КодУКТВЭД
	               |ПОМЕСТИТЬ ВременнаяТаблица
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.УДАЛИТЬКодУКТВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	Характеристики.Владелец,
	               |	Характеристики.УДАЛИТЬКодУКТВЭД
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	               |ГДЕ
	               |	НЕ Характеристики.УДАЛИТЬКодУКТВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.КодУКТВЭД
	               |ИЗ
	               |	ВременнаяТаблица КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураГТД КАК НоменклатураГТД
	               |		ПО Номенклатура.Ссылка = НоменклатураГТД.Владелец
	               |			И Номенклатура.КодУКТВЭД = НоменклатураГТД.КодУКТВЭД
	               |ГДЕ
	               |	НоменклатураГТД.Ссылка ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НоменклатураГТД = Справочники.НоменклатураГТД.СоздатьЭлемент();
		НоменклатураГТД.КодУКТВЭД = Выборка.КодУКТВЭД;
		НоменклатураГТД.Владелец  = Выборка.Ссылка;
		НоменклатураГТД.Записать();
	
	КонецЦикла;

	СостояниеОбновления("Заполнеятся реквизит справочников ""Номенклатура ГТД""");
	// теперь пройдемся по справочникам номенклатура и Характеристики и заполним пустые реквизиты Номенклатура ГТД
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Ссылка КАК ВладелецНоменклатурыГТД,
	               |	Номенклатура.УДАЛИТЬКодУКТВЭД КАК КодУКТВЭД
	               |ПОМЕСТИТЬ ВременнаяТаблица
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.УДАЛИТЬКодУКТВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	               |	И Номенклатура.НоменклатураГТД = ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Характеристики.Ссылка,
	               |	Характеристики.Владелец,
	               |	Характеристики.УДАЛИТЬКодУКТВЭД
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	               |ГДЕ
	               |	НЕ Характеристики.УДАЛИТЬКодУКТВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	               |	И Характеристики.НоменклатураГТД = ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(НоменклатураГТД.Ссылка) КАК НоменклатураГТД
	               |ИЗ
	               |	ВременнаяТаблица КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураГТД КАК НоменклатураГТД
	               |		ПО Номенклатура.ВладелецНоменклатурыГТД = НоменклатураГТД.Владелец
	               |			И Номенклатура.КодУКТВЭД = НоменклатураГТД.КодУКТВЭД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура.Ссылка";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Спр = Выборка.Ссылка.ПолучитьОбъект();
		
		Спр.НоменклатураГТД = Выборка.НоменклатураГТД;
		Спр.ОбменДанными.Загрузка = Истина;
		Спр.Записать();
		
	КонецЦикла;
	
	СостояниеОбновления("");
	
КонецПроцедуры


