
//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		// Проверка заполнения
		Заголовок = "Запись документа <" + Ссылка + ">";
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнена организация.", Отказ, Заголовок);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнено подразделение.", Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры
