// #Область СлужебныеПроцедурыИФункции

// Преобразует строку в XDTO контактную информацию телефона.
//
//  Параметры:
//      ЗначенияПолей - строка с сериализованной информацией, значения полей.
//      Представление - представление старший-младший, используется для попытки разбора. 
//                      если ЗначенияПолей пусто.
//      ОжидаемыйТип  - необязательный тип для контроля.
//
Функция ДесериализацияТелефона(ЗначенияПолей, Представление="", ОжидаемыйТип=Неопределено) Экспорт
	Результат = МИКО_стОбработкаКонтактнойИнформации.КонтактнаяИнформацияИзXML(ЗначенияПолей, Представление);
	Возврат Результат;
КонецФункции

// Открывает панель отчетов. Используется в модуле общей команды.
// 
Процедура ПоказатьПанельОтчетов(ПутьКПодсистеме, ПараметрыВыполненияКоманды, Удалить_Заголовок = "") Экспорт
	
	Попытка
		ОбщийМодуль_ВариантыОтчетовКлиент = Вычислить("ВариантыОтчетовКлиент");
	Исключение
	КонецПопытки; 
	
	Если ОбщийМодуль_ВариантыОтчетовКлиент <> Неопределено Тогда
		ОбщийМодуль_ВариантыОтчетовКлиент.ПоказатьПанельОтчетов(ПутьКПодсистеме, ПараметрыВыполненияКоманды, Удалить_Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПоказатьПанельОтчетов()

// Подмена формы истории звонков на форму журнала статистики.
// 
Функция ИспользоватьЖурналСтатистикиВ_PT1C() Экспорт
	Попытка
		врИспользовать = МИКО_стОбработкаКонтактнойИнформации.ИспользоватьЖурналСтатистикиВПанели();
	Исключение
	   	врИспользовать = Ложь;	
	КонецПопытки; 
	Возврат врИспользовать;	
КонецФункции // ИспользоватьЖурналСтатистикиВ_PT1C()

// Регламентая процедура сопоставляет документ истории звонка с документом "Событие".
// 
Процедура реглСопоставитьДокументЗвонкаСсобытием(Знач СтруктураПараметров = Неопределено) Экспорт 
	
	Если НЕ МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики() Тогда Возврат; КонецЕсли; 
	Попытка
		мод_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
		мод_стЗагрузкаИсторииЗвонков_v7.СопоставитьДокументЗвонкаСсобытием();	
	Исключение
		ЗаписьЖурналаРегистрации("МИКО.стСопоставлениеСобытийСоЗвонком",  УровеньЖурналаРегистрации.Предупреждение, , ,  "Ошибка запуска регламентной задачи: " + ОписаниеОшибки());
	КонецПопытки; 

КонецПроцедуры

// Обновляем таблицу маршрутизации.
// 
Процедура реглОбновитьТаблицуМаршрутизации(Знач СтруктураПараметров = Неопределено) Экспорт
	
	Если НЕ МИКО_опЗаписьКИ.ИспользоватьСинтезРечи() Тогда Возврат; КонецЕсли; 
	Попытка
		мод_мвМаршрутизацияЗвонков = Вычислить("МИКО_мвМаршрутизацияЗвонковСервер");
		мод_мвМаршрутизацияЗвонков.ОбновитьТаблицуМаршрутизации(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("МИКО.мвОбновитьТаблицуМаршрутизации",  УровеньЖурналаРегистрации.Предупреждение, , ,  "Ошибка запуска регламентной задачи: " + ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

// Регламентая процедура получает историю звонков с АТС.
// 
Процедура реглПолучитьПакетИсторииСAsterisk(Знач СтруктураПараметров = Неопределено) Экспорт
	
	Если НЕ МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики() Тогда Возврат; КонецЕсли; 
	Попытка
		мод_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
		мод_стЗагрузкаИсторииЗвонков_v7.ПолучитьПакетИсторииСAsterisk();	
	Исключение
		ЗаписьЖурналаРегистрации("МИКО.стЗагрузкаИсторииЗвонков",  УровеньЖурналаРегистрации.Предупреждение, , ,  "Ошибка запуска регламентной задачи: " + ОписаниеОшибки());
	КонецПопытки; 

КонецПроцедуры

// 
// Регламентая процедура создает документ "Телефонный звонок" по данным истории звонков для конфигурации CRM3.
// 
Процедура реглСоздатьДокументыТелефонногоЗвонкаCRM3(Знач СтруктураПараметров = Неопределено) Экспорт
	
	Если НЕ МИКО_опЗаписьКИ.ИспользоватьМодульСтатистики() Тогда Возврат; КонецЕсли; 
	Попытка
		мод_стИсторияЗвонковДляCRM3 = Вычислить("МИКО_стИсторияЗвонковДляCRM3");
		мод_стИсторияЗвонковДляCRM3.СоздатьДокументыТелефонногоЗвонкаCRM3();	
	Исключение
		ЗаписьЖурналаРегистрации("МИКО.стЗагрузкаИсторииЗвонков",  УровеньЖурналаРегистрации.Предупреждение, , ,  "Ошибка обработки истории звонков, создание телефонного звонка для CRM3: " + ОписаниеОшибки());
	КонецПопытки; 

КонецПроцедуры

// Функция возвращает служебную информацию по конфигурации.
// 
Функция ПолучитьСлужебнуюИнформацию() Экспорт

	СтруктураОтвета = Новый Структура("ВерсияПлатформы, ИспользоватьРежимМодальности");
	
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = Лев(СисИнфо.ВерсияПриложения,3);
	
	Если ВерсияПлатформы = "8.2" Тогда
		ИспользоватьРежимМодальности = Истина;
	Иначе
		ИспользоватьРежимМодальности = Вычислить("Метаданные.РежимИспользованияМодальности = Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать");
		Если НЕ ЗначениеЗаполнено(ИспользоватьРежимМодальности) ИЛИ НЕ ТипЗнч(ИспользоватьРежимМодальности) = Тип("Булево") Тогда
			ИспользоватьРежимМодальности = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	СтруктураОтвета.ВерсияПлатформы = ВерсияПлатформы;
	
	СтруктураОтвета.ИспользоватьРежимМодальности = ИспользоватьРежимМодальности;
	
	Возврат СтруктураОтвета;
	
КонецФункции // ПолучитьСлужебнуюИнформацию()

// Из строки вида SIP/XXXXXXXXXX-ZZZ или IAX/XXXXXXXXXX или DAHDI/XXXXXXXXXX/ZZZ, выделяет номер.
// Параметры: 
//   СтрокаНабораНомера - тип значения "строка" передается по значению, строка: содержащая номер телефона.
// Возвращаемое значение:
//   XXXXXXXXXX - тип значения "строка".
Функция ПолучитьИмяУчеткиИзКанала(ИсхСтрока) Экспорт
	Попытка
		Результат = МИКО_опЗаписьКИ.ПолучитьИмяУчеткиИзКанала(ИсхСтрока);
	Исключение
	    Результат = "";
	КонецПопытки; 
	
	Возврат Результат;
КонецФункции // ПолучитьИмяУчеткиИзКанала()

// Преобразование переданной строки из URLencoded версии
// (необходимо декодировать данные).
Функция URLDecode(Знач врЗначение, ScrptCtrl = Неопределено, Это83 = Неопределено) Экспорт
	Результат = "";
	врЗначение = СтрЗаменить(врЗначение, "+", " ");
	
	Если Это83 = Неопределено Тогда
		СИ = Новый СистемнаяИнформация; ВерсияПриложения = СИ.ВерсияПриложения;
		Это83 = Лев(ВерсияПриложения, 3) = "8.3";
	КонецЕсли; 
	Если Это83 Тогда
		Возврат Вычислить("РаскодироватьСтроку(врЗначение, СпособКодированияСтроки.КодировкаURL)");
	КонецЕсли; 
	
	Если ScrptCtrl = Неопределено Тогда
		ScrptCtrl = МИКО_стОбщегоНазначенияСерверПовторный.GetJScriptComponent();
	КонецЕсли; 
	Если ScrptCtrl <> Неопределено Тогда
		Попытка
			врЗначение = СтрЗаменить(врЗначение, "+", " ");
			Результат  = ScrptCtrl.Eval("decodeURIComponent('" + врЗначение + "');");
			Возврат Результат;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Возврат URLDecode_OLD(врЗначение);
КонецФункции

// Преобразование переданной строки из URLencoded версии
// (необходимо декодировать данные).
Функция URLDecode_OLD(стр)
	Хекс=Новый Массив;	
	Хекс.Добавить("0");
	Хекс.Добавить("1");       
	Хекс.Добавить("2");       
	Хекс.Добавить("3");
	Хекс.Добавить("4");
	Хекс.Добавить("5");
	Хекс.Добавить("6");
	Хекс.Добавить("7");
	Хекс.Добавить("8");
	Хекс.Добавить("9");
	Хекс.Добавить("A");
	Хекс.Добавить("B");
	Хекс.Добавить("C");
	Хекс.Добавить("D");
	Хекс.Добавить("E");
	Хекс.Добавить("F");
	рез="";

	ДлиннаСтроки = СтрДлина(стр);
	Для сч=1 по ДлиннаСтроки Цикл
		чар=Сред(стр,сч,1);
		Если чар = "%" И сч+2<=ДлиннаСтроки Тогда
			Сим1 = Сред(стр,сч+1,1);	
			Сим2 = Сред(стр,сч+2,1);

			Ном1 = Хекс.Найти(Сим1);
			Ном2 = Хекс.Найти(Сим2);
			Если Ном1 = Неопределено
				 ИЛИ Ном2 = Неопределено Тогда
				 рез = рез + чар;
				// тогда найденная комбинация не является спецсиволом
				Продолжить;
			КонецЕсли; 

			кс = 16 * Ном1 + Ном2;
			КорректныйСимвол = Символ(кс);

			рез = рез + КорректныйСимвол;
			// сдвинем счетчик на два символа
			сч = сч + 2;
		иначе
			рез = рез + чар;
		КонецЕсли; 
	КонецЦикла;
    рез=СтрЗаменить(рез,"+"," ");
    рез=СтрЗаменить(рез,"%3a",":");
	
	Возврат рез; 
КонецФункции // ()

// Преобразование переданной строки в URLencoded версию
//
Функция URLEncode(URL) Экспорт
    Рез = "";
    Для Сч = 1 По СтрДлина(URL) Цикл

        ch = Сред(URL,Сч,1);
        vch = КодСимвола(ch);
        Если (vch = 8470)  Тогда                            //Number    
            Рез = Рез + "%E2%84%96";    
        ИначеЕсли ("A" <= ch ) И ( ch <= "Z") Тогда        // "A".."Z" 
            Рез = Рез + ch;
        ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда    // "a".."z" 
            Рез = Рез + ch;
        ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда    // "0".."9" 
            Рез = Рез + ch;
        ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда            // space
            Рез = Рез + "%20";
        ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") Тогда        // unreserved
            // ch == '.' || ch == '!'
            // ch == '~' || ch == '*'
            // ch == '\'' || ch == '('
            // ch == ')') Тогда
            Рез = Рез + ch;
        ИначеЕсли (vch <= 127) Тогда        // other ASCII
            Рез = Рез + hex(vch);
        ИначеЕсли (vch <= 2047) Тогда        // non-ASCII <= 0x7FF
            Рез = Рез + hex(192 + Цел(vch / 64));
            Рез = Рез + hex(128 + (vch % 64));
        Иначе                    // 0x7FF < ch <= 0xFFFF
            Рез = Рез + hex(224 + Цел(vch / 4096));
            Рез = Рез + hex(128 + (Цел(vch / 64) % 64));
            Рез = Рез + hex(128 + (vch % 64));
        КонецЕсли;
    КонецЦикла;

    Возврат Рез;
КонецФункции // URLEncode()

// Вычисление шестнадцатиричного значения числа
//
Функция hex(Знач Значение)
	Значение=Число(Значение);
	Если Значение<=0 Тогда
		Результат="0";
	Иначе
		Значение=Цел(Значение);
		Результат="";
		Пока Значение>0 Цикл
			Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
			Значение=Цел(Значение/16) ;
		КонецЦикла;
	КонецЕсли;
	Если СтрДлина(Результат) < 2 Тогда
		
		Результат = "0" + Результат;
		
	КонецЕсли;
	Возврат "%" + Результат;
КонецФункции

// Возвращает текущий номер версии модуля.
// 
Функция ВерсияМодуляСтатистики() Экспорт
	Возврат "1.0.1.22";	
КонецФункции // ВерсияМодуляСтатистики()
// #КонецОбласти
