//////////////////////////////////////////////////////////////////////////////// 
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
//

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой "НА-4"
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьНА4() Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияНМА.Дата КАК Дата,
	|	ИнвентаризацияНМА.Номер КАК Номер,
	|	ИнвентаризацияНМА.Организация КАК Организация,
	|	ИнвентаризацияНМА.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ИнвентаризацияНМА.ПодразделениеОрганизации.Представление КАК ПодразделениеПредставление,
	|	ИнвентаризацияНМА.ПодразделениеОрганизации.Код КАК ПодразделениеКод,
	|	ИнвентаризацияНМА.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияНМА.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияНМА.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ИнвентаризацияНМА.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ИнвентаризацияНМА.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ИЗ
	|	Документ.ИнвентаризацияНМА КАК ИнвентаризацияНМА
	|ГДЕ
	|	ИнвентаризацияНМА.Ссылка = &Ссылка";
	
	Док = Запрос.Выполнить().Выбрать();
	Док.Следующий();
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);

	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("Организация", Док.Организация);
	Запрос.УстановитьПараметр("Дата",        Док.Дата);
	Запрос.УстановитьПараметр("СубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияНМАНМА.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияНМАНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ИнвентаризацияНМАНМА.НематериальныйАктив.НаименованиеПолное КАК НематериальныйАктивНаименованиеПолное,
	|	ИнвентаризацияНМАНМА.СтоимостьПоДаннымУчета КАК Стоимость,
	|	ИнвентаризацияНМАНМА.СтоимостьФактическая КАК СтоимостьФактическая,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияНМАНМА.НаличиеПоДаннымУчета = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияНМАНМА.НаличиеФактическое = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФактКоличество,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияНМА.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	АмортизацияБУ.СуммаОстатокКт КАК НакопленнаяАмортизация
	|ИЗ
	|	Документ.ИнвентаризацияНМА.НематериальныеАктивы КАК ИнвентаризацияНМАНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И НематериальныйАктив В
	|						(ВЫБРАТЬ
	|							ИнвентаризацияНМАНМА.НематериальныйАктив
	|						ИЗ
	|							Документ.ИнвентаризацияНМА.НематериальныеАктивы КАК ИнвентаризацияНМАНМА
	|						ГДЕ
	|							ИнвентаризацияНМАНМА.Ссылка = &Ссылка)) КАК ПервоначальныеСведенияНМА
	|		ПО ИнвентаризацияНМАНМА.НематериальныйАктив = ПервоначальныеСведенияНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&Дата,
	|				Счет В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|					ИЗ
	|						РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(&Дата, Организация = &Организация
	|							И НематериальныйАктив В
	|								(ВЫБРАТЬ
	|									ИнвентаризацияНМАНМА.НематериальныйАктив
	|								ИЗ
	|									Документ.ИнвентаризацияНМА.НематериальныеАктивы КАК ИнвентаризацияНМАНМА
	|								ГДЕ
	|									ИнвентаризацияНМАНМА.Ссылка = &Ссылка)) КАК СчетаБухгалтерскогоУчета),
	|				&СубконтоНМА,
	|				Организация = &Организация
	|					И Субконто1 В
	|						(ВЫБРАТЬ
	|							ИнвентаризацияНМАНМА.НематериальныйАктив
	|						ИЗ
	|							Документ.ИнвентаризацияНМА.НематериальныеАктивы КАК ИнвентаризацияНМАНМА
	|						ГДЕ
	|							ИнвентаризацияНМАНМА.Ссылка = &Ссылка)) КАК АмортизацияБУ
	|		ПО ИнвентаризацияНМАНМА.НематериальныйАктив = АмортизацияБУ.Субконто1
	|ГДЕ
	|	ИнвентаризацияНМАНМА.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	ТаблицаНМА = Запрос.Выполнить().Выгрузить();
	
	Макет = ПолучитьМакет("НА4");
	// печать производится на языке, указанном в настройках пользователя
	//КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	КодЯзыкаПечать = "uk";
	//Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	Макет.КодЯзыкаМакета = "ru";
	
	// Получаем области макета для вывода в табличный документ
	Шапка 				= Макет.ПолучитьОбласть("Шапка");
	ЗаголовокТаблицы 	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	СтрокаТаблицы 		= Макет.ПолучитьОбласть("СтрокаТаблицы");
	Подвал 				= Макет.ПолучитьОбласть("Подвал");
	Расписка			= Макет.ПолучитьОбласть("Расписка");
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета по умолчанию
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 10;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.АвтоМасштаб             = Истина;
	
	// Загрузим настройки пользователя
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияНМА_НА4";

	// Выведем шапку документа
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Док.Организация, Док.Дата);
	
	Шапка.Параметры.Заполнить(Док);
	Шапка.Параметры.НаименованиеПолноеОрганизации 	= Док.ОрганизацияНаименованиеПолное;
	Шапка.Параметры.ЕДРПОУ 							= УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
	// краткий формат дат
	Шапка.Параметры.ДокументОснованиеДата 			= Формат(Док.ДокументОснованиеДата, 		"ДЛФ=DD;Л =" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
	Шапка.Параметры.ДатаНачалаИнвентаризации 		= Формат(Док.ДатаНачалаИнвентаризации, 		"ДЛФ=DD;Л =" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
	Шапка.Параметры.ДатаОкончанияИнвентаризации 	= Формат(Док.ДатаОкончанияИнвентаризации, 	"ДЛФ=DD;Л =" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
	
	Шапка.Параметры.НомерДок = ОбщегоНазначения.ПолучитьНомерНаПечать(Док);
	//Шапка.Параметры.ДатаДокумента  = Док.Дата;
	
	ТабДокумент.Вывести(Шапка);
	
	
	// Проверим, помещаются ли строка над таблицей, заголовок и первая строка.
	ШапкаТаблицы = Новый Массив;
	ШапкаТаблицы.Добавить(ЗаголовокТаблицы);
	ШапкаТаблицы.Добавить(СтрокаТаблицы);
	
	Если НЕ ТабДокумент.ПроверитьВывод(ШапкаТаблицы) Тогда
			
		// Выведем разрыв страницы
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЕсли;
	
	// Сама таблица
	// Выведем заголовок таблицы	
	ТабДокумент.Вывести(ЗаголовокТаблицы);
	
	// Выведем строки таблицы
	Для Каждого СтрокаНМА Из ТаблицаНМА Цикл
		
		СтрокаТаблицы.Параметры.Заполнить(СтрокаНМА);
		
		ТабДокумент.Вывести(СтрокаТаблицы);
		
	КонецЦикла;
	
	
	// Подвал - члены комиссии
	НаименованиеЧленовКомиссии = Новый Массив;
	НаименованиеЧленовКомиссии.Добавить("ПредседательКомиссии");
	НаименованиеЧленовКомиссии.Добавить("ПервыйЧленКомиссии");
	НаименованиеЧленовКомиссии.Добавить("ВторойЧленКомиссии");
	НаименованиеЧленовКомиссии.Добавить("ТретийЧленКомиссии");
	
	// Сначала выведем членов комиссии из выборки
	Для Каждого ЧленКомиссии Из НаименованиеЧленовКомиссии Цикл
		
		Подвал.Параметры[ЧленКомиссии + "Должность"] 	= ВыборкаПоКомиссии[ЧленКомиссии + "Должность"];
		Подвал.Параметры[ЧленКомиссии + "ФИО"] 			= ВыборкаПоКомиссии[ЧленКомиссии + "ФИО"];
		
	КонецЦикла;
	
	
	// Проверим, помещаются ли шапка подписей и одна подпись
	ПодвалРасписка = Новый Массив;
	ПодвалРасписка.Добавить(Подвал);
	ПодвалРасписка.Добавить(Расписка);
	
	Если НЕ ТабДокумент.ПроверитьВывод(ПодвалРасписка) Тогда
			
		// Выведем разрыв страницы
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЕсли;
	
	ТабДокумент.Вывести(Подвал);
	
	Расписка.Параметры.НомерДок = ОбщегоНазначения.ПолучитьНомерНаПечать(Док);
	
	ТабДокумент.Вывести(Расписка);
	
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьНА4()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	ТабДокумент = Неопределено;
	Если ИмяМакета = "НА4Бух" тогда
		
		ТабДокумент = ПечатьНА4();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), НепосредственнаяПечать);

КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("НА4Бух"  , НСтр("ru='Форма НА-4';uk='Форма НА-4'"));
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры
