
#Если Клиент Тогда


Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	МассивОтбора = Новый Массив;
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = "Отражение зарплаты в регламентированном учете";
	ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация КАК Организация,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1 КАК СубконтоДт1_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2 КАК СубконтоДт2_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3 КАК СубконтоДт3_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1 КАК СубконтоКт1_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт2 КАК СубконтоКт2_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт3 КАК СубконтоКт3_,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.НалоговоеНазначениеДоходовИЗатрат,  
	|	СУММА(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма) КАК Сумма
	|ИЗ
	|	Документ.НачислениеЗарплатыРаботникамОрганизаций.ОтражениеВРеглУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|
	|ГДЕ
	|	(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаНач, МЕСЯЦ)) И
	|	(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Проведен = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация,
	|	СчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3,
	|	СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт3,
	|	НалоговоеНазначениеДоходовИЗатрат  
	|	
	|
	|ИТОГИ СУММА(СУММА) ПО
	|	ОБЩИЕ
	|
	|{ВЫБРАТЬ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация КАК Организация,
	|	СчетДт,
	|	СубконтоДт1_,
	|	СубконтоДт2_,
	|	СубконтоДт3_,
	|	СчетКт,
	|	СубконтоКт1_,
	|	СубконтоКт2_,
	|	СубконтоКт3_,
	|	НалоговоеНазначениеДоходовИЗатрат  
	|}
	|
	|{ИТОГИ ПО
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация КАК Организация,
	|	СчетДт,
	|	СубконтоДт1_,
	|	СубконтоДт2_,
	|	СубконтоДт3_,
	|	СчетКт,
	|	СубконтоКт1_,
	|	СубконтоКт2_,
	|	СубконтоКт3_,
	|	НалоговоеНазначениеДоходовИЗатрат  
	|}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	СчетДт,
	|	СубконтоДт1_,
	|	СубконтоДт2_,
	|	СубконтоДт3_,
	|	СчетКт,
	|	СубконтоКт1_,
	|	СубконтоКт2_,
	|	СубконтоКт3_,
	|	НалоговоеНазначениеДоходовИЗатрат  
	|}
	|	
	|{ГДЕ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация КАК Организация,
	|	СчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3,
	|	СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт3,
	|	НалоговоеНазначениеДоходовИЗатрат  
	|}
    |";

	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("СчетДт");
	МассивОтбора.Добавить("СубконтоДт1");
	МассивОтбора.Добавить("СубконтоДт2");
	МассивОтбора.Добавить("СубконтоДт3");
	МассивОтбора.Добавить("СчетКт");
	МассивОтбора.Добавить("СубконтоКт1");
	МассивОтбора.Добавить("СубконтоКт2");
	МассивОтбора.Добавить("СубконтоКт3");
	МассивОтбора.Добавить("НалоговоеНазначениеДоходовИЗатрат");

	ОбщийОтчет.ЗаполнитьПоказатели("Сумма", "Сумма", Истина, "ЧЦ=15; ЧДЦ=2");
	
	СтруктураПредставлениеПолей = Новый Структура("СчетДт,СубконтоДт1_,СубконтоДт2_,СубконтоДт3_,СчетКт,СубконтоКт1_,СубконтоКт2_,СубконтоКт3_
	|,НалоговоеНазначениеДоходовИЗатрат",
	"Счет Дт",
	"Субконто Дт номер 1",
	"Субконто Дт номер 2",
	"Субконто Дт номер 3",
	"Счет Кт",
	"Субконто Кт номер 1",
	"Субконто Кт номер 2",
	"Субконто Кт номер 3",
	"Налоговое назначение затрат");	
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Добавить("СчетДт");
	ПостроительОтчета.ИзмеренияКолонки.Добавить("СчетКт");
	
	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПустаяСтруктура = Новый Структура;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Сумма", ПустаяСтруктура);	

	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;

КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок) Экспорт

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок);
	
КонецПроцедуры

#КонецЕсли

