Функция РеализацияСобрана(Заказ) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст =  
        "ВЫБРАТЬ
        |	РеализацияТоваровУслугТовары.Ссылка.Собран КАК Собран
        |ИЗ
        |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
        |ГДЕ
        |	РеализацияТоваровУслугТовары.Ссылка.Сделка.Номер = &Номер";

    Запрос.УстановитьПараметр("Номер", Заказ.Номер);
    РезультатЗапроса = Запрос.Выполнить().Выбрать();

    Если РезультатЗапроса.Следующий() Тогда
        Возврат РезультатЗапроса.Собран;
    КонецЕсли;

    // Если записи не найдено или количество строк равно нулю, возвращаем "Ложь"
    Возврат Ложь;
	
КонецФункции

Функция ПолучитьРеализациюДляСборки(Характеристика) Экспорт 
	
	Запрос = Новый Запрос;
		
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	                |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                |ГДЕ
	                |	НЕ РеализацияТоваровУслугТовары.Ссылка.Собран
	                |	И (РеализацияТоваровУслугТовары.Ссылка.ТипЦен.Код <> ""000000001""
	                |			ИЛИ РеализацияТоваровУслугТовары.Ссылка.ТипЦен.Код <> ""000000011"")
	                |	И РеализацияТоваровУслугТовары.Ссылка.Дата > &Дата
	                |	И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	РеализацияТоваровУслугТовары.Ссылка.Дата УБЫВ";
	
	
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Характеристика);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 60 * 60 * 24 * 30);

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьРеализацииДляАвтоСборки() Экспорт 
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Дата КАК Дата,
		|	РеализацияТоваровУслуг.ТипЦен КАК ТипЦен
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНач
		//|	И РеализацияТоваровУслуг.Склад.Код = &СкладКод
		|	И НЕ РеализацияТоваровУслуг.Собран
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг.Дата УБЫВ";
	
				
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()) - 2 * 30 * 24 * 60 * 60);
	//Запрос.УстановитьПараметр("СкладКод", Склад.Код);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Рез.Сортировать("Дата Возр");
	Возврат Рез;
КонецФункции

Функция ДобавитьНакладныеОтгруженныхЗаказов(Контрагент, ТабДок, Макет) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	МассивЗаказов = Документы.ЗаказПокупателя.ПолучитьЗаказыНеПолуенные(Контрагент).ВыгрузитьКолонку("Ссылка");
	
	МассивРеализацииПодЗаказов = Новый Массив;
	                                                        
	Для Каждого Заказ Из МассивЗаказов Цикл
		
		Если ЗначениеЗаполнено(Заказ.ОсновнойЗаказ)
			И ТипЗнч(Заказ.ОсновнойЗаказ) <> Тип("ДокументСсылка.ЗаказПокупателя")
			И МассивРеализацииПодЗаказов.Найти(Заказ.ОсновнойЗаказ) = Неопределено Тогда
			
			МассивРеализацииПодЗаказов.Добавить(Заказ.ОсновнойЗаказ);
		
		КонецЕсли;
		
	КонецЦикла;
	
	МассивРеализации = ПолучимРеализации(МассивРеализацииПодЗаказов, МассивЗаказов, Контрагент);   
	
	Если МассивРеализации.Количество() <> 0 Тогда  
		ОбластьМакета = Макет.ПолучитьОбласть("Дата"); 
		ОбластьМакета.Параметры.Дата = "Відвантажений, не отриманий товар"; 
		ТабДок.Вывести(ОбластьМакета);
		
		
		Для Каждого Реализация Из МассивРеализации Цикл
			ВывестиРеализациюВДокумент(ТабДок, Реализация,Макет);
			ОбластьПробел  = Макет.ПолучитьОбласть("Пробел");	
			ТабДок.Вывести(ОбластьПробел);
			
		КонецЦикла; 
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТабДок;
	
КонецФункции   

функция ПолучимРеализации(МассивРеализацииПодЗаказов, МассивЗаказов, Контрагент) 


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	(РеализацияТоваровУслуг.Ссылка В (&МассивРеализацииПодЗаказов)
		|				ИЛИ РеализацияТоваровУслуг.Сделка В (&МассивЗаказов)
		|			ИЛИ НЕ РеализацияТоваровУслуг.Собран)
		|	И РеализацияТоваровУслуг.Дата > ДАТАВРЕМЯ(2026, 1, 1, 0, 0, 0)
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка";
	
	Запрос.УстановитьПараметр("МассивРеализацииПодЗаказов", МассивРеализацииПодЗаказов);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ЕстьСкидка(Товары)
	Есть = ЛОжь;
	Для Каждого Стр Из Товары Цикл
		Если НЕ Стр.Сумма=Стр.Цена*Стр.Количество Тогда
			Есть = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Есть;
КонецФункции


Функция ВывестиРеализациюВДокумент(ТабДокумент, Реализация, Макет) 
			
    Товары =  Реализация.Товары;
	Склад = Реализация.Склад;	
	Контрагент = Реализация.Контрагент;
	Сделка = Реализация.Сделка;
	
	ТабР = ОбщегоНазначения.ТаблицаРостовок(Реализация.Товары.Выгрузить(), Склад);
	
	ОбработкаЗначенияСвойств = Обработки.ЗначенияСвойствОбъекта.Создать();
	
	ОбработкаЗначенияСвойств.НазначениеСвойств = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокРеализации");

	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.ОсновнойЗаказ = &ОсновнойЗаказ";
	
	
	Запрос.УстановитьПараметр("ОсновнойЗаказ", Реализация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПодЗаказ = Выборка.Ссылка;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПодЗаказ) Тогда 
       ПодЗаказ = Реализация.Сделка;
	КонецЕсли;
  
	
	
	Если ЗначениеЗаполнено(ПодЗаказ) Тогда 
		Если ЗначениеЗаполнено(ПодЗаказ.НомерТТН) Тогда
			ОбластьМакета.Параметры.Заголовок = ПодЗаказ.СтатусОтправки + " ТТН - " + ПодЗаказ.НомерТТН;
		Иначе 
			Если Реализация.Собран Тогда
				ОбластьМакета.Параметры.Заголовок = "Спакован";	
			Иначе
				ОбластьМакета.Параметры.Заголовок = "В черзі на пакупання";
			КонецЕсли;
		КонецЕсли;
		//ОбластьМакета.Параметры.Доставка = Сделка.Получатель + " " + Сделка.ТелефонКонтрагента ;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	//товары
	Ном=1;
	ТабТов =Товары.Выгрузить();
	НужноУдалить = Новый Массив;
	Для Каждого Стр Из ТабТов Цикл
		Если ЗначениеЗаполнено(Стр.НК) Тогда
			НужноУдалить.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Стр Из НужноУдалить Цикл
		ТабТов.Удалить(Стр);
	КонецЦикла;
	ЕстьСкидка = ЕстьСкидка(Товары); 
	Скид = 0;
	
	Если ТабТов.Количество() > 0 Тогда
		
		Если ЕстьСкидка Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТабСкидка");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаб");
		КонецЕсли;
		ОбластьМакета.Параметры.ТабЧасть = "Еденичные товары";
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабТов.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НК,Цена","Количество,Сумма");
		ТабТов.Сортировать("Номенклатура,ХарактеристикаНоменклатуры");
		
		Для Каждого Стр Из ТабТов Цикл
			
			Цвет   = "";
			Ткань  = "";
			Размер = "";
			
			ОбработкаЗначенияСвойств.ОбъектОтбораЗначений   = Стр.ХарактеристикаНоменклатуры;
			ОбработкаЗначенияСвойств.ОбъектОтбораНазначений = Стр.Номенклатура;
			
			ЗначенияСвойствОбъекта = ОбработкаЗначенияСвойств.ПрочитатьТаблицуСвойствИЗначений();
			
			Для Каждого СтрокаТЗ Из ЗначенияСвойствОбъекта Цикл
				
				Если СтрокаТЗ.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Цвет") > 0 Тогда
					
					Цвет = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Ткань") > 0 Тогда
					
					Ткань = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Размер") > 0 Тогда
					
					Размер = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ИмяОбласти = "Строка" + ?(ЕстьСкидка, "Скидка", ""); // + ?(ПустаяСтрока(Ткань), "", "Ткань")
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			ОбластьМакета.Параметры.Заполнить(Стр);
			
			ПараметрыОтбора = Новый Структура("Объект, Свойство");
			ПараметрыОтбора.Объект   = Стр.Номенклатура;
			ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000037");		
			ТипИзделия = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;	
			ОбластьМакета.Параметры.ТипИзделия = ТипИзделия;
			
			ОбластьМакета.Параметры.Цвет   = Цвет;
			ОбластьМакета.Параметры.Размер = Размер;
			
			//Если Не ПустаяСтрока(Ткань) Тогда
			//	
			//	ОбластьМакета.Параметры.Ткань = Ткань;
			//	
			//КонецЕсли;
			
			ОбластьМакета.Параметры.Ном = Ном;
			Если ЕстьСкидка Тогда
				ОбластьМакета.Параметры.Скидка = Стр.Цена*Стр.Количество-Стр.Сумма;
				Скид = Скид+ОбластьМакета.Параметры.Скидка;
			КонецЕсли;
			Ном = Ном+1;
			Если Ном/2-Цел(Ном/2) = 0 Тогда
				ОбластьМакета.Области["Область" + ИмяОбласти].ЦветФона = WebЦвета.Белый;
			Иначе
				ОбластьМакета.Области["Область" + ИмяОбласти].ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;
			
			НайденаСтрока = ТабР.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры,Количество",Стр.ХарактеристикаНоменклатуры,Стр.Количество));	
			
					
			Если Контрагент.ВыводитьВРНПодробноеОписание Тогда
				
				ПараметрыОтбора = Новый Структура("Объект, Свойство");
				
				ПараметрыОтбора.Объект   = Стр.Номенклатура;
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000037");
				
				ТипИзделия = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000056");
				
				Сезон = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000055");
				
				Пол = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ОбластьМакета.Параметры.ТипИзделия = ТипИзделия;
				ОбластьМакета.Параметры.Сезон      = Сезон;
				ОбластьМакета.Параметры.Пол        = Пол;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
						
		КонецЦикла;
		
	КонецЕсли;
	
	//товары НК
	Ном=1;
	ТабТов = Товары.Выгрузить();
	НужноУдалить = Новый Массив;
	Для Каждого Стр Из ТабТов Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НК) Тогда
			НужноУдалить.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Стр Из НужноУдалить Цикл
		ТабТов.Удалить(Стр);
	КонецЦикла;
	
	Если ТабТов.Количество() > 0 Тогда
		
		Если ЕстьСкидка ТОгда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТабСкидка");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаб");
		КонецЕсли;
		ОбластьМакета.Параметры.ТабЧасть = "Товар в ростовках";
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабТов.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НК,Цена","Количество,Сумма");
		
		Для Каждого Стр Из ТабТов Цикл
			
			Цвет   = "";
			Ткань  = "";
			Размер = "";
			
			ОбработкаЗначенияСвойств.ОбъектОтбораЗначений   = Стр.ХарактеристикаНоменклатуры;
			ОбработкаЗначенияСвойств.ОбъектОтбораНазначений = Стр.Номенклатура;
			
			ЗначенияСвойствОбъекта = ОбработкаЗначенияСвойств.ПрочитатьТаблицуСвойствИЗначений();
			
			Для Каждого СтрокаТЗ Из ЗначенияСвойствОбъекта Цикл
				
				Если СтрокаТЗ.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Цвет") > 0 Тогда
					
					Цвет = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Ткань") > 0 Тогда
					
					Ткань = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
				Если СтрНайти(СтрокаТЗ.Наименование, "Размер") > 0 и не ПустаяСтрока(СтрокаТЗ.Значение) Тогда
					
					Размер = СокрЛП(СтрокаТЗ.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ИмяОбласти = "Строка" + ?(ЕстьСкидка, "Скидка", "") + ?(ПустаяСтрока(Ткань), "", "Ткань");
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			ОбластьМакета.Параметры.Заполнить(Стр);
			
			ОбластьМакета.Параметры.Цвет   = Цвет;
			ОбластьМакета.Параметры.Размер = Размер;
						
			Если Не ПустаяСтрока(Ткань) Тогда
				
				ОбластьМакета.Параметры.Ткань = Ткань;
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.Ном = Ном;
			Если ЕстьСкидка Тогда
				ОбластьМакета.Параметры.Скидка = Стр.Цена*Стр.Количество-Стр.Сумма;
				Скид = Скид+ОбластьМакета.Параметры.Скидка;
			КонецЕсли;
			Ном = Ном+1;
			Если Ном/2-Цел(Ном/2) = 0 Тогда
				ОбластьМакета.Области["Область" + ИмяОбласти].ЦветФона = WebЦвета.Белый;
			Иначе
				ОбластьМакета.Области["Область" + ИмяОбласти].ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;
			
			НайденаСтрока = ТабР.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры,Количество",Стр.ХарактеристикаНоменклатуры,Стр.Количество));
			
			ПараметрыОтбора = Новый Структура("Объект, Свойство");
				
			ПараметрыОтбора.Объект   = Стр.Номенклатура;
			ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000037");
			
			ТипИзделия = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
			
			ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000056");
			
			Сезон = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
			
			//ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000055"); 
			//
			//Пол = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
						
			ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000055"); 
			
			Пол = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
			
			Если НайденаСтрока.Количество()>0 Тогда
				ОбластьМакета.Параметры.ТипИзделия = ТипИзделия;
				//ОбластьМакета.Параметры.Сезон = Сезон;
				//ОбластьМакета.Параметры.НоменклатурнаяГруппа = Стр.Номенклатура.НоменклатурнаяГруппа;
				
				
			//	ОбластьМакета.Параметры.Р = ОбщегоНазначения.НольФормат(НайденаСтрока[0].Р1);
			//	ОбластьМакета.Параметры.В1 = ОбщегоНазначения.НольФормат(НайденаСтрока[0].В1);
			//	ОбластьМакета.Параметры.В2 = ОбщегоНазначения.НольФормат(НайденаСтрока[0].В2);
			Иначе
			//	ОбластьМакета.Параметры.Р = "";
			//	ОбластьМакета.Параметры.В1 = "";
			//	ОбластьМакета.Параметры.В2 = "";
			КонецЕсли;
			
						
			Если Контрагент.ВыводитьВРНПодробноеОписание Тогда
				
				ПараметрыОтбора = Новый Структура("Объект, Свойство");
				
				ПараметрыОтбора.Объект   = Стр.Номенклатура;
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000037");
				
				ТипИзделия = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000056");
				
				Сезон = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ПараметрыОтбора.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000055");
				
				Пол = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(ПараметрыОтбора).Значение;
				
				ОбластьМакета.Параметры.ТипИзделия = ТипИзделия;
				ОбластьМакета.Параметры.Сезон      = Сезон;
				ОбластьМакета.Параметры.Пол        = Пол;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
				КонецЦикла;
		
	КонецЕсли;
	

	//// Вывести Сумму прописью
	//ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
	Если ЕстьСкидка Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогСкидка");
		ОбластьМакета.Параметры.Скидка = Скид;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.КолТоваров = Строка(Товары.Итог("Количество"))+"шт";
	ОбластьМакета.Параметры.Итого = Товары.Итог("Сумма");
	ТабДокумент.Вывести(ОбластьМакета);
	
	
		
	Возврат ТабДокумент;
		
	КонецФункции