Процедура ПечатьРегл (СтрокаРаботник, ТабДокумент) Экспорт
	
	Если СтрокаРаботник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СтрокаРаботник.Сотрудник;
	ФизЛицо = Сотрудник.ФизЛицо;
	Организация = СтрокаРаботник.Организация;
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.КодПоДРФО,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеРегл,
	|	РаботникиОрганизацийСрезПоследних.Должность КАК ДолжностьРегл,
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботыРегл,
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокРегл,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомерРегл,
	|   ВЫБОР
	|    КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА РаботникиОрганизацийСрезПоследних.Период
	|    ИНАЧЕ
	|     NULL
	|   КОНЕЦ КАК ДатаУвольненияРегл,
	|   ВЫБОР
	|    КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА ""Уволен""
	|    КОГДА СостояниеРаботниковОрганизацийСрезПоследних.Состояние ЕСТЬ NULL
	|     ТОГДА ""Работает""
	|    ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|   КОНЕЦ КАК СостояниеРегл
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.ФизЛицо
	|
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидНачисления,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.СпособОтраженияВБухучете
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатНачисления = Запрос.Выполнить();
	ВыборкаНачисления = РезультатНачисления.Выбрать();

   	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Организация,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель4,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта4,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель5,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта5,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель6,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта6,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.СпособОтраженияВБухучете
	|ИЗ
	|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник
	|		    И Организация = &Организация) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатУдержания = Запрос.Выполнить();
	ВыборкаУдержания = РезультатУдержания.Выбрать();

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Период,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Организация,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Налог,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Актуальность
	|ИЗ
	|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник И Организация = &Организация) КАК ВзносыВФондыРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатВзносы = Запрос.Выполнить();
	ВыборкаВзносы = РезультатВзносы.Выбрать();

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Период,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Организация,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Льгота,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Актуальность
	|ИЗ
	|	РегистрСведений.ЛьготыРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник И Организация = &Организация) КАК ЛьготыРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатЛьготы = Запрос.Выполнить();
	ВыборкаЛьготы = РезультатЛьготы.Выбрать();

	
	ТабДокумент.Очистить();
	Макет = ПолучитьМакет("ДанныеПоФизлицу");

	Если Выборка.Следующий() Тогда
		//Общее
		Область= Макет.ПолучитьОбласть("Общее");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		//Место работы
		Область= Макет.ПолучитьОбласть("МестоРаботы");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("МестоРаботыКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;	
		//Состояние
		Область= Макет.ПолучитьОбласть("СостояниеРегл");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("СостояниеРеглКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;		
	Иначе
		Возврат;
	КонецЕсли;
	
	мСведенияОВидахРасчета = Новый Соответствие;
	//Начисления
	Область= Макет.ПолучитьОбласть("НачисленияРеглШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаНачисления.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаНачисления.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("НачисленияРеглСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаНачисления.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаНачисления);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("НачисленияРеглКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Удержания
	Область= Макет.ПолучитьОбласть("УдержанияРеглШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаУдержания.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаУдержания.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("УдержанияРеглСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаУдержания.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаУдержания);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("УдержанияРеглКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		

	//Взносы
	Область= Макет.ПолучитьОбласть("ВзносыШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаВзносы.Следующий() Цикл
		Область= Макет.ПолучитьОбласть("ВзносыСтрока");
		Область.Параметры.Заполнить(ВыборкаВзносы);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("ВзносыКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Льготы
	Область= Макет.ПолучитьОбласть("ЛьготыШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаЛьготы.Следующий() Цикл
		Область= Макет.ПолучитьОбласть("ЛьготыСтрока");
		Область.Параметры.Заполнить(ВыборкаЛьготы);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("ЛьготыКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		

	
	Возврат;

	
КонецПроцедуры	

Процедура ПечатьУпр (СтрокаРаботник, ТабДокумент)Экспорт
	
	Если СтрокаРаботник = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ФизЛицо = СтрокаРаботник.ФизЛицо;
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.КодПоДРФО,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	РаботникиСрезПоследних.Подразделение КАК ПодразделениеУпр,
	|	РаботникиСрезПоследних.Должность КАК ДолжностьУпр,
	|	РаботникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботыУпр,
	|	РаботникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокУпр,
	|   ВЫБОР
	|    КОГДА РаботникиСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА РаботникиСрезПоследних.Период
	|    ИНАЧЕ
	|     NULL
	|   КОНЕЦ КАК ДатаУвольненияУпр,
	|   ВЫБОР
	|    КОГДА РаботникиСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА ""Уволен""
	|    КОГДА СостояниеРаботниковСрезПоследних.Состояние ЕСТЬ NULL
	|     ТОГДА ""Работает""
	|    ИНАЧЕ СостояниеРаботниковСрезПоследних.Состояние
	|   КОНЕЦ КАК СостояниеУпр
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК РаботникиСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = РаботникиСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК СостояниеРаботниковСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = СостояниеРаботниковСрезПоследних.ФизЛицо
	|
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидНачисления,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.СпособОтраженияВУпрУчете
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник.ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатНачисления = Запрос.Выполнить();
	ВыборкаНачисления = РезультатНачисления.Выбрать();

   Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.СпособОтраженияВУпрУчете
	|ИЗ
	|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник.ФизЛицо = &ФизЛицо) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатУдержания = Запрос.Выполнить();
	ВыборкаУдержания = РезультатУдержания.Выбрать();

	
	ТабДокумент.Очистить();
	Макет = ПолучитьМакет("ДанныеПоФизлицу");

	Если Выборка.Следующий() Тогда
		//Общее
		Область= Макет.ПолучитьОбласть("Общее");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		//Место работы
		Область= Макет.ПолучитьОбласть("МестоРаботыУпр");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("МестоРаботыупрКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;	
		//Состояние
		Область= Макет.ПолучитьОбласть("СостояниеУпр");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("СостояниеУпрКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;		
	Иначе
		Возврат;
	КонецЕсли;
	
	мСведенияОВидахРасчета = Новый Соответствие;
	
	//Начисления
	Область= Макет.ПолучитьОбласть("НачисленияУпрШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаНачисления.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаНачисления.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("НачисленияУпрСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаНачисления.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаНачисления);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("НачисленияУпрКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Удержания
	Область= Макет.ПолучитьОбласть("УдержанияУпрШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаУдержания.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаУдержания.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("УдержанияУпрСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаУдержания.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаУдержания);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("УдержанияУпрКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;

	
КонецПроцедуры	


