
// #Область СлужебныеПроцедурыИФункции

Функция ВидыОбъектовМетаданных(ИмяКоллекцииМетаданных) Экспорт
	
	ПриоритетныеОбъекты = Новый Массив;
	ПриоритетныеОбъекты.Добавить("CRM_Событие");
	ПриоритетныеОбъекты.Добавить("Событие");
	ПриоритетныеОбъекты.Добавить("CRM_ТелефонныйЗвонок");
	ПриоритетныеОбъекты.Добавить("ТелефонныйЗвонок");
	ПриоритетныеОбъекты.Добавить("ЗаказКлиента");
	ПриоритетныеОбъекты.Добавить("ЗаказПокупателя");
	ПриоритетныеОбъекты.Добавить("Партнер");
	ПриоритетныеОбъекты.Добавить("Контрагент");
	
	//ТипыОбъектов = Новый Массив;
	//ТипыОбъектов.Добавить("Справочники");
	//ТипыОбъектов.Добавить("Документы");
	
	тзМетаданные = Новый ТаблицаЗначений;
	тзМетаданные.Колонки.Добавить("ПолноеИмя");
	тзМетаданные.Колонки.Добавить("Представление");
	тзМетаданные.Колонки.Добавить("Пометка");
	тзМетаданные.Колонки.Добавить("Картинка");
	
	КартинкаСтрок = БиблиотекаКартинок[ИмяКоллекцииМетаданных];
	КоллекцияОбъектовМетаданных = КоллекцияМетаданных(ИмяКоллекцииМетаданных);
	
	Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
		
		НоваяСтрока = тзМетаданные.Добавить();
		НоваяСтрока.ПолноеИмя     = ОбъектМетаданных.Имя;
		НоваяСтрока.Представление = ОбъектМетаданных.Представление();
		НоваяСтрока.Пометка       = (ПриоритетныеОбъекты.Найти(ОбъектМетаданных.Имя) <> Неопределено);
		НоваяСтрока.Картинка      = КартинкаСтрок;
		
	КонецЦикла;
	
	тзМетаданные.Сортировать("Пометка Убыв, Представление Возр");
	Результат = Новый СписокЗначений;
	
	Для Каждого СтрокаТЗ Из тзМетаданные Цикл
		
		Результат.Добавить(СтрокаТЗ.ПолноеИмя, СтрокаТЗ.Представление, СтрокаТЗ.Пометка, СтрокаТЗ.Картинка);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВидыОбъектовМетаданных()

Функция РеквизитыОбъектаМетаданных(ИмяКоллекцииМетаданных, ВидОбъекта) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Имя");
	Результат.Колонки.Добавить("Тип");
	Результат.Колонки.Добавить("Представление");
	
	КоллекцияОбъектовМетаданных = КоллекцияМетаданных(ИмяКоллекцииМетаданных);
	МетаданныеОбъекта  = КоллекцияОбъектовМетаданных[ВидОбъекта];
	
	ВсеРеквизитыОбъекта = РеквизитыОбъекта(МетаданныеОбъекта);
	
	Для Каждого Реквизит Из ВсеРеквизитыОбъекта Цикл
		
		СтрокаРеквизита = Результат.Добавить();
		СтрокаРеквизита.Имя = Реквизит.Имя;
		СтрокаРеквизита.Тип = Реквизит.Тип;
		СтрокаРеквизита.Представление = Реквизит.Представление();
		//ЗаполнитьОписаниеРеквизита(СтрокаРеквизита, Реквизит.Имя, Реквизит.Имя, Реквизит.Тип);
		
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		ВсеРеквизитыТабличнойЧасти = РеквизитыТабличнойЧасти(МетаданныеОбъекта, ТабличнаяЧасть.Имя);
		
		Для Каждого Реквизит Из ВсеРеквизитыТабличнойЧасти Цикл
			
			СтрокаРеквизита = Результат.Добавить();
			СтрокаРеквизита.Имя = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			СтрокаРеквизита.Тип = Реквизит.Тип;
			СтрокаРеквизита.Представление = ТабличнаяЧасть.Представление() + "." + Реквизит.Представление();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // РеквизитыОбъектаМетаданных()

Функция КоллекцияМетаданных(ИмяКоллекцииМетаданных)
	
	Если ИмяКоллекцииМетаданных = "Справочник" Тогда
		Возврат Метаданные.Справочники;
	ИначеЕсли ИмяКоллекцииМетаданных = "Документ" Тогда
		Возврат Метаданные.Документы;
	Иначе
		ВызватьИсключение "Параметр (" + ИмяКоллекцииМетаданных + ") имеет недопустимое значение";
	КонецЕсли;
	
КонецФункции

// Формирует общий список всех реквизитов объекта.
// 
Функция РеквизитыОбъекта(МетаданныеОбъекта)
	
	РеквизитыОбъекта = Новый Массив;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		РеквизитыОбъекта.Добавить(Реквизит);
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		РеквизитыОбъекта.Добавить(Реквизит);
	КонецЦикла;
	
	Возврат РеквизитыОбъекта;
	
КонецФункции // РеквизитыОбъекта()

Функция РеквизитыТабличнойЧасти(МетаданныеОбъекта, ТабличнаяЧасть)
	
	МетаданныеТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти[ТабличнаяЧасть];
	
	РеквизитыТабличнойЧасти = Новый Массив;
	
	Для Каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
		РеквизитыТабличнойЧасти.Добавить(Реквизит);
	КонецЦикла;
	
	Возврат РеквизитыТабличнойЧасти;
	
КонецФункции // РеквизитыТабличнойЧасти()

Процедура УстановитьПараметрыОтбора(КомпоновщикНастроекКомпоновкиДанных, ПараметрыОтбора) Экспорт
	
	Если Не ПустаяСтрока(ПараметрыОтбора) Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ПараметрыОтбора);
		МассивЭлементовОтбора = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		
		Отбор = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из МассивЭлементовОтбора Цикл
			ЗаполнитьЗначенияСвойств(Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")), ЭлементОтбора);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

// #КонецОбласти