
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок
	 Или ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок Тогда
	
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("ВидОбъекта");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);	
		КонецЕсли;
		
	ИначеЕсли ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Справочник Тогда
	
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("СрокДействия");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);	
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры
