Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и нал. соответственно
// в случае если документ НЕ отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)

Перем ВестиУчетПоДопРазрезамРегл;
Перем ВестиСкладскойУчетБУ;

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета(СтруктураШапкиДокумента) Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл(СтруктураШапкиДокумента);

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл(СтруктураШапкиДокумента)

	мСтрокаРеквизитыБухУчета =  "СтоимостьБУ,
								|СчетУчетаБУВнеоборотногоАктива,
								|ОС.ИнвентарныйНомер,
								|МОЛБУ,
								|ПодразделениеОрганизации,
								|СпособНачисленияАмортизацииБУ,
								|ПараметрВыработкиБУ,
								|ПредполагаемыйОбъемПродукцииБУ,
								|СрокПолезногоИспользованияБУ,
								|СчетУчетаБУ,
								|СчетНачисленияАмортизацииБУ,
								|ЛиквидационнаяСтоимостьБУ,
								|СубконтоБУ1,
								|СубконтоБУ2,
								|СубконтоБУ3,
								|НачислятьАмортизациюБУ
								|";

								
		
КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

#Если Клиент Тогда

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТекДата",        МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	Запрос.УстановитьПараметр("Сдал", 			Сдал);
	Запрос.УстановитьПараметр("Принял", 		Принял);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата                           КАК ДатаАкта,
	|	Док.Номер                          КАК НомерАкта,
	|	Док.МОЛБУ.Код 				       КАК КодМОЛа,
	|	Док.Организация.НаименованиеПолное КАК Организация,
	|	Док.ПодразделениеОрганизации       КАК ПринялоПодразделение,
	|	Док.Дата                           КАК ДатаВвода,
	|	Док.СчетУчетаБУ					   КАК СчетДт,
	|	Док.СчетУчетаБУВнеоборотногоАктива КАК СчетКт,
	|	КодыОрганизации.КодПоЕДРПОУ        КАК ЕДРПОУ,
	|	ФИОСдал.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОСдал.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОСдал.Отчество, 1, 1) + "".""               КАК СдалФИО,
	|	ФИОПринял.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОПринял.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОПринял.Отчество, 1, 1) + "".""             КАК ПолучилФИО,
	|	ДолжностьСдал.Должность                                       КАК СдалДолжность,
	|	ДолжностьПринял.Должность                                     КАК ПолучилДолжность
	|ИЗ
	|	Документ.ВводВЭксплуатациюОС КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&ТекДата,
	|		                                 Организация = &ТекОрганизация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И Сотрудник.Физлицо = &Сдал) КАК ДолжностьСдал
	|		ПО Док.Организация = ДолжностьСдал.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &ТекДата,
	|		                    Организация = &ТекОрганизация
	|		                    И Сотрудник.Физлицо = &Принял) КАК ДолжностьПринял
	|		ПО Док.Организация = ДолжностьПринял.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &ТекДата,
	|			                ФизЛицо = &Сдал) КАК ФИОСдал
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &ТекДата,
	|			                ФизЛицо = &Принял) КАК ФИОПринял
	|		ПО (ИСТИНА)
	|ГДЕ 
	|	Док.Ссылка = &Ссылка
	|	";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

													
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если Проведен Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведения.ИнвентарныйНомер                    КАК ИнвентарныйНомер,
		|	ПервоначальныеСведения.ПервоначальнаяСтоимость             КАК ПервоначальнаяСтоимость,
		|	ПервоначальныеСведения.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПервоначальныеСведения.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
		|	ПервоначальныеСведения.ОсновноеСредство.ДатаВыпуска        КАК ГодВыпуска,
		|	ПервоначальныеСведения.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведения
		|
		|ГДЕ
		|	ПервоначальныеСведения.Регистратор = &Ссылка";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведения.ИнвентарныйНомер                    КАК ИнвентарныйНомер,
		|	ПервоначальныеСведения.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПервоначальныеСведения.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
		|	ПервоначальныеСведения.ОсновноеСредство.ДатаВыпуска        КАК ГодВыпуска,
		|	ПервоначальныеСведения.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта
		|ИЗ
		|	Документ.ВводВЭксплуатациюОС.ОС КАК ПервоначальныеСведения
		|
		|ГДЕ
		|	ПервоначальныеСведения.Ссылка = &Ссылка";
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ВыборкаПоОС = Результат.Выбрать();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводВЭксплуатациюОС_ОЗ1";
	Макет = ПолучитьОбщийМакет("ОЗ1");
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
    ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Пока ВыборкаПоОС.Следующий() Цикл

		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(ВыборкаПоШапке);
		Параметры.Заполнить(ВыборкаПоКомиссии);
		Параметры.Заполнить(ВыборкаПоОС);
		Параметры.ВидОперации = "Введення в експлуатацію";
		Параметры.Валюта      = ВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	ТабДокумент.ОбластьПечати = ТабДокумент.Область(2, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если ИмяМакета = "ОЗ1" Тогда
		
		ТабДокумент = ПечатьОЗ1();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, "Ввод в эксплуатацию основных средств"), Ссылка);
	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ОЗ1","Форма ОЗ-1");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Устанавливает СчетНачисленияАмортизацииБУ 
// по значению СчетУчетаБУ 
// или по значению СчетУчетаБУВнеоборотногоАктива
//
Процедура УстановитьСчетАмортизации() Экспорт
	
	ПланХозрасчетный = ПланыСчетов.Хозрасчетный;
	
	Счет10   = ПланХозрасчетный.ОсновныеСредства;
	Счет11   = ПланХозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа;
	Счет13   = ПланХозрасчетный.ИзносАмортизацияНеоборотныхАктивов;
	Счет131  = ПланХозрасчетный.ИзносОсновныхСредств;
	Счет132  = ПланХозрасчетный.ИзносДругихНеоборотныхМатериальныхАктивов;
	Счет1321 = ПланХозрасчетный.ИзносДругихНеоборотныхМатериальныхАктивовИндивидуально;
	Счет1322 = ПланХозрасчетный.ИзносДругихНеоборотныхМатериальныхАктивовКоличественно;
	Счет151  = ПланХозрасчетный.КапитальноеСтроительство;
	Счет152  = ПланХозрасчетный.ПриобретениеИзготовлениеОсновныхСредств;
	Счет153  = ПланХозрасчетный.ПриобретениеИзготовлениеДругихНеоборотныхМатериальныхАктивов;
	
	Если ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		
		Если СчетУчетаБУ.ПринадлежитЭлементу(Счет10) Тогда
			
			Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ)
				ИЛИ (НЕ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет13))
				ИЛИ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет132) Тогда
				
				СчетНачисленияАмортизацииБУ = Счет131;
				
			КонецЕсли;
			
		ИначеЕсли СчетУчетаБУ.ПринадлежитЭлементу(Счет11) Тогда
			
			Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ)
				ИЛИ (НЕ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет132))
				ИЛИ СчетНачисленияАмортизацииБУ = (Счет1322) Тогда
				
				СчетНачисленияАмортизацииБУ = Счет1321;
				
			КонецЕсли;                                                   
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СчетУчетаБУВнеоборотногоАктива) Тогда
		
		Если СчетУчетаБУВнеоборотногоАктива.ПринадлежитЭлементу(Счет152)
			ИЛИ СчетУчетаБУВнеоборотногоАктива = Счет151 Тогда
			
			Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ)
				ИЛИ (НЕ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет13))
				ИЛИ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет132) Тогда
				
				СчетНачисленияАмортизацииБУ = Счет131;
				
			КонецЕсли;
			
		ИначеЕсли СчетУчетаБУВнеоборотногоАктива.ПринадлежитЭлементу(Счет153) Тогда
			
			Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизацииБУ)
				ИЛИ (НЕ СчетНачисленияАмортизацииБУ.ПринадлежитЭлементу(Счет132))
				ИЛИ СчетНачисленияАмортизацииБУ = (Счет1322) Тогда
				
				СчетНачисленияАмортизацииБУ = Счет1321;
				
			КонецЕсли;                                                   
			
		КонецЕсли;
		
	КонецЕсли;
		

КонецПроцедуры // УстановитьСчетАмортизации()

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Формирует таблицу по шапке и табличной части и добавляет необходимые колонки для проведения.
//
Функция ПодготовитьТаблицуОС(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НомерСтроки                                         КАК НомерСтроки,
	|	&ПустойДоговор                                          КАК ДоговорКонтрагента,
	|	Док.Ссылка.ОтражатьВУправленческомУчете                 КАК ОтражатьВУправленческомУчете,
	|	Док.Ссылка.Склад                                        КАК Склад,
	|	Док.Ссылка.Номенклатура                                 КАК Номенклатура,
	|	Док.Ссылка.ХарактеристикаНоменклатуры					КАК ХарактеристикаНоменклатуры,
	|	Док.Ссылка.СерияНоменклатуры                            КАК СерияНоменклатуры,
	|	Док.Ссылка.Организация                                  КАК Организация,
	|	Док.Ссылка.Подразделение                                КАК Подразделение,
	|	Док.Ссылка.Номенклатура.Услуга                          КАК Услуга,
	|	Док.ОсновноеСредство                                    КАК ОсновноеСредство,
	|	Док.ИнвентарныйНомер                                    КАК ИнвентарныйНомер,
	|	1                                                       КАК Количество,
	|	Док.Ссылка.СчетУчетаБУВнеоборотногоАктива               КАК СчетУчетаБУ,
	|	Док.Ссылка.СчетУчетаБУ                                  КАК КорСчетСписанияБУ,
	|	Док.ОсновноеСредство                                    КАК КорСубконтоСписанияБУ1,
	|	&НомерЖурнала                                           КАК НомерЖурналаБУ,
	|	НЕОПРЕДЕЛЕНО                                            КАК ДокументОприходования,
	|	Док.Ссылка.НалоговоеНазначениеОборудования              КАК НалоговоеНазначение,
	|	Док.Ссылка.НалоговоеНазначение                          КАК НалоговоеНазначениеНовое
	|ИЗ
	|	Документ.ВводВЭксплуатациюОС.ОС КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка"       , СтруктураШапкиДокумента.Ссылка );
	Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("НомерЖурнала" , "ОС");
	
	Результат = Запрос.Выполнить();
	ТаблицаПоОС = Результат.Выгрузить();
	ТаблицаПоОС.Колонки.Добавить("Регистратор");
	ТаблицаПоОС.ЗаполнитьЗначения(ЭтотОбъект, "Регистратор");
	ТаблицаПоОС.Колонки.Добавить("СчетДоходовБУ");
	
	Возврат ТаблицаПоОС;

КонецФункции // ПодготовитьТаблицуОС()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение НЕ заполнен или
// заполнен НЕ корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, СобытиеОС";
	
	Если ОтражатьВУправленческомУчете Тогда
		 ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
		                             + ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ")
		 							 + "Подразделение, МОЛБУ";
	КонецЕсли;	
		
	Если ОтражатьВБухгалтерскомУчете Тогда
		 ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
		                             + ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ")
		 							 + "ПодразделениеОрганизации, МОЛБУ, СчетУчетаБУ, СчетНачисленияАмортизацииБУ";
	КонецЕсли;	
								 
	ПредставлениеНалоговогоНазначения = "Налоговое назначение";
	ПредставлениеНалоговогоНазначенияОборудования = "Налоговое назначение оборудования";

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
		                             + ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ")
									 + "ОбъектСтроительства";
									 
		ПредставлениеНалоговогоНазначения = "Налоговое назначение объекта строительства";
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
		                             + ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ") 
									 + "Номенклатура, Склад";
									 
	Иначе
		
		Если ОтражатьВУправленческомУчете Тогда
			ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
											+ ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ") 
											+ "СтоимостьУУ";
		КонецЕсли;	
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
											+ ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ") 
											+ "СтоимостьБУ";
		КонецЕсли;	
		
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ПоРезультатамИнвентаризации Тогда
		
		Если НЕ ЗначениеЗаполнено(СчетУчетаБУВнеоборотногоАктива) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("Не выбран счет доходов.", Отказ, Заголовок);
			
		КонецЕсли;
		
	Иначе
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки 
		                             + ?(ПустаяСтрока(ОбязательныеРеквизитыШапки), "", ", ") 
									 + "СчетУчетаБУВнеоборотногоАктива";
									 
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			
		КонецЕсли;
	
	КонецЕсли;
	
	//Проверка заполнения параметров амортизации              
	Если НачислятьАмортизациюБУ Тогда
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", СпособНачисленияАмортизацииБУ";
		
		Если (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.Производственный) Тогда
			
			ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", ПараметрВыработкиБУ, ПредполагаемыйОбъемПродукцииБУ";
			
		КонецЕсли;
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", НалоговаяГруппаОС";
		
		Если  (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.Прямолинейный)
			или (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.Кумулятивный)
			или (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.УменьшенияОстатка)
			или (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.УскоренногоУменьшенияОстатка) Тогда
			
			ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", СрокПолезногоИспользованияБУ";
			
			Если (СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС.УменьшенияОстатка) Тогда
				
				Если ОтражатьВУправленческомУчете Тогда
					ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", ЛиквидационнаяСтоимостьУУ";
				КонецЕсли;	
				
				Если ОтражатьВБухгалтерскомУчете Тогда
					ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", ЛиквидационнаяСтоимостьБУ";
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", СпособыОтраженияРасходовПоАмортизации";
		
	КонецЕсли;

	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение", ПредставлениеНалоговогоНазначения);
		
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеОборудования", ПредставлениеНалоговогоНазначенияОборудования);
		КонецЕсли;	
		
	КонецЕсли;
	

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	ПроверитьЗаполнениеШапкиУпр(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда
		РеквизитАналитики = ОбъектСтроительства.НалоговоеНазначение;
		ОбъектУчетаКт = ОбъектСтроительства;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		РеквизитАналитики = НалоговоеНазначениеОборудования;
		ОбъектУчетаКт = Номенклатура;
	Иначе	
		РеквизитАналитики = НалоговоеНазначениеОборудования;
		ОбъектУчетаКт = Номенклатура;
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.ЕстьНДС Тогда
		УправлениеВнеоборотнымиАктивами.ПроверитьСоответствиеНалоговогоНазначенияОбъектов(ОбъектУчетаКт, Неопределено, РеквизитАналитики, НалоговоеНазначение, Отказ, Заголовок);
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль И СтруктураШапкиДокумента.НачислятьАмортизациюБУ И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		УправлениеВнеоборотнымиАктивами.ПроверитьСоответствиеНалоговогоНазначенияАмортизацииОбъекта(Номенклатура, СпособыОтраженияРасходовПоАмортизации, НалоговоеНазначение, Отказ, Заголовок, Дата);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения упр. реквизитов шапки
Процедура ПроверитьЗаполнениеШапкиУпр(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда
			
			ВыборкаЗаписей = РегистрыНакопления.СтроительствоОбъектовОсновныхСредств.Остатки(Дата,Новый Структура("ОбъектСтроительства",СтруктураШапкиДокумента.ОбъектСтроительства));

			Если ВыборкаЗаписей.Количество() > 0 Тогда;
				ТекущийОстаток = ВыборкаЗаписей[0].Сумма;
			Иначе
				ТекущийОстаток =0;
			КонецЕсли;

			Если ТекущийОстаток < СтруктураШапкиДокумента.СтоимостьУУ Тогда

				ОбщегоНазначения.СообщитьОбОшибке("Стоимость основного средства превышает стоимость объекта строительства
				| "+СтруктураШапкиДокумента.ОбъектСтроительства.Наименование+".
				|Стоимость объекта строительства: "+Формат(ТекущийОстаток,"ЧЦ=15; ЧДЦ=2")+" "+глЗначениеПеременной("ВалютаУправленческогоУчета"), Отказ, Заголовок);

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабОС = "ОсновноеСредство,ИнвентарныйНомер"; //через запятую

	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура(РеквизитыТабОС), Отказ, Заголовок);

КонецПроцедуры // ПроверкаРеквизитов()

// Процедура формирования движений регистров
//
Процедура ФормированиеДвижений(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		
		ФормированиеДвиженийПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ);
		
	КонецЕсли;

 	ФормированиеДвиженийУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	ФормированиеДвиженийРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	
КонецПроцедуры // ФормированиеДвижений()

Процедура ФормированиеДвиженийПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НомСтр   = 0;
	ДатаДока = Дата;

	Для каждого Строка Из ТаблицаПоОС Цикл

		НомСтр = НомСтр + 1;

		Движение = Движения.СписанныеТовары.Добавить();

		Движение.Период                     = ДатаДока;
		Движение.НомерСтрокиДокумента       = НомСтр;
		Движение.Регистратор                = Ссылка;
		Движение.Номенклатура               = СтруктураШапкиДокумента.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = СтруктураШапкиДокумента.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры          = СтруктураШапкиДокумента.СерияНоменклатуры;
		Движение.Количество                 = 1;
		Движение.Качество                   = Справочники.Качество.Новый;
		Движение.Склад                      = СтруктураШапкиДокумента.Склад;
		Движение.КодОперацииПартииТоваров 	= Перечисления.КодыОперацийПартииТоваров.ПринятиеКУчетуОС;

		Движение.ДопустимыйСтатус1            = Перечисления.СтатусыПартийТоваров.Оборудование;
		Движение.ОтражатьВУправленческомУчете = СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
		
		Движение.Подразделение             	= Строка.Подразделение;
		
		Движение.ОсновноеСредство           = Строка.ОсновноеСредство;
		
	КонецЦикла;

	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;

	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

КонецПроцедуры


// Процедура формирования движений регл. регистров
//
Процедура ФормированиеДвиженийРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		ЕстьНалогНаПрибыль = СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль;
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, ТаблицаПоОС, , Ложь, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, , , Отказ, , "Ввод в эксплуатацию объекта ОС");
	КонецЕсли;
	
	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;

	ТЗДанныеОС = Новый ТаблицаЗначений;
	ТЗДанныеОС.Колонки.Добавить("ОбъектУчета");
	ТЗДанныеОС.Колонки.Добавить("Сумма",    ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТЗДанныеОС.Колонки.Добавить("СуммаНУ", 	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
              
	ПроводкиБУ = Движения.Хозрасчетный;

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		
		НаборДвижений = Движения.ТоварыОрганизаций;
			
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
		// Заполним таблицу движений.
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Организация 					= ТекОрганизация;
		СтрокаДвижений.Номенклатура 				= СтруктураШапкиДокумента.Номенклатура;
		СтрокаДвижений.Количество 					= ТаблицаПоОС.Количество();
		СтрокаДвижений.СчетУчетаБУ                  = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
			
		Если ВестиУчетПоДопРазрезамРегл Тогда
			СтрокаДвижений.ХарактеристикаНоменклатуры = СтруктураШапкиДокумента.ХарактеристикаНоменклатуры;
			СтрокаДвижений.СерияНоменклатуры 		  = СтруктураШапкиДокумента.СерияНоменклатуры;
			СтрокаДвижений.Качество 				  = Справочники.Качество.Новый;
		КонецЕсли;
		
		Если ВестиСкладскойУчетБУ Тогда
			СтрокаДвижений.Склад                      = СтруктураШапкиДокумента.Склад;
		КонецЕсли;
			
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		// Проверка осатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатковПоШапке(ЭтотОбъект, СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движения.ТоварыОрганизаций.ВыполнитьРасход();
		Иначе
			Возврат;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из ТаблицаПоОС Цикл
			
			НоваяСтрока = ТЗДанныеОС.Добавить();
			
			НоваяСтрока.ОбъектУчета = СтрокаТаблицы.ОсновноеСредство;
			НоваяСтрока.Сумма       = СтрокаТаблицы.СписанныеПартииБУ.Итог("СуммаСписания");
			НоваяСтрока.СуммаНУ     = СтрокаТаблицы.СписанныеПартииБУ.Итог("СуммаСписанияНУ");
			
		КонецЦикла;

	Иначе //ОбъектыСтроительства или ПоРезультатамИнвентаризации

		ПогрешностьСтоимостиОС = 0;
		ПогрешностьСтоимостиОСНУ = 0;

		Если ТаблицаПоОС.Количество() > 0 Тогда
			Коэф = 1 / ТаблицаПоОС.Количество();
		Иначе
			Коэф = 0;
		КонецЕсли;
		
		//Заполним таблицу значений для проведения по регистрам, не зависящим от вида операции
		Для Каждого Строка Из ТаблицаПоОС Цикл
			
			ТекОС 			= Строка.ОсновноеСредство;
			ТекСтоимостьБУ	= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтруктураШапкиДокумента.СтоимостьБУ * Коэф, 2, ПогрешностьСтоимостиОС);
			ТекСтоимостьНУ	= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтруктураШапкиДокумента.СтоимостьНУ * Коэф, 2, ПогрешностьСтоимостиОСНУ);
			
			НоваяСтрока = ТЗДанныеОС.Добавить();
			НоваяСтрока.ОбъектУчета = ТекОС;
			НоваяСтрока.Сумма       = ТекСтоимостьБУ;
			НоваяСтрока.СуммаНУ     = ТекСтоимостьНУ;
			
		КонецЦикла;

	КонецЕсли;

	ГрафикиАмортизации       = Движения.ГрафикиАмортизацииОСБухгалтерскийУчет;
	МестонахождениеОС        = Движения.МестонахождениеОСБухгалтерскийУчет;
	НаправлениеАмортизации   = Движения.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет;
	НачислениеАмортизации    = Движения.НачислениеАмортизацииОСБухгалтерскийУчет;
	ПервоначальныеСведения   = Движения.ПервоначальныеСведенияОСБухгалтерскийУчет;
	ПервоначальныеСведенияНУ = Движения.ПервоначальныеСведенияОСНалоговыйУчет;
	ПараметрыАмортизации     = Движения.ПараметрыАмортизацииОСБухгалтерскийУчет;
	СостояниеОС              = Движения.СостоянияОСОрганизаций;
	ОперацииОС               = Движения.СобытияОСОрганизаций;
	СчетаУчетаОС             = Движения.СчетаБухгалтерскогоУчетаОС;

	НачислениеАмортизацииНУ  = Движения.НачислениеАмортизацииОСНалоговыйУчет;
	ПараметрыАмортизацииНУ   = Движения.ПараметрыАмортизацииОСНалоговыйУчет;

	НалоговыеНазначенияОС  	 = Движения.НалоговыеНазначенияОС;
	
	ВидНалоговойДеятельностиНеОблагаемая = Справочники.ВидыНалоговойДеятельности.НеОблагаемая; 
	НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
	
	Для Каждого Строка Из ТЗДанныеОС Цикл

		ТекОС = Строка.ОбъектУчета;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда

			Если Строка.Сумма > 0 Тогда

				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период       = ДатаДока;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.НомерЖурнала = "ОС";
				Проводка.Содержание   = "Введен в эксплуатацию объект ОС";
				Проводка.Сумма        = Строка.Сумма;

					Проводка.НалоговоеНазначениеДт  = СтруктураШапкиДокумента.НалоговоеНазначение;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
				    Проводка.СуммаНУДт 				= Строка.СуммаНУ;
					
				КонецЕсли;
				
				Проводка.СчетДт       = СтруктураШапкиДокумента.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ТекОС);

				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
					
					Проводка.НалоговоеНазначениеКт  = СтруктураШапкиДокумента.ОбъектСтроительства.НалоговоеНазначение;
					
				Иначе	
					Проводка.НалоговоеНазначениеКт  = НеОблНДСДеятельность;
					
				КонецЕсли;	
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
				    Проводка.СуммаНУКт 				= Строка.СуммаНУ;
					
				КонецЕсли;
				
				Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства", СтруктураШапкиДокумента.ОбъектСтроительства);

			КонецЕсли;
			
		ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
			
			//Проводка сформирована движениями по партиям
			
		ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ПоРезультатамИнвентаризации Тогда

			Если Строка.Сумма > 0 Тогда

				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период       = ДатаДока;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.НомерЖурнала = "ОС";
				Проводка.Содержание   = "Принят к учету объект ОС";
				Проводка.Сумма        = Строка.Сумма;

				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
					
					Проводка.НалоговоеНазначениеДт  = СтруктураШапкиДокумента.НалоговоеНазначение;
					
				КонецЕсли;	
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
				    Проводка.СуммаНУДт 				= Строка.СуммаНУ;
					
				КонецЕсли;
				
				Проводка.СчетДт       = СтруктураШапкиДокумента.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ТекОС);

				Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоБУ1);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоБУ2);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоБУ3);

			КонецЕсли;
			
		КонецЕсли;
		
		// Движения по регистру ПервоначальныеСведенияОбОсновныхСредствах
		Движение = ПервоначальныеСведения.Добавить();
		Движение.Период                      = ДатаДока;
		Движение.ОсновноеСредство            = ТекОС;
		Движение.Организация                 = ТекОрганизация;
		Движение.ПервоначальнаяСтоимость     = Строка.Сумма;
		Движение.СпособНачисленияАмортизации = СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ;
		ТекСтрокаОС = ТаблицаПоОС.Найти(ТекОС, "ОсновноеСредство");
		Движение.ИнвентарныйНомер            = ?(ТекСтрокаОС = Неопределено, Неопределено, ТекСтрокаОС.ИнвентарныйНомер);
		Движение.ПараметрВыработки           = СтруктураШапкиДокумента.ПараметрВыработкиБУ;
		
		// Движения по регистру МестонахождениеОсновныхСредств
		Движение = МестонахождениеОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Организация          = ТекОрганизация;
		Движение.Местонахождение      = СтруктураШапкиДокумента.ПодразделениеОрганизации;
		Движение.МОЛ                  = СтруктураШапкиДокумента.МОЛБУ;

		// Движения по регистру НачислениеАмортизации
		Движение = НачислениеАмортизации.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Организация          = ТекОрганизация;
		Движение.НачислятьАмортизацию = СтруктураШапкиДокумента.НачислятьАмортизациюБУ;
		
		Производственное = СтруктураШапкиДокумента.НалоговоеНазначение.ВидНалоговойДеятельности <> ВидНалоговойДеятельностиНеОблагаемая;
		// Движения по регистру НачислениеАмортизацииНУ
		Движение = НачислениеАмортизацииНУ.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Организация          = ТекОрганизация;
		Движение.НачислятьАмортизацию = СтруктураШапкиДокумента.НачислятьАмортизациюБУ И Производственное;
		
		// Движения по регистру СостоянияОСОрганизаций
		Движение = СостояниеОС.Добавить();
		Движение.ДатаСостояния        = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Организация          = ТекОрганизация;
		Движение.Состояние            = Перечисления.СостоянияОС.ВведеноВЭксплуатацию;
		Движение.НазваниеДокумента    = Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента       = СтруктураШапкиДокумента.Номер;

		// Движения по регистру СобытияОСОрганизаций
		Движение = ОперацииОС.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = ТекОС;
		Движение.Организация       = ТекОрганизация;
		Движение.Событие           = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента = Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента    = СтруктураШапкиДокумента.Номер;

		// Движения по регистру СчетаБухгалтерскогоУчетаОС
		Движение = СчетаУчетаОС.Добавить();
		Движение.Период                    = ДатаДока;
		Движение.ОсновноеСредство          = ТекОС;
		Движение.Организация               = ТекОрганизация;
		Движение.СчетУчета                 = СтруктураШапкиДокумента.СчетУчетаБУ;
		Движение.СчетНачисленияАмортизации = СтруктураШапкиДокумента.СчетНачисленияАмортизацииБУ;
		Движение.СчетУчетаДооценокОС         = СтруктураШапкиДокумента.СчетУчетаДооценокОС;
		
		// Движения по регистру ГрафикиАмортизации
		Движение = ГрафикиАмортизации.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = ТекОС;
		Движение.Организация       = ТекОрганизация;
		Движение.ГрафикАмортизации = СтруктураШапкиДокумента.ГрафикАмортизацииПоГодуБУ;
		
		// Движения по регистру СпособыОтраженияРасходовПоАмортизации
		Движение = НаправлениеАмортизации.Добавить();
		Движение.Период                                = ДатаДока;
		Движение.ОсновноеСредство                      = ТекОС;
		Движение.Организация                           = ТекОрганизация;
		Движение.СпособыОтраженияРасходовПоАмортизации = СтруктураШапкиДокумента.СпособыОтраженияРасходовПоАмортизации;
		
		// Движения по регистру ПараметрыАмортизации
		Движение = ПараметрыАмортизации.Добавить();
		Движение.Период                                      = ДатаДока;
		Движение.ОсновноеСредство                            = ТекОС;
		Движение.Организация                                 = ТекОрганизация;
		Движение.ОбъемПродукцииРабот                         = СтруктураШапкиДокумента.ПредполагаемыйОбъемПродукцииБУ;
		Движение.ЛиквидационнаяСтоимость                     = СтруктураШапкиДокумента.ЛиквидационнаяСтоимостьБУ;
		Движение.СрокПолезногоИспользования                  = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
		Движение.СрокИспользованияДляВычисленияАмортизации   = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
		Движение.СтоимостьДляВычисленияАмортизации           = Строка.Сумма;
		Движение.ОбъемПродукцииРаботДляВычисленияАмортизации = СтруктураШапкиДокумента.ПредполагаемыйОбъемПродукцииБУ;
		
		// Движения по регистру ПараметрыАмортизацииНУ
		Движение = ПараметрыАмортизацииНУ.Добавить();
		Движение.Период                                      = ДатаДока;
		Движение.ОсновноеСредство                            = ТекОС;
		Движение.Организация                                 = ТекОрганизация;
		Движение.СрокПолезногоИспользования                  = СтруктураШапкиДокумента.СрокПолезногоИспользованияНУ;
		Движение.СрокИспользованияДляВычисленияАмортизации   = СтруктураШапкиДокумента.СрокПолезногоИспользованияНУ;
		Если СтруктураШапкиДокумента.НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда 
			Движение.СтоимостьДляВычисленияАмортизации           = Строка.СуммаНУ;
		КонецЕсли;	
		
		// Движения по регистру ПервоначальныеСведенияОСНалоговыйУчет
		Движение = ПервоначальныеСведенияНУ.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = ТекОС;
		Движение.Организация       = ТекОрганизация;
		Движение.ПервоначальнаяСтоимостьНУ 	= Строка.СуммаНУ;
		Движение.НалоговаяГруппаОС = СтруктураШапкиДокумента.НалоговаяГруппаОС;
		                                                                                    
		// Движения по регистру НалоговыеНазначенияОС
		Движение = НалоговыеНазначенияОС.Добавить();
		Движение.Период				 = ДатаДока;
		Движение.Организация		 = ТекОрганизация;
		Движение.ОсновноеСредство	 = ТекОС;
		Движение.НалоговоеНазначение = СтруктураШапкиДокумента.НалоговоеНазначение;

	КонецЦикла;

	// Списание при принятии к учету (БУ)
	Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._100
		 ИЛИ СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
		 
		Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
			
			Для каждого Строка Из ТЗДанныеОС Цикл
			
				Строка.Сумма = Строка.Сумма / 2;	
				Строка.СуммаНУ 	= Строка.СуммаНУ / 2;	
			
			КонецЦикла;
			
		КонецЕсли; 
		 
		НаправлениеСписания = СтруктураШапкиДокумента.СпособыОтраженияРасходовПоАмортизации;
		
		ТЗДанныеОС.Колонки.Добавить("НаправлениеАмортизации");
		ТЗДанныеОС.ЗаполнитьЗначения(НаправлениеСписания, "НаправлениеАмортизации");
		ТЗДанныеОС.Колонки.Добавить("СчетАмортизации");
		ТЗДанныеОС.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетНачисленияАмортизацииБУ, "СчетАмортизации");
		ТЗДанныеОС.Колонки.Добавить("НалоговоеНазначение");
		ТЗДанныеОС.ЗаполнитьЗначения(СтруктураШапкиДокумента.НалоговоеНазначение, "НалоговоеНазначение");
		ТЗДанныеОС.Колонки.Добавить("Местонахождение");
		ТЗДанныеОС.ЗаполнитьЗначения(ПодразделениеОрганизации, "Местонахождение");
		
		// далее нужно распределить суммы по направлениям начисления амортизации
		УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект, Отказ, Заголовок, ТЗДанныеОС, СтруктураШапкиДокумента, "ОС", "Начисление амортизации ОС");

	КонецЕсли;
	
	УправлениеВнеоборотнымиАктивами.ПроверкаДублированияЗаписейСостоянийОС(СтруктураШапкиДокумента.Организация, СостояниеОС, Отказ, Заголовок);

КонецПроцедуры // ФормированиеДвиженийРегл()

// Процедура формирования движений регл. регистров
//
Процедура ФормированиеДвиженийУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДока       = Дата;

	ТЗДанныеОС = Новый ТаблицаЗначений;
	ТЗДанныеОС.Колонки.Добавить("ОбъектУчета");
	ТЗДанныеОС.Колонки.Добавить("Сумма",    ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
              
	//ПроводкиБУ = Движения.Хозрасчетный;

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
		
		Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе	
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Склад 						= СтруктураШапкиДокумента.Склад;
		СтрокаДвижений.Номенклатура 				= СтруктураШапкиДокумента.Номенклатура;
		СтрокаДвижений.ХарактеристикаНоменклатуры 	= СтруктураШапкиДокумента.ХарактеристикаНоменклатуры;
		СтрокаДвижений.СерияНоменклатуры 			= СтруктураШапкиДокумента.СерияНоменклатуры;
		СтрокаДвижений.Качество 					= Справочники.Качество.Новый;
		СтрокаДвижений.Количество 					= ТаблицаПоОС.Количество();
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		//---------------------------------------------
		Если Не Отказ Тогда
			Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
    			Движения.ТоварыВРознице.ВыполнитьРасход();
			Иначе
    			Движения.ТоварыНаСкладах.ВыполнитьРасход();
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтоимостьОС.ОсновноеСредство КАК ОбъектУчета,
		|	СУММА(СтоимостьОС.Стоимость) КАК Сумма
		|ИЗ
		|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
		|
		|ГДЕ
		|	(СтоимостьОС.Активность) И
		|	СтоимостьОС.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьОС.ОсновноеСредство");
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		ТЗДанныеОС = Запрос.Выполнить().Выгрузить();
		
	Иначе //ОбъектыСтроительства или ПоРезультатамИнвентаризации

		//Заполним таблицу значений для проведения по регистрам, не зависящим от вида операции и сделаем 
		// движения по регистру СтоимостьОС
		СтоимостьОС                 = Движения.СтоимостьОС;
		ТаблицаДвиженийСтоимость    = СтоимостьОС.Выгрузить();
		
		ПогрешностьСтоимостиОС = 0;
		
		Если ТаблицаПоОС.Количество() > 0 Тогда
			Коэф = 1 / ТаблицаПоОС.Количество();
		Иначе
			Коэф = 0;
		КонецЕсли;
		
		//Заполним таблицу значений для проведения по регистрам, не зависящим от вида операции
		Для Каждого Строка Из ТаблицаПоОС Цикл
			
			ТекОС 			= Строка.ОсновноеСредство;
			ТекСтоимостьУУ	= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтруктураШапкиДокумента.СтоимостьУУ * Коэф, 2, ПогрешностьСтоимостиОС);
			
			// Движения по регистру СтоимостьОС
			Движение = ТаблицаДвиженийСтоимость.Добавить();

			Движение.ОсновноеСредство = ТекОС;
			Движение.Амортизация      = 0;
			Движение.Стоимость        = ТекСтоимостьУУ;
			
			НоваяСтрока = ТЗДанныеОС.Добавить();
			НоваяСтрока.ОбъектУчета = ТекОС;
			НоваяСтрока.Сумма       = ТекСтоимостьУУ;
			
		КонецЦикла;

		СтоимостьОС.мПериод          = ДатаДока;
		СтоимостьОС.мТаблицаДвижений = ТаблицаДвиженийСтоимость;
		Движения.СтоимостьОС.ВыполнитьПриход();
		
	КонецЕсли;

	// списшем сумму с регистра объектов строительства
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда

		СтроительствоОС = Движения.СтроительствоОбъектовОсновныхСредств;

		ТаблицаДвиженийСтроительствоОС = СтроительствоОС.Выгрузить();

		Движение = ТаблицаДвиженийСтроительствоОС.Добавить();
		Движение.ОбъектСтроительства = СтруктураШапкиДокумента.ОбъектСтроительства;
		Движение.Сумма               = СтруктураШапкиДокумента.СтоимостьУУ;

		СтроительствоОС.мПериод          = ДатаДока;
		СтроительствоОС.мТаблицаДвижений = ТаблицаДвиженийСтроительствоОС;
		Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьРасход();

	КонецЕсли;
	
	ГрафикиАмортизации       = Движения.ГрафикиАмортизацииОС;
	МестонахождениеОС        = Движения.МестонахождениеОС;
	НаправлениеАмортизации   = Движения.СпособыОтраженияРасходовПоАмортизацииОС;
	НачислениеАмортизации    = Движения.НачислениеАмортизацииОС;
	ПервоначальныеСведения   = Движения.ПервоначальныеСведенияОС;
	ПараметрыАмортизации     = Движения.ПараметрыАмортизацииОС;
	СостояниеОС              = Движения.СостоянияОС;
	ОперацииОС               = Движения.СобытияОС;

	Для Каждого Строка Из ТЗДанныеОС Цикл

		ТекОС = Строка.ОбъектУчета;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства Тогда

			
		ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование Тогда
			
			//Проводка сформирована движениями по партиям
			
		ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ПоРезультатамИнвентаризации Тогда

			
		КонецЕсли;
		
		// Движения по регистру ПервоначальныеСведенияОбОсновныхСредствах
		Движение = ПервоначальныеСведения.Добавить();
		Движение.Период                      = ДатаДока;
		Движение.ОсновноеСредство            = ТекОС;
		Движение.ПервоначальнаяСтоимость     = Строка.Сумма;
		Движение.СпособНачисленияАмортизации = СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ;
		ТекСтрокаОС = ТаблицаПоОС.Найти(ТекОС, "ОсновноеСредство");
		Движение.ПараметрВыработки           = СтруктураШапкиДокумента.ПараметрВыработкиБУ;
		
		// Движения по регистру МестонахождениеОС
		Движение = МестонахождениеОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Местонахождение      = СтруктураШапкиДокумента.Подразделение;
		Движение.МОЛ                  = СтруктураШапкиДокумента.МОЛБУ;

		// Движения по регистру НачислениеАмортизации
		Движение = НачислениеАмортизации.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.НачислятьАмортизацию = СтруктураШапкиДокумента.НачислятьАмортизациюБУ;
		Движение.НачислятьАмортизациюВТекущемМесяце = СтруктураШапкиДокумента.НачислятьАмортизациюВТекущемМесяце;
		
		// Движения по регистру СостоянияОС
		Движение = СостояниеОС.Добавить();
		Движение.ДатаСостояния        = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Состояние            = Перечисления.СостоянияОС.ВведеноВЭксплуатацию;

		// Движения по регистру СобытияОС
		Движение = ОперацииОС.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = ТекОС;
		Движение.Событие           = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента = Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента    = СтруктураШапкиДокумента.Номер;

		// Движения по регистру ГрафикиАмортизации
		Движение = ГрафикиАмортизации.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = ТекОС;
		Движение.ГрафикАмортизации = СтруктураШапкиДокумента.ГрафикАмортизацииПоГодуБУ;
		
		// Движения по регистру СпособыОтраженияРасходовПоАмортизации
		Движение = НаправлениеАмортизации.Добавить();
		Движение.Период                                = ДатаДока;
		Движение.ОсновноеСредство                      = ТекОС;
		Движение.СпособыОтраженияРасходовПоАмортизации = СтруктураШапкиДокумента.СпособыОтраженияРасходовПоАмортизации;
		
		// Движения по регистру ПараметрыАмортизации
		Движение = ПараметрыАмортизации.Добавить();
		Движение.Период                                      = ДатаДока;
		Движение.ОсновноеСредство                            = ТекОС;
		Движение.ОбъемПродукцииРабот                         = СтруктураШапкиДокумента.ПредполагаемыйОбъемПродукцииБУ;
		Движение.ЛиквидационнаяСтоимость                     = СтруктураШапкиДокумента.ЛиквидационнаяСтоимостьУУ;
		Движение.СрокПолезногоИспользования                  = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
		Движение.СрокИспользованияДляВычисленияАмортизации   = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
		Движение.СтоимостьДляВычисленияАмортизации           = Строка.Сумма;
		Движение.ПрименитьВТекущемМесяце                     = СтруктураШапкиДокумента.НачислятьАмортизациюВТекущемМесяце;
		Движение.ОбъемПродукцииРаботДляВычисленияАмортизации = СтруктураШапкиДокумента.ПредполагаемыйОбъемПродукцииБУ;
		
	КонецЦикла;

	// Списание при принятии к учету (БУ)
	Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._100
		 ИЛИ СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
		 
		Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииОС._50_50 Тогда
			
			Для каждого Строка Из ТЗДанныеОС Цикл
			
				Строка.Сумма = Строка.Сумма / 2;	
			
			КонецЦикла;
			
		КонецЕсли; 
		 
		НаправлениеСписания = СтруктураШапкиДокумента.СпособыОтраженияРасходовПоАмортизации;
		
		ТЗДанныеОС.Колонки.Добавить("НаправлениеАмортизации");
		ТЗДанныеОС.ЗаполнитьЗначения(НаправлениеСписания, "НаправлениеАмортизации");
		ТЗДанныеОС.Колонки.Добавить("СчетАмортизации");
		ТЗДанныеОС.ЗаполнитьЗначения(СтруктураШапкиДокумента.СчетНачисленияАмортизацииБУ, "СчетАмортизации");
		ТЗДанныеОС.Колонки.Сумма.Имя = "Амортизация";
		ТЗДанныеОС.Колонки.Добавить("Местонахождение");
		ТЗДанныеОС.ЗаполнитьЗначения(Подразделение, "Местонахождение");
		
		// далее нужно распределить суммы по направлениям начисления амортизации
		УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект, Отказ, Заголовок, ТЗДанныеОС, СтруктураШапкиДокумента);

	КонецЕсли;
	
	//УправлениеВнеоборотнымиАктивами.ПроверкаДублированияЗаписейСостоянийОС(СтруктураШапкиДокумента.Организация, СостояниеОС, Отказ, Заголовок);
 	
КонецПроцедуры // ФормированиеДвиженийРегл()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		
		Если Основание.ЭтоГруппа Тогда
			
			Сообщить("Нельзя принять к учету группу основных средств", СтатусСообщения.Внимание);
			Возврат;
			
		КонецЕсли; 

		СтрокаТабличнойЧасти = ОС.Добавить();

		СтрокаТабличнойЧасти.ОсновноеСредство = Основание.Ссылка;
		СтрокаТабличнойЧасти.ИнвентарныйНомер = Основание.Код;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		
		Организация              		= Основание.Организация;
		ОтражатьВБухгалтерскомУчете  	= Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете 	= Основание.ОтражатьВУправленческомУчете;
		Подразделение 					= Основание.Подразделение;
		ПодразделениеОрганизации 		= Основание.ПодразделениеОрганизации;
		ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ПоРезультатамИнвентаризации;
		СтоимостьУУ = 0;
		СтоимостьБУ = 0;
		ТекМол      = "";
		
		Для Каждого ТекСтрокаОС Из Основание.ОС Цикл
			
			Если (НЕ ТекСтрокаОС.НаличиеПоДаннымУчета И ТекСтрокаОС.НаличиеФактическое)
				ИЛИ (НЕ ТекСтрокаОС.НаличиеПоДаннымУчетаУУ И ТекСтрокаОС.НаличиеФактическоеУУ)
				Тогда
				
				НоваяСтрока = ОС.Добавить();
				НоваяСтрока.ОсновноеСредство = ТекСтрокаОС.ОсновноеСредство;
				НоваяСтрока.ИнвентарныйНомер = ТекСтрокаОС.ОсновноеСредство.Код;
				
				СтоимостьУУ = СтоимостьУУ + ТекСтрокаОС.СтоимостьФактическаяУУ;
				СтоимостьБУ = СтоимостьБУ + ТекСтрокаОС.СтоимостьФактическая;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		ВидОперацииОснования             = Основание.ВидОперации;
		ПоступлениеОборудования          = (ВидОперацииОснования = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование);
		ПоступлениеОбъектовСтроительства = (ВидОперацииОснования = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства);
		Организация              		 = Основание.Организация;
		ОтражатьВУправленческомУчете     = Основание.ОтражатьВУправленческомУчете;
		ОтражатьВБухгалтерскомУчете 	 = Основание.ОтражатьВБухгалтерскомУчете;
		Склад                    		 = Основание.СкладОрдер;
		
		Если ПоступлениеОборудования Тогда
			
			ВидОперации            = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование;
			Подразделение          = Основание.Подразделение;
			Оборудование           = Основание.Оборудование;
			ОборудованиеКоличество = Оборудование.Количество();
			
			Если ОборудованиеКоличество > 0 Тогда
				
				Если ОборудованиеКоличество > 1 Тогда
					
					ТаблицаОборудования = Оборудование.Выгрузить();
					СтрокаТЧ = ТаблицаОборудования.ВыбратьСтроку("Выберите строку документа.");
					
				Иначе
					
					СтрокаТЧ = Оборудование[0];
					
				КонецЕсли;
				
				Если СтрокаТЧ <> Неопределено Тогда
					
					Номенклатура                   = СтрокаТЧ.Номенклатура;
					СерияНоменклатуры              = СтрокаТЧ.СерияНоменклатуры;
					ХарактеристикаНоменклатуры     = СтрокаТЧ.ХарактеристикаНоменклатуры;
					НалоговоеНазначение            = СтрокаТЧ.НалоговоеНазначение;
					СчетУчетаБУВнеоборотногоАктива = СтрокаТЧ.СчетУчетаБУ;
					НалоговоеНазначениеОборудования = СтрокаТЧ.НалоговоеНазначение;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ПоступлениеОбъектовСтроительства Тогда
			
			ВидОперации                    = Перечисления.ВидыОперацийПринятияКУчетуОсновныхСредств.ОбъектыСтроительства;
			ОбъектыСтроительства           = Основание.ОбъектыСтроительства;
			ОбъектыСтроительстваКоличество = ОбъектыСтроительства.Количество();
			
			Если ОбъектыСтроительстваКоличество > 0 Тогда
				
				Если ОбъектыСтроительстваКоличество > 1 Тогда
					
					ТаблицаОбъектовСтроительства = ОбъектыСтроительства.Выгрузить();
					СтрокаТЧ = ТаблицаОбъектовСтроительства.ВыбратьСтроку("Выберите строку документа.");
					
				Иначе
					
					СтрокаТЧ = ОбъектыСтроительства[0];
					
				КонецЕсли;
				
				Если СтрокаТЧ <> Неопределено Тогда
					
					ОбъектСтроительства            = СтрокаТЧ.ОбъектСтроительства;
					НалоговоеНазначение            = СтрокаТЧ.НалоговоеНазначение;
					СчетУчетаБУВнеоборотногоАктива = СтрокаТЧ.СчетУчетаБУ;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьСчетАмортизации();
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Заголовок = "";

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
									 
	СтруктураШапкиДокумента.Вставить("ВидСклада",
	                                 СтруктураШапкиДокумента.Склад.ВидСклада);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	ПроверитьЗаполнениеШапки(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);

	ТаблицаПоОС = ПодготовитьТаблицуОС(СтруктураШапкиДокумента);
	
	ПроверкаРеквизитовТЧ(ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(ОС, "ОсновноеСредство", "Основное средство", Отказ, Заголовок);
	
	Если НЕ Отказ Тогда

		// Формирование движений регистров, бухгалтерских и налоговых проводок.
		ФормированиеДвижений(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);

	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка неиспользуемых реквизитов.
	
	СпособыНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС;             
	
	// Бухгалтерский учет
	
	Если СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.Производственный Тогда
		
		ПредполагаемыйОбъемПродукцииБУ = 0;
		ПараметрВыработкиБУ            = Справочники.ПараметрыВыработкиОС.ПустаяСсылка();
		
	КонецЕсли;
	
	Если СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.Прямолинейный
		 И СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.УменьшенияОстатка 
		 И СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.УскоренногоУменьшенияОстатка 
		 И СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.Кумулятивный Тогда
		 
		 СрокПолезногоИспользованияБУ = 0;
		 Если СпособНачисленияАмортизацииБУ <> СпособыНачисленияАмортизации.Производственный Тогда
			 ЛиквидационнаяСтоимостьУУ    = 0;
			 ЛиквидационнаяСтоимостьБУ    = 0;
		 КонецЕсли;
		 ГрафикАмортизацииПоГодуБУ    = Справочники.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка();
		 
	 КонецЕсли;
	 
	 Если СпособНачисленияАмортизацииБУ = СпособыНачисленияАмортизации.УскоренногоУменьшенияОстатка Тогда
			
		Если СрокПолезногоИспользованияБУ <= 24 Тогда
					
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для основного средства при расчете по способу ¤1¤ указан срок полезного использования <¤2¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.",
											СпособНачисленияАмортизацииБУ, СрокПолезногоИспользованияБУ), );
				
		КонецЕсли; 
	 	
	 КонецЕсли;
	 
	 Если ОтражатьВБухгалтерскомУчете Тогда
		 
		УчетнаяПолитикаНеЗадана = Ложь;
		УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
		 
		Если НЕ УчетнаяПолитикаНУ.ЕстьНДС Тогда
			
			// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
			НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
			
			Если НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
				НалоговоеНазначение = НеОблНДСДеятельность;
			КонецЕсли;	
			
			НалоговоеНазначениеОборудования = НеОблНДСДеятельность;
			
		КонецЕсли; 	 
	КонецЕсли;	
		
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();

ВестиСкладскойУчетБУ  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
