
#Если Клиент Тогда


Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	МассивОтбора = Новый Массив;
	ОбщийОтчет.ИмяРегистра = "";
	ОбщийОтчет.мНазваниеОтчета = "Отражение зарплаты в управленческом учете";
	ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Ссылка.Ответственный КАК Ответственный,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Ссылка,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Подразделение,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.СтатьяЗатрат,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.НоменклатурнаяГруппа,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.ОбъектСтроительства,
	|	СУММА(ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Сумма) КАК Сумма
	|ИЗ
	|	Документ.НачислениеЗарплатыРаботникамОрганизаций.ОтражениеВУпрУчете КАК ОтражениеЗарплатыВУпрУчетеОтражениеВУчете
	|
	|ГДЕ
	|	(ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаНач, МЕСЯЦ)) И
	|	(ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Подразделение,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.СтатьяЗатрат,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.НоменклатурнаяГруппа,
	|	ОтражениеЗарплатыВУпрУчетеОтражениеВУчете.ОбъектСтроительства	
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	ОБЩИЕ	
	|	
	|{ВЫБРАТЬ
	|	Ссылка,
	|	Подразделение,
	|	СтатьяЗатрат,
	|	НоменклатурнаяГруппа,
	|	Ссылка.Ответственный,
	|	ОбъектСтроительства
	|}
	|{ИТОГИ ПО
	|	Подразделение,
	|	Ссылка,
	|	СтатьяЗатрат,
	|	НоменклатурнаяГруппа,
	|	Ссылка.Ответственный,
	|	ОбъектСтроительства	
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Ссылка,
	|	СтатьяЗатрат,
	|	НоменклатурнаяГруппа,
	|	Ссылка.Ответственный,
	|	ОбъектСтроительства	
	|}
	|{ГДЕ
	|	Подразделение,
	|	Ссылка,
	|	СтатьяЗатрат,
	|   НоменклатурнаяГруппа,
	|	Ссылка.Ответственный,
	|   ОбъектСтроительства
	|}
	|";

	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("СтатьяЗатрат");
	МассивОтбора.Добавить("НоменклатурнаяГруппа");
	МассивОтбора.Добавить("ОбъектСтроительства");
	МассивОтбора.Добавить("Ответственный");
	
	ОбщийОтчет.ЗаполнитьПоказатели("Сумма", "Сумма", Истина, "ЧЦ=15; ЧДЦ=2");
	
	СтруктураПредставлениеПолей = Новый Структура("Подразделение,Докумдент,СтатьяЗатрат,НоменклатурнаяГруппа,ОбъектСтроительства",
	"Подразделение",
	"Докумдент",
	"СтатьяЗатрат",
	"НоменклатурнаяГруппа",
	"ОбъектСтроительства");	
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;

	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПустаяСтруктура = Новый Структура;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Сумма", ПустаяСтруктура);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;

	ПустаяСтруктура = Новый Структура;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Сумма", ПустаяСтруктура);	

	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;

	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок) Экспорт

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок);
	
КонецПроцедуры

#КонецЕсли

