Перем мУдалятьДвижения;
Перем СоответствиеВалютныеСпособыРасчета; 

Процедура Автозаполнение(Регистратор, Сотрудники) Экспорт
	
	
	Отказ = Ложь;
	
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке("ПоРеквизитамДокумента").Выбрать();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ВыборкаПоНачислениям = СформироватьЗапросПоРаботникиОрганизацииНачисления("ПоРеквизитамДокумента").Выбрать();
	ЗафиксироватьТранзакцию();
	
	// Создадим рабочие наборы записей (
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		Если НЕ Отказ Тогда
			
			Если ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
				// ничего не меняем
				Продолжить;
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
				// сначала надо закрыть вечером предыдущих суток
				мПериод = КонецДня(ВыборкаПоНачислениям.ДатаДействия-1);
				мДействует	= Ложь;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
				// начало с утра текущего дня
				мПериод = ВыборкаПоНачислениям.ДатаДействия;
				мДействует	= Истина;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				мПериод = ВыборкаПоНачислениям.ДатаДействия;
				мДействует	= Истина;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
				
			ИначеЕсли ВыборкаПоНачислениям.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
				// движеие закрытия на вечер предыдущих суток
				мПериод = КонецДня(ВыборкаПоНачислениям.ДатаДействия);
				мДействует	= Ложь;
				ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям,мПериод,мДействует);
				
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	
	// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
	Если Отказ Тогда
		Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
		Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	КонецЕсли;

	
	АвтозаполнениеНачислений(Регистратор, НачисленияДо, Сотрудники);
	АвтозаполнениеНачислений(Регистратор, НачисленияПосле, Сотрудники);
	
	// Все закончено - удаляем движения
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
    Записать();

КонецПроцедуры

Процедура АвтозаполнениеНачислений(Регистратор, Начисления, Сотрудники)
		//Получим список видов расчета, входящих в базу индексации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.ВидРасчета
		|ИЗ
		|	ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК Начисления
		|ГДЕ
		| Начисления.Ссылка.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты) 
		|";
		
	МассивБазаИндексации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамПериодРегистрации" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамСотрудник",Сотрудники); 
	Запрос.УстановитьПараметр("парамПустойСотрудник",Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("парамНачало" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамКонец" , КонецМесяца(Дата));
	Если Начисления = НачисленияДо Тогда
		Запрос.УстановитьПараметр("парамСрез" , НачалоДня(НачалоМесяца(Дата)-1));
		Запрос.УстановитьПараметр("парамСРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты);
	Иначе	
        Запрос.УстановитьПараметр("парамСрез" , КонецМесяца(Дата));
		Запрос.УстановитьПараметр("парамСРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ПустаяСсылка());
	КонецЕсли;	
	Запрос.УстановитьПараметр("парамБазаИндексации" , МассивБазаИндексации);
	Запрос.УстановитьПараметр("парамРегистратор" , Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);

	МассивДействий = Новый Массив(2);
	МассивДействий[0] = Перечисления.ВидыДействияСНачислением.Изменить;
	МассивДействий[1] = Перечисления.ВидыДействияСНачислением.Начать;
	Запрос.УстановитьПараметр("парамДействиеНачатьИзменить", МассивДействий);
	Запрос.УстановитьПараметр("парамПрекратить", Перечисления.ВидыДействияСНачислением.Прекратить);
	Запрос.УстановитьПараметр("парамПоДням"     , Перечисления.ВидыУчетаВремени.ПоДням);
	
	Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("парамВалютаУчета" , ?(ОтражатьВРеглУчете,Константы.ВалютаРегламентированногоУчета.Получить(),Константы.ВалютаУправленческогоУчета.Получить()));
	Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты" , ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	Запрос.УстановитьПараметр("Ежемесячно", Перечисления.ХарактерВыплатыПоДоговору.Ежемесячно);
	Запрос.УстановитьПараметр("парамИндивидуальныйПоказатель",Перечисления.ВидыПоказателейСхемМотивации.Индивидуальный);		
	Запрос.УстановитьПараметр("парамПоПодраделению",Перечисления.ВидыПоказателейСхемМотивации.ПоПодразделению);
	
	
	//	ВТСписокРаботникиИЗамены
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка) ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ КАК Сотрудник,
		|	Сотрудники.Ссылка КАК Назначение
		|ПОМЕСТИТЬ ВТСписокРаботникиИЗамены	
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|ГДЕ	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=&парамПустойСотрудник ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ В ( &парамСотрудник )
		|
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Замены.Сотрудник КАК Сотрудник,
		|	Замены.ЗаменаСотрудник КАК Назначение
		|ИЗ Документ.ЗаменыОрганизаций КАК Замены
		|ГДЕ	Замены.Сотрудник В ( &парамСотрудник )
		|	И	НАЧАЛОПЕРИОДА(Замены.ДатаНачала,МЕСЯЦ)<= &парамНачало
		|	И	КОНЕЦПЕРИОДА(Замены.ДатаОкончания,МЕСЯЦ)>= &парамНачало
		|	И	Замены.Проведен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТСписокРаботникиИЗамены = "ВТСписокРаботникиИЗамены";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСписокРаботникиИЗамены";
	
	//	ВТЗамены
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части РаботникиОрганизации которые кого-либо заменяли
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Замены.Сотрудник КАК Сотрудник,
		|	Замены.ЗаменаСотрудник КАК Назначение,
		|	Замены.Ссылка			КАК ДокументОснование,
		|	ВЫБОР КОГДА Замены.ДатаНачала < &парамНачало ТОГДА &парамНачало ИНАЧЕ Замены.ДатаНачала КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР КОГДА Замены.ДатаОкончания > &парамКонец ТОГДА &парамКонец ИНАЧЕ Замены.ДатаОкончания КОНЕЦ КАК ДатаОкончания,
		|	Замены.ВидРасчета					КАК ВидРасчета,
		|	Замены.ЗаменаГрафикРаботы				КАК ГрафикРаботы,
		|	Замены.ЗаменаПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	Замены.ЗаменаПодразделение				КАК ПодразделениеУпр,
		|	Замены.ЗаменаДолжность					КАК Должность
		|ПОМЕСТИТЬ ВТЗамены	
		|ИЗ Документ.ЗаменыОрганизаций КАК Замены
		|
		|ГДЕ	Замены.Сотрудник В ( &парамСотрудник )                             
		|	И	Замены.ДатаНачала <= &парамКонец
		|	И	Замены.ДатаОкончания >= &парамНачало
		|	И	Замены.Проведен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТЗамены = "ВТЗамены";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗамены";
	
	//	ВТСписокРаботники
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части, их внутренние совместительства БЕЗ ЗАМЕН
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=&парамПустойСотрудник ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ КАК Сотрудник,
		|	Сотрудники.Ссылка КАК Назначение
		|ПОМЕСТИТЬ ВТСписокРаботники	
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|ГДЕ	ВЫБОР КОГДА Сотрудники.ОсновноеНазначение=ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка) ТОГДА Сотрудники.Ссылка ИНАЧЕ Сотрудники.ОсновноеНазначение КОНЕЦ
		|			В ( &парамСотрудник )
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТСписокРаботники = "ВТСписокРаботники";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСписокРаботники";
	
	//	ВТДвиженияРегл
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.Сотрудник					КАК Сотрудник,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|	Работники.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы				КАК ГрафикРаботы,
		|	Работники.Должность					КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияРегл	
		|ИЗ (
		|	ВЫБРАТЬ 
		|		РаботникиОрганизаций.Организация				КАК Организация,
		|		РаботникиОрганизаций.Сотрудник					КАК Сотрудник,
		|		&парамНачало									КАК ДатаНачала,
		|		РаботникиОрганизаций.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамСрез, Организация = &парамОрганизация И Сотрудник В ( ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК СписокРаботников )
		|			) КАК РаботникиОрганизаций
		|	ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.Организация				КАК Организация,
		|		РаботникиОрганизаций.Сотрудник					КАК Сотрудник,
		|		РаботникиОрганизаций.Период						КАК ДатаНачала,
		|		РаботникиОрганизаций.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ		РаботникиОрганизаций.Сотрудник В ( ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК СписокРаботников )
		|		И	РаботникиОрганизаций.Организация = &парамОрганизация
		|		И	НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &парамНачало
		|		И	РаботникиОрганизаций.Период > &парамНачало
		|		И	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|   ) КАК Работники
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Окончания
		|ПО  НАЧАЛОПЕРИОДА(Окончания.Период, МЕСЯЦ) = &парамНачало // все движения за месяц
		|	И	Окончания.Организация = Работники.Организация
		|	И	Окончания.Сотрудник = Работники.Сотрудник
		|	И	Работники.ДатаНачала < Окончания.Период 
		|       
		|СГРУППИРОВАТЬ ПО
		|	Работники.Сотрудник,
		|	Работники.ДатаНачала,
		|	Работники.ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы,
		|	Работники.Должность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ДатаНачала
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияРегл";
	КонецЕсли;
	
	//	ВТДвиженияУпр
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.ФизЛицо					КАК ФизЛицо,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|	Работники.Подразделение				КАК Подразделение,
		|	Работники.ГрафикРаботы				КАК ГрафикРаботы,
		|	Работники.Должность					КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияУпр	
		|ИЗ (
		|	ВЫБРАТЬ 
		|		РаботникиОрганизаций.ФизЛицо					КАК ФизЛицо,
		|		&парамНачало									КАК ДатаНачала,
		|		РаботникиОрганизаций.Подразделение				КАК Подразделение,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.Работники.СрезПоследних(&парамНачало, ФизЛицо В ( ВЫБРАТЬ Назначение.ФизЛицо ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК СписокРаботников )
		|			) КАК РаботникиОрганизаций
		|	ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.ФизЛицо					КАК ФизЛицо,
		|		РаботникиОрганизаций.Период						КАК ДатаНачала,
		|		РаботникиОрганизаций.Подразделение				КАК Подразделение,
		|		РаботникиОрганизаций.ГрафикРаботы				КАК ГрафикРаботы,
		|		РаботникиОрганизаций.Должность					КАК Должность
		|	ИЗ РегистрСведений.Работники КАК РаботникиОрганизаций
		|	ГДЕ		РаботникиОрганизаций.ФизЛицо В ( ВЫБРАТЬ Назначение.ФизЛицо ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК СписокРаботников )
		|		И	НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &парамНачало
		|		И	РаботникиОрганизаций.Период > &парамНачало
		|		И	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|   ) КАК Работники
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Окончания
		|ПО  НАЧАЛОПЕРИОДА(Окончания.Период, МЕСЯЦ) = &парамНачало // все движения за месяц
		|	И	Окончания.ФизЛицо = Работники.ФизЛицо
		|	И	Работники.ДатаНачала < Окончания.Период 
		|       
		|СГРУППИРОВАТЬ ПО
		|	Работники.ФизЛицо,
		|	Работники.ДатаНачала,
		|	Работники.Подразделение,
		|	Работники.ГрафикРаботы,
		|	Работники.Должность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо,
		|	ДатаНачала
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияУпр";

	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДвиженияУпр";
	
	//	ВТДвиженияРаботников
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру РаботникиОрганизации (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Работники.Сотрудник					КАК Сотрудник,
		|	Работники.Назначение				КАК Назначение,
		|	Работники.ДатаНачала				КАК ДатаНачала,
		|	МИНИМУМ(Окончание.ДатаОкончания)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТДвижения	
		|ИЗ (
		|	ВЫБРАТЬ
		|		РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|		РаботникиПоДокументу.Назначение		КАК Назначение,
		|		РаботникиРегл.ДатаНачала				КАК ДатаНачала
		|	ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|	ПО РаботникиРегл.Сотрудник = РаботникиПоДокументу.Назначение
		|
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|		РаботникиПоДокументу.Назначение		КАК Назначение,
		|		РаботникиУпр.ДатаНачала				КАК ДатаНачала
		|	ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|	ПО РаботникиУпр.ФизЛицо = РаботникиПоДокументу.Назначение.ФизЛицо
		| ) КАК Работники
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ
		|			РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|			РаботникиПоДокументу.Назначение		КАК Назначение,
		|			РаботникиРегл.ДатаОкончания				КАК ДатаОкончания
		|		ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|		ПО РаботникиРегл.Сотрудник = РаботникиПоДокументу.Назначение
		|
		|		ОБЪЕДИНИТЬ
		|		ВЫБРАТЬ
		|			РаботникиПоДокументу.Сотрудник		КАК Сотрудник,
		|			РаботникиПоДокументу.Назначение		КАК Назначение,
		|			РаботникиУпр.ДатаОкончания				КАК ДатаОкончания
		|		ИЗ ВТСписокРаботники КАК РаботникиПоДокументу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|		ПО РаботникиУпр.ФизЛицо = РаботникиПоДокументу.Назначение.ФизЛицо
		|   ) Окончание
		|   ПО		Работники.Назначение = Окончание.Назначение
		|   	И	Работники.ДатаНачала <= Окончание.ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	Работники.Сотрудник,
		|	Работники.Назначение,
		|	Работники.ДатаНачала
		| ";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();

		
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыДвижения.Сотрудник				КАК Сотрудник,
		|	ДатыДвижения.Назначение				КАК Назначение,
		|	ДатыДвижения.ДатаНачала				КАК ДатаНачала,
		|	ДатыДвижения.ДатаОкончания			КАК ДатаОкончания,
		|	РаботникиРегл.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	РаботникиУпр.Подразделение				КАК ПодразделениеУпр,
		|	ЕСТЬNULL(РаботникиРегл.ГрафикРаботы,РаботникиУпр.ГрафикРаботы)	КАК ГрафикРаботы,
		|	ЕСТЬNULL(РаботникиРегл.Должность,РаботникиУпр.Должность)		КАК Должность
		|ПОМЕСТИТЬ ВТДвиженияРаботников	
		|ИЗ ВТДвижения КАК ДатыДвижения
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРегл КАК РаботникиРегл
		|ПО		ДатыДвижения.Назначение = РаботникиРегл.Сотрудник
		|	И	ДатыДвижения.ДатаНачала <= РаботникиРегл.ДатаОкончания 
		|	И	РаботникиРегл.ДатаНачала <= ДатыДвижения.ДатаОкончания 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияУпр КАК РаботникиУпр
		|ПО		ДатыДвижения.Сотрудник.ФизЛицо = РаботникиУпр.ФизЛицо
		|	И	ДатыДвижения.ДатаНачала <= РаботникиУпр.ДатаОкончания 
		|	И	РаботникиУпр.ДатаНачала <= ДатыДвижения.ДатаОкончания 
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТДвиженияРаботников = "ВТДвиженияРаботников";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДвиженияРаботников";
	
	//	ВТПлановыеНачисления
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру ПлановыеНачисленияРаботниковОрганизаций (Сотрудники из ВТСписокРаботникиИЗамены)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|	ВЫБРАТЬ
		|		ПлановыеНачисления.Сотрудник 				КАК Сотрудник,
		|		&парамНачало								КАК ДатаНачала,
		|		КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)			КАК ДатаОкончания,
		|		ПлановыеНачисления.ОсновноеНачисление 		КАК ОсновноеНачисление, 
		|		ПлановыеНачисления.ВидНачисления			КАК ВидНачисления, 
		|		ПлановыеНачисления.ВидРасчета 				КАК ВидРасчета,
		|		ПлановыеНачисления.Действие,
		|		ПлановыеНачисления.ДокументОснование,
		|		ПлановыеНачисления.Показатель1,
		|		ПлановыеНачисления.Показатель2,
		|		ПлановыеНачисления.Показатель3,
		|		ПлановыеНачисления.Показатель4,
		|		ПлановыеНачисления.Показатель5,
		|		ПлановыеНачисления.Показатель6,
		|		ПлановыеНачисления.Валюта1,
		|		ПлановыеНачисления.Валюта2,
		|		ПлановыеНачисления.Валюта3,
		|		ПлановыеНачисления.Валюта4,
		|		ПлановыеНачисления.Валюта5,
		|		ПлановыеНачисления.Валюта6,
		|		ПлановыеНачисления.ВидУчетаВремениДляСредней
		|	ПОМЕСТИТЬ ВТПлановыеНачисления	
		|	ИЗ (
		|		ВЫБРАТЬ
		|			Начисления.Организация			КАК Организация,
		|			Начисления.Сотрудник			КАК Сотрудник,
		|			Начисления.ВидРасчетаИзмерение	КАК ВидРасчетаИзмерение,
		|			Начисления.ВидНачисления		КАК ВидНачисления,
		|			&парамНачало					КАК ДатаНачала,
		|			ВЫБОР	КОГДА Начисления.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ							КАК ОсновноеНачисление, // Оклад
		|			Начисления.ВидРасчета			КАК ВидРасчета,
		|			Начисления.Действие				КАК Действие,
		|			Начисления.ДокументОснование	КАК ДокументОснование,
		|			Начисления.Показатель1	КАК Показатель1,
		|			Начисления.Показатель2	КАК Показатель2,
		|			Начисления.Показатель3	КАК Показатель3,
		|			Начисления.Показатель4	КАК Показатель4,
		|			Начисления.Показатель5	КАК Показатель5,
		|			Начисления.Показатель6	КАК Показатель6,
		|			Начисления.Валюта1		КАК Валюта1,
		|			Начисления.Валюта2		КАК Валюта2,
		|			Начисления.Валюта3		КАК Валюта3,
		|			Начисления.Валюта4		КАК Валюта4,		
		|			Начисления.Валюта5		КАК Валюта5,		
		|			Начисления.Валюта6		КАК Валюта6,		
		|			Начисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|
		|			ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|					&парамСрез, Организация = &парамОрганизация И  
		|			    	Сотрудник В (ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК Работники)
		|				) КАК Начисления
		|	
		|			ГДЕ Начисления.Актуальность
		|	) КАК ПлановыеНачисления		

		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ОсновноеНачисление,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТПлановыеНачисления = "ВТПлановыеНачисления";
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПлановыеНачисления";
	
	//	ВТШтатноеРасписание
	Если Истина Тогда 
		//	Описание:
		// 		Получим движения по регистру НадбавкиПоШтатномуРасписаниюОрганизаций (по всем подразделениям которые принадлежат организации)
		//		Начало дня - это начало события, Конец дня это закрытие события
		//		Для п.1.
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ШтатныеНадбавки.Должность					КАК Должность,
		|		ШтатныеНадбавки.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|		ШтатныеНадбавки.ДатаНачала					КАК ДатаНачала,
		|	МИНИМУМ (
		|   	ВЫБОР	КОГДА  Окончания.Период ЕСТЬ NULL									// работник никуда не перемещался по регистру
		|         					ТОГДА КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)
		|         				КОГДА НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ) = Окончания.Период	// начало дня это кадровое перемещение, значит надо закрыть предыдущим днем
		|                           ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, СЕКУНДА, -1)
		|                       ИНАЧЕ  КОНЕЦПЕРИОДА(&парамНачало, МЕСЯЦ)							// непоняная ситуация, но поставим конец месяца
		|				КОНЕЦ)					КАК ДатаОкончания,
		|		ШтатныеНадбавки.ВидНадбавки	КАК ВидРасчета,
		|		ШтатныеНадбавки.Показатель1	КАК Показатель1,
		|		ШтатныеНадбавки.Показатель2	КАК Показатель2,
		|		ШтатныеНадбавки.Показатель3	КАК Показатель3,
		|		ШтатныеНадбавки.Показатель4	КАК Показатель4,		
		|		ШтатныеНадбавки.Показатель5	КАК Показатель5,		
		|		ШтатныеНадбавки.Показатель6	КАК Показатель6,		
		|		ШтатныеНадбавки.Валюта1		КАК Валюта1,
		|		ШтатныеНадбавки.Валюта2		КАК Валюта2,
		|		ШтатныеНадбавки.Валюта3		КАК Валюта3,
		|		ШтатныеНадбавки.Валюта4		КАК Валюта4,		
		|		ШтатныеНадбавки.Валюта5		КАК Валюта5,		
		|		ШтатныеНадбавки.Валюта6		КАК Валюта6		
		|
		|	ПОМЕСТИТЬ ВТШтатноеРасписание	
		|	ИЗ (
		|			ВЫБРАТЬ
		|				Надбавки.Должность					КАК Должность,
		|				Надбавки.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|				Надбавки.ВидНадбавки				КАК ВидНадбавки,
		|				&парамНачало			КАК ДатаНачала,
		|				Надбавки.Показатель1	КАК Показатель1,
		|				Надбавки.Показатель2	КАК Показатель2,
		|				Надбавки.Показатель3	КАК Показатель3,
		|				Надбавки.Показатель4	КАК Показатель4,		
		|				Надбавки.Показатель5	КАК Показатель5,		
		|				Надбавки.Показатель6	КАК Показатель6,		
		|				Надбавки.Валюта1		КАК Валюта1,
		|				Надбавки.Валюта2		КАК Валюта2,
		|				Надбавки.Валюта3		КАК Валюта3,
		|				Надбавки.Валюта4		КАК Валюта4,		
		|				Надбавки.Валюта5		КАК Валюта5,		
		|				Надбавки.Валюта6		КАК Валюта6		
		|			ИЗ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СрезПоследних(&парамНачало, ПодразделениеОрганизации.Владелец = &парамОрганизация) КАК Надбавки
		|			ГДЕ		Надбавки.Показатель1 > 0 
		|				ИЛИ	Надбавки.Показатель2 > 0 
		|				ИЛИ	Надбавки.Показатель3 > 0 		
		|				ИЛИ	Надбавки.Показатель4 > 0
		|
		|			ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ
		|				Надбавки.Должность		КАК Должность,
		|				Надбавки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|				Надбавки.ВидНадбавки	КАК ВидНадбавки,
		|				Надбавки.Период			КАК ДатаНачала,
		|				Надбавки.Показатель1	КАК Показатель1,
		|				Надбавки.Показатель2	КАК Показатель2,
		|				Надбавки.Показатель3	КАК Показатель3,
		|				Надбавки.Показатель4	КАК Показатель4,		
		|				Надбавки.Показатель5	КАК Показатель5,		
		|				Надбавки.Показатель6	КАК Показатель6,		
		|				Надбавки.Валюта1		КАК Валюта1,
		|				Надбавки.Валюта2		КАК Валюта2,
		|				Надбавки.Валюта3		КАК Валюта3,
		|				Надбавки.Валюта4		КАК Валюта4,		
		|				Надбавки.Валюта5		КАК Валюта5,		
		|				Надбавки.Валюта6		КАК Валюта6		
		|			ИЗ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК Надбавки
		|			ГДЕ		НАЧАЛОПЕРИОДА(Надбавки.Период,МЕСЯЦ) = &парамНачало И Надбавки.Период > &парамНачало
		|				И	Надбавки.ПодразделениеОрганизации.Владелец = &парамОрганизация
		|				И	(Надбавки.Показатель1 > 0 
		|				ИЛИ	Надбавки.Показатель2 > 0 
		|				ИЛИ	Надбавки.Показатель3 > 0 		
		|				ИЛИ	Надбавки.Показатель4 > 0)
		|	) КАК ШтатныеНадбавки
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК Окончания
		|	ПО		НАЧАЛОПЕРИОДА(Окончания.Период) = &парамНачало // все движения за месяц
		|		И	Окончания.ПодразделениеОрганизации.Владелец = &парамОрганизация
		|		И	ШтатныеНадбавки.ДатаНачала < Окончания.Период
		|			
		|	СГРУППИРОВАТЬ ПО
		|		ШтатныеНадбавки.Должность,
		|		ШтатныеНадбавки.ПодразделениеОрганизации,
		|		ШтатныеНадбавки.ВидНадбавки,
		|		ШтатныеНадбавки.ДатаНачала,
		|		ШтатныеНадбавки.Показатель1,
		|		ШтатныеНадбавки.Показатель2,
		|		ШтатныеНадбавки.Показатель3,
		|		ШтатныеНадбавки.Показатель4,		
		|		ШтатныеНадбавки.Показатель5,		
		|		ШтатныеНадбавки.Показатель6,		
		|		ШтатныеНадбавки.Валюта1,
		|		ШтатныеНадбавки.Валюта2,
		|		ШтатныеНадбавки.Валюта3,
		|		ШтатныеНадбавки.Валюта4,		
		|		ШтатныеНадбавки.Валюта5,		
		|		ШтатныеНадбавки.Валюта6		
		|";			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТШтатноеРасписание = "ВТШтатноеРасписание";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТШтатноеРасписание";

	//	ВТВсеНачисленияБезИзмененияОкладов
	Если Истина Тогда
		ТекстЗапросаВТ = "
		|// (п.1.2.3.) Оклады по назначениям (основные, совместители) и штатные надбавки
		|	ВЫБРАТЬ
		|		1 КАК НомерЗапроса,
		|		РаботникиОрганизации.Сотрудник,
		|		РаботникиОрганизации.Назначение,
		|		ОсновныеНачисления.ВидРасчета,
		|		ИСТИНА											КАК ОсновноеНачисление,
		|		ВЫБОР КОГДА ДвиженияРаботников.ДатаНачала <= ОсновныеНачисления.ДатаНачала			ТОГДА ОсновныеНачисления.ДатаНачала		ИНАЧЕ ДвиженияРаботников.ДатаНачала		КОНЕЦ КАК ДатаНачала,
		|		ВЫБОР КОГДА ДвиженияРаботников.ДатаОкончания <= ОсновныеНачисления.ДатаОкончания	ТОГДА ДвиженияРаботников.ДатаОкончания	ИНАЧЕ ОсновныеНачисления.ДатаОкончания	КОНЕЦ КАК ДатаОкончания,
		|		ДвиженияРаботников.ПодразделениеОрганизации,
		|		ДвиженияРаботников.ПодразделениеУпр,
		|		ДвиженияРаботников.ГрафикРаботы,
		|		ДвиженияРаботников.Должность,
		|
		|		ОсновныеНачисления.ДокументОснование,
		|		ОсновныеНачисления.Показатель1,
		|		ОсновныеНачисления.Показатель2,
		|		ОсновныеНачисления.Показатель3,
		|		ОсновныеНачисления.Показатель4,
		|		ОсновныеНачисления.Показатель5,
		|		ОсновныеНачисления.Показатель6,
		|		ОсновныеНачисления.Валюта1,
		|		ОсновныеНачисления.Валюта2,
		|		ОсновныеНачисления.Валюта3,
		|		ОсновныеНачисления.Валюта4,		
		|		ОсновныеНачисления.Валюта5,		
		|		ОсновныеНачисления.Валюта6,		
		|		ОсновныеНачисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|ПОМЕСТИТЬ ВТВсеНачисленияБезИзмененияОкладов	
		|	ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников	
		|	ПО		РаботникиОрганизации.Назначение = ДвиженияРаботников.Назначение	
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК ОсновныеНачисления	
		|	ПО		РаботникиОрганизации.Назначение = ОсновныеНачисления.Сотрудник	
		|		И	ОсновныеНачисления.ОсновноеНачисление
		|		И	ДвиженияРаботников.ДатаНачала <= ОсновныеНачисления.ДатаОкончания
		|		И	ОсновныеНачисления.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.2.3.) Оклады заменам
		|	ВЫБРАТЬ
		|		2 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение,
		|		ОсновныеНачисления.ВидРасчета,
		|		ИСТИНА							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|		Замены.ДокументОснование		КАК ДокументОснование,
		|		ОсновныеНачисления.Показатель1,
		|		ОсновныеНачисления.Показатель2,
		|		ОсновныеНачисления.Показатель3,
		|		ОсновныеНачисления.Показатель4,
		|		ОсновныеНачисления.Показатель5,
		|		ОсновныеНачисления.Показатель6,
		|		ОсновныеНачисления.Валюта1,
		|		ОсновныеНачисления.Валюта2,
		|		ОсновныеНачисления.Валюта3,
		|		ОсновныеНачисления.Валюта4,		
		|		ОсновныеНачисления.Валюта5,		
		|		ОсновныеНачисления.Валюта6,		
		|		ОсновныеНачисления.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней
		|	ИЗ ВТЗамены КАК Замены
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК ОсновныеНачисления	
		|	ПО		Замены.Назначение = ОсновныеНачисления.Сотрудник	
		|		И	ОсновныеНачисления.ОсновноеНачисление
		|       // данные на начало замены
		|		И	Замены.ДатаНачала <= ОсновныеНачисления.ДатаОкончания
		|		И	ОсновныеНачисления.ДатаНачала <= Замены.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Основные, совместители и их штатные надбавки
		|	ВЫБРАТЬ
		|		3 КАК НомерЗапроса,
		|		Штатные.Сотрудник,
		|		Штатные.Назначение,
		|		Штатные.ВидРасчета,
		|		Штатные.ОсновноеНачисление,
		|		Штатные.ДатаНачала,
		|		Штатные.ДатаОкончания,
		|		Штатные.ПодразделениеОрганизации,
		|		Штатные.ПодразделениеУпр,
		|		Штатные.ГрафикРаботы,
		|		Штатные.Должность,
		|
		|		NULL КАК ДокументОснование,
		|		Штатные.Показатель1,
		|		Штатные.Показатель2,
		|		Штатные.Показатель3,
		|		Штатные.Показатель4,
		|		Штатные.Показатель5,
		|		Штатные.Показатель6,
		|		Штатные.Валюта1,
		|		Штатные.Валюта2,
		|		Штатные.Валюта3,
		|		Штатные.Валюта4,		
		|		Штатные.Валюта5,		
		|		Штатные.Валюта6,		
		|		NULL	КАК ВидУчетаВремениДляСредней
		|   ИЗ ( 
		|		ВЫБРАТЬ
		|			РаботникиОрганизации.Сотрудник,
		|			РаботникиОрганизации.Назначение,
		|			ШтатныеНадбавки.ВидРасчета,
		|			ЛОЖЬ											КАК ОсновноеНачисление,
		|
		|			ВЫБОР 
		|				КОГДА ПлановыеНачисления.НомерТочки	ЕСТЬ NULL ИЛИ ПлановыеНачисления.НомерТочки = 1		
		|					ТОГДА	ВЫБОР 
		|							КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала			
		|									ТОГДА ШтатныеНадбавки.ДатаНачала		
		|								ИНАЧЕ ДвиженияРаботников.ДатаНачала 
		|							КОНЕЦ 
		|				ИНАЧЕ // ПлановыеНачисления.НомерТочки = 2
		|					ВЫБОР 
		|						КОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1) >= ШтатныеНадбавки.ДатаНачала			
		|							ИЛИ ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1) >= ДвиженияРаботников.ДатаНачала			
		|							ТОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаОкончания,ДЕНЬ), ДЕНЬ,1)		
		|						КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала			
		|							ТОГДА ШтатныеНадбавки.ДатаНачала		
		|						ИНАЧЕ ДвиженияРаботников.ДатаНачала 
		|					КОНЕЦ 
		|			КОНЕЦ 
		|			КАК ДатаНачала,
		|
		|			ВЫБОР 
		|				КОГДА ПлановыеНачисления.НомерТочки ЕСТЬ NULL ИЛИ ПлановыеНачисления.НомерТочки = 2		
		|					ТОГДА	ВЫБОР 
		|								КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания	
		|									ТОГДА ДвиженияРаботников.ДатаОкончания	
		|								ИНАЧЕ ШтатныеНадбавки.ДатаОкончания	
		|							КОНЕЦ 
 		|				ИНАЧЕ // ПлановыеНачисления.НомерТочки = 1 
		|					ВЫБОР 
		|						КОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1) <= ШтатныеНадбавки.ДатаОкончания			
		|							ИЛИ ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1) <= ДвиженияРаботников.ДатаОкончания			
		|							ТОГДА ДОБАВИТЬКДАТЕ(НачалоПЕРИОДА(ПлановыеНачисления.ДатаНачала,ДЕНЬ), ДЕНЬ,-1)		
		|						КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания	
		|							ТОГДА ДвиженияРаботников.ДатаОкончания	
		|						ИНАЧЕ ШтатныеНадбавки.ДатаОкончания	
		|					КОНЕЦ 
		|			КОНЕЦ 
		|			КАК ДатаОкончания,
		|
		|			ДвиженияРаботников.ПодразделениеОрганизации,
		|			ДвиженияРаботников.ПодразделениеУпр,
		|			ДвиженияРаботников.ГрафикРаботы,
		|			ДвиженияРаботников.Должность,
		|
		|			ШтатныеНадбавки.Показатель1,
		|			ШтатныеНадбавки.Показатель2,
		|			ШтатныеНадбавки.Показатель3,
		|			ШтатныеНадбавки.Показатель4,
		|			ШтатныеНадбавки.Показатель5,
		|			ШтатныеНадбавки.Показатель6,
		|			ШтатныеНадбавки.Валюта1,
		|			ШтатныеНадбавки.Валюта2,
		|			ШтатныеНадбавки.Валюта3,
		|			ШтатныеНадбавки.Валюта4,		
		|			ШтатныеНадбавки.Валюта5,		
		|			ШтатныеНадбавки.Валюта6		
		|
		|		ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников	
		|		ПО		РаботникиОрганизации.Назначение = ДвиженияРаботников.Назначение	
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШтатноеРасписание + " КАК ШтатныеНадбавки	
		|		ПО		ШтатныеНадбавки.ПодразделениеОрганизации = ДвиженияРаботников.ПодразделениеОрганизации
		|			И	ШтатныеНадбавки.Должность = ДвиженияРаботников.Должность
		|			И	ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаОкончания
		|			И	ШтатныеНадбавки.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|
		|   	// отрезок вытеснения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (	
		|			ВЫБРАТЬ
		|     	      1 КАК НомерТочки,
		|     	      ПлановыеНач.Сотрудник,
		|     	      ПлановыеНач.ОсновноеНачисление,
		|     	      ПлановыеНач.ДатаНачала	КАК ДатаНачала,
		|     	      &парамКонец 			КАК ДатаОкончания,
		|     	      ПлановыеНач.ВидРасчета
		|			ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНач
		|			ГДЕ НЕ ПлановыеНач.ОсновноеНачисление
		|
		|
		|       	ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ
		|       	    2 КАК НомерТочки,
		|       	    ПлановыеНач.Сотрудник,
		|       	    ПлановыеНач.ОсновноеНачисление,
		|        	   &парамКонец					КАК ДатаНачала,
		|        	   ПлановыеНач.ДатаОкончания	КАК ДатаОкончания,
		|        	   ПлановыеНач.ВидРасчета
		|			ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНач
		|			ГДЕ НЕ ПлановыеНач.ОсновноеНачисление
		|
		|			) КАК ПлановыеНачисления	
		|		ПО		РаботникиОрганизации.Назначение = ПлановыеНачисления.Сотрудник	
		|			И	ДвиженияРаботников.ДатаНачала <= ПлановыеНачисления.ДатаОкончания
		|			И	ПлановыеНачисления.ДатаНачала <= ДвиженияРаботников.ДатаОкончания
		|			И	ШтатныеНадбавки.ВидРасчета = ПлановыеНачисления.ВидРасчета
		|			И	(ВЫБОР КОГДА ДвиженияРаботников.ДатаНачала <= ШтатныеНадбавки.ДатаНачала ТОГДА ШтатныеНадбавки.ДатаНачала ИНАЧЕ ДвиженияРаботников.ДатаНачала КОНЕЦ
		|				<= ПлановыеНачисления.ДатаНачала
		|			ИЛИ	ПлановыеНачисления.ДатаОкончания
		|				<= ВЫБОР КОГДА ДвиженияРаботников.ДатаОкончания <= ШтатныеНадбавки.ДатаОкончания ТОГДА ДвиженияРаботников.ДатаОкончания	ИНАЧЕ ШтатныеНадбавки.ДатаОкончания  КОНЕЦ)
		|
		|   ) КАК Штатные
		|	ГДЕ Штатные.ДатаНачала <= Штатные.ДатаОкончания			
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Замены и их штатные надбавки
		|	ВЫБРАТЬ
		|		4 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение,
		|		ШтатныеНадбавки.ВидРасчета,
		|		ЛОЖЬ							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		NULL,
		|		ШтатныеНадбавки.Показатель1,
		|		ШтатныеНадбавки.Показатель2,
		|		ШтатныеНадбавки.Показатель3,
		|		ШтатныеНадбавки.Показатель4,
		|		ШтатныеНадбавки.Показатель5,
		|		ШтатныеНадбавки.Показатель6,
		|		ШтатныеНадбавки.Валюта1,
		|		ШтатныеНадбавки.Валюта2,
		|		ШтатныеНадбавки.Валюта3,
		|		ШтатныеНадбавки.Валюта4,		
		|		ШтатныеНадбавки.Валюта5,		
		|		ШтатныеНадбавки.Валюта6,		
		|		NULL	КАК ВидУчетаВремениДляСредней
		|	ИЗ ВТЗамены КАК Замены
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШтатноеРасписание + " КАК ШтатныеНадбавки	
		|	ПО		ШтатныеНадбавки.ПодразделениеОрганизации = Замены.ПодразделениеОрганизации
		|		И	ШтатныеНадбавки.Должность = Замены.Должность
		|		И	Замены.ДатаНачала <= ШтатныеНадбавки.ДатаОкончания
		|		И	ШтатныеНадбавки.ДатаНачала <= Замены.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.2.) Прочие плановые начисления по работникам кроме начислений по которым заменяли
		|	ВЫБРАТЬ
		|		5 КАК НомерЗапроса,
		|		РаботникиОрганизации.Сотрудник,
		|		РаботникиОрганизации.Назначение			КАК Назначение,
		|		Начисления.ВидРасчета,
		|		ЛОЖЬ									КАК ОсновноеНачисление,
		|		Начисления.ДатаНачала,
		|		Начисления.ДатаОкончания,
		|   	ДвиженияРаботников.ПодразделениеОрганизации,
		|   	ДвиженияРаботников.ПодразделениеУпр,
		|
		|		ДвиженияРаботников.ГрафикРаботы,
		|		ДвиженияРаботников.Должность,
		|
		|		Начисления.ДокументОснование,
		|		Начисления.Показатель1,
		|		Начисления.Показатель2,
		|		Начисления.Показатель3,
		|		Начисления.Показатель4,
		|		Начисления.Показатель5,
		|		Начисления.Показатель6,
		|		Начисления.Валюта1,
		|		Начисления.Валюта2,
		|		Начисления.Валюта3,
		|		Начисления.Валюта4,		
		|		Начисления.Валюта5,		
		|		Начисления.Валюта6,		
		|		Начисления.ВидУчетаВремениДляСредней
		|
		|	ИЗ " + ТекстЗапросаВТСписокРаботники + " КАК РаботникиОрганизации
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК Начисления	
		|	ПО		РаботникиОрганизации.Назначение = Начисления.Сотрудник	
		|		И	НЕ Начисления.ОсновноеНачисление
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (	
		|		ВЫБРАТЬ
		|			ПлановыеНачисления.Сотрудник  КАК Сотрудник,
		|			ПлановыеНачисления.ВидРасчета  КАК ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала  КАК ДатаНачала,
		|			МАКСИМУМ(Движения.ДатаНачала)  КАК АктуальнаяДата
		|		ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНачисления	
		|		ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК Движения
		|   	ПО		Движения.Сотрудник = ПлановыеНачисления.Сотрудник
		|			И	Движения.ДатаНачала <= ПлановыеНачисления.ДатаНачала
		|		ГДЕ	НЕ ПлановыеНачисления.ОсновноеНачисление
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисления.Сотрудник,
		|			ПлановыеНачисления.ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала
		|	) КАК ПериодАктуальногоДвижения
		|	ПО 		ПериодАктуальногоДвижения.Сотрудник = Начисления.Сотрудник
		|		И	ПериодАктуальногоДвижения.ВидРасчета = Начисления.ВидРасчета		
		|		И	ПериодАктуальногоДвижения.ДатаНачала = Начисления.ДатаНачала		
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников
		|	ПО		ДвиженияРаботников.Назначение = РаботникиОрганизации.Назначение
		|		И	ПериодАктуальногоДвижения.АктуальнаяДата = ДвиженияРаботников.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ 
		|// (п.2.) Прочие плановые начисления только по работникам которых заменяли
		|	ВЫБРАТЬ
		|		5 КАК НомерЗапроса,
		|		Замены.Сотрудник,
		|		Замены.Назначение			КАК Назначение,
		|		Начисления.ВидРасчета,
		|		ЛОЖЬ									КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|   	Замены.ПодразделениеОрганизации,
		|   	Замены.ПодразделениеУпр,
		|
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		Замены.ДокументОснование,
		|		Начисления.Показатель1,
		|		Начисления.Показатель2,
		|		Начисления.Показатель3,
		|		Начисления.Показатель4,
		|		Начисления.Показатель5,
		|		Начисления.Показатель6,
		|		Начисления.Валюта1,
		|		Начисления.Валюта2,
		|		Начисления.Валюта3,
		|		Начисления.Валюта4,		
		|		Начисления.Валюта5,		
		|		Начисления.Валюта6,		
		|		Начисления.ВидУчетаВремениДляСредней
		|
		|	ИЗ ВТЗамены КАК Замены
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПлановыеНачисления + " КАК Начисления	
		|	ПО		Замены.Назначение = Начисления.Сотрудник	
		|		И	Начисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Надбавка)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (	
		|		ВЫБРАТЬ
		|			ПлановыеНачисления.Сотрудник  КАК Сотрудник,
		|			ПлановыеНачисления.ВидРасчета  КАК ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала  КАК ДатаНачала,
		|			МАКСИМУМ(Движения.ДатаНачала)  КАК АктуальнаяДата
		|		ИЗ " + ТекстЗапросаВТПлановыеНачисления + " КАК ПлановыеНачисления	
		|		ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК Движения
		|   	ПО		Движения.Сотрудник = ПлановыеНачисления.Сотрудник
		|			И	Движения.ДатаНачала <= ПлановыеНачисления.ДатаНачала
		|		ГДЕ	ПлановыеНачисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Надбавка) 
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисления.Сотрудник,
		|			ПлановыеНачисления.ВидРасчета,
		|			ПлановыеНачисления.ДатаНачала
		|	) КАК ПериодАктуальногоДвижения
		|	ПО 		ПериодАктуальногоДвижения.Сотрудник = Начисления.Сотрудник
		|		И	ПериодАктуальногоДвижения.ВидРасчета = Начисления.ВидРасчета		
		|		И	ПериодАктуальногоДвижения.ДатаНачала = Начисления.ДатаНачала		
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТДвиженияРаботников + " КАК ДвиженияРаботников
		|	ПО		ДвиженияРаботников.Назначение = Замены.Назначение
		|		И	ПериодАктуальногоДвижения.АктуальнаяДата = ДвиженияРаботников.ДатаНачала
		|	
		|	
		|	
		|//------------------------------------------------------------------------------------	
		|	ОБЪЕДИНИТЬ ВСЕ
		|// (п.1.) Надо вытеснить основной оклад если было Замещение
		|	ВЫБРАТЬ
		|		6 КАК НомерЗапроса,
		|		Замены.Сотрудник КАК Сотрудник,
		|		Замены.Сотрудник КАК Назначение,
		|		Замены.ВидРасчета,
		|		ЛОЖЬ							КАК ОсновноеНачисление,
		|		Замены.ДатаНачала				КАК ДатаНачала,
		|		Замены.ДатаОкончания			КАК ДатаОкончания,
		|		Замены.ПодразделениеОрганизации,
		|		Замены.ПодразделениеУпр,
		|		Замены.ГрафикРаботы,
		|		Замены.Должность,
		|
		|		NULL,
		|		NULL КАК Показатель1,
		|		NULL КАК Показатель2,
		|		NULL КАК Показатель3,
		|		NULL КАК Показатель4,
		|		NULL КАК Показатель5,
		|		NULL КАК Показатель6,
		|		&парамВалютаУчета КАК Валюта1,
		|		NULL КАК Валюта2,
		|		NULL КАК Валюта3,
		|		NULL КАК Валюта4,		
		|		NULL КАК Валюта5,		
		|		NULL КАК Валюта6,		
		|		NULL КАК ВидУчетаВремениДляСредней
		|
		|	ИЗ ВТЗамены КАК Замены
		|	
		|	ГДЕ Замены.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Замещение)
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВсеНачисленияБезИзмененияОкладов";
	
	//	ВТОкладТариф
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Начисления.Организация	КАК Организация,
		|	Начисления.Сотрудник	КАК Назначение,
		|	Начисления.ВидРасчета	КАК ВидРасчета,
		|
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ					КАК СпособУчетаВремени,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ					КАК ОкладТариф,
		|
		|	Начисления.Валюта1		КАК Валюта1,
		|	Начисления.Период		КАК ДатаНачала,
		|	МИНИМУМ(Окончания.Период)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТОкладТариф	
		|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
		|ПО Валюты1.Валюта = Начисления.Валюта1 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Окончания
		|ПО Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = Окончания.Сотрудник
		|	И	Начисления.ВидРасчета = Окончания.ВидРасчета
		|	И	Начисления.Период < Окончания.Период
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ(
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|   НаборПоказателей.Ссылка	КАК ВидРасчета,
		|   НаборПоказателей.Показатель	КАК Показатель
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК НаборПоказателей
		|	ГДЕ		НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|) КАК НаборПоказателей
		|ПО Начисления.ВидРасчета = НаборПоказателей.ВидРасчета
		|
		|ГДЕ		Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник В (ВЫБРАТЬ Назначение ИЗ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК Работники)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Организация,
		|	Начисления.Сотрудник,
		|	Начисления.ВидРасчета,
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ,
		|
		|	Начисления.Валюта1,
		|	Начисления.Период
 		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОкладТариф";
	
	//	ВТВсеНачисления
	ТекстЗапросаВТ = "
	|	ВЫБРАТЬ 
	|		СписокНачислений1.Сотрудник			КАК Сотрудник,
	|		СписокНачислений1.Назначение		КАК Назначение,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаНачала,СписокНачислений1.ДатаНачала) <= СписокНачислений1.ДатаНачала		ТОГДА СписокНачислений1.ДатаНачала	ИНАЧЕ Оклады1.ДатаНачала		КОНЕЦ			КАК ДатаНачала,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаОкончания,СписокНачислений1.ДатаОкончания) < СписокНачислений1.ДатаОкончания	ТОГДА Оклады1.ДатаОкончания	ИНАЧЕ СписокНачислений1.ДатаОкончания	КОНЕЦ	КАК ДатаОкончания,
	|		СписокНачислений1.ВидРасчета		КАК ВидРасчета,
	|
	|		СписокНачислений1.НомерЗапроса,
	|		СписокНачислений1.ОсновноеНачисление,
	|		СписокНачислений1.ПодразделениеОрганизации,
	|		СписокНачислений1.ПодразделениеУпр,
	|		СписокНачислений1.ГрафикРаботы,
	|		СписокНачислений1.Должность,
	|
	|		СписокНачислений1.ДокументОснование,
	|		СписокНачислений1.Показатель1,
	|		СписокНачислений1.Показатель2,
	|		СписокНачислений1.Показатель3,
	|		СписокНачислений1.Показатель4,
	|		СписокНачислений1.Показатель5,
	|		СписокНачислений1.Показатель6,
	|		СписокНачислений1.Валюта1,
	|		СписокНачислений1.Валюта2,
	|		СписокНачислений1.Валюта3,
	|		СписокНачислений1.Валюта4,		
	|		СписокНачислений1.Валюта5,		
	|		СписокНачислений1.Валюта6,		
	|		СписокНачислений1.ВидУчетаВремениДляСредней,
	|		МАКСИМУМ(Оклады2.ДатаНачала) КАК ДатаНачалаОклада
	|ПОМЕСТИТЬ ВТВсеНачисления	
	|	ИЗ ВТВсеНачисленияБезИзмененияОкладов КАК СписокНачислений1
	|	//-----------------------
	|	// данные о видах показателей
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|	ПО		ТипПоказатель1.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель1.НомерСтроки = 1
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|	ПО		ТипПоказатель2.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель2.НомерСтроки = 2
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|	ПО		ТипПоказатель3.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель3.НомерСтроки = 3
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|	ПО		ТипПоказатель4.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель4.НомерСтроки = 4
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|	ПО		ТипПоказатель5.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель5.НомерСтроки = 5
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|	ПО		ТипПоказатель6.Ссылка = СписокНачислений1.ВидРасчета И ТипПоказатель6.НомерСтроки = 6
	|	//-----------------------
	|	// данные об окладе
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады1
	|	ПО		СписокНачислений1.Назначение = Оклады1.Назначение
	| 		И  (СписокНачислений1.ДатаНачала <= Оклады1.ДатаОкончания ИЛИ Оклады1.ДатаОкончания ЕСТЬ NULL)
	| 		И  Оклады1.ДатаНачала <= СписокНачислений1.ДатаОкончания
	|		И	(ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель2.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель3.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель4.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель5.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	ТипПоказатель6.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|		ИЛИ	СписокНачислений1.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы)
	|		ИЛИ	СписокНачислений1.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы))
	|	//-----------------------
	|	// данные об окладе
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады2
	|	ПО		СписокНачислений1.Назначение = Оклады2.Назначение
	| 		И  (СписокНачислений1.ДатаНачала <= Оклады2.ДатаОкончания ИЛИ Оклады1.ДатаОкончания ЕСТЬ NULL)
	| 		И  Оклады2.ДатаНачала <= СписокНачислений1.ДатаОкончания
	|	СГРУППИРОВАТЬ ПО 
	|		СписокНачислений1.Сотрудник,
	|		СписокНачислений1.Назначение,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаНачала,СписокНачислений1.ДатаНачала) <= СписокНачислений1.ДатаНачала		ТОГДА СписокНачислений1.ДатаНачала	ИНАЧЕ Оклады1.ДатаНачала		КОНЕЦ,
	|		ВЫБОР КОГДА ЕСТЬNULL(Оклады1.ДатаОкончания,СписокНачислений1.ДатаОкончания) < СписокНачислений1.ДатаОкончания	ТОГДА Оклады1.ДатаОкончания	ИНАЧЕ СписокНачислений1.ДатаОкончания	КОНЕЦ,
	|		СписокНачислений1.ВидРасчета,
	|
	|		СписокНачислений1.НомерЗапроса,
	|		СписокНачислений1.ОсновноеНачисление,
	|		СписокНачислений1.ПодразделениеОрганизации,
	|		СписокНачислений1.ПодразделениеУпр,
	|		СписокНачислений1.ГрафикРаботы,
	|		СписокНачислений1.Должность,
	|
	|		СписокНачислений1.ДокументОснование,
	|		СписокНачислений1.Показатель1,
	|		СписокНачислений1.Показатель2,
	|		СписокНачислений1.Показатель3,
	|		СписокНачислений1.Показатель4,
	|		СписокНачислений1.Показатель5,
	|		СписокНачислений1.Показатель6,
	|		СписокНачислений1.Валюта1,
	|		СписокНачислений1.Валюта2,
	|		СписокНачислений1.Валюта3,
	|		СписокНачислений1.Валюта4,		
	|		СписокНачислений1.Валюта5,		
	|		СписокНачислений1.Валюта6,		
	|		СписокНачислений1.ВидУчетаВремениДляСредней
	|";
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	ТекстЗапросаВТВсеНачисления = "ВТВсеНачисления";
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВсеНачисления";
		
	//	ВТЗначенияПоказателей
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.Сотрудник,
		|	ЗначенияПоказателей.Подразделение,
		|	ЗначенияПоказателей.Показатель,
		|	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|		И НЕ (ЗначенияПоказателей.Валюта В (&парамВалютаУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателей.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателей.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателей
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты
		|ПО Валюты.Валюта = ЗначенияПоказателей.Валюта 
		|	
		|ГДЕ	ЗначенияПоказателей.Организация = &парамОрганизация
		|	И	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) = &парамНачало
		|	И	(ЗначенияПоказателей.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|	ИЛИ	ЗначенияПоказателей.Сотрудник В (ВЫБРАТЬ Назначение ИЗ ВТСписокРаботникиИЗамены КАК Работники))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗначенияПоказателей";
	
	//	ВТПоказатели
	Если Истина Тогда 
		//	Описание:
		// 		
		//		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПодразделенияВПоказателях.Сотрудник КАК Сотрудник,
		|	СотрудникиПодразделенияВПоказателях.Подразделение КАК Подразделение,
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение, Сотрудник ИЗ ВТЗначенияПоказателей КАК ЗначенияПоказателей) КАК СотрудникиПодразделенияВПоказателях
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|	ПО Показатели.Ссылка = Показатели1.Ссылка И Показатели1.НомерСтроки = 1
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|	ПО Показатели.Ссылка = Показатели2.Ссылка И Показатели2.НомерСтроки = 2
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|	ПО Показатели.Ссылка = Показатели3.Ссылка И Показатели3.НомерСтроки = 3
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|	ПО Показатели.Ссылка = Показатели4.Ссылка И Показатели4.НомерСтроки = 4
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|	ПО Показатели.Ссылка = Показатели5.Ссылка И Показатели5.НомерСтроки = 5
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|	ПО Показатели.Ссылка = Показатели6.Ссылка И Показатели6.НомерСтроки = 6
		|	
		|) КАК ПоказателиВидовРасчета
		|ПО ИСТИНА
		|	
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|ПО 	ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей1.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей1.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|ПО		ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей2.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей2.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|ПО		ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей3.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей3.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|ПО		ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей4.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей4.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|ПО		ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей5.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей5.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|ПО		ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей6.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей6.Подразделение
		|
		|ГДЕ	ЗначенияПоказателей1.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей2.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей3.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей4.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей5.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей6.Значение ЕСТЬ НЕ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоказатели";

	//Основной текст запроса
	ОсновнойТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ИСТИНА КАК Авторасчет,
	|	СписокНачислений.Сотрудник		КАК Сотрудник,
	|	СписокНачислений.Назначение		КАК Назначение,
	|	СписокНачислений.ДатаНачала			КАК ДатаНачала,
	|	СписокНачислений.ДатаОкончания		КАК ДатаОкончания,
	|	СписокНачислений.ДатаНачала			КАК БазовыйПериодНачало,
	|	СписокНачислений.ДатаОкончания		КАК БазовыйПериодКонец,
	|	СписокНачислений.ОсновноеНачисление КАК ОсновноеНачисление,
	|	СписокНачислений.ВидРасчета КАК ВидРасчета,
	|	СписокНачислений.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	|	СписокНачислений.Валюта1 КАК Валюта,
	|	СписокНачислений.Валюта2 КАК Валюта2,
	|	СписокНачислений.ДокументОснование	КАК ДокументОснование,
	|
	|	ВЫБОР
	|		КОГДА СписокНачислений.Валюта1 = &парамВалютаУчета
	|				ИЛИ СписокНачислений.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Валюты1.Курс
	|	КОНЕЦ КАК КурсВалюты,		
	|	";
	ТекстПоказатель1 = "
	|			ВЫБОР
	|				КОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|					//СПЕЦИАЛЬНЫЕ
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА	ВЫБОР	КОГДА Оклады.СпособУчетаВремени = ""ЗА МЕСЯЦ"" И ДанныеКалендаря.НормаЧасовЗаМесяц > 0
	|										ТОГДА Оклады.ОкладТариф/ДанныеКалендаря.НормаЧасовЗаМесяц
	|									КОГДА Оклады.СпособУчетаВремени = ""ЗА ДЕНЬ""
	|										ТОГДА Оклады.ОкладТариф/8
	|									ИНАЧЕ Оклады.ОкладТариф
	|							КОНЕЦ
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТариф)   
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА	Оклады.ОкладТариф                                                               
	|				КОГДА СписокНачислений.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
	|						ИЛИ СписокНачислений.Валюта1 = &парамВалютаУчета
	|						ИЛИ СписокНачислений.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|                   // валюту пересчитывать не надо
	|					ТОГДА ЕСТЬNULL(СписокНачислений.Показатель1, 0)
	|				ИНАЧЕ ЕСТЬNULL(СписокНачислений.Показатель1, 0) * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|			КОНЕЦ
	|	";
	ТекстПоказатель2 = СтрЗаменить(ТекстПоказатель1, "1", "2");
	ТекстПоказатель3 = СтрЗаменить(ТекстПоказатель1, "1", "3");
	ТекстПоказатель4 = СтрЗаменить(ТекстПоказатель1, "1", "4");
	ТекстПоказатель5 = СтрЗаменить(ТекстПоказатель1, "1", "5");
	ТекстПоказатель6 = СтрЗаменить(ТекстПоказатель1, "1", "6");
	
	//Некоторые способы расчета имеют "виртуальный" показатель 1 "часовой тариф"
	ТекстПоказатель1 = СтрЗаменить(ТекстПоказатель1, "//СПЕЦИАЛЬНЫЕ", 
	"ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы) 
	|ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)");

	
	ОсновнойТекстЗапроса =  ОсновнойТекстЗапроса + "
	|	" + ТекстПоказатель1 + " КАК Показатель1,
	|	" + ТекстПоказатель2 + " КАК Показатель2,
	|	" + ТекстПоказатель3 + " КАК Показатель3,
	|	" + ТекстПоказатель4 + " КАК Показатель4,
	|	" + ТекстПоказатель5 + " КАК Показатель5,
	|	" + ТекстПоказатель6 + " КАК Показатель6,
	|	СписокНачислений.ВидУчетаВремениДляСредней,
	|	СписокНачислений.ГрафикРаботы		КАК ГрафикРаботы,
	|	ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц,
	|	ЕСТЬNULL(СписокНачислений.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	СписокНачислений.ПодразделениеУпр,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисления.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УжеПроведен,
	|	СписокНачислений.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ " + ТекстЗапросаВТВсеНачисления + " КАК СписокНачислений
	|
	|//-----------------------
	|// курсы валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как ВалютыУчета
	|ПО ВалютыУчета.Валюта = &парамВалютаУчета 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
	|ПО Валюты1.Валюта = СписокНачислений.Валюта1 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты2
	|ПО Валюты2.Валюта = СписокНачислений.Валюта2 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты3
	|ПО Валюты3.Валюта = СписокНачислений.Валюта3 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты4
	|ПО Валюты4.Валюта = СписокНачислений.Валюта4 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты5
	|ПО Валюты5.Валюта = СписокНачислений.Валюта5 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты6
	|ПО Валюты6.Валюта = СписокНачислений.Валюта6 
	|
	|//-----------------------
	|// Выборка сведений о уже выполненных начислениях за отработанное время 
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновныеНачисления.Сотрудник				КАК Сотрудник,
	|		ОсновныеНачисления.Назначение				КАК Назначение,
	|		ОсновныеНачисления.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|		ОсновныеНачисления.ПодразделениеУпр			КАК ПодразделениеУпр
	|	ИЗ РегистрРасчета.Начисления КАК ОсновныеНачисления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТСписокРаботникиИЗамены + " КАК ТаблицаДвиженийРаботников
	|	ПО ОсновныеНачисления.Назначение = ТаблицаДвиженийРаботников.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.Сторнирование КАК Сторнирование
	|	ПО Сторнирование.СторнируемыйДокумент = ОсновныеНачисления.Регистратор
	|	ГДЕ		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|		И	ОсновныеНачисления.ПериодДействияКонец <= &парамКонец
	|		И	ОсновныеНачисления.ПериодДействияНачало >= &парамНачало
	|		И	ОсновныеНачисления.Организация = &парамОрганизация
	|		И	ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|		И	ОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
	|		И	НЕ ОсновныеНачисления.Сторно
	|		И	ОсновныеНачисления.Регистратор <> &парамРегистратор
	|		И	ОсновныеНачисления.Регистратор ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций		
	|		И	ОсновныеНачисления.Организация = &парамОрганизация
 	|		И	Сторнирование.Ссылка ЕСТЬ NULL
	|) КАК ОсновныеНачисления
	|ПО		ОсновныеНачисления.Сотрудник = СписокНачислений.Сотрудник
	|	И	ОсновныеНачисления.ПодразделениеОрганизации = СписокНачислений.ПодразделениеОрганизации		
	|       
	|
	|//-----------------------
	|// данные нормы календаря
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ГрафикиРаботы.ГрафикРаботы                 КАК ГрафикРаботы,
	|		СУММА( ГрафикиРаботы.ОсновноеЗначение  )      КАК НормаДнейЗаМесяц,
	|		СУММА( ГрафикиРаботы.ДополнительноеЗначение ) КАК НормаЧасовЗаМесяц
	|	ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|	ГДЕ		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ ) = &парамНачало 
	|		И	ГрафикиРаботы.ВидУчетаВремени = &парамПоДням 
	|	СГРУППИРОВАТЬ ПО
	|			ГрафикиРаботы.ГрафикРаботы
	|) КАК ДанныеКалендаря
	|ПО		ВЫБОР	КОГДА НЕ СписокНачислений.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику	
	|		     			ТОГДА ДанныеКалендаря.ГрафикРаботы = СписокНачислений.ГрафикРаботы 
	|					ИНАЧЕ ДанныеКалендаря.ГрафикРаботы = СписокНачислений.ГрафикРаботы.ГрафикРаботыНормыВремени
	|		КОНЕЦ 
	|	//И	СписокНачислений.ОсновноеНачисление
	|
	|//-----------------------
	|// данные о видах показателей
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|ПО		ТипПоказатель1.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель1.НомерСтроки = 1
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|ПО		ТипПоказатель2.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель2.НомерСтроки = 2
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|ПО		ТипПоказатель3.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель3.НомерСтроки = 3
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|ПО		ТипПоказатель4.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель4.НомерСтроки = 4
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|ПО		ТипПоказатель5.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель5.НомерСтроки = 5
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|ПО		ТипПоказатель6.Ссылка = СписокНачислений.ВидРасчета И ТипПоказатель6.НомерСтроки = 6
	|
	|//-----------------------
	|// данные об окладах
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады
	|ПО		СписокНачислений.Назначение = Оклады.Назначение
	| 	И  Оклады.ДатаНачала = СписокНачислений.ДатаНачалаОклада
	| 	И  Оклады.ВидРасчета = СписокНачислений.ВидРасчета
	|//-----------------------
	|// данные показателей Схем Мотиваций
	|// по конкретным сотрудникам
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоСотруднику
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоСотруднику.ВидРасчета
	|	И	СписокНачислений.Назначение = ПоказателиСхемМотивацийПоСотруднику.Сотрудник
	|
	|// по подразделению
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделению
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоПодразделению.ВидРасчета
	|	И	СписокНачислений.ПодразделениеОрганизации = ПоказателиСхемМотивацийПоПодразделению.Подразделение
	|
	|// по подразделению упр.
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделениюУпр
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоПодразделениюУпр.ВидРасчета
	|	И	СписокНачислений.ПодразделениеУпр = ПоказателиСхемМотивацийПоПодразделениюУпр.Подразделение
	|
	|// организации
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоОрганизации
	|ПО		СписокНачислений.ВидРасчета = ПоказателиСхемМотивацийПоОрганизации.ВидРасчета
	|	И	ПоказателиСхемМотивацийПоОрганизации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	И	ПоказателиСхемМотивацийПоОрганизации.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) 
	|ГДЕ
	|   СписокНачислений.ВидРасчета В (&парамБазаИндексации)
	|   ИЛИ СписокНачислений.ВидРасчета.СпособРасчета = &парамСРИндексация
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование,
	|	СписокНачислений.Сотрудник,
	|	// основные начисления должны быть ввержу, а внутренее совместительство и замены внизу
	|	ВЫБОР КОГДА СписокНачислений.Сотрудник = СписокНачислений.Назначение ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ, 
	|	СписокНачислений.Назначение,
	|	СписокНачислений.ОсновноеНачисление Убыв, // основное начисление должно встретиться в выборке первым
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.ВидРасчета
	|";
	
	Запрос.Текст = ОсновнойТекстЗапроса;
	
	ВыборкаНачисления = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНачисления.Следующий() Цикл
		
		Если  ВыборкаНачисления.УжеПроведен Тогда
			
			// пропускаем такие записи: они уже введены другими документами или соответствуют окончанию назначения работника
			// необходимо сообщить пользователю что работник уже посчитан; 
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока	= Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНачисления);
		Если НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.ГодоваяПремия
			ИЛИ НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.Премия
			ИЛИ НоваяСтрока.ВидРасчета.ВидПремии = Перечисления.ВидыПремии.ПремияПропорционально
			Тогда
			НоваяСтрока.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(НачалоМесяца(НоваяСтрока.БазовыйПериодНачало),-Мин(НоваяСтрока.ВидРасчета.ЧислоМесяцев, 1)));
			НоваяСтрока.БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(НоваяСтрока.БазовыйПериодНачало),-НоваяСтрока.ВидРасчета.ЧислоМесяцев);
		КонецЕсли;
		

	КонецЦикла;

КонецПроцедуры	

Процедура ДобавитьСтрокиВзносыПоРаботнику(Выборка) Экспорт
	
	ЗапросВзносы = Новый Запрос;
	ЗапросВзносы.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
	ЗапросВзносы.УстановитьПараметр("Организация", Организация);
	ЗапросВзносы.УстановитьПараметр("Период",  Дата);
	ЗапросВзносы.УстановитьПараметр("ПустойВзнос", Справочники.Налоги.ПустаяСсылка());
	ЗапросВзносы.УстановитьПараметр("ВзносыФОТ", Справочники.Налоги.ВзносыФОТ);
	
	ЗапросВзносы.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА Налог.Родитель=&ВзносыФОТ ТОГДА ""ВзносыФОТ"" ИНАЧЕ ""Взносы"" КОНЕЦ КАК ВидВзносов,
	|	Взносы.Сотрудник КАК Сотрудник,
	|	&Организация	КАК Организация,
	|	Взносы.Налог	КАК Налог	
	|ИЗ
	|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(&Период, Организация = &Организация И Сотрудник = &Сотрудник) КАК Взносы
	|
	|ГДЕ
	|	(Взносы.Налог <> &ПустойВзнос)
	|   И Взносы.Актуальность";
	ВыборкаВзносы = ЗапросВзносы.Выполнить().Выбрать();
		
	СтруктураПоиска = Новый Структура("Сотрудник, Налог, Действие"); 
	СтруктураПоиска.Действие   = Перечисления.ВидыДействияСНачислением.НеИзменять;
	Пока ВыборкаВзносы.Следующий() Цикл
		
		СтруктураПоиска.Сотрудник    	= ВыборкаВзносы.Сотрудник;
		СтруктураПоиска.Налог 	= ВыборкаВзносы.Налог;
		Если ВыборкаВзносы.ВидВзносов 	= "ВзносыФОТ" Тогда
			МассивВзносов = ВзносыФОТ.НайтиСтроки(СтруктураПоиска);
		Иначе	
			МассивВзносов = Взносы.НайтиСтроки(СтруктураПоиска);
		КонецЕсли; 
		
		Если МассивВзносов.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли; 

		Если ВыборкаВзносы.ВидВзносов = "ВзносыФОТ" Тогда
			НоваяСтрокаТЧ 					= ВзносыФОТ.Добавить();
		Иначе
			НоваяСтрокаТЧ 					= Взносы.Добавить();
		КонецЕсли;			
		
		НоваяСтрокаТЧ.Сотрудник	 		= ВыборкаВзносы.Сотрудник;
		НоваяСтрокаТЧ.Налог		 		= ВыборкаВзносы.Налог;
		НоваяСтрокаТЧ.Действие   		= Перечисления.ВидыДействияСНачислением.НеИзменять;
		НоваяСтрокаТЧ.ДатаДействия  	= Дата;		
	КонецЦикла;
	
	Если ВыборкаВзносы.Количество() = 0 и (Выборка.Сотрудник.ВидЗанятости <> Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство) Тогда
		Если НЕ ПроведениеРасчетов.ИспользуетсяЕСВ(Дата) Тогда
			ДобавитьСтрокуВзносы( Выборка, Взносы, Справочники.Налоги.Безработица );
			ДобавитьСтрокуВзносы( Выборка, Взносы, Справочники.Налоги.Пенсионный );
			ДобавитьСтрокуВзносы( Выборка, Взносы, Справочники.Налоги.Соцстрах );
			
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.БезработицаФОТ );
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.ПенсионныйФОТ );
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.СоцстрахФОТ );
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.СоцстрахНесчФОТ );
		Иначе
			ДобавитьСтрокуВзносы( Выборка, Взносы, Справочники.Налоги.ЕСВРаботники );
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.ЕСВФОТРаботники );
			ДобавитьСтрокуВзносы( Выборка, Взносы, Справочники.Налоги.ЕСВБольничные );
			ДобавитьСтрокуВзносы( Выборка, ВзносыФОТ, Справочники.Налоги.ЕСВФОТБольничные );
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВзносы(Выборка, ТабЧасть, Налог)
	
	  ТекущаяСтрока = ТабЧасть.Добавить();
	  ТекущаяСтрока.Сотрудник		= Выборка.Сотрудник;
	  ТекущаяСтрока.ДатаДействия	= Выборка.ДатаДействия;
	  ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
	  ТекущаяСтрока.Налог			= Налог;
	  
  КонецПроцедуры
  
Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, НаборЗаписей, ОбнулитьРезультат = Ложь)
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
 	Движение.ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоСтрокамДокумента, ВыборкаПоСтрокамДокумента.СуммированныйУчетРабочегоВремени);
	Если ОбнулитьРезультат Тогда
		Движение.Результат = 0;
		Движение.ОплаченоДнейЧасов = 0;
	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

Функция Рассчитать(ТЧ, ИмяТЧ) Экспорт
	
	//массивы для хранения индексов строк табличных частей,
	//используются для расчета по одному сотруднику
	МассивИндексыСтрокНачисления = Новый Массив();
	
	Отказ = Ложь;
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	Прочитать();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке("ПоРеквизитамДокумента").Выбрать();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	Сотрудники = РаботникиОрганизации.ВыгрузитьКолонку("Сотрудник");
	
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениямДоПосле(ИмяТЧ,Сотрудники).Выбрать();
	ЗафиксироватьТранзакцию();
	
	// Создадим рабочие наборы записей
	НаборНачисления = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
	НаборНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл

		//ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоНачислениям, ИмяТЧ, Отказ);  ???
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, НаборНачисления, Истина);
			МассивИндексыСтрокНачисления.Добавить(ВыборкаПоНачислениям.НомерСтроки-1);
			
		КонецЕсли;
		
	КонецЦикла;
	НаборНачисления.Записать();
	
	Если Отказ Тогда
		
		// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
		// Удаляем движения
		НаборНачисления.Очистить();
		НаборНачисления.Записать();
		
		Возврат Не Отказ;
		
	КонецЕсли;
	
	
	
	// рассчитываем записи
	// при этом передаем не только набор записей регистра расчета, но и набор записей регисра 
	// накопления со сведениями об отработанном времени
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("Начисления", 
														НаборНачисления, 
														ТЧ, 
														МассивИндексыСтрокНачисления, 
														Сотрудники, 
														Ложь);
	
	// Удаляем движения
	НаборНачисления.Очистить();
	НаборНачисления.Записать();
	
	Записать();
	
	Возврат Не Отказ;
	

КонецФункции // Рассчитать()	

Функция РассчитатьИндексацию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("СРИндексация" , Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыДо
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.НачисленияДо КАК ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыДоБезИндексации
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.НачисленияДо КАК ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Ссылка = &ДокументСсылка
	|	И ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.ВидРасчета.СпособРасчета <> &СРИндексация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник КАК Сотрудник,
	|	СУММА(ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.ОплаченоДнейЧасов) КАК Результат
	|ПОМЕСТИТЬ ВТФиксированнаяИндексация
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.НачисленияДо КАК ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Ссылка = &ДокументСсылка
	|	И ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.ВидРасчета.СпособРасчета = &СРИндексация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияДо.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияПосле.Сотрудник КАК Сотрудник,
	|	СУММА(ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияПосле.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыПосле
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.НачисленияПосле КАК ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияПосле
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияПосле.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводСведенийОПлановыхНачисленияхУдержанияхНачисленияПосле.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводСведенийОПлановыхНачисленияхУдержаниях.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0) КАК ФиксированнаяИндексацияДо,
	|	ЕСТЬNULL(ДоходыДо.Результат, 0) КАК ДоходДо,
	|	ЕСТЬNULL(ДоходыПосле.Результат, 0) КАК ДоходПосле,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) <= ЕСТЬNULL(ДоходыДоБезИндексации.Результат, 0)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ДоходыПосле.Результат, 0) - ЕСТЬNULL(ДоходыДоБезИндексации.Результат, 0)
	|	КОНЕЦ КАК Повышение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыПосле.Результат, 0) > ЕСТЬNULL(ДоходыДо.Результат, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ДоходыДо.Результат, 0) - ЕСТЬNULL(ДоходыПосле.Результат, 0) > ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0)
	|			ТОГДА ЕСТЬNULL(ДоходыДо.Результат, 0) - ЕСТЬNULL(ДоходыПосле.Результат, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаФиксированнаяИндексация.Результат, 0)
	|	КОНЕЦ КАК ФиксированнаяИндексация
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.РаботникиОрганизации КАК ВводСведенийОПлановыхНачисленияхУдержаниях
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДо КАК ДоходыДо
	|		ПО ВводСведенийОПлановыхНачисленияхУдержаниях.Сотрудник = ДоходыДо.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоБезИндексации КАК ДоходыДоБезИндексации
	|		ПО ВводСведенийОПлановыхНачисленияхУдержаниях.Сотрудник = ДоходыДоБезИндексации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированнаяИндексация КАК ТаблицаФиксированнаяИндексация
	|		ПО ВводСведенийОПлановыхНачисленияхУдержаниях.Сотрудник = ТаблицаФиксированнаяИндексация.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПосле КАК ДоходыПосле
	|		ПО ВводСведенийОПлановыхНачисленияхУдержаниях.Сотрудник = ДоходыПосле.Сотрудник
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержаниях.Ссылка = &ДокументСсылка";
	
	ТЗРаботникиОрганизации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Работник из ТЗРаботникиОрганизации Цикл
		Если Работник.Повышение <=0 И
			Работник.ФиксированнаяИндексация > 0 Тогда
			//Что делать с фиксированной индексацией в этом случае - не известно
			//Будем считать, что она остается прежней (не увеличивается, не закрывается)
			Работник.ФиксированнаяИндексация = Работник.ФиксированнаяИндексацияДо;
		КонецЕсли;
	КонецЦикла;
	
	РаботникиОрганизации.Загрузить(ТЗРаботникиОрганизации);
		
	Записать();
	
КонецФункции

Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	|	КоэффициентИндексацииЗаработка,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоРаботникиОрганизацииНачисления(Режим)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Основное", Перечисления.ВидыНачисленийРаботникаОрганизации.Основное);

	//ВТПоказатели
	Если Истина Тогда
		// получим временную таблицу с расчетом показателей
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
		|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
		|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
		|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
		|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
		|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
		|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
		|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
		|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
		|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
		|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
		|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
		|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
		|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
		|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
		|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
		|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
		|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
		|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
		|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
		|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
		|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный,
		|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
		|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
		|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
		|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ
		|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Начисления КАК ТЧОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели1.Ссылка
		|			И (Показатели1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели2.Ссылка
		|			И (Показатели2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели3.Ссылка
		|			И (Показатели3.НомерСтроки = 3)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели4.Ссылка
		|			И (Показатели4.НомерСтроки = 4)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели5.Ссылка
		|			И (Показатели5.НомерСтроки = 5)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели6.Ссылка
		|			И (Показатели6.НомерСтроки = 6)
		|ГДЕ
		|	ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧОсновныеНачисления.ВидРасчета,
		|	Показатели1.Показатель,
		|	Показатели2.Показатель,
		|	Показатели3.Показатель,
		|	Показатели4.Показатель,
		|	Показатели5.Показатель,
		|	Показатели6.Показатель,
		|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели1.Показатель.Предопределенный,
		|	Показатели1.Показатель.Наименование,
		|	Показатели1.Показатель.ТипПоказателя,
		|	Показатели1.Показатель.ВозможностьИзменения,
		|	Показатели2.Показатель.Предопределенный,
		|	Показатели2.Показатель.Наименование,
		|	Показатели2.Показатель.ТипПоказателя,
		|	Показатели2.Показатель.ВозможностьИзменения,
		|	Показатели3.Показатель.Предопределенный,
		|	Показатели3.Показатель.Наименование,
		|	Показатели3.Показатель.ТипПоказателя,
		|	Показатели3.Показатель.ВозможностьИзменения,
		|	Показатели4.Показатель.Предопределенный,
		|	Показатели4.Показатель.Наименование,
		|	Показатели4.Показатель.ТипПоказателя,
		|	Показатели4.Показатель.ВозможностьИзменения,
		|	Показатели5.Показатель.Предопределенный,
		|	Показатели5.Показатель.Наименование,
		|	Показатели5.Показатель.ТипПоказателя,
		|	Показатели5.Показатель.ВозможностьИзменения,
		|	Показатели6.Показатель.Предопределенный,
		|	Показатели6.Показатель.Наименование,
		|	Показатели6.Показатель.ТипПоказателя,
		|	Показатели6.Показатель.ВозможностьИзменения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета
		|";		
		
		Запрос.Выполнить();	
		
		ВТПоказатели = "ВТПоказатели";
	КонецЕсли;
	
    // Описание текста запроса:
	//
    // 1. Выборка "Начисления": 
	//		Объединяются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  
	// 2. Выборка "СуществующиеДвижения": 
	//		Проверяем на наличие существующих конфликтных движений в регистре сведений. 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Начисления.ВидСтроки,
	               |	Начисления.ОтражатьВУпрУчете,
	               |	Начисления.ОтражатьВРеглУчете,
	               |	Начисления.НомерСтроки,
	               |	Начисления.Сотрудник,
	               |	Начисления.Назначение,
				   |	Начисления.ВидНачисления,
				   |	Начисления.ВидРасчета,
				   |	Начисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	               |	ВЫБОР КОГДА (Начисления.ВидНачисления = &Основное) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ОсновноеНачисление,
	               |	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
				   |	Начисления.СпособОтраженияВБухУчете,
				   |	Начисления.СпособОтраженияВУпрУчете,
				   |	Начисления.Действие,
				   |	Начисления.ДатаДействия,
				   |	Начисления.ДатаДействияКонец,
	               |	Начисления.Показатель1,
	               |	Начисления.Показатель2,
	               |	Начисления.Показатель3,
	               |	Начисления.Показатель4,
	               |	Начисления.Показатель5,
	               |	Начисления.Показатель6,
	               |	Начисления.Валюта1,
	               |	Начисления.Валюта2,
	               |	Начисления.Валюта3,
	               |	Начисления.Валюта4,
	               |	Начисления.Валюта5,
	               |	Начисления.Валюта6,
	               |	ВЫБОР	КОГДА	Начисления.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |			ТОГДА	ЛОЖЬ 
	               |			ИНАЧЕ	ИСТИНА 
	               |	КОНЕЦ					КАК ТребуетВалюту,
	               |	Начисления.ТребуетВалюту,
	               |	Начисления.КонфликтнаяСтрокаНомер,
	               |	Начисления.ОсновноеНачисление,
	               |	СуществующиеДвижения.Регистратор.Представление КАК КонфликтныйДокумент,
				   |	ЕСТЬNULL(Показатели.КоличествоПоказателей,0) КоличествоПоказателей,
				   |	Показатели.Показатель1Предопределенный,
				   |	Показатели.Показатель1Наименование,
				   |	Показатели.Показатель1ТипПоказателя,
				   |	Показатели.Показатель1ВозможностьИзменения,
				   |	Показатели.Показатель2Предопределенный,
				   |	Показатели.Показатель2Наименование,
				   |	Показатели.Показатель2ТипПоказателя,
				   |	Показатели.Показатель2ВозможностьИзменения,
				   |	Показатели.Показатель3Предопределенный,
				   |	Показатели.Показатель3Наименование,
				   |	Показатели.Показатель3ТипПоказателя,
				   |	Показатели.Показатель3ВозможностьИзменения,
				   |	Показатели.Показатель4Предопределенный,
				   |	Показатели.Показатель4Наименование,
				   |	Показатели.Показатель4ТипПоказателя,
				   |	Показатели.Показатель4ВозможностьИзменения,
				   |	Показатели.Показатель5Предопределенный,
				   |	Показатели.Показатель5Наименование,
				   |	Показатели.Показатель5ТипПоказателя,
				   |	Показатели.Показатель5ВозможностьИзменения,
				   |	Показатели.Показатель6Предопределенный,
				   |	Показатели.Показатель6Наименование,
				   |	Показатели.Показатель6ТипПоказателя,
				   |	Показатели.Показатель6ВозможностьИзменения,
				   |	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
			   
				   |	Начисления.Сотрудник.ФизЛицо.Наименование КАК ФизЛицоНаименование
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТЧНачисления.Ссылка.ОтражатьВУпрУчете,
	               |		ТЧНачисления.Ссылка.ОтражатьВРеглУчете,
	               |		ТЧНачисления.НомерСтроки	КАК НомерСтроки,
	               |		ТЧНачисления.Сотрудник		КАК Сотрудник,
	               |		ТЧНачисления.Назначение		КАК Назначение,
				   |		ТЧНачисления.ВидНачисления	КАК ВидНачисления,
				   |		ТЧНачисления.ВидРасчета		КАК ВидРасчета,
				   |		ТЧНачисления.СпособОтраженияВБухУчете,
				   |		ТЧНачисления.СпособОтраженияВУпрУчете,
            	   |		ТЧНачисления.Действие		КАК Действие,
	               |		ТЧНачисления.ДатаДействия	КАК ДатаДействия,
				   |		ТЧНачисления.ДатаДействияКонец,
	               |		ТЧНачисления.Показатель1,
	               |		ТЧНачисления.Показатель2,
	               |		ТЧНачисления.Показатель3,
	               |		ТЧНачисления.Показатель4,
	               |		ТЧНачисления.Показатель5,
	               |		ТЧНачисления.Показатель6,
	               |		ТЧНачисления.Валюта1,
	               |		ТЧНачисления.Валюта2,
	               |		ТЧНачисления.Валюта3,
	               |		ТЧНачисления.Валюта4,
	               |		ТЧНачисления.Валюта5,
	               |		ТЧНачисления.Валюта6,
				   |		ВЫБОР КОГДА (ТЧНачисления.ВидНачисления = &Основное) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ОсновноеНачисление,
	               |		ВЫБОР	КОГДА	ТЧНачисления.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |				ТОГДА	ЛОЖЬ 
	               |				ИНАЧЕ	ИСТИНА 
	               |		КОНЕЦ						КАК ТребуетВалюту,
	               |		МИНИМУМ(ПовторяющиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрокаНомер,
				   |		""Начисления"" КАК ВидСтроки
				   |	
				   |	ИЗ	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Начисления КАК ТЧНачисления
	               |	
	               |	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Начисления КАК ПовторяющиесяСтроки
	               |	ПО ТЧНачисления.Сотрудник = ПовторяющиесяСтроки.Сотрудник 
	               |	И ТЧНачисления.Назначение = ПовторяющиесяСтроки.Назначение 
	               |				   И ТЧНачисления.Ссылка = ПовторяющиесяСтроки.Ссылка 
	               |				   И ТЧНачисления.НомерСтроки < ПовторяющиесяСтроки.НомерСтроки 
	               |				   И (ТЧНачисления.ВидРасчета = ПовторяющиесяСтроки.ВидРасчета 
	               |				   ИЛИ ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени И ПовторяющиесяСтроки.ВидРасчета.ЗачетОтработанногоВремени) 
	               |				   И ТЧНачисления.ДатаДействия = ПовторяющиесяСтроки.ДатаДействия
	               |	
				   |	ГДЕ ТЧНачисления.Ссылка = &ДокументСсылка
				   |	
				   |	СГРУППИРОВАТЬ ПО
				   |		ТЧНачисления.Ссылка,
				   |		ТЧНачисления.НомерСтроки,
				   |		ТЧНачисления.Сотрудник,
				   |		ТЧНачисления.Назначение,
				   |		ТЧНачисления.ВидНачисления,
	               |		ТЧНачисления.ВидРасчета,
   				   |		ТЧНачисления.СпособОтраженияВБухУчете,
				   |		ТЧНачисления.СпособОтраженияВУпрУчете,
				   |		ТЧНачисления.Действие,
	               |		ТЧНачисления.ДатаДействия,
				   |		ТЧНачисления.ДатаДействияКонец,
	               |		ТЧНачисления.Показатель1,
	               |		ТЧНачисления.Показатель2,
	               |		ТЧНачисления.Показатель3,
	               |		ТЧНачисления.Показатель4,
	               |		ТЧНачисления.Показатель5,
	               |		ТЧНачисления.Показатель6,
	               |		ТЧНачисления.Валюта1,
	               |		ТЧНачисления.Валюта2,
	               |		ТЧНачисления.Валюта3,
	               |		ТЧНачисления.Валюта4,
	               |		ТЧНачисления.Валюта5,
	               |		ТЧНачисления.Валюта6,
				   |		ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени,
	               |		ВЫБОР	КОГДА	ТЧНачисления.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |				ТОГДА	ЛОЖЬ 
	               |				ИНАЧЕ	ИСТИНА 
	               |		КОНЕЦ
	               |		) КАК Начисления
	               |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СуществующиеДвижения
	               |ПО Начисления.Назначение = СуществующиеДвижения.Сотрудник 
	               |И Начисления.ДатаДействия = СуществующиеДвижения.Период 
	               |И Начисления.ВидРасчета = СуществующиеДвижения.ВидРасчета
				   |
				   |ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
				   |ПО Начисления.ВидРасчета = Показатели.ВидРасчета
	               |";				   
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокОснВидовРасчетаНеТребующихВалюты", ПроведениеРасчетов.ПолучитьСписокВидовРасчетаНеТребующихУказанияВалюты("Начисления"));
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция СформироватьЗапросПоРаботникиОрганизацииУдержания(Режим)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

    // Описание текста запроса:
	//
    // 1. Выборка "Начисления": 
	//		Объединяются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  
	// 2. Выборка "СуществующиеДвижения": 
	//		Проверяем на наличие существующих конфликтных движений в регистре сведений. 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Удержания.ОтражатьВУпрУчете,
	               |	Удержания.ОтражатьВРеглУчете,
	               |	Удержания.ВидСтроки,
	               |	Удержания.НомерСтроки,
	               |	Удержания.Сотрудник,
	               |	Удержания.ВидРасчета,
	   	           |	Удержания.ВидРасчета.СпособРасчета КАК СпособРасчета,
	               |	Удержания.Действие,
	               |	Удержания.ДатаДействия,
	               |	Удержания.ДатаДействияКонец,
				   |	Удержания.СпособОтраженияВБухУчете,
				   |	Удержания.СпособОтраженияВУпрУчете,
	               |	Удержания.Показатель1,
	               |	Удержания.Показатель2,
	               |	Удержания.Показатель3,
	               |	Удержания.Показатель4,
	               |	Удержания.Показатель5,
	               |	Удержания.Показатель6,
	               |	Удержания.Валюта1,
	               |	Удержания.Валюта2,
	               |	Удержания.Валюта3,
	               |	Удержания.Валюта4,
	               |	Удержания.Валюта5,
	               |	Удержания.Валюта6,
	               |	ВЫБОР	КОГДА	Удержания.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |			ТОГДА	ЛОЖЬ 
	               |			ИНАЧЕ	ИСТИНА 
	               |	КОНЕЦ					КАК ТребуетВалюту,
	               |	Удержания.ТребуетВалюту,
	               |	Удержания.КонфликтнаяСтрокаНомер,
	               |	СуществующиеДвижения.Регистратор.Представление КАК КонфликтныйДокумент,
	               |	Удержания.Сотрудник.ФизЛицо.Наименование
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТЧУдержания.Ссылка.ОтражатьВУпрУчете,
	               |		ТЧУдержания.Ссылка.ОтражатьВРеглУчете,
	               |		ТЧУдержания.НомерСтроки	КАК НомерСтроки,
	               |		ТЧУдержания.Сотрудник		КАК Сотрудник,
	               |		ТЧУдержания.ВидРасчета		КАК ВидРасчета,
				   |		ТЧУдержания.Действие		КАК Действие,
				   |		ТЧУдержания.ДатаДействия	КАК ДатаДействия,
	               |		ТЧУдержания.ДатаДействияКонец,
				   |		ТЧУдержания.СпособОтраженияВБухУчете,
				   |		ТЧУдержания.СпособОтраженияВУпрУчете,
				   |		ТЧУдержания.Показатель1,
				   |		ТЧУдержания.Показатель2,
	               |		ТЧУдержания.Показатель3,
	               |		ТЧУдержания.Показатель4,
	               |		ТЧУдержания.Показатель5,
	               |		ТЧУдержания.Показатель6,
	               |		ТЧУдержания.Валюта1,
	               |		ТЧУдержания.Валюта2,
	               |		ТЧУдержания.Валюта3,
	               |		ТЧУдержания.Валюта4,
	               |		ТЧУдержания.Валюта5,
	               |		ТЧУдержания.Валюта6,
	               |		ВЫБОР	КОГДА	ТЧУдержания.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |				ТОГДА	ЛОЖЬ 
	               |				ИНАЧЕ	ИСТИНА 
	               |		КОНЕЦ						КАК ТребуетВалюту,
	               |		МИНИМУМ(ПовторяющиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрокаНомер,
				   |		""Удержания"" КАК ВидСтроки
				   |	
				   |	ИЗ	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Удержания КАК ТЧУдержания
	               |	
	               |	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Удержания КАК ПовторяющиесяСтроки
	               |	ПО ТЧУдержания.Сотрудник = ПовторяющиесяСтроки.Сотрудник 
	               |				   И ТЧУдержания.Ссылка = ПовторяющиесяСтроки.Ссылка 
	               |				   И ТЧУдержания.НомерСтроки < ПовторяющиесяСтроки.НомерСтроки 
	               |				   И ТЧУдержания.ВидРасчета = ПовторяющиесяСтроки.ВидРасчета 
	               |				   И ТЧУдержания.ДатаДействия = ПовторяющиесяСтроки.ДатаДействия
	               |	
	               |	ГДЕ ТЧУдержания.Ссылка = &ДокументСсылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ТЧУдержания.Ссылка,
	               |		ТЧУдержания.НомерСтроки,
	               |		ТЧУдержания.Сотрудник,
				   |		ТЧУдержания.ВидРасчета,
				   |		ТЧУдержания.Действие,
				   |		ТЧУдержания.ДатаДействия,
	               |		ТЧУдержания.ДатаДействияКонец,
				   |		ТЧУдержания.СпособОтраженияВБухУчете,
				   |		ТЧУдержания.СпособОтраженияВУпрУчете,
				   |		ТЧУдержания.Показатель1,
				   |		ТЧУдержания.Показатель2,
				   |		ТЧУдержания.Показатель3,
				   |		ТЧУдержания.Показатель4,
				   |		ТЧУдержания.Показатель5,
				   |		ТЧУдержания.Показатель6,
	               |		ТЧУдержания.Валюта1,
	               |		ТЧУдержания.Валюта2,
	               |		ТЧУдержания.Валюта3,
	               |		ТЧУдержания.Валюта4,
	               |		ТЧУдержания.Валюта5,
	               |		ТЧУдержания.Валюта6,
	               |		ВЫБОР	КОГДА	ТЧУдержания.ВидРасчета В (&СписокОснВидовРасчетаНеТребующихВалюты) 
	               |				ТОГДА	ЛОЖЬ 
	               |				ИНАЧЕ	ИСТИНА 
	               |		КОНЕЦ
	               |		) КАК Удержания
	               |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СуществующиеДвижения
	               |ПО Удержания.Сотрудник = СуществующиеДвижения.Сотрудник 
	               |И Удержания.ДатаДействия = СуществующиеДвижения.Период 
	               |И Удержания.ВидРасчета = СуществующиеДвижения.ВидРасчета
	               |				   
	               |	
	               |";				   
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокОснВидовРасчетаНеТребующихВалюты", ПроведениеРасчетов.ПолучитьСписокВидовРасчетаНеТребующихУказанияВалюты("Удержания"));
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция СформироватьЗапросПоВзносамСотрудники(Режим)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

    // Описание текста запроса:
	//
    // 1. Выборка "Начисления": 
	//		Объединяются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  

	ТекстЗапроса = "ВЫБРАТЬ
					|	ТЧВзносы.НомерСтроки,
					|	ТЧВзносы.Сотрудник,
					|	ТЧВзносы.Налог,
					|	ТЧВзносы.Действие,
					|	ТЧВзносы.ДатаДействия,
					|	ТЧВзносы.ДатаДействияКонец,
					|	ВЫБОР КОГДА ВзносыВФондыРаботниковОрганизаций.Актуальность ЕСТЬ NULL ТОГДА Ложь
					|	ИНАЧЕ Истина КОНЕЦ КАК Закрывается
					|ИЗ
					|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Взносы КАК ТЧВзносы
					|	ЛЕВОЕ СОЕДИНЕНИЕ
					|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ВзносыВФондыРаботниковОрганизаций
					|	ПО ВзносыВФондыРаботниковОрганизаций.Сотрудник = ТЧВзносы.Сотрудник
					|	 И ВзносыВФондыРаботниковОрганизаций.Налог = ТЧВзносы.Налог
					|	 И ВзносыВФондыРаботниковОрганизаций.Организация = ТЧВзносы.Ссылка.Организация
					|	 И ВзносыВФондыРаботниковОрганизаций.Период = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ТЧВзносы.ДатаДействия, МЕСЯЦ), ДЕНЬ)
					|ГДЕ
					|	ТЧВзносы.Ссылка = &ДокументСсылка
	                |	
	                |ОБЪЕДИНИТЬ	
	                |	
	                |ВЫБРАТЬ	
	                |	ТЧВзносыФОТ.НомерСтроки,
	                |	ТЧВзносыФОТ.Сотрудник,
	                |	ТЧВзносыФОТ.Налог,
	                |	ТЧВзносыФОТ.Действие,
	                |	ТЧВзносыФОТ.ДатаДействия,
					|	ТЧВзносыФОТ.ДатаДействияКонец,
					|	ВЫБОР КОГДА ВзносыВФондыРаботниковОрганизаций.Актуальность ЕСТЬ NULL ТОГДА Ложь
					|	ИНАЧЕ Истина КОНЕЦ КАК Закрывается
	                |ИЗ
	                |	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.ВзносыФОТ КАК ТЧВзносыФОТ
					|	ЛЕВОЕ СОЕДИНЕНИЕ
					|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ВзносыВФондыРаботниковОрганизаций
					|	ПО ВзносыВФондыРаботниковОрганизаций.Сотрудник = ТЧВзносыФОТ.Сотрудник
					|	 И ВзносыВФондыРаботниковОрганизаций.Налог = ТЧВзносыФОТ.Налог
					|	 И ВзносыВФондыРаботниковОрганизаций.Организация = ТЧВзносыФОТ.Ссылка.Организация
					|	 И ВзносыВФондыРаботниковОрганизаций.Период = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ТЧВзносыФОТ.ДатаДействия, МЕСЯЦ), ДЕНЬ)
					|	
	                |ГДЕ
	                |	ТЧВзносыФОТ.Ссылка = &ДокументСсылка
	                |";
			   
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция СформироватьЗапросПоНачислениям() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧНачисления.НомерСтроки,
	               |	ТЧНачисления.Сотрудник,
	               |	ТЧНачисления.Назначение,
	               |	ТЧНачисления.ВидРасчета,
	               |	ТЧНачисления.Действие,
	               |	ТЧНачисления.ДатаДействия,
	               |	ТЧНачисления.Показатель1,
	               |	ТЧНачисления.Показатель2,
	               |	ТЧНачисления.Показатель3,
	               |	ТЧНачисления.Показатель4,
	               |	ТЧНачисления.Показатель5,
	               |	ТЧНачисления.Показатель6,
	               |	ТЧНачисления.Валюта1,
	               |	ТЧНачисления.Валюта2,
	               |	ТЧНачисления.Валюта3,
	               |	ТЧНачисления.Валюта4,
	               |	ТЧНачисления.Валюта5,
	               |	ТЧНачисления.Валюта6,
	               |	ТЧНачисления.СпособОтраженияВБухучете,
	               |	ТЧНачисления.СпособОтраженияВУпрУчете,
	               |	ТЧНачисления.ВидНачисления,
	               |	ТЧНачисления.ДатаДействияКонец
	               |ИЗ
	               |	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.Начисления КАК ТЧНачисления
	               |ГДЕ
	               |	ТЧНачисления.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);			   
	Возврат Запрос.Выполнить()				   
КонецФункции // СформироватьЗапросПоНачислениям()

Функция СформироватьЗапросПоНачислениямДоПосле(ИмяТЧ,Сотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
	
	Если НЕ (Сотрудники = Неопределено) Тогда
		Запрос.УстановитьПараметр("парамСотрудники", Сотрудники);
		УсловиеНаФизлицоТекст = " И СтрокиНачисления.Сотрудник В (&парамСотрудники) ";
	Иначе
		УсловиеНаФизлицоТекст="";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// Свойства
	|	&ПериодРегистрации	КАК ПериодРегистрации,
	|	СтрокиНачисления.ДатаНачала					КАК ПериодДействияНачало,
	|	СтрокиНачисления.ДатаОкончания				КАК ПериодДействияКонец,
	|	СтрокиНачисления.БазовыйПериодНачало,
	|	СтрокиНачисления.БазовыйПериодКонец,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.Сторно,
	|
	// Измерения
	|	СтрокиНачисления.Ссылка.Организация КАК организация,
	|	СтрокиНачисления.Сотрудник,
	|	СтрокиНачисления.Назначение,
	|
	// Ресурсы
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.РезультатУпр,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.КалендарныеДни,
	|
	// Реквизиты
	|	СтрокиНачисления.Авторасчет,
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ПодразделениеУпр,
	|	СтрокиНачисления.СпособОтраженияВБухучете,
	|	СтрокиНачисления.СпособОтраженияВУпрУчете,
	|	СтрокиНачисления.ДокументОснование,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.НормаДнейЗаМесяц,
	|	СтрокиНачисления.НормаЧасовЗаМесяц,
	|	СтрокиНачисления.ГрафикРаботы,
	|   ВЫБОР	КОГДА СтрокиНачисления.ГрафикРаботы ССЫЛКА Справочник.ГрафикиРаботы
	|			ТОГДА NULL
	|			ИНАЧЕ СтрокиНачисления.Сотрудник
	|	КОНЕЦ						КАК ГрафикРаботыСотрудник,
	|	СтрокиНачисления.ВидУчетаВремениДляСредней,
	|
	|	СтрокиНачисления.ВидРасчета.СпособРасчета	КАК СпособРасчета,
	|	СтрокиНачисления.ВидРасчета.СчетУчета		КАК СчетУчета,
	|	ЕСТЬNULL(СтрокиНачисления.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	СтрокиНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени	КАК ВидИспользованияРабочегоВремени,
	|
	// Проверки
	|	СтрокиНачисления.ДатаНачала,
	|	СтрокиНачисления.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сотрудник.Организация = СтрокиНачисления.Ссылка.Организация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации
	|ИЗ Документ."+Ссылка.Метаданные().Имя+"."+ИмяТЧ+" КАК СтрокиНачисления
	|
	|
	|
	|ГДЕ СтрокиНачисления.Ссылка = &ДокументСсылка" + УсловиеНаФизлицоТекст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачислениямДоПосле()

Функция СформироватьЗапросПоРаботникам() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|   &ДатаДокумента КАК ДатаДействия,
	|	ВводСведенийОПлановыхНачисленияхУдержанияхРаботникиОрганизации.Сотрудник,
	|	ВводСведенийОПлановыхНачисленияхУдержанияхРаботникиОрганизации.ФиксированнаяИндексация,
	|	ВводСведенийОПлановыхНачисленияхУдержанияхРаботникиОрганизации.Повышение
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхУдержаниях.РаботникиОрганизации КАК ВводСведенийОПлановыхНачисленияхУдержанияхРаботникиОрганизации
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхУдержанияхРаботникиОрганизации.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента",Дата);			   

	Возврат Запрос.Выполнить()				   
КонецФункции // СформироватьЗапросПоРаботникам()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизацииНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части """ + ВыборкаПоСтрокамДокумента.ВидСтроки + """: ";
	
	// Сотрудник
    ЕстьСотрудник = ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если Не ЕстьСотрудник Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Назначение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано назначение сотрудника!", Отказ);
	КонецЕсли;

	// Вид начисления
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидНачисления) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан вид начисления!", Отказ);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидНачисления = Перечисления.ВидыНачисленийРаботникаОрганизации.Надбавка Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "документом запрещено изменять надбавки по штатному расписанию!", Отказ);
	КонецЕсли;
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан вид расчета!", Отказ);
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задано действие!", Отказ);
	КонецЕсли;
	
	// Перид действия
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) И ВыборкаПоСтрокамДокумента.ДатаДействия > ВыборкаПоСтрокамДокумента.ДатаДействияКонец Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания действия не должна быть меньше даты начала!", Отказ);
	КонецЕсли; 
	
	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		
		// ДатаДействия
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействия) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задана дата действия!", Отказ);
		КонецЕсли;
		
		// Одинаковые строки
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер) Тогда
			Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
				СтрокаСообщениеОбОшибке = "основное начисление работника " + ВыборкаПоСтрокамДокумента.ФизЛицоНаименование + " следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			Иначе
				СтрокаСообщениеОбОшибке = "работнику " + ВыборкаПоСтрокамДокумента.ФизЛицоНаименование + " не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			КонецЕсли;
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке  + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;
		
		// Движения в регистре на дату из документа
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "на дату "+ ВыборкаПоСтрокамДокумента.ДатаДействия + " начисление уже зарегистрировано документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!", Отказ);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
		
		ИспользуютсяНачисленияВВалюте = Истина;
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизацииНачислекния()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизацииУдержания(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части """ + ВыборкаПоСтрокамДокумента.ВидСтроки + """: ";
	
	// Сотрудник
    ЕстьСотрудник = ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если Не ЕстьСотрудник Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран Сотрудник!", Отказ);
	КонецЕсли;
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан вид расчета!", Отказ);
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задано действие!", Отказ);
	КонецЕсли;
	
	// Перид действия
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) И ВыборкаПоСтрокамДокумента.ДатаДействия > ВыборкаПоСтрокамДокумента.ДатаДействияКонец Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания действия не должна быть меньше даты начала!", Отказ);
	КонецЕсли; 
	
	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		
		// ДатаДействия
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействия) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задана дата действия!", Отказ);
		КонецЕсли;
		
		// Одинаковые строки
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер) Тогда
			Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
				СтрокаСообщениеОбОшибке = "основное начисление работника " + ВыборкаПоСтрокамДокумента.ФизЛицоНаименование + " следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			Иначе
				СтрокаСообщениеОбОшибке = "работнику " + ВыборкаПоСтрокамДокумента.ФизЛицоНаименование + " не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			КонецЕсли;
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке  + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;
		
		// Движения в регистре на дату из документа
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "на дату "+ ВыборкаПоСтрокамДокумента.ДатаДействия + " начисление уже зарегистрировано документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!", Отказ);
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизацииУдержания()


Процедура ДобавитьСтрокуВДвиженияПоВзносамВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
		// ничего не меняем
		Возврат;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать
		ИЛИ ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
		мДействует	= Истина;

	ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
		// движеие на вечер предыдущих суток
		мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия - 1;
		мДействует	= Ложь;

	КонецЕсли;
	
	Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период       = мПериод;
	Движение.Регистратор  = ВыборкаПоШапкеДокумента.Ссылка;
	
	// Измерения
	Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Налог			= ВыборкаПоСтрокамДокумента.Налог;
	
	// Ресурсы
	Движение.Актуальность	= мДействует;
	
	
	////////////////////////////////
	// Движения на дату завершения
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать 
			И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) Тогда
		
			Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();
	
			// Свойства
			Движение.Период			= КонецДня(ВыборкаПоСтрокамДокумента.ДатаДействияКонец);
			Движение.Регистратор	= ВыборкаПоШапкеДокумента.Ссылка;
		
			// Измерения
			Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			Движение.Налог			= ВыборкаПоСтрокамДокумента.Налог;
			
			//Ресурсы
			Движение.Актуальность	= Ложь;
		
	КонецЕсли;

			
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, мПериод, мДействует)
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период						= мПериод;
	
	// Измерения
	Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Назначение;
	Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
 	Если НЕ ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение	= ВыборкаПоСтрокамДокумента.ВидРасчета;
	КонецЕсли;

	Движение.ВидРасчета					= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	// Ресурсы
	Движение.Актуальность	= мДействует;
	Движение.Действие		= ВыборкаПоСтрокамДокумента.Действие;
	Если мДействует Тогда
		Движение.Показатель1	= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2	= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3	= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4	= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5	= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6	= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.Валюта1		= ВыборкаПоСтрокамДокумента.Валюта1;
		Движение.Валюта2		= ВыборкаПоСтрокамДокумента.Валюта2;
		Движение.Валюта3		= ВыборкаПоСтрокамДокумента.Валюта3;
		Движение.Валюта4		= ВыборкаПоСтрокамДокумента.Валюта4;
		Движение.Валюта5		= ВыборкаПоСтрокамДокумента.Валюта5;
		Движение.Валюта6		= ВыборкаПоСтрокамДокумента.Валюта6;
		Движение.ВидНачисления	= ВыборкаПоСтрокамДокумента.ВидНачисления;
		
		Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
		Движение.СпособОтраженияВУпручете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете;
	КонецЕсли;
	
	
	////////////////////////////////
	// Движения на дату завершения
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать 
			И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) Тогда
		
			Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
			// Свойства
			Движение.Период						= КонецДня(ВыборкаПоСтрокамДокумента.ДатаДействияКонец);
		
			// Измерения
			Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
			Если НЕ ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
				Движение.ВидРасчетаИзмерение	= ВыборкаПоСтрокамДокумента.ВидРасчета;
			КонецЕсли;
			
			//Ресурсы
			Движение.Актуальность = Ложь;
			Движение.ВидРасчета					= ВыборкаПоСтрокамДокумента.ВидРасчета;
		
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, мПериод, мДействует)
	
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период			= мПериод;
	
	// Измерения
	Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ВидРасчета		= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	// Ресурсы
	Движение.Актуальность	= мДействует;
	Движение.Действие		= ВыборкаПоСтрокамДокумента.Действие;
	Движение.Показатель1	= ВыборкаПоСтрокамДокумента.Показатель1;
	Движение.Показатель2	= ВыборкаПоСтрокамДокумента.Показатель2;
	Движение.Показатель3	= ВыборкаПоСтрокамДокумента.Показатель3;
	Движение.Показатель4	= ВыборкаПоСтрокамДокумента.Показатель4;
	Движение.Показатель5	= ВыборкаПоСтрокамДокумента.Показатель5;
	Движение.Показатель6	= ВыборкаПоСтрокамДокумента.Показатель6;
	Движение.Валюта1		= ВыборкаПоСтрокамДокумента.Валюта1;
	Движение.Валюта2		= ВыборкаПоСтрокамДокумента.Валюта2;
	Движение.Валюта3		= ВыборкаПоСтрокамДокумента.Валюта3;
	Движение.Валюта4		= ВыборкаПоСтрокамДокумента.Валюта4;
	Движение.Валюта5		= ВыборкаПоСтрокамДокумента.Валюта5;
	Движение.Валюта6		= ВыборкаПоСтрокамДокумента.Валюта6;
	
	Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
	Движение.СпособОтраженияВУпручете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВУпручете;

	
	////////////////////////////////
	// Движения на дату завершения
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать 
			И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) Тогда
		
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	
			// Свойства
			Движение.Период			= КонецДня(ВыборкаПоСтрокамДокумента.ДатаДействияКонец);
		
			// Измерения
			Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидРасчета		= ВыборкаПоСтрокамДокумента.ВидРасчета;
			
			//Ресурсы
			Движение.Актуальность	= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоРегистрам(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, ПрименяетсяФиксированнаяИндексация)
	
	
	Движение = Движения.КоэффициентыПовышенияОкладов.Добавить();
			
	// Свойства
	Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаДействия;
			
	// Измерения
	Движение.Сотрудник                  = ВыборкаПоРаботникиОрганизации.Сотрудник;
	Движение.Организация                = ВыборкаПоШапкеДокумента.Организация;
			
	// Ресурсы
	Движение.Коэффициент				= ВыборкаПоШапкеДокумента.КоэффициентИндексацииЗаработка;
	
	
	Если ПрименяетсяФиксированнаяИндексация и ВыборкаПоРаботникиОрганизации.Повышение > 0 Тогда
		Движение = Движения.ПараметрыФиксированнойИндексации.Добавить();
		
		// Свойства
		Движение.Период         = ВыборкаПоРаботникиОрганизации.ДатаДействия;
		
		// Измерения
		Движение.Организация  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник    	= ВыборкаПоРаботникиОрганизации.Сотрудник;
		
		// Ресурсы
		Движение.Размер			= ВыборкаПоРаботникиОрганизации.ФиксированнаяИндексация;
	КонецЕсли;	
	
КонецПроцедуры	


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ПрименяетсяФиксированнаяИндексация = (ПроведениеРасчетов.ДатаВвводаФиксированнойИндексации() <= Дата);

	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке(Режим).Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту("Начисления");

			// получим реквизиты табличной части Начисления
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизацииНачисления(Режим);
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизацииНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ);

				Если НЕ Отказ Тогда
					
					Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
						// ничего не меняем
						Продолжить;
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
						// сначала надо закрыть вечером предыдущих суток
						мПериод = КонецДня(ВыборкаПоСтрокамДокумента.ДатаДействия-1);
						мДействует	= Ложь;
						ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
						// начало с утра текущего дня
						мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
						мДействует	= Истина;
						ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
						мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
						мДействует	= Истина;
						ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
						// движеие закрытия на вечер предыдущих суток
						мПериод = КонецДня(ВыборкаПоСтрокамДокумента.ДатаДействия);
						мДействует	= Ложь;
						ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
						
					КонецЕсли;
					
					
				КонецЕсли;
					

			КонецЦикла;

			// получим реквизиты табличной части Удержания
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизацииУдержания(Режим);
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизацииУдержания(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ);

				Если НЕ Отказ Тогда

						Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
							Продолжить;
						КонецЕсли;
						
						Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять тогда
							// ничего не меняем
							Продолжить;
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
							// сначала надо закрыть вечером предыдущих суток
							мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия-1;
							мДействует	= Ложь;
							ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
							// начало с утра текущего дня
							мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
							мДействует	= Истина;
							ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
							мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия;
							мДействует	= Истина;
							ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						ИначеЕсли ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Прекратить тогда
							// движеие закрытия на вечер предыдущих суток
							мПериод = ВыборкаПоСтрокамДокумента.ДатаДействия-1;
							мДействует	= Ложь;
							ДобавитьСтрокуВДвиженияПоУдержаниям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,мПериод,мДействует);
							
						КонецЕсли;
					
				КонецЕсли;

			КонецЦикла;
			
			// получим реквизиты табличной части для взносов
			РезультатЗапросаПоВзносам = СформироватьЗапросПоВзносамСотрудники(Режим);
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоВзносам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 
				
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоВзносамВФонды(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				
			КонецЦикла;
			
			// получим реквизиты табличной части РаботникиОрганизации
			Если ИндексацияЗаработка Тогда
				РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникам();
				ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 
					
					// Заполним записи в наборах записей регистровКоэффициентыПовышенияОкладов и ПараметрыФиксированнойИндексации
					ДобавитьСтрокуВДвиженияПоРегистрам(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ПрименяетсяФиксированнаяИндексация);
					
				КонецЦикла;	
			КонецЕсли;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
		
		// Заполнение шапки
		Комментарий = Основание.Комментарий;
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		
		ОтражатьВУпрУчете = Основание.ОтражатьВУпрУчете;
		ОтражатьВРеглУчете = Основание.ОтражатьВРеглУчете;
		
		//// --- то что касается взносов и индексации ---
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка", Основание);
		
		ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	ТЧРаботники.Сотрудник	КАК Сотрудник, 
		|	ТЧРаботники.Ссылка		КАК Приказ,
		|	ТЧРаботники.ДатаПриема	КАК ДатаДействия
		| 
		|ИЗ	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботники
		|
		|ГДЕ ТЧРаботники.Ссылка = &ДокументСсылка
		|";
		
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		
		РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Пока Выборка.Следующий() Цикл
			ПолучитьФорму().ДобавитьСтрокиНачисленийПоРаботнику(Выборка.Сотрудник);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") Тогда
		
		// Заполнение шапки
		Комментарий = Основание.Комментарий;
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		
		// Заполним реквизиты из стандартного набора.
		Сотрудник = Основание.Сотрудник;
		ДатаДействия=НачалоМесяца(Основание.ДатаНачала);
		
		ТекущаяСтрока = РаботникиОрганизации.Добавить();
		ТекущаяСтрока.Сотрудник		= Сотрудник;
		ТекущаяСтрока.ФизЛицо		= Сотрудник.ФизЛицо;
		
		// добавить взносы для ГПХшников
		Если НЕ ЗначениеЗаполнено(Основание.Сотрудник.ОсновноеНазначение) 
			И НЕ Основание.НазначитьВзносы
			И НЕ ПроведениеРасчетов.ИспользуетсяЕСВ(Дата)
			Тогда
			//Добавим пенсионный
			ТекущаяСтрока = Взносы.Добавить();
			ТекущаяСтрока.Сотрудник		= Сотрудник;
			ТекущаяСтрока.ДатаДействия	= ДатаДействия;
			ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
			ТекущаяСтрока.Налог			= Справочники.Налоги.Пенсионный;
			
			//Добавим пенсионный ФОТ
			ТекущаяСтрока = ВзносыФОТ.Добавить();
			ТекущаяСтрока.Сотрудник		= Сотрудник;
			ТекущаяСтрока.ДатаДействия	= ДатаДействия;
			ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
			ТекущаяСтрока.Налог			= Справочники.Налоги.ПенсионныйФОТ;
			
			//Добавим безработица ГПХ
			ТекущаяСтрока = ВзносыФОТ.Добавить();
			ТекущаяСтрока.Сотрудник		= Сотрудник;
			ТекущаяСтрока.ДатаДействия	= ДатаДействия;
			ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
			ТекущаяСтрока.Налог			= Справочники.Налоги.БезработицаГПХ;
			
		ИначеЕсли НЕ Основание.НазначитьВзносы
			И ПроведениеРасчетов.ИспользуетсяЕСВ(Дата)
			Тогда
			//Добавим ЕСВ
			ТекущаяСтрока = Взносы.Добавить();
			ТекущаяСтрока.Сотрудник		= Сотрудник;
			ТекущаяСтрока.ДатаДействия	= ДатаДействия;
			ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
			ТекущаяСтрока.Налог			= Справочники.Налоги.ЕСВГПХ;
			
			//Добавим ЕСВ ФОТ
			ТекущаяСтрока = ВзносыФОТ.Добавить();
			ТекущаяСтрока.Сотрудник		= Сотрудник;
			ТекущаяСтрока.ДатаДействия	= ДатаДействия;
			ТекущаяСтрока.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
			ТекущаяСтрока.Налог			= Справочники.Налоги.ЕСВФОТГПХ;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

