#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "Организация", Организация);
	
	Если ОтчетПоДокументу Тогда
		
		МоментДокумента = новый МоментВремени(Документ.Дата,Документ);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНачала", МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаОкончания", МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", МоментДокумента);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", МоментДокумента);
		
	Иначе
		
		КонДата = Дата(ОбщийОтчет.ДатаКон);
		КонДата = КонецДня(?(КонДата = Дата('00010101000000'), Дата('39991231235959'), КонДата));
		
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНачала", НачалоДня(ОбщийОтчет.ДатаНач));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаОкончания", КонецДня(КонДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", Новый Граница(НачалоДня(ОбщийОтчет.ДатаНач)));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", Новый Граница(КонДата));
		
	КонецЕсли; 
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПустаяДата", '00010101');
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("СостояниеПринятоКУчету", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("СостояниеСнятоСУчета", Перечисления.ВидыСостоянийНМА.Списан);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("СубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("СчетУчета", ПланыСчетов.Налоговый.ПервоначальнаяСтоимостьНМА);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("СчетАмортизации", ПланыСчетов.Налоговый.АмортизацияНМА);
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОбНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ПервоначальныеСведенияОбНМА.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОбНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияОбНМА.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПервоначальныеСведенияОбНМА.УчитываетсяКакОСНУ КАК УчитываетсяКакОСНУ,
	|	ПервоначальныеСведенияОбНМА.НалоговоеНазначение КАК НалоговоеНазначение
	|ПОМЕСТИТЬ ПервоначальныеСведенияОбНМА
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(&КонГраница, Организация = &Организация {(НематериальныйАктив).* КАК НематериальныйАктив}) КАК ПервоначальныеСведенияОбНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.Местонахождение,
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.НематериальныйАктив
	|ПОМЕСТИТЬ МестонахождениеНМАБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.МестонахождениеНМАБухгалтерскийУчет.СрезПоследних(
	|			&КонГраница,
	|			Организация = &Организация
	|				И НематериальныйАктив В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ПервоначальныеСведенияОбНМА.НематериальныйАктив
	|					ИЗ
	|						ПервоначальныеСведенияОбНМА)) КАК МестонахождениеНМАБухгалтерскийУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНМА_НУ.Счет,
	|	АмортизацияНМА_НУ.Субконто1,
	|	АмортизацияНМА_НУ.СуммаНачальныйОстатокКт,
	|	АмортизацияНМА_НУ.СуммаОборотКт,
	|	АмортизацияНМА_НУ.СуммаКонечныйОстатокКт
	|ПОМЕСТИТЬ АмортизацияНМА_НУ
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(
	|			&НачГраница,
	|			&КонГраница,
	|			Период,
	|			ДвиженияИГраницыПериода,
	|			Счет = &СчетАмортизации,
	|			&СубконтоНМА,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ПервоначальныеСведенияОбНМА.НематериальныйАктив
	|					ИЗ
	|						ПервоначальныеСведенияОбНМА)) КАК АмортизацияНМА_НУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьНМА_НУ.Счет,
	|	СтоимостьНМА_НУ.Субконто1,
	|	СтоимостьНМА_НУ.СуммаНачальныйОстатокДт,
	|	СтоимостьНМА_НУ.СуммаОборотКт,
	|	СтоимостьНМА_НУ.СуммаОборотДт,
	|	СтоимостьНМА_НУ.СуммаКонечныйОстатокДт
	|ПОМЕСТИТЬ СтоимостьНМА_НУ
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(
	|			&НачГраница,
	|			&КонГраница,
	|			Период,
	|			ДвиженияИГраницыПериода,
	|			Счет = &СчетУчета,
	|			&СубконтоНМА,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ПервоначальныеСведенияОбНМА.НематериальныйАктив
	|					ИЗ
	|						ПервоначальныеСведенияОбНМА)) КАК СтоимостьНМА_НУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|	СостоянияНМАОрганизаций.Период КАК ДатаСостояния
	|ПОМЕСТИТЬ ПринятиеКУчету
	|ИЗ
	|	РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|ГДЕ
	|	СостоянияНМАОрганизаций.Состояние = &СостояниеПринятоКУчету
	|	И ВЫБОР
	|			КОГДА &ДатаОкончания = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СостоянияНМАОрганизаций.Период <= &ДатаОкончания
	|		КОНЕЦ
	|	И СостоянияНМАОрганизаций.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|	СостоянияНМАОрганизаций.Период КАК ДатаСостояния,
	|	ИСТИНА КАК СнятоСУчета
	|ПОМЕСТИТЬ СнятыеСУчета
	|ИЗ
	|	РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|ГДЕ
	|	СостоянияНМАОрганизаций.Состояние = &СостояниеСнятоСУчета
	|	И СостоянияНМАОрганизаций.Период < &ДатаНачала
	|	И СостоянияНМАОрганизаций.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|	СостоянияНМАОрганизаций.Состояние КАК Состояние,
	|	СостоянияНМАОрганизаций.Период КАК ДатаСостояния,
	|	СостоянияНМАОрганизаций.Регистратор КАК ДокументУстановкиСостояния
	|ПОМЕСТИТЬ ТекущееСостояние
	|ИЗ
	|	РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|ГДЕ
	|	СостоянияНМАОрганизаций.Период В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(ДатаПоследнегоСостояния.Период)
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК ДатаПоследнегоСостояния
	|			ГДЕ
	|				ДатаПоследнегоСостояния.Организация = &Организация
	|				И ДатаПоследнегоСостояния.НематериальныйАктив = СостоянияНМАОрганизаций.НематериальныйАктив
	|				И ВЫБОР
	|					КОГДА &ДатаОкончания = &ПустаяДата
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДатаПоследнегоСостояния.Период < &ДатаОкончания
	|				КОНЕЦ)
	|	И СостоянияНМАОрганизаций.НомерСтроки В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				МАКСИМУМ(ДатаПоследнегоСостояния.НомерСтроки)
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК ДатаПоследнегоСостояния
	|			ГДЕ
	|				ДатаПоследнегоСостояния.Организация = &Организация
	|				И ДатаПоследнегоСостояния.НематериальныйАктив = СостоянияНМАОрганизаций.НематериальныйАктив
	|				И ДатаПоследнегоСостояния.Период = СостоянияНМАОрганизаций.Период)
	|	И СостоянияНМАОрганизаций.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.Местонахождение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеНМАБухгалтерскийУчетСрезПоследних.Местонахождение),
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив КАК НематериальныйАктив,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив),
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеНМАБухгалтерскийУчетСрезПоследних.МОЛ),
	|	ТекущееСостояние.Состояние КАК ЗначениеТекущегоСостояния,
	|	ЕСТЬNULL(СнятыеСУчета.СнятоСУчета, ЛОЖЬ) КАК НМАСнятоСУчетаНаНачало,
	|	ПринятиеКУчету.ДатаСостояния КАК ДатаПринятияКУчету,
	|	ТекущееСостояние.ДатаСостояния КАК ДатаПоследнегоСостояния,
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.УчитываетсяКакОСНУ КАК УчитываетсяКакОСНУ,
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ЕСТЬNULL(СтоимостьНМА_НУ.СуммаНачальныйОстатокДт, 0) КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(АмортизацияНМА_НУ.СуммаНачальныйОстатокКт, 0) КАК АмортизацияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтоимостьНМА_НУ.СуммаНачальныйОстатокДт, 0) = 0
	|				И ЕСТЬNULL(СтоимостьНМА_НУ.СуммаОборотДт, 0) > ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.ПервоначальнаяСтоимость
	|			ТОГДА ЕСТЬNULL(СтоимостьНМА_НУ.СуммаОборотДт, 0) - ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.ПервоначальнаяСтоимость
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА_НУ.СуммаОборотДт, 0)
	|	КОНЕЦ КАК СтоимостьОборотДт,
	|	ЕСТЬNULL(СтоимостьНМА_НУ.СуммаОборотКт, 0) КАК СтоимостьОборотКт,
	|	ЕСТЬNULL(АмортизацияНМА_НУ.СуммаОборотКт, 0) КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьНМА_НУ.СуммаКонечныйОстатокДт, 0) КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(АмортизацияНМА_НУ.СуммаКонечныйОстатокКт, 0) КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьНМА_НУ.СуммаКонечныйОстатокДт, 0) - ЕСТЬNULL(АмортизацияНМА_НУ.СуммаКонечныйОстатокКт, 0) КАК ОстаточнаяСтоимость
	|{ВЫБРАТЬ
	|	Подразделение.*,
	|	НематериальныйАктив.*,
	|	МОЛ.*,
	|	ЗначениеТекущегоСостояния,
	|	НМАСнятоСУчетаНаНачало,
	|	ДатаПринятияКУчету,
	|	ДатаПоследнегоСостояния,
	|	НалоговоеНазначение,
	|	СрокПолезногоИспользования,
	|	УчитываетсяКакОСНУ,
	|	НачислятьАмортизацию}
	|ИЗ
	|	ПервоначальныеСведенияОбНМА КАК ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних
	|		{ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеНМАБухгалтерскийУчетСрезПоследних КАК МестонахождениеНМАБухгалтерскийУчетСрезПоследних
	|		ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = МестонахождениеНМАБухгалтерскийУчетСрезПоследних.НематериальныйАктив
	|				ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_НУ КАК СтоимостьНМА_НУ
	|				ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = СтоимостьНМА_НУ.Субконто1
	|				ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_НУ КАК АмортизацияНМА_НУ
	|				ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = АмортизацияНМА_НУ.Субконто1
	|			ЛЕВОЕ СОЕДИНЕНИЕ СнятыеСУчета КАК СнятыеСУчета
	|			ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = СнятыеСУчета.НематериальныйАктив
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПринятиеКУчету КАК ПринятиеКУчету
	|			ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = ПринятиеКУчету.НематериальныйАктив
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТекущееСостояние КАК ТекущееСостояние
	|			ПО ПервоначальныеСведенияОбНМАОрганизацийСрезПоследних.НематериальныйАктив = ТекущееСостояние.НематериальныйАктив
	|		}
	|{ГДЕ
	|	(ЕСТЬNULL(СнятыеСУчета.СнятоСУчета, ЛОЖЬ)) КАК НМАСнятоСУчетаНаНачало,
	|	ТекущееСостояние.Состояние,
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.Местонахождение КАК Подразделение,
	|	МестонахождениеНМАБухгалтерскийУчетСрезПоследних.МОЛ}
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение.*,
	|	НематериальныйАктив.*,
	|	МОЛ.*,
	|	ЗначениеТекущегоСостояния,
	|	НМАСнятоСУчетаНаНачало,
	|	ДатаПринятияКУчету,
	|	ДатаПоследнегоСостояния,
	|	НалоговоеНазначение,
	|	СрокПолезногоИспользования,
	|	УчитываетсяКакОСНУ,
	|	НачислятьАмортизацию}
	|ИТОГИ
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(НематериальныйАктив),
	|	МАКСИМУМ(МОЛ),
	|	МАКСИМУМ(ЗначениеТекущегоСостояния),
	|	МАКСИМУМ(НМАСнятоСУчетаНаНачало),
	|	МАКСИМУМ(ДатаПринятияКУчету),
	|	МАКСИМУМ(ДатаПоследнегоСостояния),
	|	МАКСИМУМ(НалоговоеНазначение),
	|	МАКСИМУМ(СрокПолезногоИспользования),
	|	МАКСИМУМ(УчитываетсяКакОСНУ),
	|	МАКСИМУМ(НачислятьАмортизацию),
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(АмортизацияОборот),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(ОстаточнаяСтоимость)
	|ПО
	|	Подразделение,
	|	НематериальныйАктив
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НематериальныйАктив.*,
	|	НалоговоеНазначение.*,
	|	МОЛ.*,
	|	ЗначениеТекущегоСостояния}";
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	СтруктураПредставлениеПолей.Вставить("НематериальныйАктив", "Нематериальный актив");
	СтруктураПредставлениеПолей.Вставить("МОЛ", "МОЛ");
	СтруктураПредставлениеПолей.Вставить("НМАСнятоСУчетаНаНачало", "Снято с учета на начало отчета");
	
	СтруктураПредставлениеПолей.Вставить("ДатаПринятияКУчету", "Дата принятия к учету");
	СтруктураПредставлениеПолей.Вставить("ДатаПоследнегоСостояния", "Дата установки текущего состояния");
	СтруктураПредставлениеПолей.Вставить("ЗначениеТекущегоСостояния", "Текущее состояние");
	
	СтруктураПредставлениеПолей.Вставить("НалоговоеНазначение", "Налоговое назначение");
	СтруктураПредставлениеПолей.Вставить("СпособыОтраженияРасходовПоАмортизации", "Отражение расходов");
	
	СтруктураПредставлениеПолей.Вставить("СрокПолезногоИспользования", "Срок использования");
	СтруктураПредставлениеПолей.Вставить("УчитываетсяКакОСНУ", "Учитывается как ОС (НУ)");
	СтруктураПредставлениеПолей.Вставить("ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем продукции");
	СтруктураПредставлениеПолей.Вставить("НачислятьАмортизацию", "Начислять амортизацию");
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("НалоговоеНазначение");
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Подразделение", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("НематериальныйАктив", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("МОЛ", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ЗначениеТекущегоСостояния", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("НМАСнятоСУчетаНаНачало", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ДатаПринятияКУчету", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ДатаПоследнегоСостояния", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ПорядокПогашенияСтоимости", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("НалоговоеНазначение", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("СпособыОтраженияРасходовПоАмортизации", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("СрокПолезногоИспользования", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("УчитываетсяКакОСНУ", Новый Структура("НематериальныйАктив"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("НачислятьАмортизацию", Новый Структура("НематериальныйАктив"));
	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели("ПервоначальнаяСтоимость", "Первоначальная стоимость", Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьНачальныйОстаток", "Стоимость на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("АмортизацияНачальныйОстаток", "Амортизация на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьОборотДт", "Увеличение стоимости", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("АмортизацияОборот", "Амортизация за период", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьОборотКт", "Уменьшение стоимости", Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьКонечныйОстаток", "Стоимость на конец периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("АмортизацияКонечныйОстаток", "Амортизация на конец периода", Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели("ОстаточнаяСтоимость", "Остаточная стоимость", Истина, "ЧЦ=15; ЧДЦ=2");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("НематериальныйАктив");
	МассивОтбора.Добавить("НМАСнятоСУчетаНаНачало");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "СтоимостьНМА";
ОбщийОтчет.мНазваниеОтчета      = "Ведомость по амортизации НМА (налоговый учет)";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 0;

#КонецЕсли