Перем мПериод Экспорт; 
Перем мТаблицаДвижений Экспорт;

Процедура ВыполнитьПриход() Экспорт
	
	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");
	мТаблицаДвижений.ЗаполнитьЗначения( ВидДвиженияНакопления.Приход, "ВидДвижения");

	Загрузить(мТаблицаДвижений);
	
КонецПроцедуры // ВыполнитьДвижение()

Процедура ВыполнитьРасход() Экспорт
	
	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");
	мТаблицаДвижений.ЗаполнитьЗначения( ВидДвиженияНакопления.Расход, "ВидДвижения");

	Загрузить(мТаблицаДвижений);
	
КонецПроцедуры // ВыполнитьДвижение()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	
	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",        СтруктураШапкиДокумента.Ссылка);
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   Док.Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатур
	|ИЗ Документ." + ИмяТаблицы +" КАК Док
	|ГДЕ Док.Ссылка = &ДокументСсылка";
	
	Запрос.Выполнить();
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
					
		СтруктураПараметровБлокировки = Новый Структура(
			"ИмяТаблицы, ИсточникДанных, ИмяВременнойТаблицы", 
			"МалоценкаВЭксплуатации", МенеджерВремТаблиц, "ТаблицаНоменклатур");
		СтруктураЗначенийБлокировки   = Новый Структура(
			"Подразделение", СтруктураШапкиДокумента.Подразделение);
		СтруктураИсточникаДанных      = Новый Структура(
			"Номенклатура", "Номенклатура");
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
		
	КонецЕсли;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Подразделение",  СтруктураШапкиДокумента.Подразделение);
	
	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки в производстве
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,
	|	Док.ХарактеристикаНоменклатуры.Представление           КАК ХарактеристикаНоменклатурыПредставление,
	|	Док.СерияНоменклатуры.Представление           		   КАК СерияНоменклатурыПредставление,
	|	Док.ФизЛицо.Представление           		   		   КАК ФизЛицоПредставление,
	|	Док.НазначениеИспользования.Представление      		   КАК НазначениеИспользованияПредставление,
	//|	Док.Качество.Представление      		               КАК КачествоПредставление,
	|	СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК ДокументКоличество,
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                    КАК ОстатокКоличество
	|ИЗ 
	|	Документ." + ИмяТаблицы + " КАК Док
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.МалоценкаВЭксплуатации.Остатки(,
	|			Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТаблицаНоменклатур)
	|			И Подразделение = &Подразделение
	|			) КАК Остатки
	|	ПО 
	|		Док.Номенклатура                  = Остатки.Номенклатура
	| 		И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры
	| 		И Док.СерияНоменклатуры  		  = Остатки.СерияНоменклатуры
	| 		И Док.ФизЛицо  		  			  = Остатки.ФизЛицо
	| 		И Док.НазначениеИспользования	  = Остатки.НазначениеИспользования
	//| 		И Док.Качество              	  = Остатки.Качество
	| 		И Док.Ссылка.Подразделение 		  = Остатки.Подразделение
	|
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура,
	|	Док.ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры,
	|	Док.ФизЛицо,
	|	Док.НазначениеИспользования
	//|	Док.Качество
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.МалоценкаВЭксплуатации.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КоличествоОстаток = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);

		Если КоличествоОстаток < Выборка.ДокументКоличество Тогда

			СтрокаСообщения = "Остатка " + 
			УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
									  Выборка.ХарактеристикаНоменклатурыПредставление,
									  Выборка.СерияНоменклатурыПредставление) +
			", назначения использования <" + Выборка.НазначениеИспользованияПредставление + ">, " +
			//", качества <" + Выборка.КачествоПредставление + ">, " +
			", у работника " + (Выборка.ФизЛицоПредставление) + " недостаточно.";

			УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, КоличествоОстаток, Выборка.ДокументКоличество,
			Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()
