Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

Функция ПолучитьГрафикПоРаботнику(мСотрудник, мДатаНачала) Экспорт
	
	СтруктураДанныхОРаботнике = Новый Структура("ПодразделениеОрганизации,Подразделение,ГрафикРаботы,Должность");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",	мДатаНачала );
	Запрос.УстановитьПараметр("парамСотрудник",		мСотрудник );
	Запрос.УстановитьПараметр("парамФизЛицо",		мСотрудник.ФизЛицо );
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АктуальныйГрафик.ПодразделениеОрганизации,   
	|	АктуальныйГрафикУпр.Подразделение,   
	|	ЕСТЬNULL(АктуальныйГрафик.ГрафикРаботы, АктуальныйГрафикУпр.ГрафикРаботы) КАК ГрафикРаботы,   
	|	ЕСТЬNULL(АктуальныйГрафик.Должность, АктуальныйГрафикУпр.Должность) КАК Должность   
	|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники	
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник) КАК АктуальныйГрафик
	|ПО ИСТИНА
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &парамФизЛицо) КАК АктуальныйГрафикУпр
	|ПО ИСТИНА
	|ГДЕ Сотрудники.Ссылка = &парамСотрудник
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураДанныхОРаботнике.ПодразделениеОрганизации	= Выборка.ПодразделениеОрганизации;
		СтруктураДанныхОРаботнике.Подразделение				= Выборка.Подразделение;
		СтруктураДанныхОРаботнике.ГрафикРаботы				= Выборка.ГрафикРаботы;
		СтруктураДанныхОРаботнике.Должность					= Выборка.Должность;
	КонецЕсли;
	
	Возврат	СтруктураДанныхОРаботнике;

КонецФункции // ПолучитьГрафикПоРаботнику()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Перерассчитать(Физлица = Неопределено) Экспорт

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Основной.Дата					КАК Дата,
	|	Основной.Организация,
	|	Основной.Ссылка,
	|
	|	Основной.Сотрудник,
	|	Основной.ЗаменаСотрудник,
	|	Основной.ЗаменаПодразделениеОрганизации,
	|	Основной.ЗаменаГрафикРаботы,
	|	Основной.ЗаменаДолжность,
	|	Основной.ВидРасчета,
	|	Основной.ДатаНачала,
	|	Основной.ДатаОкончания
	|
	|   ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК Основной
	|  ГДЕ  Основной.ссылка = &ДокументСсылка
	|";
	
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ) Экспорт
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется замена!", Отказ);
	КонецЕсли;

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник, который должен заменять!", Отказ);
	КонецЕсли;
 
	// ЗаменаСотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаСотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник, которого должны заменять!", Отказ);
	КонецЕсли;

	// ДатаНачала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала замены!", Отказ);
	КонецЕсли;
	
	// ДатаОкончания
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания замены!", Отказ);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан вид замены!", Отказ);
	КонецЕсли;
	
	// ЗаменаГрафикРаботы
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаГрафикРаботы) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан график работы, по которому будет производится замена!", Отказ);
	КонецЕсли;
	
	// ЗаменаПодразделениеОрганизации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано подразделение, где будет работать сотрудник!", Отказ);
	КонецЕсли;
	
	// ЗаменаДолжность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаДолжность) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана должность на которой будет работать сотрудник!", Отказ);
	КонецЕсли;

	
КонецПроцедуры // ПроверитьЗаполнениеШапки()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	//Надо позвать проверку заполнения реквизитов шапки
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицо(ЭтотОбъект);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ОБЪЕКТА

