#Если Клиент Тогда
	
Перем ВысотаЗаголовка Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();
	
	Макет     = ПолучитьМакет("Макет");
	НаДату    = ?(НЕ ЗначениеЗаполнено(ДатаСведений), РабочаяДата, ДатаСведений);
	НаДату    = КонецДня(НаДату);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ДатаСведений = Формат(Год(НаДату),"ЧГ=0");
	
	ДокументРезультат.Вывести(ОбластьМакета);
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	Если ТолькоЗаголовок Тогда
		
		Возврат
		
	КонецЕсли;
	
	ЗапросСтоимостьБалансовая = Новый Запрос;
	
	Если Год(НаДату) > 2011 Тогда
		УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация), " И Организация = &Организация", "");
		УсловиеОрганизацияБезИ = ?(ЗначениеЗаполнено(Организация), " Организация = &Организация", "");
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СУММА(ХозрасчетныйОстатки.СуммаНУОстаток - ЕСТЬNULL(АмортизацияОстатки.СуммаНУОстатокКт, 0)) КАК СтоимостьНачПериода
		|ИЗ
	 	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (&Счет10_11), &СубконтоОС, НалоговоеНазначение <> &НеоблНехоз " + УсловиеОрганизация + ") КАК ХозрасчетныйОстатки
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (&Счет13), , НалоговоеНазначение <> &НеоблНехоз " + УсловиеОрганизация + ") КАК АмортизацияОстатки
		|		ПО ХозрасчетныйОстатки.Субконто1 = АмортизацияОстатки.Субконто1 И ХозрасчетныйОстатки.НалоговоеНазначение = АмортизацияОстатки.НалоговоеНазначение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&НачалоПериода, " + УсловиеОрганизацияБезИ + ") КАК СведенияОбОС
		|		ПО (СведенияОбОС.ОсновноеСредство = ХозрасчетныйОстатки.Субконто1)
		|ГДЕ 
		|	(НЕ ЕстьNULL(СведенияОбОС.НалоговаяГруппаОС, 0) В (&НеАмортизируемыеГруппыОС))
		|";
	Иначе	
		УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация), "И Организация = &Организация", "");	
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НалоговыйОстаткиИОбороты.Счет = &СчетОСО
		|						ИЛИ НалоговыйОстаткиИОбороты.Счет = &СчетОСГ
		|					ТОГДА НалоговыйОстаткиИОбороты.СуммаНачальныйОстатокДт
		|			КОНЕЦ), 0) КАК СтоимостьНачПериода,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НалоговыйОстаткиИОбороты.Счет = &СчетВР
		|						И НалоговыйОстаткиИОбороты.Субконто2 = &СтатьяМодернизации
		|					ТОГДА НалоговыйОстаткиИОбороты.СуммаОборотДт
		|			КОНЕЦ), 0) КАК ЗатратыНаРемонт
		|ИЗ
		|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецКвартала1,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Счет = &СчетВР
		|				ИЛИ Счет = &СчетОСО
		|				ИЛИ Счет = &СчетОСГ,
		|			,
	 	|			(НЕ Субконто1 = &НеоблВНД) " + УсловиеОрганизация + ") КАК НалоговыйОстаткиИОбороты";
	КонецЕсли;	
	
	ЗапросСтоимостьБалансовая.Текст = ТекстЗапроса;
	
	НачалоПериода = НачалоГода(НаДату);
	
	Если Год(НаДату) > 2011 Тогда
		СписокСчет10_11 = Новый СписокЗначений;
		СписокСчет10_11.Добавить(Планысчетов.Хозрасчетный.ОсновныеСредства);
		СписокСчет10_11.Добавить(Планысчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("Счет10_11",	СписокСчет10_11);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("Счет13",		ПланыСчетов.Хозрасчетный.ИзносАмортизацияНеоборотныхАктивов);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("НеоблНехоз", 	Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
		
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СубконтоОС", 	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		
		НеАмортизируемыеГруппыОС = Новый Массив();
		НеАмортизируемыеГруппыОС.Добавить(Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа1);
		НеАмортизируемыеГруппыОС.Добавить(Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа13);
 		НеАмортизируемыеГруппыОС.Добавить(Справочники.НалоговыеГруппыОсновныхСредств.ОСВременнаяНалоговаяРазница);
		НеАмортизируемыеГруппыОС.Добавить(Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа10);
		НеАмортизируемыеГруппыОС.Добавить(Справочники.НалоговыеГруппыОсновныхСредств.ОСГруппа11);
		НеАмортизируемыеГруппыОС.Добавить();
		ЗапросСтоимостьБалансовая.УстановитьПараметр("НеАмортизируемыеГруппыОС", НеАмортизируемыеГруппыОС);
		
	Иначе
		СчетОСГ = ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоГруппам;
		СчетОСО = ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоОбъектам;
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетОСГ", СчетОСГ);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетОСО", СчетОСО);
		
		СчетВР = ПланыСчетов.Налоговый.ВаловыеРасходы;
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетВР", СчетВР);
		
		СтруктураПараметров = Новый Структура("УдалитьСтатьяВаловыхРасходовПоУлучшениюОС");
		СрезПоследнихПараметрыНалоговогоУчета = РегистрыСведений.ПараметрыНалоговогоУчета.СрезПоследних(НачалоПериода,СтруктураПараметров);
		СтатьяМодернизации = ?(СрезПоследнихПараметрыНалоговогоУчета.Количество() = 0, 0, СрезПоследнихПараметрыНалоговогоУчета[0].УдалитьСтатьяВаловыхРасходовПоУлучшениюОС);
		
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СтатьяМодернизации", СтатьяМодернизации);
		
		ЗапросСтоимостьБалансовая.УстановитьПараметр("НеоблВНД", Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
		
		КонецКвартала1 = КонецКвартала(НачалоГода(НаДату));
		ЗапросСтоимостьБалансовая.УстановитьПараметр("КонецКвартала1", КонецКвартала1);
		
	КонецЕсли;
	
	ЗапросСтоимостьБалансовая.УстановитьПараметр("Организация", Организация);
	
	ЗапросСтоимостьБалансовая.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	Если Год(НаДату) > 2011 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("СуммыЗатрат");
	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("СуммыЗатрат2011");
	КонецЕсли;	
	
	СтоимостьБалансоваяВыборка = ЗапросСтоимостьБалансовая.Выполнить().Выбрать();
	
	Если СтоимостьБалансоваяВыборка.Следующий() Тогда
		
		СтоимостьНачПериода = ?(СтоимостьБалансоваяВыборка.СтоимостьНачПериода = Null, 0, СтоимостьБалансоваяВыборка.СтоимостьНачПериода);
		ОбластьМакета.Параметры.СтоимостьНачПериода = СтоимостьНачПериода;
		
		СтруктураПараметров = Новый Структура("ГодовойПроцентОтнесенияНаРасходыСуммУлучшенияОС");
		СрезПоследнихПараметрыНалоговогоУчета = РегистрыСведений.ПараметрыНалоговогоУчета.СрезПоследних(НачалоПериода,СтруктураПараметров);
		НормаЛимита = ?(СрезПоследнихПараметрыНалоговогоУчета.Количество() = 0, 0, СрезПоследнихПараметрыНалоговогоУчета[0].ГодовойПроцентОтнесенияНаРасходыСуммУлучшенияОС);
		
		СуммаЛимита = СтоимостьНачПериода * НормаЛимита / 100;
		
		СуммаЗатратНаРемонт1кв2011 = 0;
		
		Если Год(НаДату) = 2011 Тогда
			СуммаЗатратНаРемонт1кв2011 = ?(СтоимостьБалансоваяВыборка.ЗатратыНаРемонт = Null, 0, СтоимостьБалансоваяВыборка.ЗатратыНаРемонт);
			
			ОбластьМакета.Параметры.СуммаЗатратНаРемонт1кв2011 = СуммаЗатратНаРемонт1кв2011;
		КонецЕсли;	
		
		СуммаЛимита = Макс(0, СуммаЛимита - СуммаЗатратНаРемонт1кв2011);	
		ОбластьМакета.Параметры.СуммаЛимита = СуммаЛимита;
		
	Иначе
		
		ОбластьМакета.Параметры.СтоимостьНачПериода = 0;
		ОбластьМакета.Параметры.СуммаЛимита = 0;
		
	КонецЕсли;
	
	Выборка = ЗаполнитьНачальныеНастройки();
	Если Выборка.Следующий() Тогда
		ОбластьМакета.Параметры.СуммаОтнесенная = Выборка.Сумма;
		ОбластьМакета.Параметры.СуммаОставшаяся = ОбластьМакета.Параметры.СуммаЛимита - Выборка.Сумма;
	Иначе 
		ОбластьМакета.Параметры.СуммаОтнесенная = 0;
		ОбластьМакета.Параметры.СуммаОставшаяся = ОбластьМакета.Параметры.СуммаЛимита;
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьМакета);
	
	Если ВыводитьРасшифровкуСуммы Тогда
		ОбластьРасшифровкаЗаголовок = Макет.ПолучитьОбласть("РасшифровкаЗаголовок");
		ВыводитьРасшифровкаЗаголовок = Истина;
	Иначе
		Возврат;
	КонецЕсли;
			
	Пока Выборка.Следующий() Цикл
		Если ВыводитьРасшифровкаЗаголовок Тогда
			ДокументРезультат.Вывести(ОбластьРасшифровкаЗаголовок);
			ВыводитьРасшифровкаЗаголовок = Ложь;
		КонецЕсли;
		СтрокаМакета = Макет.ПолучитьОбласть("Строка");
		СтрокаМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(СтрокаМакета);

	КонецЦикла;
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ТолькоПросмотр                = Истина;
	ДокументРезультат.ВерхнийКолонтитул.Выводить    = Истина;
	ДокументРезультат.НижнийКолонтитул.Выводить     = Истина;
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы,
																	  ДокументРезультат.ШиринаТаблицы);
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетЗатратНаУлучшениеОС";
	
КонецПроцедуры // СформироватьОтчет()
																									
// Процедура - заполняет начальные настройки заполнения
//
Функция ЗаполнитьНачальныеНастройки() Экспорт
	
	УсловиеРегистратор = ?(ЗначениеЗаполнено(ДокументИсключения),"И ХозрасчетныйОстаткиИОбороты.Регистратор <> &Регистратор", "");	
	УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация)		,"И ХозрасчетныйОстаткиИОбороты.Организация = &Организация", "");	
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка КАК СтатьяЗатрат
	|ПОМЕСТИТЬ СтатьиЗатратСписок
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|ГДЕ
	|	СтатьиЗатрат.СтатьяДекларацииПоНалогуНаПрибыль В(&СтатьиДекларации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Регистратор) КАК ПредставлениеРегистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборот КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (&СчетаЗатрат), , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 В
	|					(ВЫБРАТЬ
	|						СтатьиЗатратСписок.СтатьяЗатрат
	|					ИЗ
	|						СтатьиЗатратСписок КАК СтатьиЗатратСписок)
	|	" + УсловиеОрганизация + "
	|	" + УсловиеРегистратор + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Регистратор),
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (&СчетаЗатрат), , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Субконто2 В	
	|					(ВЫБРАТЬ
	|						СтатьиЗатратСписок.СтатьяЗатрат
	|					ИЗ
	|						СтатьиЗатратСписок КАК СтатьиЗатратСписок)
	|	" + УсловиеОрганизация + "
	|   " + УсловиеРегистратор + "
	|   ИТОГИ
	|   СУММА(Сумма)
	|ПО
	|   ОБЩИЕ";
	СчетаЗатрат = новый СписокЗначений;
	
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаСбыт);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности);
	
	Запрос.УстановитьПараметр("СчетаЗатрат", СчетаЗатрат);
	
	СтатьиДекларации = новый СписокЗначений;
	
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ЗВ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_АВ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ВЗ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ИВ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_ПЗ_Ремонт);
	
	Запрос.УстановитьПараметр("СтатьиДекларации", СтатьиДекларации);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ДатаСведений));
	Запрос.УстановитьПараметр("КонецПериода",  КонецГода(ДатаСведений));
	
	Запрос.УстановитьПараметр("Регистратор", ДокументИсключения);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выбрать();
	
	
КонецФункции // ЗаполнитьНачальныеНастройки()


Процедура Настроить(ДокументРегистратор) Экспорт
	
	ДокументИсключения  = ДокументРегистратор;
	ДатаСведений 		= ДокументИсключения.Дата;
	Организация  		= ДокументИсключения.Организация
	
КонецПроцедуры
#КонецЕсли
