Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	|	ОтражатьВУпрУчете,
	|	ОтражатьВРеглУчете,
	|	ВЫБОР КОГДА Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА Организация ИНАЧЕ Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим)

	Запрос = Новый Запрос;

	// Заполним список обособленных подразделений организации 
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", ГоловнаяОрганизация);
	
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений", СписокСтруктурныхПодразделений);
	

    ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.ФизЛицо КАК ФизЛицо,
		|	ТЧРаботникиОрганизации.Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	ТЧРаботникиОрганизации.ДатаВозврата,
		|	ВЫБОР КОГДА (ДругиеСтроки.НомерСтроки) ЕСТЬ NULL  ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПровестипоУпр
		|ИЗ
		|	Документ.ВозвратНаРаботуОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|(ВЫБРАТЬ ПЕРВЫЕ 1
		|   Строки.НомерСтроки,
		|   Строки.Сотрудник,
		|   Строки.ДатаВозврата
		|ИЗ Документ.ВозвратНаРаботуОрганизаций.РаботникиОрганизации КАК Строки
		|ГДЕ	Строки.Ссылка = &ДокументСсылка	) КАК ДругиеСтроки
		|ПО	ДругиеСтроки.Сотрудник = ТЧРаботникиОрганизации.Сотрудник 
		| И	ДругиеСтроки.НомерСтроки < ТЧРаботникиОрганизации.НомерСтроки
		| И	ДругиеСтроки.ДатаВозврата = ТЧРаботникиОрганизации.ДатаВозврата
        |ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|";
			   
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация, работники которой возвращаются на работу!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

    	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";

	// ФизЛицо
	НетФизЛица = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо);
	Если НетФизЛица Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано физическое лицо!", Отказ, Заголовок);
	КонецЕсли;

	// ДатаВозврата
	НетДатыВозврата = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаВозврата);
	Если НетДатыВозврата Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана дата возврата на работу!", Отказ, Заголовок);
	КонецЕсли;

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		
		Уволен = Ложь;
		УжеРаботает = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаВозврата, Новый Структура("Сотрудник, Организация",ВыборкаПоСтрокамДокумента.Сотрудник,Организация));
		Для каждого Место из УжеРаботает Цикл
			Если Место.ЗанимаемыхСтавок = 0 Тогда
				Уволен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "работник не принят на работу в организацию!", Отказ);
		КонецЕсли;
		
		События = РегистрыСведений.СостояниеРаботниковОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаВозврата-1, Новый Структура("Сотрудник, Организация",ВыборкаПоСтрокамДокумента.Сотрудник,Организация));
		Если События.Количество()>0 Тогда
			Если События[0].Период = ВыборкаПоСтрокамДокумента.ДатаВозврата-1 Тогда 
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "в регл. кадровом учете собятие противоречит документу "+События[0].Регистратор+"!", Отказ);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ОтражатьвУпрУчете Тогда
		Уволен = Ложь;
		УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаВозврата, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.ФизЛицо));
		Для каждого Место из УжеРаботает Цикл
			Если Место.ЗанимаемыхСтавок = 0 Тогда
				Уволен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "работник не принят на работу на предприятие!",Отказ);
		КонецЕсли;
		
		События = РегистрыСведений.СостояниеРаботников.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаВозврата-1, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.ФизЛицо));
		Если События.Количество()>0 Тогда
			Если События[0].Период = ВыборкаПоСтрокамДокумента.ДатаВозврата-1 Тогда 
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "в упр. кадровом учете собятие противоречит документу "+События[0].Регистратор+"!", Отказ);
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;

			
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()


Процедура ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(СтруктураПроведенияПоРегистрамСведений)

	СтруктураПроведенияПоРегистрамСведений = Новый Структура();
	
	СтруктураПроведенияПоРегистрамСведений.Вставить("СостояниеРаботниковОрганизаций");
	СтруктураПроведенияПоРегистрамСведений.Вставить("СостояниеРаботников");

КонецПроцедуры // ЗаполнитьСтруктуруПроведенияПоРегистрамСведений()

Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации,  
		  СтруктураПроведенияПоРегистрамСведений, СтруктураПараметров = "")

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда	  
		// Если документ нужно проводить по регистру, то для него есть ключ в структуре
		ИмяРегистра = "СостояниеРаботниковОрганизаций";
		Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда
			
			Движение = Движения[ИмяРегистра].Добавить();

			// Свойства
			Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаВозврата-1;

			// Измерения
			Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
	        Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
			
			// Ресурсы
			Движение.Состояние                  = Перечисления.СостоянияРаботникаОрганизации.Работает;
				
		КонецЕсли;
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете Тогда	  
		// Если документ нужно проводить по регистру, то для него есть ключ в структуре
		ИмяРегистра = "СостояниеРаботников";
		Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) И ВыборкаПоРаботникиОрганизации.ПровестипоУпр Тогда
			
			Движение = Движения[ИмяРегистра].Добавить();

			// Свойства
			Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаВозврата-1;

			// Измерения
			Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизации.ФизЛицо;
			
			// Ресурсы
			Движение.Состояние                  = Перечисления.СостоянияРаботникаОрганизации.Работает;
				
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//структура, содержащая имена регистров накопления по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамНакопления;

	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			// Создадим и заполним структуры, содержащие имена регистров, по которым в зависимости от типа учета
			// проводится документ. В дальнейшем будем считать, что если для регистра не создан ключ в структуре,
			// то проводить по нему не надо.
			ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(СтруктураПроведенияПоРегистрамСведений);

			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим);
			ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать();

			Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ, Заголовок);

				Если НЕ Отказ Тогда

					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, СтруктураПроведенияПоРегистрамСведений);

				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ДокументОснование = Основание;
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку")  
	 ИЛИ ТипОснования = Тип("ДокументСсылка.НачислениеПоБольничномуЛисту")
	 ИЛИ ТипОснования = Тип("ДокументСсылка.НачислениеОтпускаРаботникамОрганизаций")
	 ИЛИ ТипОснования = Тип("ДокументСсылка.НевыходыИОдноразовыеВыплатыВОрганизациях")
	 Тогда
		
		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ОтражатьВУпрУчете = Основание.ОтражатьВУпрУчете;
		ОтражатьВРеглУчете = Основание.ОтражатьВРеглУчете;
		
		Если Основание.Проведен Тогда
			
			// Заполнение табличной части. 
			Для Каждого ТекСтрока Из Основание.Начисления Цикл
				Если ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) и Не ТекСтрока.ПроизошедшееСобытие и (ТекСтрока.Состояние <> Перечисления.СостоянияРаботникаОрганизации.НеИзменять) Тогда
					НоваяСтрока = РаботникиОрганизации.Добавить();
					НоваяСтрока.Сотрудник		= ТекСтрока.Сотрудник;
					НоваяСтрока.ДатаВозврата	= ТекСтрока.ДатаОкончания + 86400;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры        

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено

КонецПроцедуры

