
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерТелефона", НомерТелефона);
	
	НайтиВладелцевНомераСервер();
	
	Если Не ПустаяСтрока(НомерТелефона) И ТаблицаКлиентов.Количество() > 0 Тогда
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаКлиентовКлиент;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВладелцевНомера(Команда)
	НайтиВладелцевНомераСервер();
КонецПроцедуры

&НаСервере 
Процедура НайтиВладелцевНомераСервер()
	ТаблицаКлиентов.Очистить();
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ЧислоЦифрДляХранения = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
		НомерТелефонаЧислом = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(НомерТелефона, ЧислоЦифрДляХранения);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 100
			|	ВЫБОР
			|		КОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента.Владелец = NULL
			|			ТОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента
			|		ИНАЧЕ МИКО_опИндексНомераТелефонов.СсылкаНаКлиента.Владелец
			|	КОНЕЦ КАК Владелец,
			|	ВЫБОР
			|		КОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента.Владелец = NULL
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ МИКО_опИндексНомераТелефонов.СсылкаНаКлиента
			|	КОНЕЦ КАК СсылкаНаКонтакт,
			|	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой КАК Представление
			|ИЗ
			|	РегистрСведений.МИКО_опИндексНомераТелефонов КАК МИКО_опИндексНомераТелефонов
			|ГДЕ
			|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс = &НомерТелефонаЧислом";
	    Запрос.УстановитьПараметр("НомерТелефонаЧислом", НомерТелефонаЧислом);
		Результат = Запрос.Выполнить().Выгрузить();
		Для каждого СтрРезультата Из Результат Цикл
		
			НовСтрока = ТаблицаКлиентов.Добавить();
			Если ЗначениеЗаполнено(СтрРезультата.Владелец) Тогда
			 	НовСтрока.Клиент = СтрРезультата.Владелец;
			 	НовСтрока.Контакт = СтрРезультата.СсылкаНаКонтакт;
			Иначе	
			 	НовСтрока.Клиент = СтрРезультата.СсылкаНаКонтакт;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Если ТаблицаКлиентов.Количество()=0 Тогда
		Элементы.ДекорацияНеНайден.Видимость = Истина;
		Элементы.ТаблицаКлиентов.Видимость 	 = Ложь;
	Иначе
		Элементы.ДекорацияНеНайден.Видимость = Ложь;
		Элементы.ТаблицаКлиентов.Видимость 	 = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлиентовПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлиентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВладелецФормы) = Тип("ПолеВвода") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		//Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Клиент) Тогда
		//	
		//	Закрыть(Элемент.ТекущиеДанные.Клиент);
		//	
		//ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Контакт) Тогда
		//	
		//	Закрыть(Элемент.ТекущиеДанные.Контакт);
		//	
		//КонецЕсли;
		
		Закрыть(ПолучитьМассивКлиентов());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКлиентов()
	
	ТЗКлиентов = ТаблицаКлиентов.Выгрузить(, "Клиент");
	
	ТЗКлиентов.Свернуть("Клиент");
	
	Возврат ТЗКлиентов.ВыгрузитьКолонку("Клиент");
	
КонецФункции

#КонецОбласти
