Перем мУдалятьДвижения;
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуПриобретения(РезультатЗапросаПоПриобретениям, СтруктураШапкиДокумента, Подтвержденый )

	ТаблицаПриобретения = РезультатЗапросаПоПриобретениям.Выгрузить();
	
	Для каждого Строка Из ТаблицаПриобретения Цикл
	
		ОпределитьСделкуЛокально(Строка);	
	
	КонецЦикла; 
	
	// по некотрым строкам не движений не предполагется вовсе, их можно удалить заранее
	СтруктураПоиска = Новый Структура;
	// по этим видам остатков не нужны корректировки
	Если Подтвержденый Тогда
		СтруктураПоиска.Вставить("ВидОстатка",Перечисления.ВидыОстатковНДСПриобретенийПодтвержденный.ПолученыЗаранее);
	Иначе	
		СтруктураПоиска.Вставить("ВидОстатка",Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.ЕщеНеПолучены);
	КонецЕсли; 
	
	НайденныеСтроки = ТаблицаПриобретения.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из НайденныеСтроки Цикл
		ТаблицаПриобретения.Удалить(Строка);
	КонецЦикла; 
	
	ТаблицаПриобретения.Колонки.Добавить("НДСКредит"	, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
	ТаблицаПриобретения.Колонки.Добавить("ВидДеятельностиНДС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиНДС"));

	Для каждого СтрокаТаблицы Из ТаблицаПриобретения Цикл
		
		// проверим, есть ли право на налоговый кредит
		Если (СтрокаТаблицы.ДляХозяйственнойДеятельности И СтрокаТаблицы.ДляОперацийОблагаемыхНДС) Тогда
			СтрокаТаблицы.НДСКредит = СтрокаТаблицы.СуммаНДС;
		Иначе
			СтрокаТаблицы.НДСКредит		= 0;
		КонецЕсли;
		
		Если Подтвержденый Тогда
			// увеличение на самом деле отражается в регистре как расход с минусом
			
			СтрокаТаблицы.БазаНДС 				  = - СтрокаТаблицы.БазаНДС;
			СтрокаТаблицы.СуммаНДС				  = - СтрокаТаблицы.СуммаНДС;
			
			СтрокаТаблицы.НДСКредит				  = - СтрокаТаблицы.НДСКредит;
			
		КонецЕсли; 
		
		Если СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая;	
		Иначе	
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая;				
		КонецЕсли

	КонецЦикла;

	Возврат ТаблицаПриобретения;

КонецФункции // ПодготовитьТаблицуПриобретения()

Функция ПодготовитьТаблицуПродажи(РезультатЗапросаПоПродажам, СтруктураШапкиДокумента, Подтвержденный)

	ТаблицаПродажи = РезультатЗапросаПоПродажам.Выгрузить();
	
	Для каждого Строка Из ТаблицаПродажи Цикл
	
		ОпределитьСделкуЛокально(Строка);	
	
	КонецЦикла; 
	
	// по некотрым строкам не движений не предполагется вовсе, их можно удалить заранее
	СтруктураПоиска = Новый Структура;
	// по этим видам остатков не нужны корректировки
	Если Подтвержденный Тогда
		СтруктураПоиска.Вставить("ВидОстатка",Перечисления.ВидыОстатковНДСПродажПодтвержденный.ВыписаныЗаранее);
	Иначе	
		СтруктураПоиска.Вставить("ВидОстатка",Перечисления.ВидыОстатковНДСПродажОжидаемый.ЕщеНеВыписаны);
	КонецЕсли; 
	
	НайденныеСтроки = ТаблицаПродажи.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из НайденныеСтроки Цикл
		ТаблицаПродажи.Удалить(Строка);
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из ТаблицаПродажи Цикл
		Если Подтвержденный Тогда
			// увеличение на самом деле отражается в регистре как расход с минусом
			
			СтрокаТаблицы.БазаНДС 				  = - СтрокаТаблицы.БазаНДС;
			СтрокаТаблицы.СуммаНДС		  		  = - СтрокаТаблицы.СуммаНДС;
		
		КонецЕсли; 
	КонецЦикла;

	Возврат ТаблицаПродажи;

КонецФункции // ПодготовитьТаблицуПродажи()

// Проверяет правильность заполнения строк табличной части "Приобретения".
//
// Параметры:
// Параметры: 
//  ТаблицаПоПриобретениям  - таблица значений, содержащая данные для проведения и проверки
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПриобретения(ТаблицаПоПриобретениям, СтруктураШапкиДокумента, Отказ, Заголовок, Подтвердженный)
	
    Если Подтвердженный Тогда
		ИмяТабличнойЧасти = "ПриобретенияПодтвержденный";
		// Список видов остатков, по которым обязательно заполнение счета НДС
		СписокВидыОстатковСПроводками = Новый СписокЗначений;
		СписокВидыОстатковСПроводками.Добавить(Перечисления.ВидыОстатковНДСПриобретенийПодтвержденный.НеправильноЗарегистрированы);
		СписокВидыОстатковСПроводками.Добавить(Перечисления.ВидыОстатковНДСПриобретенийПодтвержденный.ПолученыИзлишне);
	Иначе
		ИмяТабличнойЧасти = "ПриобретенияОжидаемый";
		// Список видов остатков, по которым обязательно заполнение счета НДС
		СписокВидыОстатковСПроводками = Новый СписокЗначений;
		СписокВидыОстатковСПроводками.Добавить(Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.ПравильнаяРегистрация);
		СписокВидыОстатковСПроводками.Добавить(Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.НеБудутПолучены);
	КонецЕсли; 
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ВидОстатка,Контрагент, ДоговорКонтрагента,СобытиеНДС,СтавкаНДС,СчетУчетаНДС,БазаНДС");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	УправлениеВзаиморасчетами.ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоПриобретениям, Отказ, Заголовок);
	
	ПредставлениеТабличнойЧасти = Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	Для каждого СтрокаТаблицы Из ТаблицаПоПриобретениям Цикл
	
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""¤2¤"": ", СокрЛП(СтрокаТаблицы.НомерСтроки), ПредставлениеТабличнойЧасти);
		Если НЕ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указана сделка!", Отказ, Заголовок);			
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиПриобретения()

// Проверяет правильность заполнения строк табличной части "Продажи".
//
// Параметры:
// Параметры: 
//  ТаблицаПоПродажам  		- таблица значений, содержащая данные для проведения и проверки
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПродажи(ТаблицаПоПродажам, СтруктураШапкиДокумента, Отказ, Заголовок, Подтвержденный)

    Если Подтвержденный Тогда
		ИмяТабличнойЧасти = "ПродажиПодтвержденный";
	Иначе
		ИмяТабличнойЧасти = "ПродажиОжидаемый";
	КонецЕсли; 
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Контрагент, ДоговорКонтрагента,СобытиеНДС,СтавкаНДС,СчетУчетаНДС,БазаНДС");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	УправлениеВзаиморасчетами.ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоПродажам, Отказ, Заголовок);
	
	ПредставлениеТабличнойЧасти = Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	Для каждого СтрокаТаблицы Из ТаблицаПоПродажам Цикл
	
		СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон1("В строке номер ""¤1¤"" табличной части ""¤2¤"": ", СокрЛП(СтрокаТаблицы.НомерСтроки), ПредставлениеТабличнойЧасти);
		Если НЕ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + " не указана сделка!", Отказ, Заголовок);			
			
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиПродажи()

Процедура ПроверитьСоответсвиеСуммПоИзмерениямПриобретения(ТаблицаПриобретенияПодтвержденный, ТаблицаПоПриобретениямОжидаемый, Отказ, Заголовок)
	
	// проверка сумм на соответсвие
	ТаблицаКопияПодтвержденный = ТаблицаПриобретенияПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("ВидОстатка,Контрагент,ДоговорКонтрагента, Сделка, ВозвратнаяТара,СобытиеНДС,СтавкаНДС","БазаНДС,СуммаНДС");
	
	ТаблицаКопияОжидаемый = ТаблицаПоПриобретениямОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("ВидОстатка,Контрагент,ДоговорКонтрагента, Сделка, ВозвратнаяТара,СобытиеНДС,СтавкаНДС","БазаНДС,СуммаНДС");
	ТаблицаКопияОжидаемый.Колонки.Добавить("ФлагПроверки");
	
	Для Каждого СтрокаТаблицыПодтвержденный Из ТаблицаКопияПодтвержденный Цикл
		
		Если СтрокаТаблицыПодтвержденный.ВидОстатка <> Перечисления.ВидыОстатковНДСПриобретенийПодтвержденный.НеправильноЗарегистрированы Тогда
			// проверять соответсвие нужно только для неправильно зарегистрированных
			Продолжить;
		
		КонецЕсли; 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ВидОстатка"			,Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.ПравильнаяРегистрация);
		СтруктураПоиска.Вставить("Контрагент"			,СтрокаТаблицыПодтвержденный.Контрагент);
		СтруктураПоиска.Вставить("Сделка"				,СтрокаТаблицыПодтвержденный.Сделка);
		СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТаблицыПодтвержденный.ДоговорКонтрагента);
		СтруктураПоиска.Вставить("ВозвратнаяТара"		,СтрокаТаблицыПодтвержденный.ВозвратнаяТара);
		СтруктураПоиска.Вставить("СобытиеНДС"			,СтрокаТаблицыПодтвержденный.СобытиеНДС);
		СтруктураПоиска.Вставить("СтавкаНДС"			,СтрокаТаблицыПодтвержденный.СтавкаНДС);
		
		НайденныеСтроки = ТаблицаКопияОжидаемый.НайтиСтроки(СтруктураПоиска);
		
		// выполним проверку на корректность заполнения табличных частей
		// суммы БазаНСС и НДС по измерениям должны совпадать
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОжидаемыйБазаНДС 					= НайденныеСтроки[0].БазаНДС;
			ОжидаемыйНДС						= НайденныеСтроки[0].СуммаНДС;
			// установим флаг, что мы уже проверяли эту строку
			НайденныеСтроки[0].ФлагПроверки = Истина;
		Иначе 
			ОжидаемыйБазаНДС 					= 0;
			ОжидаемыйНДС		 				= 0;
		КонецЕсли;
		
		Если НЕ (-СтрокаТаблицыПодтвержденный.БазаНДС 				= ОжидаемыйБазаНДС И
			 	 -СтрокаТаблицыПодтвержденный.СуммаНДС 			 	= ОжидаемыйНДС) Тогда
		
			ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Не совпадают итоги в табличных частях по приобретениям !"
"По измерениям контрагент: ¤1¤, договор: ¤2¤, cделка: ¤10¤ возвратная тара: ¤3¤, событие: ¤4¤ ставка НДС: ¤5¤:"
"   В табличной части ""Подтвержденный"" база НДС:¤6¤, НДС :¤7¤"
"   А в табличной части ""Ожидаемый"" база НДС:¤8¤, НДС :¤9¤!", СтрокаТаблицыПодтвержденный.Контрагент, СтрокаТаблицыПодтвержденный.ДоговорКонтрагента, СтрокаТаблицыПодтвержденный.ВозвратнаяТара, СтрокаТаблицыПодтвержденный.СобытиеНДС, СтрокаТаблицыПодтвержденный.СтавкаНДС, (-СтрокаТаблицыПодтвержденный.БазаНДС), (-СтрокаТаблицыПодтвержденный.СуммаНДС), ОжидаемыйБазаНДС, ОжидаемыйНДС, СтрокаТаблицыПодтвержденный.Сделка), Отказ, Заголовок);
		
		
		КонецЕсли;
		
	КонецЦикла;
	
	// теперь нужно выполнить проверку "по ожидаемым"
	Для Каждого СтрокаТаблицыОжидаемый Из ТаблицаКопияОжидаемый Цикл
		
		Если СтрокаТаблицыОжидаемый.ВидОстатка <> Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.ПравильнаяРегистрация 
			ИЛИ СтрокаТаблицыОжидаемый.ФлагПроверки = Истина Тогда
			// проверять соответсвие нужно только для "правильной регистрации", 
			// и если эту строку не проеверяли в предыдущем цикле
			Продолжить;
		
		КонецЕсли; 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ВидОстатка"			,Перечисления.ВидыОстатковНДСПриобретенийПодтвержденный.НеправильноЗарегистрированы);
		СтруктураПоиска.Вставить("Контрагент"			,СтрокаТаблицыОжидаемый.Контрагент);
		СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТаблицыОжидаемый.ДоговорКонтрагента);
		СтруктураПоиска.Вставить("Сделка"				,СтрокаТаблицыОжидаемый.Сделка);
		СтруктураПоиска.Вставить("ВозвратнаяТара"		,СтрокаТаблицыОжидаемый.ВозвратнаяТара);
		СтруктураПоиска.Вставить("СобытиеНДС"			,СтрокаТаблицыОжидаемый.СобытиеНДС);
		СтруктураПоиска.Вставить("СтавкаНДС"			,СтрокаТаблицыОжидаемый.СтавкаНДС);
		
		НайденныеСтроки = ТаблицаКопияПодтвержденный.НайтиСтроки(СтруктураПоиска);
		
		// выполним проверку на корректность заполнения табличных частей
		// суммы БазаНС и НДСпо измерениям должны совпадать
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ПодтвержденныйБазаНДС 					= - НайденныеСтроки[0].БазаНДС;
			ПодтвержденныйНДС						= - НайденныеСтроки[0].СуммаНДС;
		Иначе 
			ПодтвержденныйБазаНДС 					= 0;
			ПодтвержденныйНДС		 				= 0;
		КонецЕсли;
		
		Если НЕ (СтрокаТаблицыОжидаемый.БазаНДС 				 = ПодтвержденныйБазаНДС И
			 	 СтрокаТаблицыОжидаемый.СуммаНДС				 = ПодтвержденныйНДС) Тогда
		
			ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Не совпадают итоги в табличных частях по приобретениям !"
"По измерениям контрагент: ¤1¤, договор: ¤2¤ cделка: ¤10¤ возвратная тара: ¤3¤, событие: ¤4¤ ставка НДС: ¤5¤:"
"   В табличной части ""Подтвержденный"" база НДС:¤6¤, НДС :¤7¤"
"   А в табличной части ""Ожидаемый"" база НДС:¤8¤, НДС :¤9¤!", СтрокаТаблицыОжидаемый.Контрагент, СтрокаТаблицыОжидаемый.ДоговорКонтрагента, СтрокаТаблицыОжидаемый.ВозвратнаяТара, СтрокаТаблицыОжидаемый.СобытиеНДС, СтрокаТаблицыОжидаемый.СтавкаНДС, ПодтвержденныйБазаНДС, ПодтвержденныйНДС, СтрокаТаблицыОжидаемый.БазаНДС, СтрокаТаблицыОжидаемый.СуммаНДС, СтрокаТаблицыОжидаемый.Сделка), Отказ, Заголовок);
		
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответсвиеСуммПоИзмерениямПродажи(ТаблицаПродажиПодтвержденный , ТаблицаПродажиОжидаемый , Отказ, Заголовок)
	
	// проверка сумм на соответсвие
	ТаблицаКопияПодтвержденный = ТаблицаПродажиПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("ВидОстатка,Контрагент,ДоговорКонтрагента,Сделка,ВозвратнаяТара,СобытиеНДС,СтавкаНДС","БазаНДС,СуммаНДС");
	
	ТаблицаКопияОжидаемый = ТаблицаПродажиОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("ВидОстатка,Контрагент,ДоговорКонтрагента,Сделка,ВозвратнаяТара,СобытиеНДС,СтавкаНДС","БазаНДС,СуммаНДС");
	ТаблицаКопияОжидаемый.Колонки.Добавить("ФлагПроверки");
	
	Для Каждого СтрокаТаблицыПодтвержденный Из ТаблицаКопияПодтвержденный Цикл
		
		Если СтрокаТаблицыПодтвержденный.ВидОстатка <> Перечисления.ВидыОстатковНДСПродажПодтвержденный.НеправильноЗарегистрированы Тогда
			// проверять соответсвие нужно только для неправильно зарегистрированных
			Продолжить;
		
		КонецЕсли; 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ВидОстатка"			,Перечисления.ВидыОстатковНДСПродажОжидаемый.ПравильнаяРегистрация);
		СтруктураПоиска.Вставить("Контрагент"			,СтрокаТаблицыПодтвержденный.Контрагент);
		СтруктураПоиска.Вставить("Сделка"				,СтрокаТаблицыПодтвержденный.Сделка);
		СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТаблицыПодтвержденный.ДоговорКонтрагента);
		СтруктураПоиска.Вставить("ВозвратнаяТара"		,СтрокаТаблицыПодтвержденный.ВозвратнаяТара);
		СтруктураПоиска.Вставить("СобытиеНДС"			,СтрокаТаблицыПодтвержденный.СобытиеНДС);
		СтруктураПоиска.Вставить("СтавкаНДС"			,СтрокаТаблицыПодтвержденный.СтавкаНДС);
		
		НайденныеСтроки = ТаблицаКопияОжидаемый.НайтиСтроки(СтруктураПоиска);
		
		// выполним проверку на корректность заполнения табличных частей
		// суммы  БазаНДС и НДС по измерениям должны совпадать
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОжидаемыйБазаНДС 					= НайденныеСтроки[0].БазаНДС;
			ОжидаемыйНДС 						= НайденныеСтроки[0].СуммаНДС;
			// установим флаг, что мы уже проверяли эту строку
			НайденныеСтроки[0].ФлагПроверки = Истина;
		Иначе 
			ОжидаемыйБазаНДС 					= 0;
			ОжидаемыйНДС 						= 0;
		КонецЕсли;
		
		Если НЕ (-СтрокаТаблицыПодтвержденный.БазаНДС 				  = ОжидаемыйБазаНДС И
			 	 -СтрокаТаблицыПодтвержденный.СуммаНДС		 		  = ОжидаемыйНДС) Тогда
		
			ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Не совпадают итоги в табличных частях по продажам !"
"По измерениям контрагент: ¤1¤, договор: ¤2¤  cделка: ¤10¤ возвратная тара: ¤3¤, событие: ¤4¤ ставка НДС: ¤5¤:"
"   В табличной части ""Подтвержденный НДС"" база НДС:¤6¤, НДС :¤7¤"
"   А в табличной части ""Ожидаемый НДС"" база НДС:¤8¤, НДС :¤9¤!", СтрокаТаблицыПодтвержденный.Контрагент, СтрокаТаблицыПодтвержденный.ДоговорКонтрагента, СтрокаТаблицыПодтвержденный.ВозвратнаяТара, СтрокаТаблицыПодтвержденный.СобытиеНДС, СтрокаТаблицыПодтвержденный.СтавкаНДС, (-СтрокаТаблицыПодтвержденный.БазаНДС), (-СтрокаТаблицыПодтвержденный.СуммаНДС), ОжидаемыйБазаНДС, ОжидаемыйНДС, СтрокаТаблицыПодтвержденный.Сделка), Отказ, Заголовок);
		
		
		КонецЕсли;
		
	КонецЦикла;
	
	// теперь нужно выполнить проверку "по ожидаемым"
	Для Каждого СтрокаТаблицыОжидаемый Из ТаблицаКопияОжидаемый Цикл
		
		Если СтрокаТаблицыОжидаемый.ВидОстатка <> Перечисления.ВидыОстатковНДСПродажОжидаемый.ПравильнаяРегистрация 
			ИЛИ СтрокаТаблицыОжидаемый.ФлагПроверки = Истина Тогда
			// проверять соответсвие нужно только для "правильной регистрации", 
			// и если эту строку не проеверяли в предыдущем цикле
			Продолжить;
		
		КонецЕсли; 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ВидОстатка"			,Перечисления.ВидыОстатковНДСПродажПодтвержденный.НеправильноЗарегистрированы);
		СтруктураПоиска.Вставить("Контрагент"			,СтрокаТаблицыОжидаемый.Контрагент);
		СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТаблицыОжидаемый.ДоговорКонтрагента);
		СтруктураПоиска.Вставить("Сделка"				,СтрокаТаблицыОжидаемый.Сделка);
		СтруктураПоиска.Вставить("ВозвратнаяТара"		,СтрокаТаблицыОжидаемый.ВозвратнаяТара);
		СтруктураПоиска.Вставить("СобытиеНДС"			,СтрокаТаблицыОжидаемый.СобытиеНДС);
		СтруктураПоиска.Вставить("СтавкаНДС"			,СтрокаТаблицыОжидаемый.СтавкаНДС);
		
		НайденныеСтроки = ТаблицаКопияПодтвержденный.НайтиСтроки(СтруктураПоиска);
		
		// выполним проверку на корректность заполнения табличных частей
		// суммы БазаНДС и НДС по измерениям должны совпадать
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ПодтвержденныйБазаНДС 					= - НайденныеСтроки[0].БазаНДС;
			ПодтвержденныйНДС 						= - НайденныеСтроки[0].СуммаНДС;
		Иначе 
			ПодтвержденныйБазаНДС 					= 0;
			ПодтвержденныйНДС		 				= 0;
		КонецЕсли;
		
		Если НЕ (СтрокаТаблицыОжидаемый.БазаНДС 				 = ПодтвержденныйБазаНДС И
			 	 СтрокаТаблицыОжидаемый.СуммаНДС		 		 = ПодтвержденныйНДС) Тогда
		
			ОбщегоНазначения.ОшибкаПриПроведении(Локализация.СтрШаблон1("Не совпадают итоги в табличных частях по продажам !"
"По измерениям контрагент: ¤1¤, договор: ¤2¤  cделка: ¤10¤ возвратная тара: ¤3¤, событие: ¤4¤ ставка НДС: ¤5¤:"
"   В табличной части ""Подтвержденный НДС"" база НДС:¤6¤, НДС :¤7¤"
"   А в табличной части ""Ожидаемый НДС"" база НДС:¤8¤, НДС :¤9¤!", СтрокаТаблицыОжидаемый.Контрагент, СтрокаТаблицыОжидаемый.ДоговорКонтрагента, СтрокаТаблицыОжидаемый.ВозвратнаяТара, СтрокаТаблицыОжидаемый.СобытиеНДС, СтрокаТаблицыОжидаемый.СтавкаНДС, ПодтвержденныйБазаНДС, ПодтвержденныйНДС, СтрокаТаблицыОжидаемый.БазаНДС, СтрокаТаблицыОжидаемый.СуммаНДС, СтрокаТаблицыОжидаемый.Сделка), Отказ, Заголовок);
		
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация,СчетУчетаНДС,СчетУчетаДоходов,СчетУчетаЗатрат,СчетУчетаКорректировкиНДСКредит");
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеДоходовИЗатрат");
		
		//проверим указание субконто для заполнения декларации по прибыли
		Если ЗначениеЗаполнено(СчетУчетаДоходов) 
			И НЕ НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность ТОгда
		
			ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
			Для НомСубконто = 1 По 3 Цикл
				Если СчетУчетаДоходов.ВидыСубконто.Количество()<НомСубконто Тогда
					Прервать;
				КонецЕсли;
				ВидСубконто = СчетУчетаДоходов.ВидыСубконто[НомСубконто-1].ВидСубконто;
				Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
					ЕстьСубконтоСтатьяЗатратДоходов = Истина;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
				СтруктураОбязательныхПолей.Вставить("ДоходыСубконто" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто);
			КонецЕсли;
		
		КонецЕсли;
		
		//проверим указание субконто для заполнения декларации по прибыли
		Если ЗначениеЗаполнено(СчетУчетаЗатрат)
			И НЕ НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
		
			ЕстьСубконтоСтатьяЗатратДоходов = Ложь;
			Для НомСубконто = 1 По 3 Цикл
				Если СчетУчетаЗатрат.ВидыСубконто.Количество()<НомСубконто Тогда
					Прервать;
				КонецЕсли;
				
				ВидСубконто = СчетУчетаЗатрат.ВидыСубконто[НомСубконто-1].ВидСубконто;
				Если     ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДоходов
					 ИЛИ ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНеоперационныхРасходов Тогда
					ЕстьСубконтоСтатьяЗатратДоходов = Истина;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			Если ЕстьСубконтоСтатьяЗатратДоходов Тогда
				СтруктураОбязательныхПолей.Вставить("ЗатратыСубконто" + НомСубконто, НСТР("ru = 'Не заполнено значение субконто: '; uk = 'Не заповнене значення субконто: '") + ВидСубконто); 	
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
	
		ОбщегоНазначения.ОшибкаПриПроведении("По выбранной организации не ведется учет НДС!", Отказ, Заголовок);
	
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоПриобретениям    - таблица значений, содержащая данные для проведения и проверки ТЧ Приобретения
//  ТаблицаПоПродажам         - таблица значений, содержащая данные для проведения и проверки ТЧ Продажи,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПриобретенияПодтвержденный, ТаблицаПриобретенияОжидаемый,  
							  ТаблицаПродажиПодтвержденный, ТаблицаПродажиОжидаемый, Отказ, Заголовок)
							  
	ДвиженияПоРегистрамПриобретения(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПриобретенияПодтвержденный, ТаблицаПриобретенияОжидаемый, Отказ, Заголовок);
							  
	ДвиженияПоРегистрамПродажи(РежимПроведения, СтруктураШапкиДокумента, 
							  ТаблицаПродажиПодтвержденный, ТаблицаПродажиОжидаемый, Отказ, Заголовок);
	
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоДоходамИЗатратам(СтруктураШапкиДокумента, СтрокаТаблицы, СуммаНДС)

	ПроводкиБУ = Движения.Хозрасчетный;
	
	Если СуммаНДС = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаНДС< 0 Тогда
	
		// на доходы
		
		Проводка = ПроводкиБУ.Добавить();
	
		Проводка.Период                     = СтруктураШапкиДокумента.Дата;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		
		Проводка.Сумма                      = -СуммаНДС;
		
		Проводка.СчетДт						= СтрокаТаблицы.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтрокаТаблицы.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтрокаТаблицы.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.Сделка);		
		
		Проводка.СчетКт						= СтруктураШапкиДокумента.СчетУчетаДоходов;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтруктураШапкиДокумента.ДоходыСубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтруктураШапкиДокумента.ДоходыСубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3 , СтруктураШапкиДокумента.ДоходыСубконто3);
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУКт = -СуммаНДС;
			КонецЕсли;
		КонецЕсли;
		
		Проводка.Содержание					= "Отнесение корректировок на доходы";
		
	Иначе
		
		// на затраты
		
		Проводка = ПроводкиБУ.Добавить();
	
		Проводка.Период                     = СтруктураШапкиДокумента.Дата;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		
		Проводка.Сумма                      = СуммаНДС;
		
		Проводка.СчетДт						= СтруктураШапкиДокумента.СчетУчетаЗатрат;
		
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1 , СтруктураШапкиДокумента.ЗатратыСубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2 , СтруктураШапкиДокумента.ЗатратыСубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3 , СтруктураШапкиДокумента.ЗатратыСубконто3);
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
			Если НЕ СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУДт = СуммаНДС;
			КонецЕсли;
		КонецЕсли;
		
		Проводка.СчетКт						= СтрокаТаблицы.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , СтрокаТаблицы.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2 , СтрокаТаблицы.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.Сделка);		
		
		Проводка.Содержание					= "Отнесение корректировок на расходы";
		
	КонецЕсли; 

КонецПроцедуры
 
Процедура ДвиженияПоРегистрамПриобретения(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПриобретенияПодтвержденный, ТаблицаПриобретенияОжидаемый, Отказ, Заголовок);

  	ПроводкиБУ = Движения.Хозрасчетный;
	
	ВсегоКорректировкаНДСКредит = 0;
	
	// Проводки по изменению налогового кредита
	ТаблицаКопияПодтвержденный = ТаблицаПриобретенияПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("ВидОстатка,СчетУчетаНДС,СобытиеНДС,Контрагент,ДоговорКонтрагента,Сделка","НДСКредит");
	
	Для Каждого СтрокаТаблицыПодтвержденный Из ТаблицаКопияПодтвержденный Цикл
		
		// тут суммы отрицательные 
		
		ПроводкаНДСКредит = СтрокаТаблицыПодтвержденный.НДСКредит;
		
		Если СтрокаТаблицыПодтвержденный.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат Тогда
			ПроводкаНДСКредит = - ПроводкаНДСКредит;
		КонецЕсли; 
		
		Если ПроводкаНДСКредит = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// делаем "сторно" налогового кредита 
		ВсегоКорректировкаНДСКредит = ВсегоКорректировкаНДСКредит + ПроводкаНДСКредит;
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период                     = СтруктураШапкиДокумента.Дата;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма                      = ПроводкаНДСКредит;
		Проводка.Содержание                 = "НДС кредит, корректировка по неправильному оформлению";
		Проводка.НомерЖурнала               = "";

		Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаКорректировкиНДСКредит;

		Проводка.СчетКт                     = СтрокаТаблицыПодтвержденный.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаТаблицыПодтвержденный.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"   , СтрокаТаблицыПодтвержденный.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицыПодтвержденный.Сделка);
		
	КонецЦикла;
	
	ТаблицаКопияОжидаемый = ТаблицаПриобретенияОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("ВидОстатка,СчетУчетаНДС,СобытиеНДС,Контрагент,ДоговорКонтрагента,Сделка","НДСКредит");
	
	Для Каждого СтрокаТаблицыОжидаемый Из ТаблицаКопияОжидаемый Цикл
		
		ПроводкаНДСКредит = СтрокаТаблицыОжидаемый.НДСКредит;
		
		Если СтрокаТаблицыОжидаемый.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат Тогда
			ПроводкаНДСКредит = - ПроводкаНДСКредит;
		КонецЕсли; 
		
		Если ПроводкаНДСКредит = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицыОжидаемый.ВидОстатка = Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.ПравильнаяРегистрация Тогда
			
			ВсегоКорректировкаНДСКредит = ВсегоКорректировкаНДСКредит + ПроводкаНДСКредит;
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = ПроводкаНДСКредит;
			Проводка.Содержание                 = "НДС кредит, корректировка";
			Проводка.НомерЖурнала               = "";

			Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаКорректировкиНДСКредит;
				
			Проводка.СчетКт                     = СтрокаТаблицыОжидаемый.СчетУчетаНДС;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаТаблицыОжидаемый.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"   , СтрокаТаблицыОжидаемый.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицыОжидаемый.Сделка);			
			
		ИначеЕсли СтрокаТаблицыОжидаемый.ВидОстатка = Перечисления.ВидыОстатковНДСПриобретенийОжидаемый.НеБудутПолучены  Тогда
			
			ДвиженияПоДоходамИЗатратам(СтруктураШапкиДокумента, СтрокаТаблицыОжидаемый, ПроводкаНДСКредит);
			
		КонецЕсли;

	КонецЦикла;
	
	// откорректируем регистр НДСПриобретений
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаКопияПодтвержденный = ТаблицаПриобретенияПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("ВидОстатка,ДоговорКонтрагента,Сделка, СобытиеНДС,СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,ВозвратнаяТара, Амортизируется", "БазаНДС,СуммаНДС");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопияПодтвержденный, ТаблицаДвижений);
	
	ТаблицаКопияОжидаемый = ТаблицаПриобретенияОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("ВидОстатка,ДоговорКонтрагента,Сделка, СобытиеНДС,СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,ВозвратнаяТара, Амортизируется", "БазаНДС,СуммаНДС");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопияОжидаемый, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.КорректировкаНеправильноОформленныхНалоговыхДокументов,  "КодОперации");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
	
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамПриобретения()

Процедура ДвиженияПоРегистрамПродажи(РежимПроведения, СтруктураШапкиДокумента, 
	                           ТаблицаПродажиПодтвержденный, ТаблицаПродажиОжидаемый, Отказ, Заголовок);
							   
	// откорректируем регистр НДСпродаж
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// ТОВАРЫ
	ТаблицаКопияПодтвержденный = ТаблицаПродажиПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("ДоговорКонтрагента, Сделка, СобытиеНДС,СтавкаНДС,ВозвратнаяТара", "БазаНДС,СуммаНДС");
	
	ТаблицаКопияОжидаемый = ТаблицаПродажиОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("ДоговорКонтрагента,Сделка, СобытиеНДС,СтавкаНДС,ВозвратнаяТара", "БазаНДС,СуммаНДС");
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопияПодтвержденный, ТаблицаДвижений);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопияОжидаемый		, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.КорректировкаНеправильноОформленныхНалоговыхДокументов,  "КодОперации");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьРасход();
	
	КонецЕсли;
	
	// Проводки по изменению счета учета НДС
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	ТаблицаКопияПодтвержденный = ТаблицаПродажиПодтвержденный.Скопировать();
	ТаблицаКопияПодтвержденный.Свернуть("СчетУчетаНДС,СобытиеНДС,Контрагент,ДоговорКонтрагента,Сделка","СуммаНДС");
	
	Для Каждого СтрокаТаблицыПодтвержденный Из ТаблицаКопияПодтвержденный Цикл
		
		// тут суммы отрицательные 
		СуммаНДС = СтрокаТаблицыПодтвержденный.СуммаНДС;
		
		Если СтрокаТаблицыПодтвержденный.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат Тогда
			СуммаНДС = - СуммаНДС;
		КонецЕсли; 
		
		Если СуммаНДС = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период                     = СтруктураШапкиДокумента.Дата;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма                      = СуммаНДС;
		Проводка.Содержание                 = "НДС обязательства, корректировка по неправильному оформлению";
		Проводка.НомерЖурнала               = "";

		Проводка.СчетДт                     = СтрокаТаблицыПодтвержденный.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаТаблицыПодтвержденный.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры"   , СтрокаТаблицыПодтвержденный.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицыПодтвержденный.Сделка);
		
		Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.НДССубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.НДССубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.НДССубконто3);

			
	КонецЦикла;
	
	ТаблицаКопияОжидаемый = ТаблицаПродажиОжидаемый.Скопировать();
	ТаблицаКопияОжидаемый.Свернуть("СчетУчетаНДС,СобытиеНДС,Контрагент,ДоговорКонтрагента,Сделка","СуммаНДС");
	
	Для Каждого СтрокаТаблицыОжидаемый Из ТаблицаКопияОжидаемый Цикл
		
		СуммаНДС = СтрокаТаблицыОжидаемый.СуммаНДС;
		
		Если СтрокаТаблицыОжидаемый.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.Возврат Тогда
			СуммаНДС = - СуммаНДС;
		КонецЕсли; 
		
		Если СуммаНДС = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период                     = СтруктураШапкиДокумента.Дата;
		Проводка.Активность                 = Истина;
		Проводка.Организация                = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма                      = СуммаНДС;
		Проводка.Содержание                 = "НДС обязательства, корректировка";
		Проводка.НомерЖурнала               = "";

		Проводка.СчетДт                     = СтрокаТаблицыОжидаемый.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаТаблицыОжидаемый.Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры"   , СтрокаТаблицыОжидаемый.ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицыОжидаемый.Сделка);
		
		Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.НДССубконто1);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.НДССубконто2);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.НДССубконто3);
			
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрамПродажи()


// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Прежде всего, проверим заполнение реквизита Организация в шапке документа
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	// Теперь позовем общую процедуру проверки
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	// Организация не заполнена, получать учетную политику нет смысла
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
	
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , УчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитикаНУ.СхемаНалогообложения.НДС = Истина);
	
	КонецЕсли; 
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиРегл()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "ПриобретенияУвеличение".
	СтруктураПолей        = Новый Структура;

	СтруктураПолей.Вставить("Контрагент"                           , "Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента"                   , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("ДоговорОрганизация"                   , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"                , "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"                 , "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("Сделка"                   			   , "Сделка");
	СтруктураПолей.Вставить("ВозвратнаяТара"                       , "ВозвратнаяТара");
	СтруктураПолей.Вставить("СобытиеНДС"                           , "СобытиеНДС");
	СтруктураПолей.Вставить("СтавкаНДС"                  		   , "СтавкаНДС");
	СтруктураПолей.Вставить("ДляХозяйственнойДеятельности"		   , "ДляХозяйственнойДеятельности");
	СтруктураПолей.Вставить("ДляОперацийОблагаемыхНДС"             , "ДляОперацийОблагаемыхНДС");
	СтруктураПолей.Вставить("Амортизируется"             		   , "Амортизируется");
	СтруктураПолей.Вставить("БазаНДС"                          	   , "БазаНДС");
	СтруктураПолей.Вставить("СуммаНДС"	                           , "СуммаНДС");
	СтруктураПолей.Вставить("СчетУчетаНДС"                         , "СчетУчетаНДС");
	СтруктураПолей.Вставить("ВидОстатка"                           , "ВидОстатка");
	
	РезультатЗапросаПриобретенияПодтвержденный 	= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПриобретенияПодтвержденный", СтруктураПолей);
	// табличные части с одинаковой структурой
	РезультатЗапросаПриобретенияОжидаемый 		= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПриобретенияОжидаемый", СтруктураПолей);
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Продажи...".
	СтруктураПолей        = Новый Структура;

	СтруктураПолей.Вставить("Контрагент"                           , "Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента"                   , "ДоговорКонтрагента");
	СтруктураПолей.Вставить("ДоговорОрганизация"                   , "ДоговорКонтрагента.Организация");
	СтруктураПолей.Вставить("ВедениеВзаиморасчетов"                , "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураПолей.Вставить("СложныйНалоговыйУчет"                 , "ДоговорКонтрагента.СложныйНалоговыйУчет");
	СтруктураПолей.Вставить("Сделка"                   			   , "Сделка");
	СтруктураПолей.Вставить("ВозвратнаяТара"                       , "ВозвратнаяТара");
	СтруктураПолей.Вставить("СобытиеНДС"                           , "СобытиеНДС");
	СтруктураПолей.Вставить("СтавкаНДС"                  		   , "СтавкаНДС");
	СтруктураПолей.Вставить("СчетУчетаНДС"                         , "СчетУчетаНДС");
	СтруктураПолей.Вставить("БазаНДС"                          	   , "БазаНДС");
	СтруктураПолей.Вставить("СуммаНДС"                             , "СуммаНДС");
	СтруктураПолей.Вставить("ВидОстатка"                           , "ВидОстатка");
	
	РезультатЗапросаПродажиПодтвержденный 	= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПродажиПодтвержденный", СтруктураПолей);
	// табличные части с одинаковой структурой
	РезультатЗапросаПродажиОжидаемый 		= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПродажиОжидаемый"		, СтруктураПолей);
	
	// Подготовим таблицы для проведения.
	ТаблицаПриобретенияПодтвержденный  	= ПодготовитьТаблицуПриобретения(РезультатЗапросаПриобретенияПодтвержденный	, СтруктураШапкиДокумента, Истина);
	ТаблицаПриобретенияОжидаемый      	= ПодготовитьТаблицуПриобретения(РезультатЗапросаПриобретенияОжидаемый		, СтруктураШапкиДокумента, Ложь	 );
	
	// Подготовим таблицы для проведения.
	ТаблицаПродажиПодтвержденный     	= ПодготовитьТаблицуПродажи(РезультатЗапросаПродажиПодтвержденный	, СтруктураШапкиДокумента, Истина);
	ТаблицаПродажиОжидаемый      		= ПодготовитьТаблицуПродажи(РезультатЗапросаПродажиОжидаемый		, СтруктураШапкиДокумента, Ложь	 );
	
	// Проверить заполнение ТЧ 
	ПроверитьЗаполнениеТабличнойЧастиПриобретения(ТаблицаПриобретенияПодтвержденный	, СтруктураШапкиДокумента, Отказ, Заголовок, Истина);
	ПроверитьЗаполнениеТабличнойЧастиПриобретения(ТаблицаПриобретенияОжидаемый		, СтруктураШапкиДокумента, Отказ, Заголовок, Ложь  );
	// Проверить заполнение ТЧ 
	ПроверитьЗаполнениеТабличнойЧастиПродажи(ТаблицаПродажиПодтвержденный	, СтруктураШапкиДокумента, Отказ, Заголовок, Истина);
	ПроверитьЗаполнениеТабличнойЧастиПродажи(ТаблицаПродажиОжидаемый		, СтруктураШапкиДокумента, Отказ, Заголовок, Ложь  );
	
	// проверки на соответсвие сумм между табличными частями
	ПроверитьСоответсвиеСуммПоИзмерениямПриобретения(ТаблицаПриобретенияПодтвержденный, ТаблицаПриобретенияОжидаемый, Отказ, Заголовок);
	ПроверитьСоответсвиеСуммПоИзмерениямПродажи(ТаблицаПродажиПодтвержденный, ТаблицаПродажиОжидаемый, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
							ТаблицаПриобретенияПодтвержденный, ТаблицаПриобретенияОжидаемый, 
							ТаблицаПродажиПодтвержденный, ТаблицаПродажиОжидаемый, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
    	
	Если Дата < '20080101' Тогда
		Для каждого Строка  Из ПриобретенияПодтвержденный Цикл
			Если Строка.Амортизируется Тогда
				Строка.Амортизируется = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Строка  Из ПриобретенияОжидаемый Цикл
			Если Строка.Амортизируется Тогда
				Строка.Амортизируется = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Функция ОпределитьСделкуЛокально(Строка) Экспорт

	Если Строка.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли Строка.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
     	  ИЛИ Строка.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда

		Возврат Строка.Сделка;

	Иначе// по расчетным документам
		
		Если Строка.СложныйНалоговыйУчет Тогда
			// взаиморасчеты по договору по расчетным документам при сложном учете ведутся по договору вцелом
			Возврат Неопределено;
			
		Иначе
			
			Возврат Строка.Сделка;
			
		КонецЕсли;
		
	КонецЕсли;
   
КонецФункции // УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
