#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "ОжидаемыйИПодтвержденныйНДСПродаж";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Описание исходного текста запроса.
	
    ТекстЗапроса = 
		  "ВЫБРАТЬ Разрешенные
		  |	НДС.Организация КАК Организация,
		  |	ВЫБОР
		  |		КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |				ИЛИ НДС.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |			ТОГДА &Гривна
		  |		ИНАЧЕ НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |	КОНЕЦ КАК Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец КАК Контрагент,
		  |	НДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |	ВЫБОР КОГДА НДС.ВозвратнаяТара = ИСТИНА ТОГДА ""Возвратная тара"" ИНАЧЕ ""Товары"" КОНЕЦ КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.Сделка,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ -НДС.БазаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ -НДС.СуммаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйСуммаНДС
		  |{ВЫБРАТЬ
		  |	Организация.*,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	НДС.Сделка.*,
  		  |	ОжидаемыйБазаНДС,
		  |	ОжидаемыйСуммаНДС,
		  |	ПодтвержденныйБазаНДС,
		  |	ПодтвержденныйСуммаНДС,
		  |	НеПодтвержденныйБазаНДС,
		  |	НеПодтвержденныйСуммаНДС}

		  |ИЗ
		  |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПродаж КАК НДС
		  |
		  |ГДЕ НДС.Период >= &ДатаНачала 
		  |  И НДС.Период <= &ДатаКонца
		  |  И НДС.Активность = Истина
		  |
		  |{ГДЕ
		  |	Организация.*,
		  |	(ВЫБОР
		  |			КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |					ИЛИ НДС.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |				ТОГДА &Гривна
		  |			ИНАЧЕ НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |		КОНЕЦ).* КАК Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	НДС.ВозвратнаяТара КАК ВозвратнаяТара,
		  | НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.Сделка.*}
  		  |УПОРЯДОЧИТЬ ПО
		  | СобытиеНДС
		  |{УПОРЯДОЧИТЬ ПО
		  |	СобытиеНДС,
		  |	Организация.*,
		  |	Контрагент.*,
		  |	ДоговорКонтрагента.*}
		  |ИТОГИ
		  |	СУММА(ОжидаемыйСуммаНДС),
		  |	СУММА(ОжидаемыйБазаНДС),
		  |	СУММА(ПодтвержденныйСуммаНДС),
		  |	СУММА(ПодтвержденныйБазаНДС),
		  |	СУММА(НеПодтвержденныйСуммаНДС),
		  |	СУММА(НеПодтвержденныйБазаНДС)
		  |ПО
		  |	Общие,
		  |	Организация,
		  |	Валюта,
		  |	Контрагент,
		  | ДоговорКонтрагента,
		  | Сделка,
		  | ВозвратнаяТара,
		  | СтавкаНДС
		  |
		  |{ИТОГИ ПО
		  |	Организация.*,
		  |	Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	ВЫБОР КОГДА НДС.ВозвратнаяТара = ИСТИНА ТОГДА ""Возвратная тара"" ИНАЧЕ ""Товары"" КОНЕЦ КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.Сделка.*
		  |}";

	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента",		 	"Договор");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент",	 				"Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВозвратнаяТара", 				"За тару");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СобытиеНДС", 					"Поступление/возврат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка", 						"Сделка");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтавкаНДС", 					"Ставка НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация",		 			"Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта",		 			    "Валюта");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйБазаНДС", 			"База НДС", Истина, "ЧЦ=15; ЧДЦ=2","ОжидаемыйНДС", "Ожидаемый НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйСуммаНДС", 			"НДС", 		Истина, "ЧЦ=15; ЧДЦ=2","ОжидаемыйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйБазаНДС", 		"База НДС", Истина, "ЧЦ=15; ЧДЦ=2","ПодтвержденныйНДС", "Подтвержденный НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйСуммаНДС", 	"НДС", 		Истина, "ЧЦ=15; ЧДЦ=2","ПодтвержденныйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйБазаНДС", 	"База НДС", Истина, "ЧЦ=15; ЧДЦ=2","НеПодтвержденныйНДС", "Не подтвержденный НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйСуммаНДС", 	"НДС", 		Истина, "ЧЦ=15; ЧДЦ=2","НеПодтвержденныйНДС");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	 УниверсальныйОтчет.ДобавитьИзмерениеКолонки("СобытиеНДС");
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("СобытиеНДС");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	 
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", 						ВидДвиженияНакопления.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ОблагаемыйВидДеятельностиНДС",Перечисления.ВидыДеятельностиНДС.Облагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Гривна",  					глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 4;

#КонецЕсли