Процедура СоздатьНК(Владелец,Характеристики, Ссылка) Экспорт
	
	НайденаНК = НайтиСуществующуюНк(Владелец);
	//Если НЕ ЗначениеЗаполнено(НайденНК) Тогда
	//	Если Вопрос("Создать НК для группы?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	СоздатьЕдиницу = Ложь;	
	
	Если ЗначениеЗаполнено(НайденаНК) Тогда
		
		Ном = НайденаНК.ПолучитьОбъект();
		
	Иначе
		
		Ном = Справочники.Номенклатура.СоздатьЭлемент();
		Ном.ВестиУчетПоХарактеристикам = Истина;
		Ном.Нк = Владелец.Код;
		
		СоздатьЕдиницу = Истина;
		
	КонецЕсли;
	Ном.Родитель = Владелец.Родитель;
	Ном.Наименование = Владелец.Наименование + " (Рост-ка)";
	Ном.НаименованиеПолноеРус = Владелец.Наименование + " (Рост-ка)";
    Ном.НаименованиеПолное = Владелец.НаименованиеПолное + " (Рост-ка)";
		
	Ном.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000009");
	Ном.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
	Ном.ГруппаХарактеристик = Ссылка;
	Ном.Нк = Владелец.Код;
	
	Ном.Организация = Владелец.Организация;
	
	Ном.Записать();
	
	Если СоздатьЕдиницу Тогда
		
		НоваяЕдиница = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		
		НоваяЕдиница.Владелец                = Ном.Ссылка;
		НоваяЕдиница.ЕдиницаПоКлассификатору = Ном.БазоваяЕдиницаИзмерения;
		НоваяЕдиница.Наименование            = СокрЛП(НоваяЕдиница.ЕдиницаПоКлассификатору);
		НоваяЕдиница.Коэффициент             = 1;
		
		НоваяЕдиница.Записать();
		
		Ном.ЕдиницаХраненияОстатков = НоваяЕдиница.Ссылка;
		Ном.ЕдиницаДляОтчетов       = НоваяЕдиница.Ссылка;
		
		Ном.Записать();
		
	КонецЕсли;
	
	//характеристика
	НайденаХарактеристика = НКХарактетистика(Ссылка);
	Если ЗначениеЗаполнено(НайденаХарактеристика) Тогда
		Хар = НайденаХарактеристика.ПолучитьОбъект();
	Иначе
		Хар = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	КонецЕсли;
	Хар.КодНК = Ссылка.Код;
	Хар.Наименование = Ссылка.Наименование;
	
	Хар.Владелец = Ном.Ссылка;
	Хар.Записать();
	
	//комплектующие
	НЗ = РегистрыСведений.КомплектующиеНоменклатуры.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(Ном.Ссылка);
	НЗ.Отбор.ХарактеристикаНоменклатуры.Установить(Хар.Ссылка);
	НЗ.Записать(Истина); // очистим
	
	Для Каждого Стр Из Характеристики Цикл
		НЗ = РегистрыСведений.КомплектующиеНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Номенклатура = Ном.Ссылка;
		НЗ.Комплектующая = Владелец;
		НЗ.Количество= ?(Стр.Количество = 0,1,Стр.Количество);
		НЗ.ЕдиницаИзмерения = Владелец.ЕдиницаДляОтчетов;
		НЗ.ХарактеристикаКомплектующей = Стр.Характеристика;
		НЗ.ХарактеристикаНоменклатуры = Хар.Ссылка;
		НЗ.Записать(Истина);             ////////////////////////////////
	КонецЦикла;

КонецПроцедуры

Функция НайтиСуществующуюНк(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	 |	Номенклатура.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура.Нк = &Нк";
	
	
	Запрос.УстановитьПараметр("Нк", Номенклатура.Код);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		
		Запрос = Новый Запрос;
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.ГруппаХарактеристик.Владелец.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Номенклатура.Код);
		Рез = Запрос.Выполнить().Выбрать();

		Если Рез.Следующий() Тогда
			Возврат Рез.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецФункции


Функция НКХарактетистика(ГруппаХар) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолучимХарактеристикуНк.Ссылка КАК ХарактеристикаНк
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ПолучимХарактеристикуНк
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик КАК ГруппыХарактеристик
	               |		ПО (ГруппыХарактеристик.Наименование = ПолучимХарактеристикуНк.Наименование)
	               |			И (ГруппыХарактеристик.Владелец.Код = ПолучимХарактеристикуНк.Владелец.Нк
	               |				ИЛИ ПолучимХарактеристикуНк.Владелец.ГруппаХарактеристик.Владелец = ГруппыХарактеристик.Владелец)
	               |ГДЕ
	               |	ГруппыХарактеристик.Ссылка = &Ссылка";  	
	
	
	Запрос.УстановитьПараметр("Ссылка",ГруппаХар.ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ХарактеристикаНк;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции



