
Процедура ПередУдалением(Отказ)
	Штрихкод = "";
КонецПроцедуры

Функция ПолучитьСкидку() Экспорт
		
	НКХарактетистика = Справочники.ГруппыХарактеристик.НКХарактетистика(Ссылка);
	
	Если ЗначениеЗаполнено(НКХарактетистика) Тогда
		
		Возврат ЦеноОбразование.ПолучитьОбщуюСкидку(НКХарактетистика.Владелец, НКХарактетистика).ПроцентСкидкиНаценки; 
	Иначе
	Возврат 0.1;
	КонецЕсли;
		
КонецФункции

Функция НКГруппы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.ГруппаХарактеристик.Владелец = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Ссылка.Владелец);
	Рез = Запрос.Выполнить().Выбрать();

	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Нк = &Код";
		Запрос.УстановитьПараметр("Код",Ссылка.Владелец.Код);
		Рез = Запрос.Выполнить().Выбрать();

		Если Рез.Следующий() Тогда
			Возврат Рез.Ссылка;
		Иначе
			СоздатьЗадачу()
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

функция СоздатьЗадачу() 	
	Задачи.ЗадачиПользователя.Создать(код,"Перепровести!!!",Ссылка);
КонецФункции
