

Процедура ЗаписатьХМЛЗапроса(Запись, СтруктураЗапроса) Экспорт
	Если ТипЗнч(СтруктураЗапроса) = Тип("Строка") тогда
		Запись.ЗаписатьТекст(СтруктураЗапроса);
		Возврат;
	КонецЕсли;	
	Для каждого ТекКлючЗначение Из СтруктураЗапроса Цикл
		Запись.ЗаписатьНачалоЭлемента(ТекКлючЗначение.Ключ);
		Если ТипЗнч(ТекКлючЗначение.Значение) = Тип("Структура") Тогда
			ЗаписатьХМЛЗапроса(Запись, ТекКлючЗначение.Значение);
		ИначеЕсли ТипЗнч(ТекКлючЗначение.Значение) = Тип("Массив") Тогда
			Для Каждого ТекЭлементМассива из ТекКлючЗначение.Значение Цикл
				Запись.ЗаписатьНачалоЭлемента("item");
				ЗаписатьХМЛЗапроса(Запись, ТекЭлементМассива);
				Запись.ЗаписатьКонецЭлемента();
			КонецЦикла;	
		Иначе	
			Запись.ЗаписатьТекст(ТекКлючЗначение.Значение);
		КонецЕсли;	
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьЗапрос_getStatusDocuments(ПараметрыМетода)
	
	ТекстЗапроса = 
	"<?xml version=""1.0"" encoding=""UTF-8""?>
	|<root>
	|<apiKey>"+ ПараметрыМетода.API20+"</apiKey>
	|<modelName>TrackingDocument</modelName>
	|<calledMethod>getStatusDocuments</calledMethod>
	|<methodProperties>
	|<Documents>" + Символы.ПС;  
	Для каждого Реф Из ПараметрыМетода.ТабРеф Цикл
		ТекстЗапроса = ТекстЗапроса + "<item>" + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + "<DocumentNumber>" + СокрЛП(Реф.НомерДок) + "</DocumentNumber>" + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + "<Phone>" + СокрЛП(Реф.Телефон) + "</Phone>" + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + "</item>" + Символы.ПС;
	КонецЦикла; 
	ТекстЗапроса = ТекстЗапроса	+
	"</Documents>
	|<Language>UA</Language>
	|</methodProperties>
	|</root>";
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ПолучитьТочкуВхода() Экспорт
	Возврат   "https://api.novaposhta.ua/v2.0/xml/";
КонецФункции

Функция ПолучитьОтветДОМ(Адрес,ТекстXML,КлючAPI)
	Попытка 
		Попытка
			ХМЛХТТП = ПолучитьCOMОбъект("", "MSXML2.ServerXMLHTTP.6.0");
		Исключение
			ХМЛХТТП = ПолучитьCOMОбъект("", "Microsoft.XMLHTTP");
		КонецПопытки;
		
		ХМЛХТТП.Open("POST", Адрес, Ложь);
		ХМЛХТТП.SetRequestHeader("Content-Type", "text/xml");
		ХМЛХТТП.Send(ТекстXML);
		//Сообщить(ХМЛХТТП.ResponseText);
		XMLДокумент = Новый ЧтениеXML;
		XMLДокумент.УстановитьСтроку(ХМЛХТТП.ResponseText);
		ПостроительДом = Новый ПостроительDOM;
		ДокументДом = ПостроительДом.Прочитать(XMLДокумент);
		XMLДокумент.Закрыть();	
		
		//ДеревоXML = ПрочитатьResponseTextXML(ХМЛХТТП.ResponseText);
		Возврат ДокументДом;
	Исключение 
		Сообщить(ОписаниеОшибки());
		Ответтекст = GetXMLResponserNewPost(ТекстXML,КлючAPI);
		XMLДокумент = Новый ЧтениеXML;
		XMLДокумент.УстановитьСтроку(Ответтекст);
		ПостроительДом = Новый ПостроительDOM;
		ДокументДом = ПостроительДом.Прочитать(XMLДокумент);
		XMLДокумент.Закрыть();	
		Возврат ДокументДом;

		//Возврат Неопределено
	КонецПопытки;
КонецФункции

Функция ЭтоУспех(ДокументДом)
	success =  ДокументДом.ПолучитьЭлементыПоИмени("success");// = "true"
	
	Возврат success[0].ТекстовоеСодержимое = "true";
КонецФункции

Функция ВернутьЕрор(ДокументДом) 
	ТекстОшибки  = "";
	
	Узел =  ДокументДом.ПолучитьЭлементыПоИмени("errors");
	Если Узел.количество() = 0 Тогда
		Возврат "";
	КонецЕсли;	
	
	Узел = Узел[0].первыйДочерний;
	Пока не Узел = Неопределено цикл
		ТекстОшибки = ТекстОшибки + Символы.ПС + Узел.ТекстовоеСодержимое ;
		Узел = Узел.СледующийСоседний;
	КонецЦикла;	 
	
	Возврат ТекстОшибки;	
КонецФункции

function GetXMLResponserNewPost(запрос,КлючAPI) экспорт
	
	запрос=СтрЗаменить(запрос,"[ВАШ КЛЮЧ]",КлючAPI);
	url= "api.novaposhta.ua/v2.0/xml/";
	//хтппсоед=новый HTTPСоединение(url,,,,,,new ЗащищенноеСоединениеOpenSSL);
	хтппсоед=новый HTTPСоединение(url,,,,,,);
	
	хтппзапрос=новый HTTPЗапрос(url);
	хтппзапрос.УстановитьТелоИзСтроки(запрос);
	хтппзапрос.Заголовки.Вставить("Content-Type", "text/xml");
	тело=запрос;
	
	ответ=хтппсоед.ОтправитьДляОбработки(хтппзапрос);
	ОтветСтрока=ответ.ПолучитьТелоКакСтроку();
	//ОтветСерв=сокрлп(ТекущаяДата())+Символы.ПС+ОтветСтрока;
	//если ЭтотОбъект.Отладка тогда
	//	сообщить("Запрос:"+Символы.ПС+запрос+Символы.ПС+" ответ: "+ОтветСтрока);
	//	ЗапросЛог=запрос;
	//	ОтветЛог=ОтветСтрока;
	//конецесли;
	
	return ОтветСтрока;
		
endfunction	

Функция СтатусНакладнойНов(ТекущийКлюч,ТабНакл) Экспорт
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("API20",ТекущийКлюч);
	ПараметрыМетода.Вставить("ТабРеф",ТабНакл);
	ТекстЗапроса = ПолучитьЗапрос_getStatusDocuments(ПараметрыМетода);
	ДокументДом  = ПолучитьОтветДОМ(ПолучитьТочкуВхода(),ТекстЗапроса,ТекущийКлюч);
	Если  ДокументДом = Неопределено тогда
		Сообщить("Ошибка при получении ответа, метод: getStatusDocuments");
	КонецЕсли;
	Если не  ЭтоУспех(ДокументДом) тогда
		ТекстИсключения = ВернутьЕрор(ДокументДом);
		Сообщить(ТекстИсключения+" getStatusDocuments");
	КонецЕсли;
	лВыполняемаяобработка = ПолучитьПроцедуруПоМетоду("getStatusDocuments");
	Если не ЗначениеЗаполнено(лВыполняемаяобработка) тогда
		Сообщить(ТекстИсключения + "Не назначен обработчик методу: getStatusDocuments");
	КонецЕсли;
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номер");
	Результат.Колонки.Добавить("СтатусДокумента");
	Результат.Колонки.Добавить("ДатаДоставки");
	Результат.Колонки.Добавить("СтатусОбратнойДоставки");
	Результат.Колонки.Добавить("ТТНОбратнойДоставки");
	Результат.Колонки.Добавить("ПричинаОтказа");
	Результат.Колонки.Добавить("АдресДоставки");
	Результат.Колонки.Добавить("СтоимостьДоставки");
	Результат.Колонки.Добавить("ЕстьПереадресация");	
		
	РаспарситьОтвет(лВыполняемаяобработка, ДокументДом,Результат, "getStatusDocuments",ПараметрыМетода);
	Возврат Результат;
	
КонецФункции


Процедура РаспарситьОтвет(лВыполняемаяобработка,ДокументДом, Результат, Владелец = неопределено,Параметры = Неопределено)
	Если Не лВыполняемаяобработка = "Обработать_getMessageCodeText" Тогда
		Узел = ДокументДом.ПолучитьЭлементыПоИмени("Item");
	Иначе
		Узел = ДокументДом.ПолучитьЭлементыПоИмени("data");
	конецЕсли;
	КоличествоЭлементов = Узел.Количество();
	Если КоличествоЭлементов > 0 тогда
		Item = Узел.Элемент(0);
		
		Пока не Item = неопределено цикл
			Элемент_Item = Item.ПервыйДочерний;
			
			ВыполнитьОбработчик(Владелец, лВыполняемаяобработка,Элемент_Item, Результат,Параметры);
			Item = Item.СледующийСоседний;
		КонецЦикла;
		
	КонецЕсли;	
	//здесь пишем дбф?	
КонецПроцедуры

Функция ВыполнитьОбработчик(Владелец, ИмяФункции, П1 = Неопределено, П2 = Неопределено, П3=Неопределено)
	Получилось = Ложь;
	Если не Получилось тогда
		//Попытка
		Выполнить(""+ИмяФункции+"(П1,П2,Владелец,П3)");
		Получилось = истина;
		//Исключение
		//КонецПопытки;
	КонецЕсли;
	Возврат Получилось;
КонецФункции


Функция Обработать_getStatusDocuments(ЭлементДом, Результат, ТаблицаРегистра,Параметры)
	СтруктураПараметров = Новый Структура;
	
	Пока не ЭлементДом = неопределено цикл
		//Если ЭлементДом.ИмяУзла = "Success" Тогда // data
		//Для Каждого Узел из ЭлементДом.ДочерниеУзлы Цикл
		//Если Узел.ИмяУзла = "Success" Тогда
		//Для Каждого Узел2 из ЭлементДом.ДочерниеУзлы Цикл
		//Если Узел2.ИмяУзла ="item" Тогда
		//	Для Каждого ТТН из ЭлементДом.ДочерниеУзлы Цикл
		Если ЭлементДом.ИмяУзла = "Number" Тогда
			Строка = Результат.Добавить();
			Строка.Номер = ЭлементДом.ТекстовоеСодержимое;
		ИначеЕсли ЭлементДом.ИмяУзла = "Status" Тогда
			Строка.СтатусДокумента = ЭлементДом.ТекстовоеСодержимое;
		ИначеЕсли ЭлементДом.ИмяУзла = "ActualDeliveryDate" Тогда
			//14.04.2018 14:33:25
			Дат = СтрЗаменить(ЭлементДом.ТекстовоеСодержимое,"-",".");
			Если ЭлементДом.ТекстовоеСодержимое <> "" Тогда 
				Попытка
					//ДатаДоставки = Дата(Сред(Дат,5,4)+Сред(Дат,3,2)+Лев(Дат,2)+Сред(Дат,9,6));
					Строка.ДатаДоставки =НачалоДня(Дата(Сред(Дат,9,2) + Сред(Дат,5,4) +Лев(Дат,4) + " " + Прав(Дат,9)));
				Исключение
					Строка.ДатаДоставки = "";
				КонецПопытки;
			иначе 
				Строка.ДатаДоставки = ЭлементДом.ТекстовоеСодержимое;
			КонецЕсли;
				
			
		ИначеЕсли ЭлементДом.ИмяУзла = "LastCreatedOnTheBasisNumber" Тогда
			 Строка.ТТНОбратнойДоставки = ЭлементДом.ТекстовоеСодержимое;
		//ИначеЕсли ЭлементДом.ИмяУзла = "LastCreatedOnTheBasisNumber" Тогда
		//	 Строка.ЕстьПереадресация = (ЭлементДом.ТекстовоеСодержимое <> "");
		ИначеЕсли ЭлементДом.ИмяУзла = "UndeliveryReasonsSubtypeDescription" Тогда
			 Строка.ПричинаОтказа = ЭлементДом.ТекстовоеСодержимое;
		ИначеЕсли ЭлементДом.ИмяУзла = "WarehouseRecipientAddress" Тогда
			 Строка.АдресДоставки = ЭлементДом.ТекстовоеСодержимое;
		ИначеЕсли ЭлементДом.ИмяУзла = "DocumentCost" Тогда
			 Строка.СтоимостьДоставки = ЭлементДом.ТекстовоеСодержимое;
		//ИначеЕсли ЭлементДом.ИмяУзла = "DateCreated" И Не ЗначениеЗаполнено(Строка.ДатаДоставки) Тогда	 
		//	Дат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ЭлементДом.ТекстовоеСодержимое,".",""),":","")," ",""),"-","");
		//	Попытка
		//		ДатаДоставки = Дата(Сред(Дат,5,4)+Сред(Дат,3,2)+Лев(Дат,2)+Сред(Дат,9,6));
		//	Исключение
		//		ДатаДоставки = "";
		//	КонецПопытки;
		//    Строка.ДатаДоставки = ДатаДоставки;		
		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		//КонецЦикла;
		//КонецЕсли;
		//КонецЦикла;
		//КонецЕсли;
		ЭлементДом = ЭлементДом.СледующийСоседний; 
	КонецЦикла;
КонецФункции	


Функция ОтправитьЗапрос(СтруктураЗапроса) Экспорт
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	ХТТПСоединение = Новый HTTPСоединение("api.novaposhta.ua",,,,,,ssl);
	
	Запись = Новый ЗаписьXML;
	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла("xml");
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("xml");
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("utf-8", , Ложь);
	Запись.ОткрытьФайл(ИмяФайлаЗапроса, ПараметрыЗаписиXML);
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("file");
	ЗаписатьХМЛЗапроса(Запись, СтруктураЗапроса);
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
	
	ХТТПЗапрос = Новый HTTPЗапрос("/v2.0/xml/");
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "text/xml");
	ХТТПЗапрос.УстановитьИмяФайлаТела(ИмяФайлаЗапроса);
	ХТТПЗапрос.Заголовки = Заголовки;
	
	Ответ = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос, ИмяФайлаОтвета);
	
	Если Ответ.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайлаОтвета);
		ДеревоОтвета = ___обРазобратьXML(Чтение);
		Чтение.Закрыть();
		Возврат ДеревоОтвета; 
	КонецЕсли;	
	
КонецФункции	


Функция ПолучитьПроцедуруПоМетоду(ИмяМетода)
	Текст = "";
	ИмяМетода = ВРег(СокрЛП(ИмяМетода));
	
	Если ИмяМетода = "GETCITIES" тогда
		Текст = "Обработать_getCities";
	ИначеЕсли ИмяМетода = "GETSTREET" тогда
		Текст = "Обработать_getStreet";
	ИначеЕсли ИмяМетода = "GETWAREHOUSES" тогда
		Текст = "Обработать_getWarehouses";		
	ИначеЕсли ИмяМетода = "GETWAREHOUSETYPES" тогда
		Текст = "Обработать_getWarehouseTypes";
	ИначеЕсли ИмяМетода = "GETCOUNTERPARTIES" тогда
		Текст = "Обработать_getCounterparties";
	ИначеЕсли ИмяМетода = "GETCOUNTERPARTYADDRESSES" тогда
		Текст = "Обработать_getCounterpartyAddresses";
	ИначеЕсли ИмяМетода = "GETCOUNTERPARTYCONTACTPERSONS" тогда
		Текст = "Обработать_getCounterpartyContactPersons";
	ИначеЕсли ИмяМетода = "GETTYPESOFPAYERS" тогда
		Текст = "Обработать_Common";		
	ИначеЕсли ИмяМетода = "GETPAYMENTFORMS" тогда
		Текст = "Обработать_Common";		
	ИначеЕсли ИмяМетода = "GETCARGOTYPES" тогда
		Текст = "Обработать_Common";		
	ИначеЕсли ИмяМетода = "GETSERVICETYPES" тогда
		Текст = "Обработать_Common";
	ИначеЕсли ИмяМетода = "GETCARGODESCRIPTIONLIST" тогда
		Текст = "Обработать_Common";//getCargoDescriptionList
	ИначеЕсли ИмяМетода = "GETAREAS" тогда
		Текст = "Обработать_getArea";
	ИначеЕсли ИмяМетода = "GETOWNERSHIPFORMSLIST" тогда
		Текст = "Обработать_Common";//getOwnershipFormsList
	ИначеЕсли ИмяМетода = "GETBACKWARDDELIVERYCARGOTYPES" тогда
		Текст = "Обработать_Common";//getBackwardDeliveryCargoTypes
	ИначеЕсли ИмяМетода = "GETPALLETSLIST" тогда
		Текст = "Обработать_Common";//getPalletsList
	ИначеЕсли ИмяМетода = "GETTYPESOFCOUNTERPARTIES" тогда
		Текст = "Обработать_Common";//getTypesOfCounterparties
	ИначеЕсли ИмяМетода = "GETTYPESOFPAYERSFORREDELIVERY" тогда
		Текст = "Обработать_Common";
	ИначеЕсли ИмяМетода = "GETTIMEINTERVALS" тогда
		Текст = "Обработать_getTimeIntervals";
	ИначеЕсли ИмяМетода = "GETTIRESWHEELSLIST" тогда
		Текст = "Обработать_Common";
	ИначеЕсли ИмяМетода = "GETTRAYSLIST" тогда
		Текст = "Обработать_Common"; //getTraysList
	ИначеЕсли ИмяМетода = "GETDOCUMENTSTATUSES" тогда
		Текст = "Обработать_getDocumentStatuses";
	ИначеЕсли ИмяМетода = "GETCOUNTERPARTYOPTIONS" тогда
		Текст = "Обработать_getCounterpartyOptions";			
	ИначеЕсли ИмяМетода = "SAVECOUNTERPARTY" тогда
		Текст = "Обработать_SaveCounterparty";		
	ИначеЕсли ИмяМетода = "SAVECONTACTPERSON" тогда
		Текст = "Обработать_SaveContactPerson";	
	ИначеЕсли ИмяМетода = "SAVEINTERNETDOCUMENT" тогда
		Текст = "Обработать_SaveInternetDocument";	
	ИначеЕсли ИмяМетода = "INSERTDOCUMENTSSCANSHEET" тогда
		Текст = "Обработать_insertDocumentsScanSheet";
	ИначеЕсли ИмяМетода = "REMOVEDOCUMENTS" тогда
		Текст = "Обработать_removeDocuments";
	ИначеЕсли ИмяМетода = "DELETESCANSHEET" тогда
		Текст = "Обработать_deleteScanSheet";
	ИначеЕсли ИмяМетода = "DELETEDOC" тогда
		Текст = "Обработать_deleteDoc";
	ИначеЕсли ИмяМетода = "GETSTATUSDOCUMENTS" тогда
		Текст = "Обработать_getStatusDocuments";
	ИначеЕсли ИмяМетода = "GETMESSAGECODETEXT" тогда
		Текст = "Обработать_getMessageCodeText";
	КонецЕсли;	
	
	Возврат Текст
КонецФункции	

Функция ПолучитьТаблицуМетодов()
	ТаблицаМетодов = Новый ТаблицаЗначений;
	ТаблицаМетодов.Колонки.Добавить("Метод");
	ТаблицаМетодов.Колонки.Добавить("Файл");
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getAreas";
	Строка.Файл = "\Areas.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCities";
	Строка.Файл = "\Cities.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getStreet";
	Строка.Файл = "\Streets.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getWarehouseTypes";
	Строка.Файл = "\whtypes.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getWarehouses";
	Строка.Файл = "\whouse.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCounterparties";
	Строка.Файл = "\counter1.dbf";
	Строка.Метод = "getCounterparties";
	Строка.Файл = "\counter2.dbf";
	Строка.Метод = "getCounterparties";
	Строка.Файл = "\counter3.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getOwnershipFormsList";
	Строка.Файл = "\ownform.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTypesOfPayers";
	Строка.Файл = "\payertyp.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTypesOfCounterparties";
	Строка.Файл = "\counttyp.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCargoTypes";
	Строка.Файл = "\cargotyp.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getServiceTypes";
	Строка.Файл = "\servtype.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getBackwardDeliveryCargoTypes";
	Строка.Файл = "\bdelct.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCargoDescriptionList";
	Строка.Файл = "\cargodes.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTypesOfPayersForRedelivery";
	Строка.Файл = "\redevpt.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCounterpartyAddresses";
	Строка.Файл = "\countadr.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCounterpartyContactPersons";
	Строка.Файл = "\countcp.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getCounterpartyOptions";
	Строка.Файл = "\countopt.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getPaymentForms";
	Строка.Файл = "\payforms.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getPalletsList";
	Строка.Файл = "\pallets.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTimeIntervals";
	Строка.Файл = "\timeint.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTraysList";
	Строка.Файл = "\trays.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getTiresWheelsList";
	Строка.Файл = "\tires.dbf";
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = "getMessageCodeText";
	Строка.Файл = "\Errors.dbf";
	Возврат ТаблицаМетодов;
КонецФункции


Функция ___обРазобратьXML(Ч) Экспорт
	
	Дерево = Новый ДеревоЗначений();
	Дерево.Колонки.Добавить("Тег");
	Дерево.Колонки.Добавить("Тело");
	ТекСтроки = Дерево.Строки;
	___обРазобратьXMLСлуж(Ч, ТекСтроки, Неопределено);	
	
	Возврат Дерево;
КонецФункции

Функция ПолучитьТаблицуЭлементовПоДереву(ДеревоОтвета) Экспорт
	Табл = Новый ТаблицаЗначений;
	Для Каждого ТекСтрока из ДеревоОтвета.Строки Цикл
		Если ТекСтрока.Тег = "root" тогда
			Для Каждого ТекСтрока1 Из ТекСтрока.Строки цикл
				Если ТекСтрока1.Тег = "success" Тогда
					Если НЕ ТекСтрока1.Тело = "true" Тогда
						Возврат Табл;
					КонецЕсли; 	
				ИначеЕсли ТекСтрока1.Тег = "data" Тогда
					Для Каждого ТекСтрока2 Из ТекСтрока1.Строки Цикл
						Если ТекСтрока2.Тег = "item" Тогда
							СтрТабл = Табл.Добавить();
							Для каждого ТекСтрока3 Из ТекСтрока2.Строки цикл
								Если Табл.Колонки.Найти(ТекСтрока3.Тег) = Неопределено Тогда
									Табл.Колонки.Добавить(ТекСтрока3.Тег);
								КонецЕсли;	
								СтрТабл[ТекСтрока3.Тег] = ТекСтрока3.Тело;
							КонецЦикла;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;	
	Возврат Табл;
КонецФункции	
//Служебная функция для разбора XML в дерево
Функция ___обРазобратьXMLСлуж(Ч, ТекСтроки, Знач ТекСтрока) Экспорт
	Атрибуты = Новый Структура();
	Пока Ч.Прочитать() Цикл
		Если Ч.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекСтрока = ТекСтроки.Добавить();
			ТекСтрока.Тег = Ч.Имя;
			___обРазобратьXMLСлуж(Ч, ТекСтрока.Строки, ТекСтрока);
		ИначеЕсли Ч.ТипУзла = ТипУзлаXML.Текст Тогда
			ТекСтрока.Тело = Ч.Значение;
		ИначеЕсли Ч.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСтруктуруОтвета(ДеревоОтвета,ПолучатьОшибки = Ложь) Экспорт
	
	СтруктураОтвета = Новый Структура;
	Для Каждого ТекСтрока из ДеревоОтвета.Строки Цикл
		Если ТекСтрока.Тег = "root" тогда
			Для Каждого ТекСтрока1 Из ТекСтрока.Строки цикл
				Если ТекСтрока1.Тег = "success" Тогда
					Если ПолучатьОшибки = Ложь И НЕ ТекСтрока1.Тело = "true" Тогда
						Возврат СтруктураОтвета;
					КонецЕсли; 	
				ИначеЕсли ТекСтрока1.Тег = "data" Тогда
					Для Каждого ТекСтрока2 Из ТекСтрока1.Строки Цикл
						Если ТекСтрока2.Тег = "item" Тогда
							Для Каждого ТекСтрока3 Из ТекСтрока2.Строки Цикл
								Если ЗначениеЗаполнено(ТекСтрока3.Тег) и ЗначениеЗаполнено(ТекСтрока3.Тело) Тогда
									СтруктураОтвета.Вставить(ТекСтрока3.Тег,ТекСтрока3.Тело);
								КонецЕсли;	
							КонецЦикла;
						КонецЕсли;	
					КонецЦикла;	
					
				ИначеЕсли ТекСтрока1.Тег = "errors" Тогда
					Ошибки = Новый Структура;
					итераторОшибок = 0;
					Для Каждого ТекСтрока2 Из ТекСтрока1.Строки Цикл
						Если ЗначениеЗаполнено(ТекСтрока2.Тег) и ЗначениеЗаполнено(ТекСтрока2.Тело) Тогда
							Если Ошибки.Свойство(ТекСтрока2.Тег) Тогда
								итераторОшибок = итераторОшибок + 1;
								Ошибки.Вставить(ТекСтрока2.Тег + "Итератор" + Формат(итераторОшибок,"ЧГ="),ТекСтрока2.Тело)
							Иначе	
								Ошибки.Вставить(ТекСтрока2.Тег,ТекСтрока2.Тело);
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
					
					СтруктураОтвета.Вставить("Ошибки",Ошибки);
					
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;	
	Возврат СтруктураОтвета;
	
КонецФункции	
