
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Контрагент") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
		|ИЗ
		|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
		|ГДЕ
		|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Параметры.Отбор.Контрагент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КонтрагентДоставки = Выборка.КонтрагентДоставки;
		Иначе
			Контрагент = Параметры.Отбор.Контрагент;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере 
Функция СтруктураПараметровОткрытияКонтрагента()
	Если ЗначениеЗаполнено(КонтрагентДоставки) Тогда
		Возврат Новый Структура("Ключ",КонтрагентДоставки);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Структура("Контрагент",Контрагент);
	Иначе
		Возврат Неопределено
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураПараметров = СтруктураПараметровОткрытияКонтрагента();
	Если Не СтруктураПараметров = Неопределено Тогда
		ФормаКонтрагентовДоставки = ПолучитьФорму("Справочник.ЛМ_Контрагенты.Форма.ФормаЭлемента", СтруктураПараметров);
		Отказ = Истина;
		ФормаКонтрагентовДоставки.Открыть()
	КонецЕсли;	
	
	
КонецПроцедуры
