// #Область СлужебныеПроцедурыИФункции
//****************************************************************************//
// ПОДСИСТЕМА ТЕЛЕФОНИИ
// МОДУЛЬ ОБЩЕГО НАЗНАЧЕНИЯ
//****************************************************************************//

// Выводит сообщение пользователю методом "Сообщить".
// 
Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	                                
	ТекстСообщения = НСтр("ru='"+ТекстСообщения+"';uk='"+ТекстСообщения+"'");	
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
	
КонецПроцедуры

// Выбор каталога.
// 
Процедура ОбработкаВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если "МИКО_СообщениеВТехническуюПоддержку" = ДополнительныеПараметры Тогда
		Оповестить("ВыборКаталога", ВыбранныеФайлы, "МИКО_СообщениеВТехническуюПоддержку");
	КонецЕсли; 	

КонецПроцедуры

// Получение глобальной переменной. Значение - объект "Панель телефонии для 1С".
//
Функция ПолучитьОбъектПанелиТелефонииОб() Экспорт

	Ajam_comp = ВычислитьНаКлиенте("Miko_Ajam"); 			  // Конфигурации УТ 10.3, УПП 1.3, КА 8, БП 2.0.
	Если Ajam_comp = Неопределено Тогда
		Ajam_comp = ВычислитьНаКлиенте("РарусСофтФонЛайт"); // Конфигурации 1С:CRM 1.4, УТиВСК 1, КА 8+CRM.
	КонецЕсли; 
	Если Ajam_comp = Неопределено Тогда
		Ajam_comp = ВычислитьНаКлиенте("глРарусСофтФонПроф"); // Конфигурации 1С:CRM 1.4, УТиВСК 1, КА 8+CRM.
	КонецЕсли; 
	
	Возврат Ajam_comp;
КонецФункции // ПолучитьОбъектПанелиТелефонии()
// Получение глобальной переменной. Значение - объект "Панель телефонии для 1С".
//                                                                             
Функция ПолучитьОбъектПанелиТелефонииУп() Экспорт

	Ajam_comp = ВычислитьНаКлиенте("сфпФормаТелефонВнешняяПанель"); 			  // Конфигурации УТ 10.3, УПП 1.3, КА 8, БП 2.0.
	Если Ajam_comp = Неопределено Тогда
		Ajam_comp = ВычислитьНаКлиенте("сфпФормаТелефон"); // Конфигурации 1С:CRM 1.4, УТиВСК 1, КА 8+CRM.
	КонецЕсли; 
	Если Ajam_comp = Неопределено Тогда
		Ajam_comp = ВычислитьНаКлиенте("сфпПанельУправления"); // Конфигурации 1С:CRM 1.4, УТиВСК 1, КА 8+CRM.
	КонецЕсли; 
	Возврат Ajam_comp;
КонецФункции // ПолучитьОбъектПанелиТелефонииУп()

// Вычисление произвольнго выражения на клиенте.
//
Функция ВычислитьНаКлиенте(Выражение) Экспорт
	MikoTmpData = Неопределено;
	Попытка
		MikoTmpData = Вычислить(Выражение); // Конфигурации 1С:CRM 1.4, УТиВСК 1, КА 8+CRM.
	Исключение
	КонецПопытки; 	

	Возврат MikoTmpData;
КонецФункции // ВычислитьНаКлиенте()

// #КонецОбласти